***********************************************************************         
* CREATED BY PC30186   ON 97/09/17  AT 13:04                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'REFILL INFORMATION NDC          '                               
W2N364   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W2T364U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W2T351  ',                                          +        
               14='W2T352  ',                                          +        
               15='W2T353  ',                                          +        
               16='W2T354  ',                                          +        
               17='W2T355  ',                                          +        
               18='W2T356  ',                                          +        
               19='W2T364  ',                                          +        
               20='W2T358  ',                                          +        
               21='W2T359  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W2N364   DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
TRANS1   DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
TRANS2   DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
TRANS3   DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
TRANS4   DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'REFILL INFO',                                          +        
               POS=(1,11),LTH=11,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Part No.',                                             +        
               POS=(2,2),LTH=8,                                        +        
               ATTR=(NUM,PROT)                                                  
ARTNRIN  DFLD  POS=(2,12),LTH=9,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'DC',                                                   +        
               POS=(2,27),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DCIN     DFLD  POS=(2,31),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
ARTNRUT  DFLD  POS=(3,12),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
DCUT     DFLD  POS=(3,31),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
BEART    DFLD  POS=(3,41),LTH=25,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Warehouse info',                                       +        
               POS=(5,3),LTH=14,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Future Supplier',                                      +        
               POS=(6,31),LTH=15,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Date',                                                 +        
               POS=(6,50),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Supplier',                                             +        
               POS=(7,3),LTH=8,                                        +        
               ATTR=(PROT)                                                      
SUPUT    DFLD  POS=(7,15),LTH=5,                                       +        
               ATTR=(PROT)                                                      
SUPIN    DFLD  POS=(7,21),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
FUSUP    DFLD  POS=(7,31),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DATEFS   DFLD  POS=(7,50),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Orderblock',                                           +        
               POS=(8,3),LTH=10,                                       +        
               ATTR=(PROT)                                                      
OSPUT    DFLD  POS=(8,19),LTH=1,                                       +        
               ATTR=(PROT)                                                      
OSPIN    DFLD  POS=(8,25),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Date',                                                 +        
               POS=(9,8),LTH=4,                                        +        
               ATTR=(PROT)                                                      
DATEOUT  DFLD  POS=(9,19),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Userid',                                               +        
               POS=(10,7),LTH=6,                                       +        
               ATTR=(PROT)                                                      
USEROUT  DFLD  POS=(10,19),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Bulkorderbl',                                          +        
               POS=(11,3),LTH=11,                                      +        
               ATTR=(PROT)                                                      
BSPUT    DFLD  POS=(11,19),LTH=1,                                      +        
               ATTR=(PROT)                                                      
BSPIN    DFLD  POS=(11,25),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Date',                                                 +        
               POS=(12,8),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DATEBUT  DFLD  POS=(12,19),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Userid',                                               +        
               POS=(13,7),LTH=6,                                       +        
               ATTR=(PROT)                                                      
USERBUT  DFLD  POS=(13,19),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Leadtime',                                             +        
               POS=(14,3),LTH=8,                                       +        
               ATTR=(PROT)                                                      
MLTUT    DFLD  POS=(14,17),LTH=3,                                      +        
               ATTR=(PROT)                                                      
MLTIN    DFLD  POS=(14,23),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Buyer',                                                +        
               POS=(15,3),LTH=5,                                       +        
               ATTR=(PROT)                                                      
BUYUT    DFLD  POS=(15,17),LTH=3,                                      +        
               ATTR=(PROT)                                                      
BUYIN    DFLD  POS=(15,23),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Referral Block (Y/N)',                                 +        
               POS=(16,3),LTH=20,                                      +        
               ATTR=(PROT)                                                      
REFERUT  DFLD  POS=(16,25),LTH=1,                                      +        
               ATTR=(PROT)                                                      
REFERIN  DFLD  POS=(16,30),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'User',                                                 +        
               POS=(16,32),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
USER     DFLD  POS=(16,37),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Date',                                                 +        
               POS=(16,46),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
REGDAT   DFLD  POS=(16,51),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Not',                                                  +        
               POS=(19,3),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
NOTIN    DFLD  POS=(19,11),LTH=70,                                     +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  '13',                                                   +        
               POS=(21,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '14',                                                   +        
               POS=(21,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '15',                                                   +        
               POS=(21,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16',                                                   +        
               POS=(21,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W2O364N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W2N364,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W2I364N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W2N364                                                       
         SEG                                                                    
         MFLD  TRANS1,                                                 +        
               LTH=1                                                            
         MFLD  TRANS2,                                                 +        
               LTH=1                                                            
         MFLD  TRANS3,                                                 +        
               LTH=1                                                            
         MFLD  TRANS4,                                                 +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  ARTNRIN,                                                +        
               LTH=9                                                            
         MFLD  DCIN,                                                   +        
               LTH=2                                                            
         MFLD  ARTNRUT,                                                +        
               LTH=9                                                            
         MFLD  DCUT,                                                   +        
               LTH=2                                                            
         MFLD  BEART,                                                  +        
               LTH=25                                                           
         MFLD  SUPUT,                                                  +        
               LTH=5                                                            
         MFLD  FUSUP,                                                  +        
               LTH=5                                                            
         MFLD  DATEFS,                                                 +        
               LTH=6                                                            
         MFLD  OSPUT,                                                  +        
               LTH=1                                                            
         MFLD  DATEOUT,                                                +        
               LTH=6                                                            
         MFLD  USEROUT,                                                +        
               LTH=8                                                            
         MFLD  BSPUT,                                                  +        
               LTH=1                                                            
         MFLD  DATEBUT,                                                +        
               LTH=6                                                            
         MFLD  USERBUT,                                                +        
               LTH=8                                                            
         MFLD  MLTUT,                                                  +        
               LTH=3                                                            
         MFLD  BUYUT,                                                  +        
               LTH=3                                                            
         MFLD  REFERUT,                                                +        
               LTH=1                                                            
         MFLD  USER,                                                   +        
               LTH=8                                                            
         MFLD  REGDAT,                                                 +        
               LTH=6                                                            
         MFLD  SUPIN,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OSPIN,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BSPIN,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  MLTIN,                                                  +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BUYIN,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  REFERIN,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  NOTIN,                                                  +        
               LTH=72,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MFLD  LTH=25                                                           
         MSGEND                                                                 
W2I364N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W2N364),                                           +        
               OPT=2,                                                  +        
               NXT=W2O364N1                                                     
MID      LPAGE SOR=(W2N364)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  TRANS1,                                                 +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  TRANS2,                                                 +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  TRANS3,                                                 +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  TRANS4,                                                 +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '23642',                                                +        
               LTH=5                                                            
         MFLD  (ARTNRIN,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DCIN,                                                  +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (SUPIN,                                                 +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (OSPIN,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (BSPIN,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (MLTIN,                                                 +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (BUYIN,                                                 +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (REFERIN,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (NOTIN,                                                 +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++++++++++++')                                       +        
               LTH=70,                                                 +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
