***********************************************************************         
* CREATED BY PCC6483   ON 00/10/23  AT 13:36                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'Part included in supplier group '                               
W2N334   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W2T334 7',                                           +        
               8='W2T334 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,11)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'PART INCLUDED IN',                                     +        
               POS=(1,11),LTH=16,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'SUPPL',                                                +        
               POS=(1,28),LTH=5,                                       +        
               ATTR=(PROT,HI)                                                   
         DFLD  'GROUP',                                                +        
               POS=(1,34),LTH=5,                                       +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Part No:',                                             +        
               POS=(2,2),LTH=8,                                        +        
               ATTR=(ALPHA,PROT)                                                
ARTNRIN  DFLD  POS=(2,11),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
ARTNRUT  DFLD  POS=(3,11),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Supplier Group   Start date Start date  Supplier Group +        
                  Start date Start date',                              +        
               POS=(5,2),LTH=79,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Group    Part No',                                     +        
               POS=(6,24),LTH=16,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Group    Part No',                                     +        
               POS=(6,65),LTH=16,                                      +        
               ATTR=(PROT)                                                      
LEVNR1   DFLD  POS=(7,2),LTH=5,                                        +        
               ATTR=(PROT,MOD)                                                  
IDGRP1   DFLD  POS=(7,9),LTH=10,                                       +        
               ATTR=(PROT,MOD)                                                  
DATGRP1  DFLD  POS=(7,23),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
DATART1  DFLD  POS=(7,34),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
LEVNR15  DFLD  POS=(7,42),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
IDGRP15  DFLD  POS=(7,48),LTH=10,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DATGRP15 DFLD  POS=(7,64),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
DATART15 DFLD  POS=(7,75),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
LEVNR2   DFLD  POS=(8,2),LTH=5,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
IDGRP2   DFLD  POS=(8,9),LTH=10,                                       +        
               ATTR=(PROT,MOD)                                                  
DATGRP2  DFLD  POS=(8,23),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
DATART2  DFLD  POS=(8,34),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
LEVNR16  DFLD  POS=(8,42),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
IDGRP16  DFLD  POS=(8,48),LTH=10,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DATGRP16 DFLD  POS=(8,64),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
DATART16 DFLD  POS=(8,75),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
LEVNR3   DFLD  POS=(9,2),LTH=5,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
IDGRP3   DFLD  POS=(9,9),LTH=10,                                       +        
               ATTR=(PROT,MOD)                                                  
DATGRP3  DFLD  POS=(9,23),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
DATART3  DFLD  POS=(9,34),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
LEVNR17  DFLD  POS=(9,42),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
IDGRP17  DFLD  POS=(9,48),LTH=10,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DATGRP17 DFLD  POS=(9,64),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
DATART17 DFLD  POS=(9,75),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
LEVNR4   DFLD  POS=(10,2),LTH=5,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
IDGRP4   DFLD  POS=(10,9),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
DATGRP4  DFLD  POS=(10,23),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DATART4  DFLD  POS=(10,34),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
LEVNR18  DFLD  POS=(10,42),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
IDGRP18  DFLD  POS=(10,48),LTH=10,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
DATGRP18 DFLD  POS=(10,64),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DATART18 DFLD  POS=(10,75),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
LEVNR5   DFLD  POS=(11,2),LTH=5,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
IDGRP5   DFLD  POS=(11,9),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
DATGRP5  DFLD  POS=(11,23),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DATART5  DFLD  POS=(11,34),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
LEVNR19  DFLD  POS=(11,42),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
IDGRP19  DFLD  POS=(11,48),LTH=10,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
DATGRP19 DFLD  POS=(11,64),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DATART19 DFLD  POS=(11,75),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
LEVNR6   DFLD  POS=(12,2),LTH=5,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
IDGRP6   DFLD  POS=(12,9),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
DATGRP6  DFLD  POS=(12,23),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DATART6  DFLD  POS=(12,34),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
LEVNR20  DFLD  POS=(12,42),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
IDGRP20  DFLD  POS=(12,48),LTH=10,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
DATGRP20 DFLD  POS=(12,64),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DATART20 DFLD  POS=(12,75),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
LEVNR7   DFLD  POS=(13,2),LTH=5,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
IDGRP7   DFLD  POS=(13,9),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
DATGRP7  DFLD  POS=(13,23),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DATART7  DFLD  POS=(13,34),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
LEVNR21  DFLD  POS=(13,42),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
IDGRP21  DFLD  POS=(13,48),LTH=10,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
DATGRP21 DFLD  POS=(13,64),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DATART21 DFLD  POS=(13,75),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
LEVNR8   DFLD  POS=(14,2),LTH=5,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
IDGRP8   DFLD  POS=(14,9),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
DATGRP8  DFLD  POS=(14,23),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DATART8  DFLD  POS=(14,34),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
LEVNR22  DFLD  POS=(14,42),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
IDGRP22  DFLD  POS=(14,48),LTH=10,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
DATGRP22 DFLD  POS=(14,64),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DATART22 DFLD  POS=(14,75),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
LEVNR9   DFLD  POS=(15,2),LTH=5,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
IDGRP9   DFLD  POS=(15,9),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
DATGRP9  DFLD  POS=(15,23),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DATART9  DFLD  POS=(15,34),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
LEVNR23  DFLD  POS=(15,42),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
IDGRP23  DFLD  POS=(15,48),LTH=10,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
DATGRP23 DFLD  POS=(15,64),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DATART23 DFLD  POS=(15,75),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
LEVNR10  DFLD  POS=(16,2),LTH=5,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
IDGRP10  DFLD  POS=(16,9),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
DATGRP10 DFLD  POS=(16,23),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DATART10 DFLD  POS=(16,34),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
LEVNR24  DFLD  POS=(16,42),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
IDGRP24  DFLD  POS=(16,48),LTH=10,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
DATGRP24 DFLD  POS=(16,64),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DATART24 DFLD  POS=(16,75),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
LEVNR11  DFLD  POS=(17,2),LTH=5,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
IDGRP11  DFLD  POS=(17,9),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
DATGRP11 DFLD  POS=(17,23),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DATART11 DFLD  POS=(17,34),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
LEVNR25  DFLD  POS=(17,42),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
IDGRP25  DFLD  POS=(17,48),LTH=10,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
DATGRP25 DFLD  POS=(17,64),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DATART25 DFLD  POS=(17,75),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
LEVNR12  DFLD  POS=(18,2),LTH=5,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
IDGRP12  DFLD  POS=(18,9),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
DATGRP12 DFLD  POS=(18,23),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DATART12 DFLD  POS=(18,34),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
LEVNR26  DFLD  POS=(18,42),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
IDGRP26  DFLD  POS=(18,48),LTH=10,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
DATGRP26 DFLD  POS=(18,64),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DATART26 DFLD  POS=(18,75),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
LEVNR13  DFLD  POS=(19,2),LTH=5,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
IDGRP13  DFLD  POS=(19,9),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
DATGRP13 DFLD  POS=(19,23),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DATART13 DFLD  POS=(19,34),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
LEVNR27  DFLD  POS=(19,42),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
IDGRP27  DFLD  POS=(19,48),LTH=10,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
DATGRP27 DFLD  POS=(19,64),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DATART27 DFLD  POS=(19,75),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
LEVNR14  DFLD  POS=(20,2),LTH=5,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
IDGRP14  DFLD  POS=(20,9),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
DATGRP14 DFLD  POS=(20,23),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DATART14 DFLD  POS=(20,34),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
LEVNR28  DFLD  POS=(20,42),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
IDGRP28  DFLD  POS=(20,48),LTH=10,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
DATGRP28 DFLD  POS=(20,64),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DATART28 DFLD  POS=(20,75),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'F7=First  F8=Next  F10=WHELP',                         +        
               POS=(22,2),LTH=28,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W2O334N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W2N334,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W2I334N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  ARTNRIN,                                                +        
               LTH=2                                                            
         MFLD  ARTNRUT,                                                +        
               LTH=9                                                            
         MFLD  LEVNR1,                                                 +        
               LTH=5                                                            
         MFLD  IDGRP1,                                                 +        
               LTH=10                                                           
         MFLD  DATGRP1,                                                +        
               LTH=6                                                            
         MFLD  DATART1,                                                +        
               LTH=6                                                            
         MFLD  LEVNR2,                                                 +        
               LTH=5                                                            
         MFLD  IDGRP2,                                                 +        
               LTH=10                                                           
         MFLD  DATGRP2,                                                +        
               LTH=6                                                            
         MFLD  DATART2,                                                +        
               LTH=6                                                            
         MFLD  LEVNR3,                                                 +        
               LTH=5                                                            
         MFLD  IDGRP3,                                                 +        
               LTH=10                                                           
         MFLD  DATGRP3,                                                +        
               LTH=6                                                            
         MFLD  DATART3,                                                +        
               LTH=6                                                            
         MFLD  LEVNR4,                                                 +        
               LTH=5                                                            
         MFLD  IDGRP4,                                                 +        
               LTH=10                                                           
         MFLD  DATGRP4,                                                +        
               LTH=6                                                            
         MFLD  DATART4,                                                +        
               LTH=6                                                            
         MFLD  LEVNR5,                                                 +        
               LTH=5                                                            
         MFLD  IDGRP5,                                                 +        
               LTH=10                                                           
         MFLD  DATGRP5,                                                +        
               LTH=6                                                            
         MFLD  DATART5,                                                +        
               LTH=6                                                            
         MFLD  LEVNR6,                                                 +        
               LTH=5                                                            
         MFLD  IDGRP6,                                                 +        
               LTH=10                                                           
         MFLD  DATGRP6,                                                +        
               LTH=6                                                            
         MFLD  DATART6,                                                +        
               LTH=6                                                            
         MFLD  LEVNR7,                                                 +        
               LTH=5                                                            
         MFLD  IDGRP7,                                                 +        
               LTH=10                                                           
         MFLD  DATGRP7,                                                +        
               LTH=6                                                            
         MFLD  DATART7,                                                +        
               LTH=6                                                            
         MFLD  LEVNR8,                                                 +        
               LTH=5                                                            
         MFLD  IDGRP8,                                                 +        
               LTH=10                                                           
         MFLD  DATGRP8,                                                +        
               LTH=6                                                            
         MFLD  DATART8,                                                +        
               LTH=6                                                            
         MFLD  LEVNR9,                                                 +        
               LTH=5                                                            
         MFLD  IDGRP9,                                                 +        
               LTH=10                                                           
         MFLD  DATGRP9,                                                +        
               LTH=6                                                            
         MFLD  DATART9,                                                +        
               LTH=6                                                            
         MFLD  LEVNR10,                                                +        
               LTH=5                                                            
         MFLD  IDGRP10,                                                +        
               LTH=10                                                           
         MFLD  DATGRP10,                                               +        
               LTH=6                                                            
         MFLD  DATART10,                                               +        
               LTH=6                                                            
         MFLD  LEVNR11,                                                +        
               LTH=5                                                            
         MFLD  IDGRP11,                                                +        
               LTH=10                                                           
         MFLD  DATGRP11,                                               +        
               LTH=6                                                            
         MFLD  DATART11,                                               +        
               LTH=6                                                            
         MFLD  LEVNR12,                                                +        
               LTH=5                                                            
         MFLD  IDGRP12,                                                +        
               LTH=10                                                           
         MFLD  DATGRP12,                                               +        
               LTH=6                                                            
         MFLD  DATART12,                                               +        
               LTH=6                                                            
         MFLD  LEVNR13,                                                +        
               LTH=5                                                            
         MFLD  IDGRP13,                                                +        
               LTH=10                                                           
         MFLD  DATGRP13,                                               +        
               LTH=6                                                            
         MFLD  DATART13,                                               +        
               LTH=6                                                            
         MFLD  LEVNR14,                                                +        
               LTH=5                                                            
         MFLD  IDGRP14,                                                +        
               LTH=10                                                           
         MFLD  DATGRP14,                                               +        
               LTH=6                                                            
         MFLD  DATART14,                                               +        
               LTH=6                                                            
         MFLD  LEVNR15,                                                +        
               LTH=5                                                            
         MFLD  IDGRP15,                                                +        
               LTH=10                                                           
         MFLD  DATGRP15,                                               +        
               LTH=6                                                            
         MFLD  DATART15,                                               +        
               LTH=6                                                            
         MFLD  LEVNR16,                                                +        
               LTH=5                                                            
         MFLD  IDGRP16,                                                +        
               LTH=10                                                           
         MFLD  DATGRP16,                                               +        
               LTH=6                                                            
         MFLD  DATART16,                                               +        
               LTH=6                                                            
         MFLD  LEVNR17,                                                +        
               LTH=5                                                            
         MFLD  IDGRP17,                                                +        
               LTH=10                                                           
         MFLD  DATGRP17,                                               +        
               LTH=6                                                            
         MFLD  DATART17,                                               +        
               LTH=6                                                            
         MFLD  LEVNR18,                                                +        
               LTH=5                                                            
         MFLD  IDGRP18,                                                +        
               LTH=10                                                           
         MFLD  DATGRP18,                                               +        
               LTH=6                                                            
         MFLD  DATART18,                                               +        
               LTH=6                                                            
         MFLD  LEVNR19,                                                +        
               LTH=5                                                            
         MFLD  IDGRP19,                                                +        
               LTH=10                                                           
         MFLD  DATGRP19,                                               +        
               LTH=6                                                            
         MFLD  DATART19,                                               +        
               LTH=6                                                            
         MFLD  LEVNR20,                                                +        
               LTH=5                                                            
         MFLD  IDGRP20,                                                +        
               LTH=10                                                           
         MFLD  DATGRP20,                                               +        
               LTH=6                                                            
         MFLD  DATART20,                                               +        
               LTH=6                                                            
         MFLD  LEVNR21,                                                +        
               LTH=5                                                            
         MFLD  IDGRP21,                                                +        
               LTH=10                                                           
         MFLD  DATGRP21,                                               +        
               LTH=6                                                            
         MFLD  DATART21,                                               +        
               LTH=6                                                            
         MFLD  LEVNR22,                                                +        
               LTH=5                                                            
         MFLD  IDGRP22,                                                +        
               LTH=10                                                           
         MFLD  DATGRP22,                                               +        
               LTH=6                                                            
         MFLD  DATART22,                                               +        
               LTH=6                                                            
         MFLD  LEVNR23,                                                +        
               LTH=5                                                            
         MFLD  IDGRP23,                                                +        
               LTH=10                                                           
         MFLD  DATGRP23,                                               +        
               LTH=6                                                            
         MFLD  DATART23,                                               +        
               LTH=6                                                            
         MFLD  LEVNR24,                                                +        
               LTH=5                                                            
         MFLD  IDGRP24,                                                +        
               LTH=10                                                           
         MFLD  DATGRP24,                                               +        
               LTH=6                                                            
         MFLD  DATART24,                                               +        
               LTH=6                                                            
         MFLD  LEVNR25,                                                +        
               LTH=5                                                            
         MFLD  IDGRP25,                                                +        
               LTH=10                                                           
         MFLD  DATGRP25,                                               +        
               LTH=6                                                            
         MFLD  DATART25,                                               +        
               LTH=6                                                            
         MFLD  LEVNR26,                                                +        
               LTH=5                                                            
         MFLD  IDGRP26,                                                +        
               LTH=10                                                           
         MFLD  DATGRP26,                                               +        
               LTH=6                                                            
         MFLD  DATART26,                                               +        
               LTH=6                                                            
         MFLD  LEVNR27,                                                +        
               LTH=5                                                            
         MFLD  IDGRP27,                                                +        
               LTH=10                                                           
         MFLD  DATGRP27,                                               +        
               LTH=6                                                            
         MFLD  DATART27,                                               +        
               LTH=6                                                            
         MFLD  LEVNR28,                                                +        
               LTH=5                                                            
         MFLD  IDGRP28,                                                +        
               LTH=10                                                           
         MFLD  DATGRP28,                                               +        
               LTH=6                                                            
         MFLD  DATART28,                                               +        
               LTH=6                                                            
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W2I334N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W2N334),                                           +        
               OPT=2,                                                  +        
               NXT=W2O334N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '23342',                                                +        
               LTH=5                                                            
         MFLD  (ARTNRIN,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R                                                           
         MSGEND                                                                 
         END                                                                    
