***********************************************************************         
* CREATED BY v086936   ON 06/01/31  AT 14:22                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'DC Group                        '                               
W2N365   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W2T365U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W2N365   DPAGE CURSOR=((2,5)),                                         +        
               FILL=NONE                                                        
TRANS1   DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
TRANS2   DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
TRANS3   DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
TRANS4   DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DC GROUP             ',                                +        
               POS=(1,11),LTH=21,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'DC',                                                   +        
               POS=(2,2),LTH=2,                                        +        
               ATTR=(PROT)                                                      
IDDCIN   DFLD  POS=(2,5),LTH=2,                                        +        
               ATTR=(NOPROT)                                                    
IDDCUT   DFLD  POS=(3,5),LTH=2,                                        +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'CMD',                                                  +        
               POS=(5,02),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'DC',                                                   +        
               POS=(5,06),LTH=2,                                       +        
               ATTR=(PROT)                                                      
CMD1     DFLD  POS=(7,03),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DC1      DFLD  POS=(7,06),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
CMD2     DFLD  POS=(8,03),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DC2      DFLD  POS=(8,06),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
CMD3     DFLD  POS=(9,03),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DC3      DFLD  POS=(9,06),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
CMD4     DFLD  POS=(10,03),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
DC4      DFLD  POS=(10,06),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
CMD5     DFLD  POS=(11,03),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
DC5      DFLD  POS=(11,06),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
CMD6     DFLD  POS=(12,03),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
DC6      DFLD  POS=(12,06),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
CMD7     DFLD  POS=(13,03),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
DC7      DFLD  POS=(13,06),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
CMD8     DFLD  POS=(14,03),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
DC8      DFLD  POS=(14,06),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
CMD9     DFLD  POS=(15,03),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
DC9      DFLD  POS=(15,06),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
CMD10    DFLD  POS=(16,03),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
DC10     DFLD  POS=(16,06),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
CMD11    DFLD  POS=(17,03),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
DC11     DFLD  POS=(17,06),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'New',                                                  +        
               POS=(20,02),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DCNY     DFLD  POS=(20,06),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  '13             14             ',                       +        
               POS=(21,2),LTH=30,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,17),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,33),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,49),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '22      ',                                             +        
               POS=(22,65),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W2O365N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W2N365,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W2I365N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W2N365                                                       
         SEG                                                                    
         MFLD  TRANS1,                                                 +        
               LTH=1                                                            
         MFLD  TRANS2,                                                 +        
               LTH=1                                                            
         MFLD  TRANS3,                                                 +        
               LTH=1                                                            
         MFLD  TRANS4,                                                 +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDDCIN,                                                 +        
               LTH=2                                                            
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  CMD1,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DC1,                                                    +        
               LTH=2                                                            
         MFLD  CMD2,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DC2,                                                    +        
               LTH=2                                                            
         MFLD  CMD3,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DC3,                                                    +        
               LTH=2                                                            
         MFLD  CMD4,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DC4,                                                    +        
               LTH=2                                                            
         MFLD  CMD5,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DC5,                                                    +        
               LTH=2                                                            
         MFLD  CMD6,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DC6,                                                    +        
               LTH=2                                                            
         MFLD  CMD7,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DC7,                                                    +        
               LTH=2                                                            
         MFLD  CMD8,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DC8,                                                    +        
               LTH=2                                                            
         MFLD  CMD9,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DC9,                                                    +        
               LTH=2                                                            
         MFLD  CMD10,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DC10,                                                   +        
               LTH=2                                                            
         MFLD  CMD11,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DC11,                                                   +        
               LTH=2                                                            
         MFLD  DCNY,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W2I365N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W2N365),                                           +        
               OPT=2,                                                  +        
               NXT=W2O365N1                                                     
MID      LPAGE SOR=(W2N365)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  TRANS1,                                                 +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  TRANS2,                                                 +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  TRANS3,                                                 +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  TRANS4,                                                 +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '23651',                                                +        
               LTH=5                                                            
         MFLD  (IDDCIN,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (IDDCUT,                                                +        
               '  '),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD1,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD2,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD3,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD4,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD5,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD6,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD7,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD8,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD9,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD10,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD11,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DCNY,                                                  +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
