***********************************************************************         
* CREATED BY V0C9059   ON 10/11/23  AT 08:51                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'DESTOCKING STEERING'                                            
W2N366   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T553 9',                                           +        
               10='WHELP   ',                                          +        
               11='W2T366U ',                                          +        
               12='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((2,05)),                                        +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DC Destocking steering   ',                            +        
               POS=(1,12),LTH=25,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'DC',                                                   +        
               POS=(2,2),LTH=2,                                        +        
               ATTR=(ALPHA,PROT)                                                
IDDCIN   DFLD  POS=(2,05),LTH=02,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
IDDCUT   DFLD  POS=(3,05),LTH=02,                                      +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  'ID:',                                                  +        
               POS=(4,41),LTH=3,                                       +        
               ATTR=(ALPHA,PROT)                                                
IDUSER   DFLD  POS=(4,45),LTH=08,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
         DFLD  'Date Changed:',                                        +        
               POS=(4,55),LTH=13,                                      +        
               ATTR=(ALPHA,PROT)                                                
TIUPPDAT DFLD  POS=(4,70),LTH=06,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  'C',                                                    +        
               POS=(5,2),LTH=1,                                        +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  'Last sales',                                           +        
               POS=(5,4),LTH=10,                                       +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  'Pubw',                                                 +        
               POS=(5,15),LTH=04,                                      +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  'Price',                                                +        
               POS=(5,23),LTH=05,                                      +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  'Vol (cm3)',                                            +        
               POS=(5,33),LTH=09,                                      +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  'PG',                                                   +        
               POS=(5,44),LTH=02,                                      +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  'Area',                                                 +        
               POS=(5,47),LTH=04,                                      +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  '(weeks)',                                              +        
               POS=(6,4),LTH=07,                                       +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  '(weeks)',                                              +        
               POS=(6,15),LTH=07,                                      +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  '     ',                                                +        
               POS=(6,23),LTH=05,                                      +        
               ATTR=(ALPHA,PROT)                                                
LSALES01 DFLD  POS=(7,6),LTH=03,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
PUBW01   DFLD  POS=(7,17),LTH=03,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
PRICE01  DFLD  POS=(7,25),LTH=07,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
VOL01    DFLD  POS=(7,35),LTH=08,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
PRODSL01 DFLD  POS=(7,44),LTH=02,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
AREA101  DFLD  POS=(7,47),LTH=02,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
AREA102  DFLD  POS=(7,50),LTH=02,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
AREA103  DFLD  POS=(7,53),LTH=02,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
AREA104  DFLD  POS=(7,56),LTH=02,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
AREA105  DFLD  POS=(7,59),LTH=02,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
AREA106  DFLD  POS=(7,62),LTH=02,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
AREA107  DFLD  POS=(7,65),LTH=02,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
AREA108  DFLD  POS=(7,68),LTH=02,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
AREA109  DFLD  POS=(7,71),LTH=02,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
AREA110  DFLD  POS=(7,74),LTH=02,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
KDCMDV02 DFLD  POS=(8,2),LTH=1,                                        +        
               ATTR=(ALPHA,NOPROT,MOD)                                          
         DFLD  '>',                                                    +        
               POS=(8,05),LTH=01,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
LSALES02 DFLD  POS=(8,7),LTH=03,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  '>',                                                    +        
               POS=(8,15),LTH=01,                                      +        
               ATTR=(ALPHA,PROT)                                                
PUBW02   DFLD  POS=(8,17),LTH=03,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  '>',                                                    +        
               POS=(8,23),LTH=01,                                      +        
               ATTR=(ALPHA,PROT)                                                
PRICE02  DFLD  POS=(8,25),LTH=07,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  '>',                                                    +        
               POS=(8,33),LTH=01,                                      +        
               ATTR=(ALPHA,PROT)                                                
VOL02    DFLD  POS=(8,35),LTH=08,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
PRODSL02 DFLD  POS=(8,44),LTH=02,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
AREA201  DFLD  POS=(8,47),LTH=02,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
AREA202  DFLD  POS=(8,50),LTH=02,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
AREA203  DFLD  POS=(8,53),LTH=02,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
AREA204  DFLD  POS=(8,56),LTH=02,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
AREA205  DFLD  POS=(8,59),LTH=02,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
AREA206  DFLD  POS=(8,62),LTH=02,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
AREA207  DFLD  POS=(8,65),LTH=02,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
AREA208  DFLD  POS=(8,68),LTH=02,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
AREA209  DFLD  POS=(8,71),LTH=02,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
AREA210  DFLD  POS=(8,74),LTH=02,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KDCMDV03 DFLD  POS=(9,2),LTH=1,                                        +        
               ATTR=(ALPHA,NOPROT,MOD)                                          
         DFLD  '>',                                                    +        
               POS=(9,05),LTH=01,                                      +        
               ATTR=(ALPHA,PROT)                                                
LSALES03 DFLD  POS=(9,7),LTH=03,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  '>',                                                    +        
               POS=(9,15),LTH=01,                                      +        
               ATTR=(ALPHA,PROT)                                                
PUBW03   DFLD  POS=(9,17),LTH=03,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  '>',                                                    +        
               POS=(9,23),LTH=01,                                      +        
               ATTR=(ALPHA,PROT)                                                
PRICE03  DFLD  POS=(9,25),LTH=07,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  '>',                                                    +        
               POS=(9,33),LTH=01,                                      +        
               ATTR=(ALPHA,PROT)                                                
VOL03    DFLD  POS=(9,35),LTH=08,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
PRODSL03 DFLD  POS=(9,44),LTH=02,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
AREA301  DFLD  POS=(9,47),LTH=02,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
AREA302  DFLD  POS=(9,50),LTH=02,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
AREA303  DFLD  POS=(9,53),LTH=02,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
AREA304  DFLD  POS=(9,56),LTH=02,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
AREA305  DFLD  POS=(9,59),LTH=02,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
AREA306  DFLD  POS=(9,62),LTH=02,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
AREA307  DFLD  POS=(9,65),LTH=02,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
AREA308  DFLD  POS=(9,68),LTH=02,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
AREA309  DFLD  POS=(9,71),LTH=02,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
AREA310  DFLD  POS=(9,74),LTH=02,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KDCMDV04 DFLD  POS=(10,2),LTH=1,                                       +        
               ATTR=(ALPHA,NOPROT,MOD)                                          
         DFLD  '>',                                                    +        
               POS=(10,05),LTH=01,                                     +        
               ATTR=(ALPHA,PROT)                                                
LSALES04 DFLD  POS=(10,7),LTH=03,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  '>',                                                    +        
               POS=(10,15),LTH=01,                                     +        
               ATTR=(ALPHA,PROT)                                                
PUBW04   DFLD  POS=(10,17),LTH=03,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  '>',                                                    +        
               POS=(10,23),LTH=01,                                     +        
               ATTR=(ALPHA,PROT)                                                
PRICE04  DFLD  POS=(10,25),LTH=07,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  '>',                                                    +        
               POS=(10,33),LTH=01,                                     +        
               ATTR=(ALPHA,PROT)                                                
VOL04    DFLD  POS=(10,35),LTH=08,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
PRODSL04 DFLD  POS=(10,44),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA401  DFLD  POS=(10,47),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA402  DFLD  POS=(10,50),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA403  DFLD  POS=(10,53),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA404  DFLD  POS=(10,56),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA405  DFLD  POS=(10,59),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA406  DFLD  POS=(10,62),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA407  DFLD  POS=(10,65),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA408  DFLD  POS=(10,68),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA409  DFLD  POS=(10,71),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA410  DFLD  POS=(10,74),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
KDCMDV05 DFLD  POS=(11,2),LTH=1,                                       +        
               ATTR=(ALPHA,NOPROT,MOD)                                          
         DFLD  '>',                                                    +        
               POS=(11,05),LTH=01,                                     +        
               ATTR=(ALPHA,PROT)                                                
LSALES05 DFLD  POS=(11,7),LTH=03,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  '>',                                                    +        
               POS=(11,15),LTH=01,                                     +        
               ATTR=(ALPHA,PROT)                                                
PUBW05   DFLD  POS=(11,17),LTH=03,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  '>',                                                    +        
               POS=(11,23),LTH=01,                                     +        
               ATTR=(ALPHA,PROT)                                                
PRICE05  DFLD  POS=(11,25),LTH=07,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  '>',                                                    +        
               POS=(11,33),LTH=01,                                     +        
               ATTR=(ALPHA,PROT)                                                
VOL05    DFLD  POS=(11,35),LTH=08,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
PRODSL05 DFLD  POS=(11,44),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA501  DFLD  POS=(11,47),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA502  DFLD  POS=(11,50),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA503  DFLD  POS=(11,53),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA504  DFLD  POS=(11,56),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA505  DFLD  POS=(11,59),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA506  DFLD  POS=(11,62),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA507  DFLD  POS=(11,65),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA508  DFLD  POS=(11,68),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA509  DFLD  POS=(11,71),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA510  DFLD  POS=(11,74),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
KDCMDV06 DFLD  POS=(12,2),LTH=1,                                       +        
               ATTR=(ALPHA,NOPROT,MOD)                                          
         DFLD  '>',                                                    +        
               POS=(12,05),LTH=01,                                     +        
               ATTR=(ALPHA,PROT)                                                
LSALES06 DFLD  POS=(12,7),LTH=03,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  '>',                                                    +        
               POS=(12,15),LTH=01,                                     +        
               ATTR=(ALPHA,PROT)                                                
PUBW06   DFLD  POS=(12,17),LTH=03,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  '>',                                                    +        
               POS=(12,23),LTH=01,                                     +        
               ATTR=(ALPHA,PROT)                                                
PRICE06  DFLD  POS=(12,25),LTH=07,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  '>',                                                    +        
               POS=(12,33),LTH=01,                                     +        
               ATTR=(ALPHA,PROT)                                                
VOL06    DFLD  POS=(12,35),LTH=08,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
PRODSL06 DFLD  POS=(12,44),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA601  DFLD  POS=(12,47),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA602  DFLD  POS=(12,50),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA603  DFLD  POS=(12,53),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA604  DFLD  POS=(12,56),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA605  DFLD  POS=(12,59),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA606  DFLD  POS=(12,62),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA607  DFLD  POS=(12,65),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA608  DFLD  POS=(12,68),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA609  DFLD  POS=(12,71),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA610  DFLD  POS=(12,74),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
KDCMDV07 DFLD  POS=(13,2),LTH=1,                                       +        
               ATTR=(ALPHA,NOPROT,MOD)                                          
         DFLD  '>',                                                    +        
               POS=(13,05),LTH=01,                                     +        
               ATTR=(ALPHA,PROT)                                                
LSALES07 DFLD  POS=(13,7),LTH=03,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  '>',                                                    +        
               POS=(13,15),LTH=01,                                     +        
               ATTR=(ALPHA,PROT)                                                
PUBW07   DFLD  POS=(13,17),LTH=03,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  '>',                                                    +        
               POS=(13,23),LTH=01,                                     +        
               ATTR=(ALPHA,PROT)                                                
PRICE07  DFLD  POS=(13,25),LTH=07,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  '>',                                                    +        
               POS=(13,33),LTH=01,                                     +        
               ATTR=(ALPHA,PROT)                                                
VOL07    DFLD  POS=(13,35),LTH=08,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
PRODSL07 DFLD  POS=(13,44),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA701  DFLD  POS=(13,47),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA702  DFLD  POS=(13,50),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA703  DFLD  POS=(13,53),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA704  DFLD  POS=(13,56),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA705  DFLD  POS=(13,59),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA706  DFLD  POS=(13,62),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA707  DFLD  POS=(13,65),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA708  DFLD  POS=(13,68),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA709  DFLD  POS=(13,71),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA710  DFLD  POS=(13,74),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
KDCMDV08 DFLD  POS=(14,2),LTH=1,                                       +        
               ATTR=(ALPHA,NOPROT,MOD)                                          
         DFLD  '>',                                                    +        
               POS=(14,05),LTH=01,                                     +        
               ATTR=(ALPHA,PROT)                                                
LSALES08 DFLD  POS=(14,7),LTH=03,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  '>',                                                    +        
               POS=(14,15),LTH=01,                                     +        
               ATTR=(ALPHA,PROT)                                                
PUBW08   DFLD  POS=(14,17),LTH=03,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  '>',                                                    +        
               POS=(14,23),LTH=01,                                     +        
               ATTR=(ALPHA,PROT)                                                
PRICE08  DFLD  POS=(14,25),LTH=07,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  '>',                                                    +        
               POS=(14,33),LTH=01,                                     +        
               ATTR=(ALPHA,PROT)                                                
VOL08    DFLD  POS=(14,35),LTH=08,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
PRODSL08 DFLD  POS=(14,44),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA801  DFLD  POS=(14,47),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA802  DFLD  POS=(14,50),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA803  DFLD  POS=(14,53),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA804  DFLD  POS=(14,56),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA805  DFLD  POS=(14,59),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA806  DFLD  POS=(14,62),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA807  DFLD  POS=(14,65),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA808  DFLD  POS=(14,68),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA809  DFLD  POS=(14,71),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA810  DFLD  POS=(14,74),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
KDCMDV09 DFLD  POS=(15,2),LTH=1,                                       +        
               ATTR=(ALPHA,NOPROT,MOD)                                          
         DFLD  '>',                                                    +        
               POS=(15,05),LTH=01,                                     +        
               ATTR=(ALPHA,PROT)                                                
LSALES09 DFLD  POS=(15,7),LTH=03,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  '>',                                                    +        
               POS=(15,15),LTH=01,                                     +        
               ATTR=(ALPHA,PROT)                                                
PUBW09   DFLD  POS=(15,17),LTH=03,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  '>',                                                    +        
               POS=(15,23),LTH=01,                                     +        
               ATTR=(ALPHA,PROT)                                                
PRICE09  DFLD  POS=(15,25),LTH=07,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  '>',                                                    +        
               POS=(15,33),LTH=01,                                     +        
               ATTR=(ALPHA,PROT)                                                
VOL09    DFLD  POS=(15,35),LTH=08,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
PRODSL09 DFLD  POS=(15,44),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA901  DFLD  POS=(15,47),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA902  DFLD  POS=(15,50),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA903  DFLD  POS=(15,53),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA904  DFLD  POS=(15,56),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA905  DFLD  POS=(15,59),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA906  DFLD  POS=(15,62),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA907  DFLD  POS=(15,65),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA908  DFLD  POS=(15,68),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA909  DFLD  POS=(15,71),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA910  DFLD  POS=(15,74),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
KDCMDV10 DFLD  POS=(16,2),LTH=1,                                       +        
               ATTR=(ALPHA,NOPROT,MOD)                                          
         DFLD  '>',                                                    +        
               POS=(16,05),LTH=01,                                     +        
               ATTR=(ALPHA,PROT)                                                
LSALES10 DFLD  POS=(16,7),LTH=03,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  '>',                                                    +        
               POS=(16,15),LTH=01,                                     +        
               ATTR=(ALPHA,PROT)                                                
PUBW10   DFLD  POS=(16,17),LTH=03,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  '>',                                                    +        
               POS=(16,23),LTH=01,                                     +        
               ATTR=(ALPHA,PROT)                                                
PRICE10  DFLD  POS=(16,25),LTH=07,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  '>',                                                    +        
               POS=(16,33),LTH=01,                                     +        
               ATTR=(ALPHA,PROT)                                                
VOL10    DFLD  POS=(16,35),LTH=08,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
PRODSL10 DFLD  POS=(16,44),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA1001 DFLD  POS=(16,47),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA1002 DFLD  POS=(16,50),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA1003 DFLD  POS=(16,53),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA1004 DFLD  POS=(16,56),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA1005 DFLD  POS=(16,59),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA1006 DFLD  POS=(16,62),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA1007 DFLD  POS=(16,65),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA1008 DFLD  POS=(16,68),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA1009 DFLD  POS=(16,71),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA1010 DFLD  POS=(16,74),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
KDCMDV11 DFLD  POS=(17,2),LTH=1,                                       +        
               ATTR=(ALPHA,NOPROT,MOD)                                          
         DFLD  '>',                                                    +        
               POS=(17,05),LTH=01,                                     +        
               ATTR=(ALPHA,PROT)                                                
LSALES11 DFLD  POS=(17,7),LTH=03,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  '>',                                                    +        
               POS=(17,15),LTH=01,                                     +        
               ATTR=(ALPHA,PROT)                                                
PUBW11   DFLD  POS=(17,17),LTH=03,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  '>',                                                    +        
               POS=(17,23),LTH=01,                                     +        
               ATTR=(ALPHA,PROT)                                                
PRICE11  DFLD  POS=(17,25),LTH=07,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  '>',                                                    +        
               POS=(17,33),LTH=01,                                     +        
               ATTR=(ALPHA,PROT)                                                
VOL11    DFLD  POS=(17,35),LTH=08,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
PRODSL11 DFLD  POS=(17,44),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA1101 DFLD  POS=(17,47),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA1102 DFLD  POS=(17,50),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA1103 DFLD  POS=(17,53),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA1104 DFLD  POS=(17,56),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA1105 DFLD  POS=(17,59),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA1106 DFLD  POS=(17,62),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA1107 DFLD  POS=(17,65),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA1108 DFLD  POS=(17,68),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA1109 DFLD  POS=(17,71),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA1110 DFLD  POS=(17,74),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
KDCMDV12 DFLD  POS=(18,2),LTH=1,                                       +        
               ATTR=(ALPHA,NOPROT,MOD)                                          
         DFLD  '>',                                                    +        
               POS=(18,05),LTH=01,                                     +        
               ATTR=(ALPHA,PROT)                                                
LSALES12 DFLD  POS=(18,7),LTH=03,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  '>',                                                    +        
               POS=(18,15),LTH=01,                                     +        
               ATTR=(ALPHA,PROT)                                                
PUBW12   DFLD  POS=(18,17),LTH=03,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  '>',                                                    +        
               POS=(18,23),LTH=01,                                     +        
               ATTR=(ALPHA,PROT)                                                
PRICE12  DFLD  POS=(18,25),LTH=07,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  '>',                                                    +        
               POS=(18,33),LTH=01,                                     +        
               ATTR=(ALPHA,PROT)                                                
VOL12    DFLD  POS=(18,35),LTH=08,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
PRODSL12 DFLD  POS=(18,44),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA1201 DFLD  POS=(18,47),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA1202 DFLD  POS=(18,50),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA1203 DFLD  POS=(18,53),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA1204 DFLD  POS=(18,56),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA1205 DFLD  POS=(18,59),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA1206 DFLD  POS=(18,62),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA1207 DFLD  POS=(18,65),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA1208 DFLD  POS=(18,68),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA1209 DFLD  POS=(18,71),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA1210 DFLD  POS=(18,74),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
KDCMDV13 DFLD  POS=(19,2),LTH=1,                                       +        
               ATTR=(ALPHA,NOPROT,MOD)                                          
         DFLD  '>',                                                    +        
               POS=(19,05),LTH=01,                                     +        
               ATTR=(ALPHA,PROT)                                                
LSALES13 DFLD  POS=(19,7),LTH=03,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  '>',                                                    +        
               POS=(19,15),LTH=01,                                     +        
               ATTR=(ALPHA,PROT)                                                
PUBW13   DFLD  POS=(19,17),LTH=03,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  '>',                                                    +        
               POS=(19,23),LTH=01,                                     +        
               ATTR=(ALPHA,PROT)                                                
PRICE13  DFLD  POS=(19,25),LTH=07,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  '>',                                                    +        
               POS=(19,33),LTH=01,                                     +        
               ATTR=(ALPHA,PROT)                                                
VOL13    DFLD  POS=(19,35),LTH=08,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
PRODSL13 DFLD  POS=(19,44),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA1301 DFLD  POS=(19,47),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA1302 DFLD  POS=(19,50),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA1303 DFLD  POS=(19,53),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA1304 DFLD  POS=(19,56),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA1305 DFLD  POS=(19,59),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA1306 DFLD  POS=(19,62),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA1307 DFLD  POS=(19,65),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA1308 DFLD  POS=(19,68),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA1309 DFLD  POS=(19,71),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA1310 DFLD  POS=(19,74),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
KDCMDV14 DFLD  POS=(20,2),LTH=1,                                       +        
               ATTR=(ALPHA,NOPROT,MOD)                                          
         DFLD  '>',                                                    +        
               POS=(20,05),LTH=01,                                     +        
               ATTR=(ALPHA,PROT)                                                
LSALES14 DFLD  POS=(20,7),LTH=03,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  '>',                                                    +        
               POS=(20,15),LTH=01,                                     +        
               ATTR=(ALPHA,PROT)                                                
PUBW14   DFLD  POS=(20,17),LTH=03,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  '>',                                                    +        
               POS=(20,23),LTH=01,                                     +        
               ATTR=(ALPHA,PROT)                                                
PRICE14  DFLD  POS=(20,25),LTH=07,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  '>',                                                    +        
               POS=(20,33),LTH=01,                                     +        
               ATTR=(ALPHA,PROT)                                                
VOL14    DFLD  POS=(20,35),LTH=08,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
PRODSL14 DFLD  POS=(20,44),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA1401 DFLD  POS=(20,47),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA1402 DFLD  POS=(20,50),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA1403 DFLD  POS=(20,53),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA1404 DFLD  POS=(20,56),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA1405 DFLD  POS=(20,59),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA1406 DFLD  POS=(20,62),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA1407 DFLD  POS=(20,65),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA1408 DFLD  POS=(20,68),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA1409 DFLD  POS=(20,71),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AREA1410 DFLD  POS=(20,74),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  'F9=Notes  F10=WHELP  F11=Update',                      +        
               POS=(22,2),LTH=70,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W2I366N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W2N366),                                           +        
               OPT=2,                                                  +        
               NXT=W2O366N1                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  (IDTRANS1,                                              +        
               '2'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  (IDTRANS2,                                              +        
               '3'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  (IDTRANS3,                                              +        
               '6'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  (IDTRANS4,                                              +        
               '6'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '23662',                                                +        
               LTH=5                                                            
         MFLD  (IDDCIN,                                                +        
               '++'),                                                  +        
               LTH=2                                                            
         MFLD  (LSALES01,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PUBW01,                                                +        
               '+++'),                                                 +        
               LTH=03,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PRICE01,                                               +        
               '+++++++'),                                             +        
               LTH=07,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (VOL01,                                                 +        
               '++++++++'),                                            +        
               LTH=08,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PRODSL01,                                              +        
               '++'),                                                  +        
               LTH=02,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AREA101,                                               +        
               '++'),                                                  +        
               LTH=02,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AREA102,                                               +        
               '++'),                                                  +        
               LTH=02,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AREA103,                                               +        
               '++'),                                                  +        
               LTH=02,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AREA104,                                               +        
               '++'),                                                  +        
               LTH=02,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AREA105,                                               +        
               '++'),                                                  +        
               LTH=02,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AREA106,                                               +        
               '++'),                                                  +        
               LTH=02,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AREA107,                                               +        
               '++'),                                                  +        
               LTH=02,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AREA108,                                               +        
               '++'),                                                  +        
               LTH=02,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AREA109,                                               +        
               '++'),                                                  +        
               LTH=02,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AREA110,                                               +        
               '++'),                                                  +        
               LTH=02,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDCMDV02,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  LSALES02,                                               +        
               LTH=03                                                           
         MFLD  PUBW02,                                                 +        
               LTH=03                                                           
         MFLD  PRICE02,                                                +        
               LTH=07                                                           
         MFLD  VOL02,                                                  +        
               LTH=08                                                           
         MFLD  PRODSL02,                                               +        
               LTH=02                                                           
         MFLD  AREA201,                                                +        
               LTH=02                                                           
         MFLD  AREA202,                                                +        
               LTH=02                                                           
         MFLD  AREA203,                                                +        
               LTH=02                                                           
         MFLD  AREA204,                                                +        
               LTH=02                                                           
         MFLD  AREA205,                                                +        
               LTH=02                                                           
         MFLD  AREA206,                                                +        
               LTH=02                                                           
         MFLD  AREA207,                                                +        
               LTH=02                                                           
         MFLD  AREA208,                                                +        
               LTH=02                                                           
         MFLD  AREA209,                                                +        
               LTH=02                                                           
         MFLD  AREA210,                                                +        
               LTH=02                                                           
         MFLD  (KDCMDV03,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  LSALES03,                                               +        
               LTH=03                                                           
         MFLD  PUBW03,                                                 +        
               LTH=03                                                           
         MFLD  PRICE03,                                                +        
               LTH=07                                                           
         MFLD  VOL03,                                                  +        
               LTH=08                                                           
         MFLD  PRODSL03,                                               +        
               LTH=02                                                           
         MFLD  AREA301,                                                +        
               LTH=02                                                           
         MFLD  AREA302,                                                +        
               LTH=02                                                           
         MFLD  AREA303,                                                +        
               LTH=02                                                           
         MFLD  AREA304,                                                +        
               LTH=02                                                           
         MFLD  AREA305,                                                +        
               LTH=02                                                           
         MFLD  AREA306,                                                +        
               LTH=02                                                           
         MFLD  AREA307,                                                +        
               LTH=02                                                           
         MFLD  AREA308,                                                +        
               LTH=02                                                           
         MFLD  AREA309,                                                +        
               LTH=02                                                           
         MFLD  AREA310,                                                +        
               LTH=02                                                           
         MFLD  (KDCMDV04,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  LSALES04,                                               +        
               LTH=03                                                           
         MFLD  PUBW04,                                                 +        
               LTH=03                                                           
         MFLD  PRICE04,                                                +        
               LTH=07                                                           
         MFLD  VOL04,                                                  +        
               LTH=08                                                           
         MFLD  PRODSL04,                                               +        
               LTH=02                                                           
         MFLD  AREA401,                                                +        
               LTH=02                                                           
         MFLD  AREA402,                                                +        
               LTH=02                                                           
         MFLD  AREA403,                                                +        
               LTH=02                                                           
         MFLD  AREA404,                                                +        
               LTH=02                                                           
         MFLD  AREA405,                                                +        
               LTH=02                                                           
         MFLD  AREA406,                                                +        
               LTH=02                                                           
         MFLD  AREA407,                                                +        
               LTH=02                                                           
         MFLD  AREA408,                                                +        
               LTH=02                                                           
         MFLD  AREA409,                                                +        
               LTH=02                                                           
         MFLD  AREA410,                                                +        
               LTH=02                                                           
         MFLD  (KDCMDV05,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  LSALES05,                                               +        
               LTH=03                                                           
         MFLD  PUBW05,                                                 +        
               LTH=03                                                           
         MFLD  PRICE05,                                                +        
               LTH=07                                                           
         MFLD  VOL05,                                                  +        
               LTH=08                                                           
         MFLD  PRODSL05,                                               +        
               LTH=02                                                           
         MFLD  AREA501,                                                +        
               LTH=02                                                           
         MFLD  AREA502,                                                +        
               LTH=02                                                           
         MFLD  AREA503,                                                +        
               LTH=02                                                           
         MFLD  AREA504,                                                +        
               LTH=02                                                           
         MFLD  AREA505,                                                +        
               LTH=02                                                           
         MFLD  AREA506,                                                +        
               LTH=02                                                           
         MFLD  AREA507,                                                +        
               LTH=02                                                           
         MFLD  AREA508,                                                +        
               LTH=02                                                           
         MFLD  AREA509,                                                +        
               LTH=02                                                           
         MFLD  AREA510,                                                +        
               LTH=02                                                           
         MFLD  (KDCMDV06,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  LSALES06,                                               +        
               LTH=03                                                           
         MFLD  PUBW06,                                                 +        
               LTH=03                                                           
         MFLD  PRICE06,                                                +        
               LTH=07                                                           
         MFLD  VOL06,                                                  +        
               LTH=08                                                           
         MFLD  PRODSL06,                                               +        
               LTH=02                                                           
         MFLD  AREA601,                                                +        
               LTH=02                                                           
         MFLD  AREA602,                                                +        
               LTH=02                                                           
         MFLD  AREA603,                                                +        
               LTH=02                                                           
         MFLD  AREA604,                                                +        
               LTH=02                                                           
         MFLD  AREA605,                                                +        
               LTH=02                                                           
         MFLD  AREA606,                                                +        
               LTH=02                                                           
         MFLD  AREA607,                                                +        
               LTH=02                                                           
         MFLD  AREA608,                                                +        
               LTH=02                                                           
         MFLD  AREA609,                                                +        
               LTH=02                                                           
         MFLD  AREA610,                                                +        
               LTH=02                                                           
         MFLD  (KDCMDV07,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  LSALES07,                                               +        
               LTH=03                                                           
         MFLD  PUBW07,                                                 +        
               LTH=03                                                           
         MFLD  PRICE07,                                                +        
               LTH=07                                                           
         MFLD  VOL07,                                                  +        
               LTH=08                                                           
         MFLD  PRODSL07,                                               +        
               LTH=02                                                           
         MFLD  AREA701,                                                +        
               LTH=02                                                           
         MFLD  AREA702,                                                +        
               LTH=02                                                           
         MFLD  AREA703,                                                +        
               LTH=02                                                           
         MFLD  AREA704,                                                +        
               LTH=02                                                           
         MFLD  AREA705,                                                +        
               LTH=02                                                           
         MFLD  AREA706,                                                +        
               LTH=02                                                           
         MFLD  AREA707,                                                +        
               LTH=02                                                           
         MFLD  AREA708,                                                +        
               LTH=02                                                           
         MFLD  AREA709,                                                +        
               LTH=02                                                           
         MFLD  AREA710,                                                +        
               LTH=02                                                           
         MFLD  (KDCMDV08,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  LSALES08,                                               +        
               LTH=03                                                           
         MFLD  PUBW08,                                                 +        
               LTH=03                                                           
         MFLD  PRICE08,                                                +        
               LTH=07                                                           
         MFLD  VOL08,                                                  +        
               LTH=08                                                           
         MFLD  PRODSL08,                                               +        
               LTH=02                                                           
         MFLD  AREA801,                                                +        
               LTH=02                                                           
         MFLD  AREA802,                                                +        
               LTH=02                                                           
         MFLD  AREA803,                                                +        
               LTH=02                                                           
         MFLD  AREA804,                                                +        
               LTH=02                                                           
         MFLD  AREA805,                                                +        
               LTH=02                                                           
         MFLD  AREA806,                                                +        
               LTH=02                                                           
         MFLD  AREA807,                                                +        
               LTH=02                                                           
         MFLD  AREA808,                                                +        
               LTH=02                                                           
         MFLD  AREA809,                                                +        
               LTH=02                                                           
         MFLD  AREA810,                                                +        
               LTH=02                                                           
         MFLD  (KDCMDV09,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  LSALES09,                                               +        
               LTH=03                                                           
         MFLD  PUBW09,                                                 +        
               LTH=03                                                           
         MFLD  PRICE09,                                                +        
               LTH=07                                                           
         MFLD  VOL09,                                                  +        
               LTH=08                                                           
         MFLD  PRODSL09,                                               +        
               LTH=02                                                           
         MFLD  AREA901,                                                +        
               LTH=02                                                           
         MFLD  AREA902,                                                +        
               LTH=02                                                           
         MFLD  AREA903,                                                +        
               LTH=02                                                           
         MFLD  AREA904,                                                +        
               LTH=02                                                           
         MFLD  AREA905,                                                +        
               LTH=02                                                           
         MFLD  AREA906,                                                +        
               LTH=02                                                           
         MFLD  AREA907,                                                +        
               LTH=02                                                           
         MFLD  AREA908,                                                +        
               LTH=02                                                           
         MFLD  AREA909,                                                +        
               LTH=02                                                           
         MFLD  AREA910,                                                +        
               LTH=02                                                           
         MFLD  (KDCMDV10,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  LSALES10,                                               +        
               LTH=03                                                           
         MFLD  PUBW10,                                                 +        
               LTH=03                                                           
         MFLD  PRICE10,                                                +        
               LTH=07                                                           
         MFLD  VOL10,                                                  +        
               LTH=08                                                           
         MFLD  PRODSL10,                                               +        
               LTH=02                                                           
         MFLD  AREA1001,                                               +        
               LTH=02                                                           
         MFLD  AREA1002,                                               +        
               LTH=02                                                           
         MFLD  AREA1003,                                               +        
               LTH=02                                                           
         MFLD  AREA1004,                                               +        
               LTH=02                                                           
         MFLD  AREA1005,                                               +        
               LTH=02                                                           
         MFLD  AREA1006,                                               +        
               LTH=02                                                           
         MFLD  AREA1007,                                               +        
               LTH=02                                                           
         MFLD  AREA1008,                                               +        
               LTH=02                                                           
         MFLD  AREA1009,                                               +        
               LTH=02                                                           
         MFLD  AREA1010,                                               +        
               LTH=02                                                           
         MFLD  (KDCMDV11,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  LSALES11,                                               +        
               LTH=03                                                           
         MFLD  PUBW11,                                                 +        
               LTH=03                                                           
         MFLD  PRICE11,                                                +        
               LTH=07                                                           
         MFLD  VOL11,                                                  +        
               LTH=08                                                           
         MFLD  PRODSL11,                                               +        
               LTH=02                                                           
         MFLD  AREA1101,                                               +        
               LTH=02                                                           
         MFLD  AREA1102,                                               +        
               LTH=02                                                           
         MFLD  AREA1103,                                               +        
               LTH=02                                                           
         MFLD  AREA1104,                                               +        
               LTH=02                                                           
         MFLD  AREA1105,                                               +        
               LTH=02                                                           
         MFLD  AREA1106,                                               +        
               LTH=02                                                           
         MFLD  AREA1107,                                               +        
               LTH=02                                                           
         MFLD  AREA1108,                                               +        
               LTH=02                                                           
         MFLD  AREA1109,                                               +        
               LTH=02                                                           
         MFLD  AREA1110,                                               +        
               LTH=02                                                           
         MFLD  (KDCMDV12,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  LSALES12,                                               +        
               LTH=03                                                           
         MFLD  PUBW12,                                                 +        
               LTH=03                                                           
         MFLD  PRICE12,                                                +        
               LTH=07                                                           
         MFLD  VOL12,                                                  +        
               LTH=08                                                           
         MFLD  PRODSL12,                                               +        
               LTH=02                                                           
         MFLD  AREA1201,                                               +        
               LTH=02                                                           
         MFLD  AREA1202,                                               +        
               LTH=02                                                           
         MFLD  AREA1203,                                               +        
               LTH=02                                                           
         MFLD  AREA1204,                                               +        
               LTH=02                                                           
         MFLD  AREA1205,                                               +        
               LTH=02                                                           
         MFLD  AREA1206,                                               +        
               LTH=02                                                           
         MFLD  AREA1207,                                               +        
               LTH=02                                                           
         MFLD  AREA1208,                                               +        
               LTH=02                                                           
         MFLD  AREA1209,                                               +        
               LTH=02                                                           
         MFLD  AREA1210,                                               +        
               LTH=02                                                           
         MFLD  (KDCMDV13,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  LSALES13,                                               +        
               LTH=03                                                           
         MFLD  PUBW13,                                                 +        
               LTH=03                                                           
         MFLD  PRICE13,                                                +        
               LTH=07                                                           
         MFLD  VOL13,                                                  +        
               LTH=08                                                           
         MFLD  PRODSL13,                                               +        
               LTH=02                                                           
         MFLD  AREA1301,                                               +        
               LTH=02                                                           
         MFLD  AREA1302,                                               +        
               LTH=02                                                           
         MFLD  AREA1303,                                               +        
               LTH=02                                                           
         MFLD  AREA1304,                                               +        
               LTH=02                                                           
         MFLD  AREA1305,                                               +        
               LTH=02                                                           
         MFLD  AREA1306,                                               +        
               LTH=02                                                           
         MFLD  AREA1307,                                               +        
               LTH=02                                                           
         MFLD  AREA1308,                                               +        
               LTH=02                                                           
         MFLD  AREA1309,                                               +        
               LTH=02                                                           
         MFLD  AREA1310,                                               +        
               LTH=02                                                           
         MFLD  (KDCMDV14,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  LSALES14,                                               +        
               LTH=03                                                           
         MFLD  PUBW14,                                                 +        
               LTH=03                                                           
         MFLD  PRICE14,                                                +        
               LTH=07                                                           
         MFLD  VOL14,                                                  +        
               LTH=08                                                           
         MFLD  PRODSL14,                                               +        
               LTH=02                                                           
         MFLD  AREA1401,                                               +        
               LTH=02                                                           
         MFLD  AREA1402,                                               +        
               LTH=02                                                           
         MFLD  AREA1403,                                               +        
               LTH=02                                                           
         MFLD  AREA1404,                                               +        
               LTH=02                                                           
         MFLD  AREA1405,                                               +        
               LTH=02                                                           
         MFLD  AREA1406,                                               +        
               LTH=02                                                           
         MFLD  AREA1407,                                               +        
               LTH=02                                                           
         MFLD  AREA1408,                                               +        
               LTH=02                                                           
         MFLD  AREA1409,                                               +        
               LTH=02                                                           
         MFLD  AREA1410,                                               +        
               LTH=02                                                           
         MSGEND                                                                 
W2O366N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W2N366,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W2I366N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDDCIN,                                                 +        
               LTH=04,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDDCUT,                                                 +        
               LTH=02                                                           
         MFLD  IDUSER,                                                 +        
               LTH=08                                                           
         MFLD  TIUPPDAT,                                               +        
               LTH=06                                                           
         MFLD  LSALES01,                                               +        
               LTH=05,                                                 +        
               ATTR=(YES)                                                       
         MFLD  PUBW01,                                                 +        
               LTH=05,                                                 +        
               ATTR=(YES)                                                       
         MFLD  PRICE01,                                                +        
               LTH=09,                                                 +        
               ATTR=(YES)                                                       
         MFLD  VOL01,                                                  +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  PRODSL01,                                               +        
               LTH=04,                                                 +        
               ATTR=(YES)                                                       
         MFLD  AREA101,                                                +        
               LTH=04,                                                 +        
               ATTR=(YES)                                                       
         MFLD  AREA102,                                                +        
               LTH=04,                                                 +        
               ATTR=(YES)                                                       
         MFLD  AREA103,                                                +        
               LTH=04,                                                 +        
               ATTR=(YES)                                                       
         MFLD  AREA104,                                                +        
               LTH=04,                                                 +        
               ATTR=(YES)                                                       
         MFLD  AREA105,                                                +        
               LTH=04,                                                 +        
               ATTR=(YES)                                                       
         MFLD  AREA106,                                                +        
               LTH=04,                                                 +        
               ATTR=(YES)                                                       
         MFLD  AREA107,                                                +        
               LTH=04,                                                 +        
               ATTR=(YES)                                                       
         MFLD  AREA108,                                                +        
               LTH=04,                                                 +        
               ATTR=(YES)                                                       
         MFLD  AREA109,                                                +        
               LTH=04,                                                 +        
               ATTR=(YES)                                                       
         MFLD  AREA110,                                                +        
               LTH=04,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDCMDV02,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  LSALES02,                                               +        
               LTH=03                                                           
         MFLD  PUBW02,                                                 +        
               LTH=03                                                           
         MFLD  PRICE02,                                                +        
               LTH=07                                                           
         MFLD  VOL02,                                                  +        
               LTH=08                                                           
         MFLD  PRODSL02,                                               +        
               LTH=02                                                           
         MFLD  AREA201,                                                +        
               LTH=02                                                           
         MFLD  AREA202,                                                +        
               LTH=02                                                           
         MFLD  AREA203,                                                +        
               LTH=02                                                           
         MFLD  AREA204,                                                +        
               LTH=02                                                           
         MFLD  AREA205,                                                +        
               LTH=02                                                           
         MFLD  AREA206,                                                +        
               LTH=02                                                           
         MFLD  AREA207,                                                +        
               LTH=02                                                           
         MFLD  AREA208,                                                +        
               LTH=02                                                           
         MFLD  AREA209,                                                +        
               LTH=02                                                           
         MFLD  AREA210,                                                +        
               LTH=02                                                           
         MFLD  KDCMDV03,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  LSALES03,                                               +        
               LTH=03                                                           
         MFLD  PUBW03,                                                 +        
               LTH=03                                                           
         MFLD  PRICE03,                                                +        
               LTH=07                                                           
         MFLD  VOL03,                                                  +        
               LTH=08                                                           
         MFLD  PRODSL03,                                               +        
               LTH=02                                                           
         MFLD  AREA301,                                                +        
               LTH=02                                                           
         MFLD  AREA302,                                                +        
               LTH=02                                                           
         MFLD  AREA303,                                                +        
               LTH=02                                                           
         MFLD  AREA304,                                                +        
               LTH=02                                                           
         MFLD  AREA305,                                                +        
               LTH=02                                                           
         MFLD  AREA306,                                                +        
               LTH=02                                                           
         MFLD  AREA307,                                                +        
               LTH=02                                                           
         MFLD  AREA308,                                                +        
               LTH=02                                                           
         MFLD  AREA309,                                                +        
               LTH=02                                                           
         MFLD  AREA310,                                                +        
               LTH=02                                                           
         MFLD  KDCMDV04,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  LSALES04,                                               +        
               LTH=03                                                           
         MFLD  PUBW04,                                                 +        
               LTH=03                                                           
         MFLD  PRICE04,                                                +        
               LTH=07                                                           
         MFLD  VOL04,                                                  +        
               LTH=08                                                           
         MFLD  PRODSL04,                                               +        
               LTH=02                                                           
         MFLD  AREA401,                                                +        
               LTH=02                                                           
         MFLD  AREA402,                                                +        
               LTH=02                                                           
         MFLD  AREA403,                                                +        
               LTH=02                                                           
         MFLD  AREA404,                                                +        
               LTH=02                                                           
         MFLD  AREA405,                                                +        
               LTH=02                                                           
         MFLD  AREA406,                                                +        
               LTH=02                                                           
         MFLD  AREA407,                                                +        
               LTH=02                                                           
         MFLD  AREA408,                                                +        
               LTH=02                                                           
         MFLD  AREA409,                                                +        
               LTH=02                                                           
         MFLD  AREA410,                                                +        
               LTH=02                                                           
         MFLD  KDCMDV05,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  LSALES05,                                               +        
               LTH=03                                                           
         MFLD  PUBW05,                                                 +        
               LTH=03                                                           
         MFLD  PRICE05,                                                +        
               LTH=07                                                           
         MFLD  VOL05,                                                  +        
               LTH=08                                                           
         MFLD  PRODSL05,                                               +        
               LTH=02                                                           
         MFLD  AREA501,                                                +        
               LTH=02                                                           
         MFLD  AREA502,                                                +        
               LTH=02                                                           
         MFLD  AREA503,                                                +        
               LTH=02                                                           
         MFLD  AREA504,                                                +        
               LTH=02                                                           
         MFLD  AREA505,                                                +        
               LTH=02                                                           
         MFLD  AREA506,                                                +        
               LTH=02                                                           
         MFLD  AREA507,                                                +        
               LTH=02                                                           
         MFLD  AREA508,                                                +        
               LTH=02                                                           
         MFLD  AREA509,                                                +        
               LTH=02                                                           
         MFLD  AREA510,                                                +        
               LTH=02                                                           
         MFLD  KDCMDV06,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  LSALES06,                                               +        
               LTH=03                                                           
         MFLD  PUBW06,                                                 +        
               LTH=03                                                           
         MFLD  PRICE06,                                                +        
               LTH=07                                                           
         MFLD  VOL06,                                                  +        
               LTH=08                                                           
         MFLD  PRODSL06,                                               +        
               LTH=02                                                           
         MFLD  AREA601,                                                +        
               LTH=02                                                           
         MFLD  AREA602,                                                +        
               LTH=02                                                           
         MFLD  AREA603,                                                +        
               LTH=02                                                           
         MFLD  AREA604,                                                +        
               LTH=02                                                           
         MFLD  AREA605,                                                +        
               LTH=02                                                           
         MFLD  AREA606,                                                +        
               LTH=02                                                           
         MFLD  AREA607,                                                +        
               LTH=02                                                           
         MFLD  AREA608,                                                +        
               LTH=02                                                           
         MFLD  AREA609,                                                +        
               LTH=02                                                           
         MFLD  AREA610,                                                +        
               LTH=02                                                           
         MFLD  KDCMDV07,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  LSALES07,                                               +        
               LTH=03                                                           
         MFLD  PUBW07,                                                 +        
               LTH=03                                                           
         MFLD  PRICE07,                                                +        
               LTH=07                                                           
         MFLD  VOL07,                                                  +        
               LTH=08                                                           
         MFLD  PRODSL07,                                               +        
               LTH=02                                                           
         MFLD  AREA701,                                                +        
               LTH=02                                                           
         MFLD  AREA702,                                                +        
               LTH=02                                                           
         MFLD  AREA703,                                                +        
               LTH=02                                                           
         MFLD  AREA704,                                                +        
               LTH=02                                                           
         MFLD  AREA705,                                                +        
               LTH=02                                                           
         MFLD  AREA706,                                                +        
               LTH=02                                                           
         MFLD  AREA707,                                                +        
               LTH=02                                                           
         MFLD  AREA708,                                                +        
               LTH=02                                                           
         MFLD  AREA709,                                                +        
               LTH=02                                                           
         MFLD  AREA710,                                                +        
               LTH=02                                                           
         MFLD  KDCMDV08,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  LSALES08,                                               +        
               LTH=03                                                           
         MFLD  PUBW08,                                                 +        
               LTH=03                                                           
         MFLD  PRICE08,                                                +        
               LTH=07                                                           
         MFLD  VOL08,                                                  +        
               LTH=08                                                           
         MFLD  PRODSL08,                                               +        
               LTH=02                                                           
         MFLD  AREA801,                                                +        
               LTH=02                                                           
         MFLD  AREA802,                                                +        
               LTH=02                                                           
         MFLD  AREA803,                                                +        
               LTH=02                                                           
         MFLD  AREA804,                                                +        
               LTH=02                                                           
         MFLD  AREA805,                                                +        
               LTH=02                                                           
         MFLD  AREA806,                                                +        
               LTH=02                                                           
         MFLD  AREA807,                                                +        
               LTH=02                                                           
         MFLD  AREA808,                                                +        
               LTH=02                                                           
         MFLD  AREA809,                                                +        
               LTH=02                                                           
         MFLD  AREA810,                                                +        
               LTH=02                                                           
         MFLD  KDCMDV09,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  LSALES09,                                               +        
               LTH=03                                                           
         MFLD  PUBW09,                                                 +        
               LTH=03                                                           
         MFLD  PRICE09,                                                +        
               LTH=07                                                           
         MFLD  VOL09,                                                  +        
               LTH=08                                                           
         MFLD  PRODSL09,                                               +        
               LTH=02                                                           
         MFLD  AREA901,                                                +        
               LTH=02                                                           
         MFLD  AREA902,                                                +        
               LTH=02                                                           
         MFLD  AREA903,                                                +        
               LTH=02                                                           
         MFLD  AREA904,                                                +        
               LTH=02                                                           
         MFLD  AREA905,                                                +        
               LTH=02                                                           
         MFLD  AREA906,                                                +        
               LTH=02                                                           
         MFLD  AREA907,                                                +        
               LTH=02                                                           
         MFLD  AREA908,                                                +        
               LTH=02                                                           
         MFLD  AREA909,                                                +        
               LTH=02                                                           
         MFLD  AREA910,                                                +        
               LTH=02                                                           
         MFLD  KDCMDV10,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  LSALES10,                                               +        
               LTH=03                                                           
         MFLD  PUBW10,                                                 +        
               LTH=03                                                           
         MFLD  PRICE10,                                                +        
               LTH=07                                                           
         MFLD  VOL10,                                                  +        
               LTH=08                                                           
         MFLD  PRODSL10,                                               +        
               LTH=02                                                           
         MFLD  AREA1001,                                               +        
               LTH=02                                                           
         MFLD  AREA1002,                                               +        
               LTH=02                                                           
         MFLD  AREA1003,                                               +        
               LTH=02                                                           
         MFLD  AREA1004,                                               +        
               LTH=02                                                           
         MFLD  AREA1005,                                               +        
               LTH=02                                                           
         MFLD  AREA1006,                                               +        
               LTH=02                                                           
         MFLD  AREA1007,                                               +        
               LTH=02                                                           
         MFLD  AREA1008,                                               +        
               LTH=02                                                           
         MFLD  AREA1009,                                               +        
               LTH=02                                                           
         MFLD  AREA1010,                                               +        
               LTH=02                                                           
         MFLD  KDCMDV11,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  LSALES11,                                               +        
               LTH=03                                                           
         MFLD  PUBW11,                                                 +        
               LTH=03                                                           
         MFLD  PRICE11,                                                +        
               LTH=07                                                           
         MFLD  VOL11,                                                  +        
               LTH=08                                                           
         MFLD  PRODSL11,                                               +        
               LTH=02                                                           
         MFLD  AREA1101,                                               +        
               LTH=02                                                           
         MFLD  AREA1102,                                               +        
               LTH=02                                                           
         MFLD  AREA1103,                                               +        
               LTH=02                                                           
         MFLD  AREA1104,                                               +        
               LTH=02                                                           
         MFLD  AREA1105,                                               +        
               LTH=02                                                           
         MFLD  AREA1106,                                               +        
               LTH=02                                                           
         MFLD  AREA1107,                                               +        
               LTH=02                                                           
         MFLD  AREA1108,                                               +        
               LTH=02                                                           
         MFLD  AREA1109,                                               +        
               LTH=02                                                           
         MFLD  AREA1110,                                               +        
               LTH=02                                                           
         MFLD  KDCMDV12,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  LSALES12,                                               +        
               LTH=03                                                           
         MFLD  PUBW12,                                                 +        
               LTH=03                                                           
         MFLD  PRICE12,                                                +        
               LTH=07                                                           
         MFLD  VOL12,                                                  +        
               LTH=08                                                           
         MFLD  PRODSL12,                                               +        
               LTH=02                                                           
         MFLD  AREA1201,                                               +        
               LTH=02                                                           
         MFLD  AREA1202,                                               +        
               LTH=02                                                           
         MFLD  AREA1203,                                               +        
               LTH=02                                                           
         MFLD  AREA1204,                                               +        
               LTH=02                                                           
         MFLD  AREA1205,                                               +        
               LTH=02                                                           
         MFLD  AREA1206,                                               +        
               LTH=02                                                           
         MFLD  AREA1207,                                               +        
               LTH=02                                                           
         MFLD  AREA1208,                                               +        
               LTH=02                                                           
         MFLD  AREA1209,                                               +        
               LTH=02                                                           
         MFLD  AREA1210,                                               +        
               LTH=02                                                           
         MFLD  KDCMDV13,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  LSALES13,                                               +        
               LTH=03                                                           
         MFLD  PUBW13,                                                 +        
               LTH=03                                                           
         MFLD  PRICE13,                                                +        
               LTH=07                                                           
         MFLD  VOL13,                                                  +        
               LTH=08                                                           
         MFLD  PRODSL13,                                               +        
               LTH=02                                                           
         MFLD  AREA1301,                                               +        
               LTH=02                                                           
         MFLD  AREA1302,                                               +        
               LTH=02                                                           
         MFLD  AREA1303,                                               +        
               LTH=02                                                           
         MFLD  AREA1304,                                               +        
               LTH=02                                                           
         MFLD  AREA1305,                                               +        
               LTH=02                                                           
         MFLD  AREA1306,                                               +        
               LTH=02                                                           
         MFLD  AREA1307,                                               +        
               LTH=02                                                           
         MFLD  AREA1308,                                               +        
               LTH=02                                                           
         MFLD  AREA1309,                                               +        
               LTH=02                                                           
         MFLD  AREA1310,                                               +        
               LTH=02                                                           
         MFLD  KDCMDV14,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  LSALES14,                                               +        
               LTH=03                                                           
         MFLD  PUBW14,                                                 +        
               LTH=03                                                           
         MFLD  PRICE14,                                                +        
               LTH=07                                                           
         MFLD  VOL14,                                                  +        
               LTH=08                                                           
         MFLD  PRODSL14,                                               +        
               LTH=02                                                           
         MFLD  AREA1401,                                               +        
               LTH=02                                                           
         MFLD  AREA1402,                                               +        
               LTH=02                                                           
         MFLD  AREA1403,                                               +        
               LTH=02                                                           
         MFLD  AREA1404,                                               +        
               LTH=02                                                           
         MFLD  AREA1405,                                               +        
               LTH=02                                                           
         MFLD  AREA1406,                                               +        
               LTH=02                                                           
         MFLD  AREA1407,                                               +        
               LTH=02                                                           
         MFLD  AREA1408,                                               +        
               LTH=02                                                           
         MFLD  AREA1409,                                               +        
               LTH=02                                                           
         MFLD  AREA1410,                                               +        
               LTH=02                                                           
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
