***********************************************************************         
* CREATED BY V006144   ON 05/05/24  AT 09:45                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'CROSS DOCKING                   '                               
W2N349   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W2T349 7',                                           +        
               8='W2T349 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W2T349U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W2N349   DPAGE CURSOR=((2,10)),                                        +        
               FILL=NONE                                                        
TRANS1   DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
TRANS2   DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
TRANS3   DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
TRANS4   DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'TRANSFER STEERING',                                    +        
               POS=(1,11),LTH=17,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'FROM DC',                                              +        
               POS=(2,2),LTH=7,                                        +        
               ATTR=(NUM,PROT)                                                  
FROMDCIN DFLD  POS=(2,10),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'TO DC',                                                +        
               POS=(2,16),LTH=5,                                       +        
               ATTR=(PROT)                                                      
TODCIN   DFLD  POS=(2,22),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'JOB ROLE',                                             +        
               POS=(2,28),LTH=8,                                       +        
               ATTR=(PROT)                                                      
JOBRIN   DFLD  POS=(2,37),LTH=8,                                       +        
               ATTR=(NOPROT)                                                    
FROMDCUT DFLD  POS=(3,10),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
TODCUT   DFLD  POS=(3,22),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
JOBRUT   DFLD  POS=(3,37),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'CMD',                                                  +        
               POS=(5,2),LTH=3,                                        +        
               ATTR=(PROT)                                                      
DCRUBR1  DFLD  POS=(5,6),LTH=6,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'DIST CUST',                                            +        
               POS=(5,13),LTH=9,                                       +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'CMD',                                                  +        
               POS=(5,42),LTH=3,                                       +        
               ATTR=(PROT)                                                      
DCRUBR2  DFLD  POS=(5,46),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'DIST CUST',                                            +        
               POS=(5,53),LTH=9,                                       +        
               ATTR=(NUM,PROT)                                                  
CMD1     DFLD  POS=(7,3),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
DC1      DFLD  POS=(7,10),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DIST1    DFLD  POS=(7,13),LTH=4,                                       +        
               ATTR=(PROT)                                                      
CUST1    DFLD  POS=(7,18),LTH=6,                                       +        
               ATTR=(PROT)                                                      
CMD12    DFLD  POS=(7,43),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DC12     DFLD  POS=(7,50),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DIST12   DFLD  POS=(7,53),LTH=4,                                       +        
               ATTR=(PROT)                                                      
CUST12   DFLD  POS=(7,58),LTH=6,                                       +        
               ATTR=(PROT)                                                      
CMD2     DFLD  POS=(8,3),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
DC2      DFLD  POS=(8,10),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DIST2    DFLD  POS=(8,13),LTH=4,                                       +        
               ATTR=(PROT)                                                      
CUST2    DFLD  POS=(8,18),LTH=6,                                       +        
               ATTR=(PROT)                                                      
CMD13    DFLD  POS=(8,43),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DC13     DFLD  POS=(8,50),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DIST13   DFLD  POS=(8,53),LTH=4,                                       +        
               ATTR=(PROT)                                                      
CUST13   DFLD  POS=(8,58),LTH=6,                                       +        
               ATTR=(PROT)                                                      
CMD3     DFLD  POS=(9,3),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
DC3      DFLD  POS=(9,10),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DIST3    DFLD  POS=(9,13),LTH=4,                                       +        
               ATTR=(PROT)                                                      
CUST3    DFLD  POS=(9,18),LTH=6,                                       +        
               ATTR=(PROT)                                                      
CMD14    DFLD  POS=(9,43),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DC14     DFLD  POS=(9,50),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DIST14   DFLD  POS=(9,53),LTH=4,                                       +        
               ATTR=(PROT)                                                      
CUST14   DFLD  POS=(9,58),LTH=6,                                       +        
               ATTR=(PROT)                                                      
CMD4     DFLD  POS=(10,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DC4      DFLD  POS=(10,10),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DIST4    DFLD  POS=(10,13),LTH=4,                                      +        
               ATTR=(PROT)                                                      
CUST4    DFLD  POS=(10,18),LTH=6,                                      +        
               ATTR=(PROT)                                                      
CMD15    DFLD  POS=(10,43),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
DC15     DFLD  POS=(10,50),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DIST15   DFLD  POS=(10,53),LTH=4,                                      +        
               ATTR=(PROT)                                                      
CUST15   DFLD  POS=(10,58),LTH=6,                                      +        
               ATTR=(PROT)                                                      
CMD5     DFLD  POS=(11,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DC5      DFLD  POS=(11,10),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DIST5    DFLD  POS=(11,13),LTH=4,                                      +        
               ATTR=(PROT)                                                      
CUST5    DFLD  POS=(11,18),LTH=6,                                      +        
               ATTR=(PROT)                                                      
CMD16    DFLD  POS=(11,43),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
DC16     DFLD  POS=(11,50),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DIST16   DFLD  POS=(11,53),LTH=4,                                      +        
               ATTR=(PROT)                                                      
CUST16   DFLD  POS=(11,58),LTH=6,                                      +        
               ATTR=(PROT)                                                      
CMD6     DFLD  POS=(12,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DC6      DFLD  POS=(12,10),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DIST6    DFLD  POS=(12,13),LTH=4,                                      +        
               ATTR=(PROT)                                                      
CUST6    DFLD  POS=(12,18),LTH=6,                                      +        
               ATTR=(PROT)                                                      
CMD17    DFLD  POS=(12,43),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
DC17     DFLD  POS=(12,50),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DIST17   DFLD  POS=(12,53),LTH=4,                                      +        
               ATTR=(PROT)                                                      
CUST17   DFLD  POS=(12,58),LTH=6,                                      +        
               ATTR=(PROT)                                                      
CMD7     DFLD  POS=(13,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DC7      DFLD  POS=(13,10),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DIST7    DFLD  POS=(13,13),LTH=4,                                      +        
               ATTR=(PROT)                                                      
CUST7    DFLD  POS=(13,18),LTH=6,                                      +        
               ATTR=(PROT)                                                      
CMD18    DFLD  POS=(13,43),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
DC18     DFLD  POS=(13,50),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DIST18   DFLD  POS=(13,53),LTH=4,                                      +        
               ATTR=(PROT)                                                      
CUST18   DFLD  POS=(13,58),LTH=6,                                      +        
               ATTR=(PROT)                                                      
CMD8     DFLD  POS=(14,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DC8      DFLD  POS=(14,10),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DIST8    DFLD  POS=(14,13),LTH=4,                                      +        
               ATTR=(PROT)                                                      
CUST8    DFLD  POS=(14,18),LTH=6,                                      +        
               ATTR=(PROT)                                                      
CMD19    DFLD  POS=(14,43),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
DC19     DFLD  POS=(14,50),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DIST19   DFLD  POS=(14,53),LTH=4,                                      +        
               ATTR=(PROT)                                                      
CUST19   DFLD  POS=(14,58),LTH=6,                                      +        
               ATTR=(PROT)                                                      
CMD9     DFLD  POS=(15,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DC9      DFLD  POS=(15,10),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DIST9    DFLD  POS=(15,13),LTH=4,                                      +        
               ATTR=(PROT)                                                      
CUST9    DFLD  POS=(15,18),LTH=6,                                      +        
               ATTR=(PROT)                                                      
CMD20    DFLD  POS=(15,43),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
DC20     DFLD  POS=(15,50),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DIST20   DFLD  POS=(15,53),LTH=4,                                      +        
               ATTR=(PROT)                                                      
CUST20   DFLD  POS=(15,58),LTH=6,                                      +        
               ATTR=(PROT)                                                      
CMD10    DFLD  POS=(16,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DC10     DFLD  POS=(16,10),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DIST10   DFLD  POS=(16,13),LTH=4,                                      +        
               ATTR=(PROT)                                                      
CUST10   DFLD  POS=(16,18),LTH=6,                                      +        
               ATTR=(PROT)                                                      
CMD21    DFLD  POS=(16,43),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
DC21     DFLD  POS=(16,50),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DIST21   DFLD  POS=(16,53),LTH=4,                                      +        
               ATTR=(PROT)                                                      
CUST21   DFLD  POS=(16,58),LTH=6,                                      +        
               ATTR=(PROT)                                                      
CMD11    DFLD  POS=(17,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DC11     DFLD  POS=(17,10),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DIST11   DFLD  POS=(17,13),LTH=4,                                      +        
               ATTR=(PROT)                                                      
CUST11   DFLD  POS=(17,18),LTH=6,                                      +        
               ATTR=(PROT)                                                      
CMD22    DFLD  POS=(17,43),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
DC22     DFLD  POS=(17,50),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DIST22   DFLD  POS=(17,53),LTH=4,                                      +        
               ATTR=(PROT)                                                      
CUST22   DFLD  POS=(17,58),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'New',                                                  +        
               POS=(19,2),LTH=3,                                       +        
               ATTR=(PROT)                                                      
DCNY     DFLD  POS=(19,10),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
DISTNY   DFLD  POS=(19,13),LTH=4,                                      +        
               ATTR=(NOPROT)                                                    
CUSTNY   DFLD  POS=(19,18),LTH=6,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  '13',                                                   +        
               POS=(21,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '14',                                                   +        
               POS=(21,17),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,17),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,33),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,49),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '22',                                                   +        
               POS=(22,65),LTH=2,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W2O349N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W2N349,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W2I349N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W2N349                                                       
         SEG                                                                    
         MFLD  TRANS1,                                                 +        
               LTH=1                                                            
         MFLD  TRANS2,                                                 +        
               LTH=1                                                            
         MFLD  TRANS3,                                                 +        
               LTH=1                                                            
         MFLD  TRANS4,                                                 +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  FROMDCIN,                                               +        
               LTH=2                                                            
         MFLD  TODCIN,                                                 +        
               LTH=2                                                            
         MFLD  JOBRIN,                                                 +        
               LTH=8                                                            
         MFLD  FROMDCUT,                                               +        
               LTH=2                                                            
         MFLD  TODCUT,                                                 +        
               LTH=2                                                            
         MFLD  JOBRUT,                                                 +        
               LTH=8                                                            
         MFLD  DCRUBR1,                                                +        
               LTH=6                                                            
         MFLD  DCRUBR2,                                                +        
               LTH=6                                                            
         MFLD  CMD1,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DC1,                                                    +        
               LTH=2                                                            
         MFLD  DIST1,                                                  +        
               LTH=4                                                            
         MFLD  CUST1,                                                  +        
               LTH=6                                                            
         MFLD  CMD2,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DC2,                                                    +        
               LTH=2                                                            
         MFLD  DIST2,                                                  +        
               LTH=4                                                            
         MFLD  CUST2,                                                  +        
               LTH=6                                                            
         MFLD  CMD3,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DC3,                                                    +        
               LTH=2                                                            
         MFLD  DIST3,                                                  +        
               LTH=4                                                            
         MFLD  CUST3,                                                  +        
               LTH=6                                                            
         MFLD  CMD4,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DC4,                                                    +        
               LTH=2                                                            
         MFLD  DIST4,                                                  +        
               LTH=4                                                            
         MFLD  CUST4,                                                  +        
               LTH=6                                                            
         MFLD  CMD5,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DC5,                                                    +        
               LTH=2                                                            
         MFLD  DIST5,                                                  +        
               LTH=4                                                            
         MFLD  CUST5,                                                  +        
               LTH=6                                                            
         MFLD  CMD6,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DC6,                                                    +        
               LTH=2                                                            
         MFLD  DIST6,                                                  +        
               LTH=4                                                            
         MFLD  CUST6,                                                  +        
               LTH=6                                                            
         MFLD  CMD7,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DC7,                                                    +        
               LTH=2                                                            
         MFLD  DIST7,                                                  +        
               LTH=4                                                            
         MFLD  CUST7,                                                  +        
               LTH=6                                                            
         MFLD  CMD8,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DC8,                                                    +        
               LTH=2                                                            
         MFLD  DIST8,                                                  +        
               LTH=4                                                            
         MFLD  CUST8,                                                  +        
               LTH=6                                                            
         MFLD  CMD9,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DC9,                                                    +        
               LTH=2                                                            
         MFLD  DIST9,                                                  +        
               LTH=4                                                            
         MFLD  CUST9,                                                  +        
               LTH=6                                                            
         MFLD  CMD10,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DC10,                                                   +        
               LTH=2                                                            
         MFLD  DIST10,                                                 +        
               LTH=4                                                            
         MFLD  CUST10,                                                 +        
               LTH=6                                                            
         MFLD  CMD11,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DC11,                                                   +        
               LTH=2                                                            
         MFLD  DIST11,                                                 +        
               LTH=4                                                            
         MFLD  CUST11,                                                 +        
               LTH=6                                                            
         MFLD  CMD12,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DC12,                                                   +        
               LTH=2                                                            
         MFLD  DIST12,                                                 +        
               LTH=4                                                            
         MFLD  CUST12,                                                 +        
               LTH=6                                                            
         MFLD  CMD13,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DC13,                                                   +        
               LTH=2                                                            
         MFLD  DIST13,                                                 +        
               LTH=4                                                            
         MFLD  CUST13,                                                 +        
               LTH=6                                                            
         MFLD  CMD14,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DC14,                                                   +        
               LTH=2                                                            
         MFLD  DIST14,                                                 +        
               LTH=4                                                            
         MFLD  CUST14,                                                 +        
               LTH=6                                                            
         MFLD  CMD15,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DC15,                                                   +        
               LTH=2                                                            
         MFLD  DIST15,                                                 +        
               LTH=4                                                            
         MFLD  CUST15,                                                 +        
               LTH=6                                                            
         MFLD  CMD16,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DC16,                                                   +        
               LTH=2                                                            
         MFLD  DIST16,                                                 +        
               LTH=4                                                            
         MFLD  CUST16,                                                 +        
               LTH=6                                                            
         MFLD  CMD17,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DC17,                                                   +        
               LTH=2                                                            
         MFLD  DIST17,                                                 +        
               LTH=4                                                            
         MFLD  CUST17,                                                 +        
               LTH=6                                                            
         MFLD  CMD18,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DC18,                                                   +        
               LTH=2                                                            
         MFLD  DIST18,                                                 +        
               LTH=4                                                            
         MFLD  CUST18,                                                 +        
               LTH=6                                                            
         MFLD  CMD19,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DC19,                                                   +        
               LTH=2                                                            
         MFLD  DIST19,                                                 +        
               LTH=4                                                            
         MFLD  CUST19,                                                 +        
               LTH=6                                                            
         MFLD  CMD20,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DC20,                                                   +        
               LTH=2                                                            
         MFLD  DIST20,                                                 +        
               LTH=4                                                            
         MFLD  CUST20,                                                 +        
               LTH=6                                                            
         MFLD  CMD21,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DC21,                                                   +        
               LTH=2                                                            
         MFLD  DIST21,                                                 +        
               LTH=4                                                            
         MFLD  CUST21,                                                 +        
               LTH=6                                                            
         MFLD  CMD22,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DC22,                                                   +        
               LTH=2                                                            
         MFLD  DIST22,                                                 +        
               LTH=4                                                            
         MFLD  CUST22,                                                 +        
               LTH=6                                                            
         MFLD  DCNY,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DISTNY,                                                 +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CUSTNY,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W2I349N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W2N349),                                           +        
               OPT=2,                                                  +        
               NXT=W2O349N1                                                     
MID      LPAGE SOR=(W2N349)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  TRANS1,                                                 +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  TRANS2,                                                 +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  TRANS3,                                                 +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  TRANS4,                                                 +        
               LTH=1,                                                  +        
               FILL=X'F9'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '23491',                                                +        
               LTH=5                                                            
         MFLD  (FROMDCIN,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TODCIN,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (JOBRIN,                                                +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FROMDCUT,                                              +        
               '  '),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TODCUT,                                                +        
               '  '),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (JOBRUT,                                                +        
               '        '),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD1,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD2,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD3,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD4,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD5,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD6,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD7,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD8,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD9,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD10,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD11,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD12,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD13,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD14,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD15,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD16,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD17,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD18,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD19,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD20,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD21,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD22,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DCNY,                                                  +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DISTNY,                                                +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CUSTNY,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
