***********************************************************************         
* CREATED BY V063442   ON 02/02/28  AT 13:21                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'Supplier groups                 '                               
W2N332   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W2T332 7',                                           +        
               8='W2T332 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W2T332U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'SUPPLIER GROUPS',                                      +        
               POS=(1,11),LTH=15,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Supplier:',                                            +        
               POS=(2,2),LTH=9,                                        +        
               ATTR=(ALPHA,PROT)                                                
LEVNRIN  DFLD  POS=(2,12),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
LEVNRUT  DFLD  POS=(3,12),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'C Group',                                              +        
               POS=(5,2),LTH=7,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'Start date  Supplier name',                            +        
               POS=(5,15),LTH=25,                                      +        
               ATTR=(PROT)                                                      
CMD      DFLD  POS=(6,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
IDGRPIN  DFLD  POS=(6,4),LTH=10,                                       +        
               ATTR=(NOPROT)                                                    
DATIN    DFLD  POS=(6,17),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
LEVNAMN  DFLD  POS=(6,27),LTH=35,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Group',                                                +        
               POS=(8,4),LTH=5,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'Start date   Group',                                   +        
               POS=(8,15),LTH=18,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Start date   Group',                                   +        
               POS=(8,39),LTH=18,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Start date',                                           +        
               POS=(8,63),LTH=10,                                      +        
               ATTR=(PROT)                                                      
IDGRP1   DFLD  POS=(9,4),LTH=10,                                       +        
               ATTR=(PROT,MOD)                                                  
DAT1     DFLD  POS=(9,19),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
IDGRP13  DFLD  POS=(9,28),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
DAT13    DFLD  POS=(9,43),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
IDGRP25  DFLD  POS=(9,52),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
DAT25    DFLD  POS=(9,67),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
IDGRP2   DFLD  POS=(10,4),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
DAT2     DFLD  POS=(10,19),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
IDGRP14  DFLD  POS=(10,28),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
DAT14    DFLD  POS=(10,43),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
IDGRP26  DFLD  POS=(10,52),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
DAT26    DFLD  POS=(10,67),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
IDGRP3   DFLD  POS=(11,4),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
DAT3     DFLD  POS=(11,19),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
IDGRP15  DFLD  POS=(11,28),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
DAT15    DFLD  POS=(11,43),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
IDGRP27  DFLD  POS=(11,52),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
DAT27    DFLD  POS=(11,67),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
IDGRP4   DFLD  POS=(12,4),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
DAT4     DFLD  POS=(12,19),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
IDGRP16  DFLD  POS=(12,28),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
DAT16    DFLD  POS=(12,43),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
IDGRP28  DFLD  POS=(12,52),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
DAT28    DFLD  POS=(12,67),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
IDGRP5   DFLD  POS=(13,4),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
DAT5     DFLD  POS=(13,19),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
IDGRP17  DFLD  POS=(13,28),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
DAT17    DFLD  POS=(13,43),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
IDGRP29  DFLD  POS=(13,52),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
DAT29    DFLD  POS=(13,67),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
IDGRP6   DFLD  POS=(14,4),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
DAT6     DFLD  POS=(14,19),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
IDGRP18  DFLD  POS=(14,28),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
DAT18    DFLD  POS=(14,43),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
IDGRP30  DFLD  POS=(14,52),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
DAT30    DFLD  POS=(14,67),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
IDGRP7   DFLD  POS=(15,4),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
DAT7     DFLD  POS=(15,19),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
IDGRP19  DFLD  POS=(15,28),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
DAT19    DFLD  POS=(15,43),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
IDGRP31  DFLD  POS=(15,52),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
DAT31    DFLD  POS=(15,67),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
IDGRP8   DFLD  POS=(16,4),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
DAT8     DFLD  POS=(16,19),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
IDGRP20  DFLD  POS=(16,28),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
DAT20    DFLD  POS=(16,43),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
IDGRP32  DFLD  POS=(16,52),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
DAT32    DFLD  POS=(16,67),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
IDGRP9   DFLD  POS=(17,4),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
DAT9     DFLD  POS=(17,19),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
IDGRP21  DFLD  POS=(17,28),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
DAT21    DFLD  POS=(17,43),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
IDGRP33  DFLD  POS=(17,52),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
DAT33    DFLD  POS=(17,67),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
IDGRP10  DFLD  POS=(18,4),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
DAT10    DFLD  POS=(18,19),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
IDGRP22  DFLD  POS=(18,28),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
DAT22    DFLD  POS=(18,43),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
IDGRP34  DFLD  POS=(18,52),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
DAT34    DFLD  POS=(18,67),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
IDGRP11  DFLD  POS=(19,4),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
DAT11    DFLD  POS=(19,19),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
IDGRP23  DFLD  POS=(19,28),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
DAT23    DFLD  POS=(19,43),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
IDGRP35  DFLD  POS=(19,52),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
DAT35    DFLD  POS=(19,67),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
IDGRP12  DFLD  POS=(20,4),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
DAT12    DFLD  POS=(20,19),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
IDGRP24  DFLD  POS=(20,28),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
DAT24    DFLD  POS=(20,43),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
IDGRP36  DFLD  POS=(20,52),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
DAT36    DFLD  POS=(20,67),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'F7=First  F8=Next  F10=WHELP  F11=Update',             +        
               POS=(22,2),LTH=40,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W2O332N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W2N332,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W2I332N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  LEVNRIN,                                                +        
               LTH=2                                                            
         MFLD  LEVNRUT,                                                +        
               LTH=5                                                            
         MFLD  CMD,                                                    +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDGRPIN,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DATIN,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEVNAMN,                                                +        
               LTH=35                                                           
         MFLD  IDGRP1,                                                 +        
               LTH=10                                                           
         MFLD  DAT1,                                                   +        
               LTH=6                                                            
         MFLD  IDGRP2,                                                 +        
               LTH=10                                                           
         MFLD  DAT2,                                                   +        
               LTH=6                                                            
         MFLD  IDGRP3,                                                 +        
               LTH=10                                                           
         MFLD  DAT3,                                                   +        
               LTH=6                                                            
         MFLD  IDGRP4,                                                 +        
               LTH=10                                                           
         MFLD  DAT4,                                                   +        
               LTH=6                                                            
         MFLD  IDGRP5,                                                 +        
               LTH=10                                                           
         MFLD  DAT5,                                                   +        
               LTH=6                                                            
         MFLD  IDGRP6,                                                 +        
               LTH=10                                                           
         MFLD  DAT6,                                                   +        
               LTH=6                                                            
         MFLD  IDGRP7,                                                 +        
               LTH=10                                                           
         MFLD  DAT7,                                                   +        
               LTH=6                                                            
         MFLD  IDGRP8,                                                 +        
               LTH=10                                                           
         MFLD  DAT8,                                                   +        
               LTH=6                                                            
         MFLD  IDGRP9,                                                 +        
               LTH=10                                                           
         MFLD  DAT9,                                                   +        
               LTH=6                                                            
         MFLD  IDGRP10,                                                +        
               LTH=10                                                           
         MFLD  DAT10,                                                  +        
               LTH=6                                                            
         MFLD  IDGRP11,                                                +        
               LTH=10                                                           
         MFLD  DAT11,                                                  +        
               LTH=6                                                            
         MFLD  IDGRP12,                                                +        
               LTH=10                                                           
         MFLD  DAT12,                                                  +        
               LTH=6                                                            
         MFLD  IDGRP13,                                                +        
               LTH=10                                                           
         MFLD  DAT13,                                                  +        
               LTH=6                                                            
         MFLD  IDGRP14,                                                +        
               LTH=10                                                           
         MFLD  DAT14,                                                  +        
               LTH=6                                                            
         MFLD  IDGRP15,                                                +        
               LTH=10                                                           
         MFLD  DAT15,                                                  +        
               LTH=6                                                            
         MFLD  IDGRP16,                                                +        
               LTH=10                                                           
         MFLD  DAT16,                                                  +        
               LTH=6                                                            
         MFLD  IDGRP17,                                                +        
               LTH=10                                                           
         MFLD  DAT17,                                                  +        
               LTH=6                                                            
         MFLD  IDGRP18,                                                +        
               LTH=10                                                           
         MFLD  DAT18,                                                  +        
               LTH=6                                                            
         MFLD  IDGRP19,                                                +        
               LTH=10                                                           
         MFLD  DAT19,                                                  +        
               LTH=6                                                            
         MFLD  IDGRP20,                                                +        
               LTH=10                                                           
         MFLD  DAT20,                                                  +        
               LTH=6                                                            
         MFLD  IDGRP21,                                                +        
               LTH=10                                                           
         MFLD  DAT21,                                                  +        
               LTH=6                                                            
         MFLD  IDGRP22,                                                +        
               LTH=10                                                           
         MFLD  DAT22,                                                  +        
               LTH=6                                                            
         MFLD  IDGRP23,                                                +        
               LTH=10                                                           
         MFLD  DAT23,                                                  +        
               LTH=6                                                            
         MFLD  IDGRP24,                                                +        
               LTH=10                                                           
         MFLD  DAT24,                                                  +        
               LTH=6                                                            
         MFLD  IDGRP25,                                                +        
               LTH=10                                                           
         MFLD  DAT25,                                                  +        
               LTH=6                                                            
         MFLD  IDGRP26,                                                +        
               LTH=10                                                           
         MFLD  DAT26,                                                  +        
               LTH=6                                                            
         MFLD  IDGRP27,                                                +        
               LTH=10                                                           
         MFLD  DAT27,                                                  +        
               LTH=6                                                            
         MFLD  IDGRP28,                                                +        
               LTH=10                                                           
         MFLD  DAT28,                                                  +        
               LTH=6                                                            
         MFLD  IDGRP29,                                                +        
               LTH=10                                                           
         MFLD  DAT29,                                                  +        
               LTH=6                                                            
         MFLD  IDGRP30,                                                +        
               LTH=10                                                           
         MFLD  DAT30,                                                  +        
               LTH=6                                                            
         MFLD  IDGRP31,                                                +        
               LTH=10                                                           
         MFLD  DAT31,                                                  +        
               LTH=6                                                            
         MFLD  IDGRP32,                                                +        
               LTH=10                                                           
         MFLD  DAT32,                                                  +        
               LTH=6                                                            
         MFLD  IDGRP33,                                                +        
               LTH=10                                                           
         MFLD  DAT33,                                                  +        
               LTH=6                                                            
         MFLD  IDGRP34,                                                +        
               LTH=10                                                           
         MFLD  DAT34,                                                  +        
               LTH=6                                                            
         MFLD  IDGRP35,                                                +        
               LTH=10                                                           
         MFLD  DAT35,                                                  +        
               LTH=6                                                            
         MFLD  IDGRP36,                                                +        
               LTH=10                                                           
         MFLD  DAT36,                                                  +        
               LTH=6                                                            
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W2I332N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W2N332),                                           +        
               OPT=2,                                                  +        
               NXT=W2O332N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '23322',                                                +        
               LTH=5                                                            
         MFLD  (LEVNRIN,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (CMD,                                                   +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (IDGRPIN,                                               +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DATIN,                                                 +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R                                                           
         MSGEND                                                                 
         END                                                                    
