***********************************************************************         
* CREATED BY V086977   ON 03/03/14  AT 09:39                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'CAMPAIGN INFORMATION - PART '                                   
W2N315   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W2T315 7',                                           +        
               8='W2T315 8',                                           +        
               9='W2T315 9',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='W0T501  ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((2,10)),                                        +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'CAMPAIGN INFORMATION - PART',                          +        
               POS=(1,12),LTH=27,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Part no',                                              +        
               POS=(2,2),LTH=7,                                        +        
               ATTR=(ALPHA,PROT)                                                
ARTIN    DFLD  POS=(2,10),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
ARTUT    DFLD  POS=(3,10),LTH=9,                                       +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'C A M P A I G N',                                      +        
               POS=(5,9),LTH=15,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Screen',                                               +        
               POS=(6,2),LTH=6,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'No',                                                   +        
               POS=(6,9),LTH=2,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'Group',                                                +        
               POS=(6,18),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Start',                                                +        
               POS=(6,27),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Stop',                                                 +        
               POS=(6,35),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Type',                                                 +        
               POS=(6,42),LTH=4,                                       +        
               ATTR=(PROT)                                                      
PAGE1    DFLD  POS=(7,2),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
KMPNO1   DFLD  POS=(7,9),LTH=7,                                        +        
               ATTR=(ALPHA,PROT,MOD)                                            
KMPGR1   DFLD  POS=(7,18),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
TISTA1   DFLD  POS=(7,27),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
TISTO1   DFLD  POS=(7,35),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
TYPE1    DFLD  POS=(7,43),LTH=1,                                       +        
               ATTR=(PROT)                                                      
PAGE2    DFLD  POS=(8,2),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
KMPNO2   DFLD  POS=(8,9),LTH=7,                                        +        
               ATTR=(ALPHA,PROT,MOD)                                            
KMPGR2   DFLD  POS=(8,18),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
TISTA2   DFLD  POS=(8,27),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
TISTO2   DFLD  POS=(8,35),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
TYPE2    DFLD  POS=(8,43),LTH=1,                                       +        
               ATTR=(PROT)                                                      
PAGE3    DFLD  POS=(9,2),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
KMPNO3   DFLD  POS=(9,9),LTH=7,                                        +        
               ATTR=(ALPHA,PROT,MOD)                                            
KMPGR3   DFLD  POS=(9,18),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
TISTA3   DFLD  POS=(9,27),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
TISTO3   DFLD  POS=(9,35),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
TYPE3    DFLD  POS=(9,43),LTH=1,                                       +        
               ATTR=(PROT)                                                      
PAGE4    DFLD  POS=(10,2),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
KMPNO4   DFLD  POS=(10,9),LTH=7,                                       +        
               ATTR=(ALPHA,PROT,MOD)                                            
KMPGR4   DFLD  POS=(10,18),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
TISTA4   DFLD  POS=(10,27),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
TISTO4   DFLD  POS=(10,35),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
TYPE4    DFLD  POS=(10,43),LTH=1,                                      +        
               ATTR=(PROT)                                                      
PAGE5    DFLD  POS=(11,2),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
KMPNO5   DFLD  POS=(11,9),LTH=7,                                       +        
               ATTR=(ALPHA,PROT,MOD)                                            
KMPGR5   DFLD  POS=(11,18),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
TISTA5   DFLD  POS=(11,27),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
TISTO5   DFLD  POS=(11,35),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
TYPE5    DFLD  POS=(11,43),LTH=1,                                      +        
               ATTR=(PROT)                                                      
PAGE6    DFLD  POS=(12,2),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
KMPNO6   DFLD  POS=(12,9),LTH=7,                                       +        
               ATTR=(ALPHA,PROT,MOD)                                            
KMPGR6   DFLD  POS=(12,18),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
TISTA6   DFLD  POS=(12,27),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
TISTO6   DFLD  POS=(12,35),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
TYPE6    DFLD  POS=(12,43),LTH=1,                                      +        
               ATTR=(PROT)                                                      
PAGE7    DFLD  POS=(13,2),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
KMPNO7   DFLD  POS=(13,9),LTH=7,                                       +        
               ATTR=(ALPHA,PROT,MOD)                                            
KMPGR7   DFLD  POS=(13,18),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
TISTA7   DFLD  POS=(13,27),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
TISTO7   DFLD  POS=(13,35),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
TYPE7    DFLD  POS=(13,43),LTH=1,                                      +        
               ATTR=(PROT)                                                      
PAGE8    DFLD  POS=(14,2),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
KMPNO8   DFLD  POS=(14,9),LTH=7,                                       +        
               ATTR=(ALPHA,PROT,MOD)                                            
KMPGR8   DFLD  POS=(14,18),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
TISTA8   DFLD  POS=(14,27),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
TISTO8   DFLD  POS=(14,35),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
TYPE8    DFLD  POS=(14,43),LTH=1,                                      +        
               ATTR=(PROT)                                                      
PAGE9    DFLD  POS=(15,2),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
KMPNO9   DFLD  POS=(15,9),LTH=7,                                       +        
               ATTR=(ALPHA,PROT,MOD)                                            
KMPGR9   DFLD  POS=(15,18),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
TISTA9   DFLD  POS=(15,27),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
TISTO9   DFLD  POS=(15,35),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
TYPE9    DFLD  POS=(15,43),LTH=1,                                      +        
               ATTR=(PROT)                                                      
PAGE10   DFLD  POS=(16,2),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
KMPNO10  DFLD  POS=(16,9),LTH=7,                                       +        
               ATTR=(ALPHA,PROT,MOD)                                            
KMPGR10  DFLD  POS=(16,18),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
TISTA10  DFLD  POS=(16,27),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
TISTO10  DFLD  POS=(16,35),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
TYPE10   DFLD  POS=(16,43),LTH=1,                                      +        
               ATTR=(PROT)                                                      
PAGE11   DFLD  POS=(17,2),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
KMPNO11  DFLD  POS=(17,9),LTH=7,                                       +        
               ATTR=(ALPHA,PROT,MOD)                                            
KMPGR11  DFLD  POS=(17,18),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
TISTA11  DFLD  POS=(17,27),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
TISTO11  DFLD  POS=(17,35),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
TYPE11   DFLD  POS=(17,43),LTH=1,                                      +        
               ATTR=(PROT)                                                      
PAGE12   DFLD  POS=(18,2),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
KMPNO12  DFLD  POS=(18,9),LTH=7,                                       +        
               ATTR=(ALPHA,PROT,MOD)                                            
KMPGR12  DFLD  POS=(18,18),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
TISTA12  DFLD  POS=(18,27),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
TISTO12  DFLD  POS=(18,35),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
TYPE12   DFLD  POS=(18,43),LTH=1,                                      +        
               ATTR=(PROT)                                                      
PAGE13   DFLD  POS=(19,2),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
KMPNO13  DFLD  POS=(19,9),LTH=7,                                       +        
               ATTR=(ALPHA,PROT,MOD)                                            
KMPGR13  DFLD  POS=(19,18),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
TISTA13  DFLD  POS=(19,27),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
TISTO13  DFLD  POS=(19,35),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
TYPE13   DFLD  POS=(19,43),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'F7=First',                                             +        
               POS=(22,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'F8=Next',                                              +        
               POS=(22,12),LTH=7,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'F9=Jump',                                              +        
               POS=(22,21),LTH=7,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'F10=WHELP',                                            +        
               POS=(22,30),LTH=9,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,MOD)                                                  
         FMTEND                                                                 
W2I315N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W2N315),                                           +        
               OPT=2,                                                  +        
               NXT=W2O315N1                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '23152',                                                +        
               LTH=5                                                            
         MFLD  (ARTIN,                                                 +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PAGE1,                                                 +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KMPNO1,                                                +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KMPGR1,                                                +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (PAGE2,                                                 +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KMPNO2,                                                +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KMPGR2,                                                +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (PAGE3,                                                 +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KMPNO3,                                                +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KMPGR3,                                                +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (PAGE4,                                                 +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KMPNO4,                                                +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KMPGR4,                                                +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (PAGE5,                                                 +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KMPNO5,                                                +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KMPGR5,                                                +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (PAGE6,                                                 +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KMPNO6,                                                +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KMPGR6,                                                +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (PAGE7,                                                 +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KMPNO7,                                                +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KMPGR7,                                                +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (PAGE8,                                                 +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KMPNO8,                                                +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KMPGR8,                                                +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (PAGE9,                                                 +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KMPNO9,                                                +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KMPGR9,                                                +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (PAGE10,                                                +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KMPNO10,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KMPGR10,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (PAGE11,                                                +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KMPNO11,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KMPGR11,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (PAGE12,                                                +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KMPNO12,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KMPGR12,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (PAGE13,                                                +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KMPNO13,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KMPGR13,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
W2O315N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W2N315,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W2I315N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  ARTIN,                                                  +        
               LTH=9                                                            
         MFLD  ARTUT,                                                  +        
               LTH=9                                                            
         MFLD  PAGE1,                                                  +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KMPNO1,                                                 +        
               LTH=7                                                            
         MFLD  KMPGR1,                                                 +        
               LTH=7                                                            
         MFLD  TISTA1,                                                 +        
               LTH=6                                                            
         MFLD  TISTO1,                                                 +        
               LTH=6                                                            
         MFLD  TYPE1,                                                  +        
               LTH=1                                                            
         MFLD  PAGE2,                                                  +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KMPNO2,                                                 +        
               LTH=7                                                            
         MFLD  KMPGR2,                                                 +        
               LTH=7                                                            
         MFLD  TISTA2,                                                 +        
               LTH=6                                                            
         MFLD  TISTO2,                                                 +        
               LTH=6                                                            
         MFLD  TYPE2,                                                  +        
               LTH=1                                                            
         MFLD  PAGE3,                                                  +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KMPNO3,                                                 +        
               LTH=7                                                            
         MFLD  KMPGR3,                                                 +        
               LTH=7                                                            
         MFLD  TISTA3,                                                 +        
               LTH=6                                                            
         MFLD  TISTO3,                                                 +        
               LTH=6                                                            
         MFLD  TYPE3,                                                  +        
               LTH=1                                                            
         MFLD  PAGE4,                                                  +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KMPNO4,                                                 +        
               LTH=7                                                            
         MFLD  KMPGR4,                                                 +        
               LTH=7                                                            
         MFLD  TISTA4,                                                 +        
               LTH=6                                                            
         MFLD  TISTO4,                                                 +        
               LTH=6                                                            
         MFLD  TYPE4,                                                  +        
               LTH=1                                                            
         MFLD  PAGE5,                                                  +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KMPNO5,                                                 +        
               LTH=7                                                            
         MFLD  KMPGR5,                                                 +        
               LTH=7                                                            
         MFLD  TISTA5,                                                 +        
               LTH=6                                                            
         MFLD  TISTO5,                                                 +        
               LTH=6                                                            
         MFLD  TYPE5,                                                  +        
               LTH=1                                                            
         MFLD  PAGE6,                                                  +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KMPNO6,                                                 +        
               LTH=7                                                            
         MFLD  KMPGR6,                                                 +        
               LTH=7                                                            
         MFLD  TISTA6,                                                 +        
               LTH=6                                                            
         MFLD  TISTO6,                                                 +        
               LTH=6                                                            
         MFLD  TYPE6,                                                  +        
               LTH=1                                                            
         MFLD  PAGE7,                                                  +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KMPNO7,                                                 +        
               LTH=7                                                            
         MFLD  KMPGR7,                                                 +        
               LTH=7                                                            
         MFLD  TISTA7,                                                 +        
               LTH=6                                                            
         MFLD  TISTO7,                                                 +        
               LTH=6                                                            
         MFLD  TYPE7,                                                  +        
               LTH=1                                                            
         MFLD  PAGE8,                                                  +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KMPNO8,                                                 +        
               LTH=7                                                            
         MFLD  KMPGR8,                                                 +        
               LTH=7                                                            
         MFLD  TISTA8,                                                 +        
               LTH=6                                                            
         MFLD  TISTO8,                                                 +        
               LTH=6                                                            
         MFLD  TYPE8,                                                  +        
               LTH=1                                                            
         MFLD  PAGE9,                                                  +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KMPNO9,                                                 +        
               LTH=7                                                            
         MFLD  KMPGR9,                                                 +        
               LTH=7                                                            
         MFLD  TISTA9,                                                 +        
               LTH=6                                                            
         MFLD  TISTO9,                                                 +        
               LTH=6                                                            
         MFLD  TYPE9,                                                  +        
               LTH=1                                                            
         MFLD  PAGE10,                                                 +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KMPNO10,                                                +        
               LTH=7                                                            
         MFLD  KMPGR10,                                                +        
               LTH=7                                                            
         MFLD  TISTA10,                                                +        
               LTH=6                                                            
         MFLD  TISTO10,                                                +        
               LTH=6                                                            
         MFLD  TYPE10,                                                 +        
               LTH=1                                                            
         MFLD  PAGE11,                                                 +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KMPNO11,                                                +        
               LTH=7                                                            
         MFLD  KMPGR11,                                                +        
               LTH=7                                                            
         MFLD  TISTA11,                                                +        
               LTH=6                                                            
         MFLD  TISTO11,                                                +        
               LTH=6                                                            
         MFLD  TYPE11,                                                 +        
               LTH=1                                                            
         MFLD  PAGE12,                                                 +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KMPNO12,                                                +        
               LTH=7                                                            
         MFLD  KMPGR12,                                                +        
               LTH=7                                                            
         MFLD  TISTA12,                                                +        
               LTH=6                                                            
         MFLD  TISTO12,                                                +        
               LTH=6                                                            
         MFLD  TYPE12,                                                 +        
               LTH=1                                                            
         MFLD  PAGE13,                                                 +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KMPNO13,                                                +        
               LTH=7                                                            
         MFLD  KMPGR13,                                                +        
               LTH=7                                                            
         MFLD  TISTA13,                                                +        
               LTH=6                                                            
         MFLD  TISTO13,                                                +        
               LTH=6                                                            
         MFLD  TYPE13,                                                 +        
               LTH=1                                                            
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
