***********************************************************************         
* CREATED BY PC59625   ON 99/01/28  AT 13:46                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'PARTS PLANNING PER DC           '                               
W2N377   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W2T377U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W2N377   DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
TRANS1   DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
TRANS2   DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
TRANS3   DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
TRANS4   DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'PARTS PLANNING NDC           ',                        +        
               POS=(1,11),LTH=29,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Part No.',                                             +        
               POS=(2,2),LTH=8,                                        +        
               ATTR=(NUM,PROT)                                                  
ARTNRIN  DFLD  POS=(2,12),LTH=9,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'DC',                                                   +        
               POS=(2,24),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDDCIN   DFLD  POS=(2,27),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
ARTNRUT  DFLD  POS=(3,12),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
IDDCUT   DFLD  POS=(3,27),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Description',                                          +        
               POS=(5,3),LTH=11,                                       +        
               ATTR=(PROT)                                                      
BEART    DFLD  POS=(5,17),LTH=25,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Insert part',                                          +        
               POS=(6,3),LTH=11,                                       +        
               ATTR=(PROT)                                                      
KODIN    DFLD  POS=(6,22),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Publ. date',                                           +        
               POS=(7,3),LTH=10,                                       +        
               ATTR=(PROT)                                                      
DAPUBUT  DFLD  POS=(7,18),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DAPUBIN  DFLD  POS=(7,29),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Deleted part',                                         +        
               POS=(8,3),LTH=12,                                       +        
               ATTR=(PROT)                                                      
OSPUT    DFLD  POS=(8,22),LTH=1,                                       +        
               ATTR=(PROT)                                                      
OSPIN    DFLD  POS=(8,33),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Date',                                                 +        
               POS=(9,3),LTH=4,                                        +        
               ATTR=(PROT)                                                      
DATEUT   DFLD  POS=(9,17),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Userid',                                               +        
               POS=(10,3),LTH=6,                                       +        
               ATTR=(PROT)                                                      
USERUT   DFLD  POS=(10,17),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Local origin',                                         +        
               POS=(11,3),LTH=12,                                      +        
               ATTR=(PROT)                                                      
URSDCUT  DFLD  POS=(11,21),LTH=2,                                      +        
               ATTR=(PROT)                                                      
URSDCIN  DFLD  POS=(11,31),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Local PSN',                                            +        
               POS=(12,3),LTH=9,                                       +        
               ATTR=(PROT)                                                      
PSNDCUT  DFLD  POS=(12,20),LTH=3,                                      +        
               ATTR=(PROT)                                                      
PSNDCIN  DFLD  POS=(12,31),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Supplier',                                             +        
               POS=(13,3),LTH=8,                                       +        
               ATTR=(PROT)                                                      
LEVNRUT  DFLD  POS=(13,18),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Buyer',                                                +        
               POS=(14,3),LTH=5,                                       +        
               ATTR=(PROT)                                                      
BUYUT    DFLD  POS=(14,20),LTH=3,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Origin CDC',                                           +        
               POS=(18,3),LTH=10,                                      +        
               ATTR=(PROT)                                                      
URSCDCUT DFLD  POS=(18,21),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'PSN CDC',                                              +        
               POS=(19,3),LTH=7,                                       +        
               ATTR=(PROT)                                                      
PSNCDC   DFLD  POS=(19,20),LTH=3,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Publ. CDC',                                            +        
               POS=(20,3),LTH=9,                                       +        
               ATTR=(PROT)                                                      
TIFINLV  DFLD  POS=(20,18),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Pf10 WHELP  Pf11 Update  Pf12 Logoff',                 +        
               POS=(22,2),LTH=36,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(23,59),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W2O377N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W2N377,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W2I377N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W2N377                                                       
         SEG                                                                    
         MFLD  TRANS1,                                                 +        
               LTH=1                                                            
         MFLD  TRANS2,                                                 +        
               LTH=1                                                            
         MFLD  TRANS3,                                                 +        
               LTH=1                                                            
         MFLD  TRANS4,                                                 +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  ARTNRIN,                                                +        
               LTH=9                                                            
         MFLD  ARTNRUT,                                                +        
               LTH=9                                                            
         MFLD  IDDCIN,                                                 +        
               LTH=2                                                            
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  BEART,                                                  +        
               LTH=25                                                           
         MFLD  DAPUBUT,                                                +        
               LTH=5                                                            
         MFLD  OSPUT,                                                  +        
               LTH=1                                                            
         MFLD  DATEUT,                                                 +        
               LTH=6                                                            
         MFLD  USERUT,                                                 +        
               LTH=8                                                            
         MFLD  URSDCUT,                                                +        
               LTH=2                                                            
         MFLD  PSNDCUT,                                                +        
               LTH=3                                                            
         MFLD  LEVNRUT,                                                +        
               LTH=5                                                            
         MFLD  BUYUT,                                                  +        
               LTH=3                                                            
         MFLD  URSCDCUT,                                               +        
               LTH=2                                                            
         MFLD  PSNCDC,                                                 +        
               LTH=3                                                            
         MFLD  TIFINLV,                                                +        
               LTH=5                                                            
         MFLD  KODIN,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DAPUBIN,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OSPIN,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  URSDCIN,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PSNDCIN,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W2I377N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W2N377),                                           +        
               OPT=2,                                                  +        
               NXT=W2O377N1                                                     
MID      LPAGE SOR=(W2N377)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  TRANS1,                                                 +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  TRANS2,                                                 +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  TRANS3,                                                 +        
               LTH=1,                                                  +        
               FILL=X'F7'                                                       
         MFLD  TRANS4,                                                 +        
               LTH=1,                                                  +        
               FILL=X'F7'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '23772',                                                +        
               LTH=5                                                            
         MFLD  (ARTNRIN,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNRUT,                                               +        
               '         '),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDDCIN,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (IDDCUT,                                                +        
               '  '),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KODIN,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DAPUBIN,                                               +        
               '++++++'),                                              +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (OSPIN,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (URSDCIN,                                               +        
               '+++'),                                                 +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (PSNDCIN,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
