***********************************************************************         
* CREATED BY PCCP964   ON 18/07/10                                              
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE '                                '                               
W2N393   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W2T393U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W2T407  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W2T393U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W2N393   DPAGE CURSOR=((2,11)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'REFILL  INFO  CDC.',                                   +        
               POS=(1,17),LTH=18,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Part No.',                                             +        
               POS=(2,2),LTH=8,                                        +        
               ATTR=(PROT)                                                      
ARTNRIN  DFLD  POS=(2,11),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
ARTNRUT  DFLD  POS=(3,11),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Warehouse info',                                       +        
               POS=(5,2),LTH=14,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Supplier',                                             +        
               POS=(7,2),LTH=8,                                        +        
               ATTR=(PROT)                                                      
IDLEVNR  DFLD  POS=(7,17),LTH=5,                                       +        
               ATTR=(PROT)                                                      
IDLEVNRI DFLD  POS=(7,26),LTH=5,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Block Qty',                                            +        
               POS=(8,2),LTH=9,                                        +        
               ATTR=(PROT)                                                      
KVSPANT  DFLD  POS=(8,15),LTH=7,                                       +        
               ATTR=(PROT)                                                      
KVSPANTI DFLD  POS=(8,26),LTH=7,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Buyer',                                                +        
               POS=(9,2),LTH=5,                                        +        
               ATTR=(PROT)                                                      
IDPERSON DFLD  POS=(9,19),LTH=3,                                       +        
               ATTR=(PROT)                                                      
IDPERSNI DFLD  POS=(9,26),LTH=3,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Pub. week',                                            +        
               POS=(10,2),LTH=9,                                       +        
               ATTR=(PROT)                                                      
TIFINLV  DFLD  POS=(10,17),LTH=5,                                      +        
               ATTR=(PROT)                                                      
TIFINLVI DFLD  POS=(10,26),LTH=4,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Man FC-Plan',                                          +        
               POS=(12,2),LTH=11,                                      +        
               ATTR=(NOPROT)                                                    
KVPBPLAN DFLD  POS=(12,17),LTH=8,                                      +        
               ATTR=(PROT)                                                      
KVPBIN   DFLD  POS=(12,26),LTH=8,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Until',                                                +        
               POS=(13,2),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
DAPBPLAN DFLD  POS=(13,19),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DAPBIN   DFLD  POS=(13,26),LTH=6,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Mask PB-Plan',                                         +        
               POS=(14,2),LTH=12,                                      +        
               ATTR=(NUM,PROT)                                                  
KVPBMASK DFLD  POS=(14,17),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Note',                                                 +        
               POS=(16,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
TEARTNO1 DFLD  POS=(16,17),LTH=40,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'Note',                                                 +        
               POS=(17,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
TEARTNO2 DFLD  POS=(17,17),LTH=40                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  '13',                                                   +        
               POS=(21,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '14',                                                   +        
               POS=(21,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '15',                                                   +        
               POS=(21,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16',                                                   +        
               POS=(21,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
FLD1961  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1970  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,MOD)                                                  
         FMTEND                                                                 
W2O393N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W2N393,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W2I393N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W2N393                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  ARTNRIN,                                                +        
               LTH=9                                                            
         MFLD  ARTNRUT,                                                +        
               LTH=9                                                            
         MFLD  IDLEVNR,                                                +        
               LTH=5                                                            
         MFLD  KVSPANT,                                                +        
               LTH=7                                                            
         MFLD  IDPERSON,                                               +        
               LTH=3                                                            
         MFLD  TIFINLV,                                                +        
               LTH=5                                                            
         MFLD  IDLEVNRI,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVSPANTI,                                               +        
               LTH=9,                                                  +        
               ATTR=YES                                                         
         MFLD  IDPERSNI,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TIFINLVI,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVPBIN,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVPBPLAN,                                               +        
               LTH=8                                                            
         MFLD  DAPBIN,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DAPBPLAN,                                               +        
               LTH=6                                                            
         MFLD  KVPBMASK,                                               +        
               LTH=8                                                            
         MFLD  TEARTNO1,                                               +        
               LTH=42,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TEARTNO2,                                               +        
               LTH=42,                                                 +        
               ATTR=YES                                                         
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD1961,                                               +        
               DATE4)                                                           
         MFLD  (FLD1970,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W2I393N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W2N393),                                           +        
               OPT=2,                                                  +        
               NXT=W2O393N1                                                     
MID      LPAGE SOR=(W2N393)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F9'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '23932',                                                +        
               LTH=5                                                            
         MFLD  (ARTNRIN,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  ARTNRUT,                                                +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDLEVNRI,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVSPANTI,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDPERSNI,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TIFINLVI,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVPBIN,                                                +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DAPBIN,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TEARTNO1,                                              +        
               '++++++++++++++++++++++++++++++++++++++++'),            +        
               LTH=40,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TEARTNO2,                                              +        
               '++++++++++++++++++++++++++++++++++++++++'),            +        
               LTH=40,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
