***********************************************************************         
* CREATED BY V086936   ON 06/02/14  AT 15:58                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'ÖVERSIKTSBILD ORDERFÖRSLAG DCGRUPP'                             
W2N381   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W2T381 7',                                           +        
               8='W2T381 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W2T382  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W2N381   DPAGE CURSOR=((2,7)),                                         +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Purchase proposal menu DC group',                      +        
               POS=(1,12),LTH=31,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,44),LTH=37,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Type',                                                 +        
               POS=(2,2),LTH=4,                                        +        
               ATTR=(NUM,PROT)                                                  
FLD0207  DFLD  POS=(2,7),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
FLD0307  DFLD  POS=(3,7),LTH=5,                                        +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'S Lines to  DC  ',                                     +        
               POS=(5,2),LTH=16,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'review',                                               +        
               POS=(6,4),LTH=6,                                        +        
               ATTR=(PROT)                                                      
CMD1     DFLD  POS=(7,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
LINES1   DFLD  POS=(7,4),LTH=6,                                        +        
               ATTR=(PROT,MOD)                                                  
DC11     DFLD  POS=(7,14),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DC12     DFLD  POS=(7,17),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DC13     DFLD  POS=(7,20),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DC14     DFLD  POS=(7,23),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DC15     DFLD  POS=(7,26),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DC16     DFLD  POS=(7,29),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
CMD2     DFLD  POS=(8,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
LINES2   DFLD  POS=(8,4),LTH=6,                                        +        
               ATTR=(PROT,MOD)                                                  
DC21     DFLD  POS=(8,14),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DC22     DFLD  POS=(8,17),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DC23     DFLD  POS=(8,20),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DC24     DFLD  POS=(8,23),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DC25     DFLD  POS=(8,26),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DC26     DFLD  POS=(8,29),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
CMD3     DFLD  POS=(9,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
LINES3   DFLD  POS=(9,4),LTH=6,                                        +        
               ATTR=(PROT,MOD)                                                  
DC31     DFLD  POS=(9,14),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DC32     DFLD  POS=(9,17),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DC33     DFLD  POS=(9,20),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DC34     DFLD  POS=(9,23),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DC35     DFLD  POS=(9,26),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DC36     DFLD  POS=(9,29),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
CMD4     DFLD  POS=(10,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
LINES4   DFLD  POS=(10,4),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
DC41     DFLD  POS=(10,14),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DC42     DFLD  POS=(10,17),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DC43     DFLD  POS=(10,20),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DC44     DFLD  POS=(10,23),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DC45     DFLD  POS=(10,26),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DC46     DFLD  POS=(10,29),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
CMD5     DFLD  POS=(11,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
LINES5   DFLD  POS=(11,4),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
DC51     DFLD  POS=(11,14),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DC52     DFLD  POS=(11,17),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DC53     DFLD  POS=(11,20),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DC54     DFLD  POS=(11,23),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DC55     DFLD  POS=(11,26),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DC56     DFLD  POS=(11,29),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
CMD6     DFLD  POS=(12,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
LINES6   DFLD  POS=(12,4),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
DC61     DFLD  POS=(12,14),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DC62     DFLD  POS=(12,17),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DC63     DFLD  POS=(12,20),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DC64     DFLD  POS=(12,23),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DC65     DFLD  POS=(12,26),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DC66     DFLD  POS=(12,29),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
CMD7     DFLD  POS=(13,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
LINES7   DFLD  POS=(13,4),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
DC71     DFLD  POS=(13,14),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DC72     DFLD  POS=(13,17),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DC73     DFLD  POS=(13,20),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DC74     DFLD  POS=(13,23),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DC75     DFLD  POS=(13,26),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DC76     DFLD  POS=(13,29),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
CMD8     DFLD  POS=(14,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
LINES8   DFLD  POS=(14,4),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
DC81     DFLD  POS=(14,14),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DC82     DFLD  POS=(14,17),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DC83     DFLD  POS=(14,20),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DC84     DFLD  POS=(14,23),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DC85     DFLD  POS=(14,26),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DC86     DFLD  POS=(14,29),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
CMD9     DFLD  POS=(15,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
LINES9   DFLD  POS=(15,4),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
DC91     DFLD  POS=(15,14),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DC92     DFLD  POS=(15,17),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DC93     DFLD  POS=(15,20),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DC94     DFLD  POS=(15,23),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DC95     DFLD  POS=(15,26),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DC96     DFLD  POS=(15,29),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
CMD10    DFLD  POS=(16,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
LINES10  DFLD  POS=(16,4),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
DC101    DFLD  POS=(16,14),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DC102    DFLD  POS=(16,17),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DC103    DFLD  POS=(16,20),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DC104    DFLD  POS=(16,23),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DC105    DFLD  POS=(16,26),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DC106    DFLD  POS=(16,29),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
CMD11    DFLD  POS=(17,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
LINES11  DFLD  POS=(17,4),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
DC111    DFLD  POS=(17,14),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DC112    DFLD  POS=(17,17),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DC113    DFLD  POS=(17,20),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DC114    DFLD  POS=(17,23),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DC115    DFLD  POS=(17,26),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DC116    DFLD  POS=(17,29),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
CMD12    DFLD  POS=(18,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
LINES12  DFLD  POS=(18,4),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
DC121    DFLD  POS=(18,14),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DC122    DFLD  POS=(18,17),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DC123    DFLD  POS=(18,20),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DC124    DFLD  POS=(18,23),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DC125    DFLD  POS=(18,26),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DC126    DFLD  POS=(18,29),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
CMD13    DFLD  POS=(19,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
LINES13  DFLD  POS=(19,4),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
DC131    DFLD  POS=(19,14),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DC132    DFLD  POS=(19,17),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DC133    DFLD  POS=(19,20),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DC134    DFLD  POS=(19,23),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DC135    DFLD  POS=(19,26),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DC136    DFLD  POS=(19,29),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  '13              14 Purch prop   15         ',          +        
               POS=(21,2),LTH=43,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16         ',                                          +        
               POS=(21,50),LTH=11,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '17       ',                                            +        
               POS=(21,66),LTH=9,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18              19              20              21     +        
                        10 WHELP',                                     +        
               POS=(22,2),LTH=72,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W2O381N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W2N381,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W2I381N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W2N381                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  FLD0207,                                                +        
               LTH=1                                                            
         MFLD  FLD0307,                                                +        
               LTH=5                                                            
         MFLD  CMD1,                                                   +        
               LTH=1                                                            
         MFLD  LINES1,                                                 +        
               LTH=6                                                            
         MFLD  DC11,                                                   +        
               LTH=2                                                            
         MFLD  DC12,                                                   +        
               LTH=2                                                            
         MFLD  DC13,                                                   +        
               LTH=2                                                            
         MFLD  DC14,                                                   +        
               LTH=2                                                            
         MFLD  DC15,                                                   +        
               LTH=2                                                            
         MFLD  DC16,                                                   +        
               LTH=2                                                            
         MFLD  CMD2,                                                   +        
               LTH=1                                                            
         MFLD  LINES2,                                                 +        
               LTH=6                                                            
         MFLD  DC21,                                                   +        
               LTH=2                                                            
         MFLD  DC22,                                                   +        
               LTH=2                                                            
         MFLD  DC23,                                                   +        
               LTH=2                                                            
         MFLD  DC24,                                                   +        
               LTH=2                                                            
         MFLD  DC25,                                                   +        
               LTH=2                                                            
         MFLD  DC26,                                                   +        
               LTH=2                                                            
         MFLD  CMD3,                                                   +        
               LTH=1                                                            
         MFLD  LINES3,                                                 +        
               LTH=6                                                            
         MFLD  DC31,                                                   +        
               LTH=2                                                            
         MFLD  DC32,                                                   +        
               LTH=2                                                            
         MFLD  DC33,                                                   +        
               LTH=2                                                            
         MFLD  DC34,                                                   +        
               LTH=2                                                            
         MFLD  DC35,                                                   +        
               LTH=2                                                            
         MFLD  DC36,                                                   +        
               LTH=2                                                            
         MFLD  CMD4,                                                   +        
               LTH=1                                                            
         MFLD  LINES4,                                                 +        
               LTH=6                                                            
         MFLD  DC41,                                                   +        
               LTH=2                                                            
         MFLD  DC42,                                                   +        
               LTH=2                                                            
         MFLD  DC43,                                                   +        
               LTH=2                                                            
         MFLD  DC44,                                                   +        
               LTH=2                                                            
         MFLD  DC45,                                                   +        
               LTH=2                                                            
         MFLD  DC46,                                                   +        
               LTH=2                                                            
         MFLD  CMD5,                                                   +        
               LTH=1                                                            
         MFLD  LINES5,                                                 +        
               LTH=6                                                            
         MFLD  DC51,                                                   +        
               LTH=2                                                            
         MFLD  DC52,                                                   +        
               LTH=2                                                            
         MFLD  DC53,                                                   +        
               LTH=2                                                            
         MFLD  DC54,                                                   +        
               LTH=2                                                            
         MFLD  DC55,                                                   +        
               LTH=2                                                            
         MFLD  DC56,                                                   +        
               LTH=2                                                            
         MFLD  CMD6,                                                   +        
               LTH=1                                                            
         MFLD  LINES6,                                                 +        
               LTH=6                                                            
         MFLD  DC61,                                                   +        
               LTH=2                                                            
         MFLD  DC62,                                                   +        
               LTH=2                                                            
         MFLD  DC63,                                                   +        
               LTH=2                                                            
         MFLD  DC64,                                                   +        
               LTH=2                                                            
         MFLD  DC65,                                                   +        
               LTH=2                                                            
         MFLD  DC66,                                                   +        
               LTH=2                                                            
         MFLD  CMD7,                                                   +        
               LTH=1                                                            
         MFLD  LINES7,                                                 +        
               LTH=6                                                            
         MFLD  DC71,                                                   +        
               LTH=2                                                            
         MFLD  DC72,                                                   +        
               LTH=2                                                            
         MFLD  DC73,                                                   +        
               LTH=2                                                            
         MFLD  DC74,                                                   +        
               LTH=2                                                            
         MFLD  DC75,                                                   +        
               LTH=2                                                            
         MFLD  DC76,                                                   +        
               LTH=2                                                            
         MFLD  CMD8,                                                   +        
               LTH=1                                                            
         MFLD  LINES8,                                                 +        
               LTH=6                                                            
         MFLD  DC81,                                                   +        
               LTH=2                                                            
         MFLD  DC82,                                                   +        
               LTH=2                                                            
         MFLD  DC83,                                                   +        
               LTH=2                                                            
         MFLD  DC84,                                                   +        
               LTH=2                                                            
         MFLD  DC85,                                                   +        
               LTH=2                                                            
         MFLD  DC86,                                                   +        
               LTH=2                                                            
         MFLD  CMD9,                                                   +        
               LTH=1                                                            
         MFLD  LINES9,                                                 +        
               LTH=6                                                            
         MFLD  DC91,                                                   +        
               LTH=2                                                            
         MFLD  DC92,                                                   +        
               LTH=2                                                            
         MFLD  DC93,                                                   +        
               LTH=2                                                            
         MFLD  DC94,                                                   +        
               LTH=2                                                            
         MFLD  DC95,                                                   +        
               LTH=2                                                            
         MFLD  DC96,                                                   +        
               LTH=2                                                            
         MFLD  CMD10,                                                  +        
               LTH=1                                                            
         MFLD  LINES10,                                                +        
               LTH=6                                                            
         MFLD  DC101,                                                  +        
               LTH=2                                                            
         MFLD  DC102,                                                  +        
               LTH=2                                                            
         MFLD  DC103,                                                  +        
               LTH=2                                                            
         MFLD  DC104,                                                  +        
               LTH=2                                                            
         MFLD  DC105,                                                  +        
               LTH=2                                                            
         MFLD  DC106,                                                  +        
               LTH=2                                                            
         MFLD  CMD11,                                                  +        
               LTH=1                                                            
         MFLD  LINES11,                                                +        
               LTH=6                                                            
         MFLD  DC111,                                                  +        
               LTH=2                                                            
         MFLD  DC112,                                                  +        
               LTH=2                                                            
         MFLD  DC113,                                                  +        
               LTH=2                                                            
         MFLD  DC114,                                                  +        
               LTH=2                                                            
         MFLD  DC115,                                                  +        
               LTH=2                                                            
         MFLD  DC116,                                                  +        
               LTH=2                                                            
         MFLD  CMD12,                                                  +        
               LTH=1                                                            
         MFLD  LINES12,                                                +        
               LTH=6                                                            
         MFLD  DC121,                                                  +        
               LTH=2                                                            
         MFLD  DC122,                                                  +        
               LTH=2                                                            
         MFLD  DC123,                                                  +        
               LTH=2                                                            
         MFLD  DC124,                                                  +        
               LTH=2                                                            
         MFLD  DC125,                                                  +        
               LTH=2                                                            
         MFLD  DC126,                                                  +        
               LTH=2                                                            
         MFLD  CMD13,                                                  +        
               LTH=1                                                            
         MFLD  LINES13,                                                +        
               LTH=6                                                            
         MFLD  DC131,                                                  +        
               LTH=2                                                            
         MFLD  DC132,                                                  +        
               LTH=2                                                            
         MFLD  DC133,                                                  +        
               LTH=2                                                            
         MFLD  DC134,                                                  +        
               LTH=2                                                            
         MFLD  DC135,                                                  +        
               LTH=2                                                            
         MFLD  DC136,                                                  +        
               LTH=2                                                            
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W2I381N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W2N381),                                           +        
               OPT=2,                                                  +        
               NXT=W2O381N1                                                     
MID      LPAGE SOR=(W2N381)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F8'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '23812',                                                +        
               LTH=5                                                            
         MFLD  (FLD0207,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0307,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD1,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC11,                                                  +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC12,                                                  +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC13,                                                  +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC14,                                                  +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC15,                                                  +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC16,                                                  +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD2,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC21,                                                  +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC22,                                                  +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC23,                                                  +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC24,                                                  +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC25,                                                  +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC26,                                                  +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD3,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC31,                                                  +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC32,                                                  +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC33,                                                  +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC34,                                                  +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC35,                                                  +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC36,                                                  +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD4,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC41,                                                  +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC42,                                                  +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC43,                                                  +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC44,                                                  +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC45,                                                  +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC46,                                                  +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD5,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC51,                                                  +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC52,                                                  +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC53,                                                  +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC54,                                                  +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC55,                                                  +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC56,                                                  +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD6,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC61,                                                  +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC62,                                                  +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC63,                                                  +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC64,                                                  +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC65,                                                  +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC66,                                                  +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD7,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC71,                                                  +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC72,                                                  +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC73,                                                  +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC74,                                                  +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC75,                                                  +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC76,                                                  +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD8,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC81,                                                  +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC82,                                                  +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC83,                                                  +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC84,                                                  +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC85,                                                  +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC86,                                                  +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD9,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC91,                                                  +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC92,                                                  +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC93,                                                  +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC94,                                                  +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC95,                                                  +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC96,                                                  +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD10,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC101,                                                 +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC102,                                                 +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC103,                                                 +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC104,                                                 +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC105,                                                 +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC106,                                                 +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD11,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC111,                                                 +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC112,                                                 +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC113,                                                 +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC114,                                                 +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC115,                                                 +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC116,                                                 +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD12,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC121,                                                 +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC122,                                                 +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC123,                                                 +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC124,                                                 +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC125,                                                 +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC126,                                                 +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD13,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC131,                                                 +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC132,                                                 +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC133,                                                 +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC134,                                                 +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC135,                                                 +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC136,                                                 +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
