***********************************************************************         
* CREATED BY PCC6483   ON 00/10/25  AT 12:44                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'Parts in Supplier group         '                               
W2N333   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W2T333 7',                                           +        
               8='W2T333 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W2T333U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'PARTS IN SUPPLIER GROUP',                              +        
               POS=(1,11),LTH=23,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Supplier:',                                            +        
               POS=(2,2),LTH=9,                                        +        
               ATTR=(ALPHA,PROT)                                                
LEVNRIN  DFLD  POS=(2,12),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Group:',                                               +        
               POS=(2,18),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
IDGRPIN  DFLD  POS=(2,25),LTH=10,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Part No:',                                             +        
               POS=(2,36),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
ARTNRIN  DFLD  POS=(2,45),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
LEVNRUT  DFLD  POS=(3,12),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
IDGRPUT  DFLD  POS=(3,25),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
ARTNRUT  DFLD  POS=(3,45),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'C Part No  Start date  Start group',                   +        
               POS=(5,2),LTH=34,                                       +        
               ATTR=(PROT)                                                      
CMD      DFLD  POS=(6,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
ARTNUMIN DFLD  POS=(6,4),LTH=9,                                        +        
               ATTR=(NOPROT,MOD)                                                
DATIN    DFLD  POS=(6,17),LTH=6,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
DATGRP   DFLD  POS=(6,30),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Part No   Start date    Part No   Start date    Part No+        
                  Start date',                                         +        
               POS=(8,4),LTH=68,                                       +        
               ATTR=(PROT)                                                      
ARTNR1   DFLD  POS=(9,4),LTH=9,                                        +        
               ATTR=(PROT,MOD)                                                  
DAT1     DFLD  POS=(9,18),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
ARTNR13  DFLD  POS=(9,28),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
DAT13    DFLD  POS=(9,42),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
ARTNR25  DFLD  POS=(9,52),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
DAT25    DFLD  POS=(9,66),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
ARTNR2   DFLD  POS=(10,4),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
DAT2     DFLD  POS=(10,18),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
ARTNR14  DFLD  POS=(10,28),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
DAT14    DFLD  POS=(10,42),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
ARTNR26  DFLD  POS=(10,52),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
DAT26    DFLD  POS=(10,66),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
ARTNR3   DFLD  POS=(11,4),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
DAT3     DFLD  POS=(11,18),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
ARTNR15  DFLD  POS=(11,28),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
DAT15    DFLD  POS=(11,42),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
ARTNR27  DFLD  POS=(11,52),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
DAT27    DFLD  POS=(11,66),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
ARTNR4   DFLD  POS=(12,4),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
DAT4     DFLD  POS=(12,18),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
ARTNR16  DFLD  POS=(12,28),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
DAT16    DFLD  POS=(12,42),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
ARTNR28  DFLD  POS=(12,52),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
DAT28    DFLD  POS=(12,66),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
ARTNR5   DFLD  POS=(13,4),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
DAT5     DFLD  POS=(13,18),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
ARTNR17  DFLD  POS=(13,28),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
DAT17    DFLD  POS=(13,42),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
ARTNR29  DFLD  POS=(13,52),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
DAT29    DFLD  POS=(13,66),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
ARTNR6   DFLD  POS=(14,4),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
DAT6     DFLD  POS=(14,18),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
ARTNR18  DFLD  POS=(14,28),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
DAT18    DFLD  POS=(14,42),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
ARTNR30  DFLD  POS=(14,52),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
DAT30    DFLD  POS=(14,66),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
ARTNR7   DFLD  POS=(15,4),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
DAT7     DFLD  POS=(15,18),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
ARTNR19  DFLD  POS=(15,28),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
DAT19    DFLD  POS=(15,42),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
ARTNR31  DFLD  POS=(15,52),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
DAT31    DFLD  POS=(15,66),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
ARTNR8   DFLD  POS=(16,4),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
DAT8     DFLD  POS=(16,18),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
ARTNR20  DFLD  POS=(16,28),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
DAT20    DFLD  POS=(16,42),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
ARTNR32  DFLD  POS=(16,52),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
DAT32    DFLD  POS=(16,66),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
ARTNR9   DFLD  POS=(17,4),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
DAT9     DFLD  POS=(17,18),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
ARTNR21  DFLD  POS=(17,28),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
DAT21    DFLD  POS=(17,42),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
ARTNR33  DFLD  POS=(17,52),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
DAT33    DFLD  POS=(17,66),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
ARTNR10  DFLD  POS=(18,4),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
DAT10    DFLD  POS=(18,18),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
ARTNR22  DFLD  POS=(18,28),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
DAT22    DFLD  POS=(18,42),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
ARTNR34  DFLD  POS=(18,52),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
DAT34    DFLD  POS=(18,66),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
ARTNR11  DFLD  POS=(19,4),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
DAT11    DFLD  POS=(19,18),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
ARTNR23  DFLD  POS=(19,28),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
DAT23    DFLD  POS=(19,42),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
ARTNR35  DFLD  POS=(19,52),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
DAT35    DFLD  POS=(19,66),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
ARTNR12  DFLD  POS=(20,4),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
DAT12    DFLD  POS=(20,18),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
ARTNR24  DFLD  POS=(20,28),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
DAT24    DFLD  POS=(20,42),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
ARTNR36  DFLD  POS=(20,52),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
DAT36    DFLD  POS=(20,66),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'F7=First  F8=Next  F10=WHELP  F11=Update',             +        
               POS=(22,2),LTH=40,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W2O333N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W2N333,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W2I333N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  LEVNRIN,                                                +        
               LTH=2                                                            
         MFLD  LEVNRUT,                                                +        
               LTH=5                                                            
         MFLD  IDGRPIN,                                                +        
               LTH=2                                                            
         MFLD  IDGRPUT,                                                +        
               LTH=10                                                           
         MFLD  ARTNRIN,                                                +        
               LTH=2                                                            
         MFLD  ARTNRUT,                                                +        
               LTH=9                                                            
         MFLD  CMD,                                                    +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ARTNUMIN,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DATIN,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DATGRP,                                                 +        
               LTH=6                                                            
         MFLD  ARTNR1,                                                 +        
               LTH=9                                                            
         MFLD  DAT1,                                                   +        
               LTH=6                                                            
         MFLD  ARTNR2,                                                 +        
               LTH=9                                                            
         MFLD  DAT2,                                                   +        
               LTH=6                                                            
         MFLD  ARTNR3,                                                 +        
               LTH=9                                                            
         MFLD  DAT3,                                                   +        
               LTH=6                                                            
         MFLD  ARTNR4,                                                 +        
               LTH=9                                                            
         MFLD  DAT4,                                                   +        
               LTH=6                                                            
         MFLD  ARTNR5,                                                 +        
               LTH=9                                                            
         MFLD  DAT5,                                                   +        
               LTH=6                                                            
         MFLD  ARTNR6,                                                 +        
               LTH=9                                                            
         MFLD  DAT6,                                                   +        
               LTH=6                                                            
         MFLD  ARTNR7,                                                 +        
               LTH=9                                                            
         MFLD  DAT7,                                                   +        
               LTH=6                                                            
         MFLD  ARTNR8,                                                 +        
               LTH=9                                                            
         MFLD  DAT8,                                                   +        
               LTH=6                                                            
         MFLD  ARTNR9,                                                 +        
               LTH=9                                                            
         MFLD  DAT9,                                                   +        
               LTH=6                                                            
         MFLD  ARTNR10,                                                +        
               LTH=9                                                            
         MFLD  DAT10,                                                  +        
               LTH=6                                                            
         MFLD  ARTNR11,                                                +        
               LTH=9                                                            
         MFLD  DAT11,                                                  +        
               LTH=6                                                            
         MFLD  ARTNR12,                                                +        
               LTH=9                                                            
         MFLD  DAT12,                                                  +        
               LTH=6                                                            
         MFLD  ARTNR13,                                                +        
               LTH=9                                                            
         MFLD  DAT13,                                                  +        
               LTH=6                                                            
         MFLD  ARTNR14,                                                +        
               LTH=9                                                            
         MFLD  DAT14,                                                  +        
               LTH=6                                                            
         MFLD  ARTNR15,                                                +        
               LTH=9                                                            
         MFLD  DAT15,                                                  +        
               LTH=6                                                            
         MFLD  ARTNR16,                                                +        
               LTH=9                                                            
         MFLD  DAT16,                                                  +        
               LTH=6                                                            
         MFLD  ARTNR17,                                                +        
               LTH=9                                                            
         MFLD  DAT17,                                                  +        
               LTH=6                                                            
         MFLD  ARTNR18,                                                +        
               LTH=9                                                            
         MFLD  DAT18,                                                  +        
               LTH=6                                                            
         MFLD  ARTNR19,                                                +        
               LTH=9                                                            
         MFLD  DAT19,                                                  +        
               LTH=6                                                            
         MFLD  ARTNR20,                                                +        
               LTH=9                                                            
         MFLD  DAT20,                                                  +        
               LTH=6                                                            
         MFLD  ARTNR21,                                                +        
               LTH=9                                                            
         MFLD  DAT21,                                                  +        
               LTH=6                                                            
         MFLD  ARTNR22,                                                +        
               LTH=9                                                            
         MFLD  DAT22,                                                  +        
               LTH=6                                                            
         MFLD  ARTNR23,                                                +        
               LTH=9                                                            
         MFLD  DAT23,                                                  +        
               LTH=6                                                            
         MFLD  ARTNR24,                                                +        
               LTH=9                                                            
         MFLD  DAT24,                                                  +        
               LTH=6                                                            
         MFLD  ARTNR25,                                                +        
               LTH=9                                                            
         MFLD  DAT25,                                                  +        
               LTH=6                                                            
         MFLD  ARTNR26,                                                +        
               LTH=9                                                            
         MFLD  DAT26,                                                  +        
               LTH=6                                                            
         MFLD  ARTNR27,                                                +        
               LTH=9                                                            
         MFLD  DAT27,                                                  +        
               LTH=6                                                            
         MFLD  ARTNR28,                                                +        
               LTH=9                                                            
         MFLD  DAT28,                                                  +        
               LTH=6                                                            
         MFLD  ARTNR29,                                                +        
               LTH=9                                                            
         MFLD  DAT29,                                                  +        
               LTH=6                                                            
         MFLD  ARTNR30,                                                +        
               LTH=9                                                            
         MFLD  DAT30,                                                  +        
               LTH=6                                                            
         MFLD  ARTNR31,                                                +        
               LTH=9                                                            
         MFLD  DAT31,                                                  +        
               LTH=6                                                            
         MFLD  ARTNR32,                                                +        
               LTH=9                                                            
         MFLD  DAT32,                                                  +        
               LTH=6                                                            
         MFLD  ARTNR33,                                                +        
               LTH=9                                                            
         MFLD  DAT33,                                                  +        
               LTH=6                                                            
         MFLD  ARTNR34,                                                +        
               LTH=9                                                            
         MFLD  DAT34,                                                  +        
               LTH=6                                                            
         MFLD  ARTNR35,                                                +        
               LTH=9                                                            
         MFLD  DAT35,                                                  +        
               LTH=6                                                            
         MFLD  ARTNR36,                                                +        
               LTH=9                                                            
         MFLD  DAT36,                                                  +        
               LTH=6                                                            
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W2I333N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W2N333),                                           +        
               OPT=2,                                                  +        
               NXT=W2O333N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '23332',                                                +        
               LTH=5                                                            
         MFLD  (LEVNRIN,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (LEVNRUT,                                               +        
               '     '),                                               +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (IDGRPIN,                                               +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L                                                           
         MFLD  (IDGRPUT,                                               +        
               '          '),                                          +        
               LTH=10,                                                 +        
               FILL=X'40'                                                       
         MFLD  (ARTNRIN,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R                                                           
         MFLD  (ARTNRUT,                                               +        
               '         '),                                           +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (CMD,                                                   +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (ARTNUMIN,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R                                                           
         MFLD  (DATIN,                                                 +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R                                                           
         MSGEND                                                                 
         END                                                                    
