***********************************************************************         
* CREATED BY V063442   ON 02/01/24  AT 10:20                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'SELECT PART LINFORMATION DC     '                               
W2N348   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W2T348 7',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W2T348U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W2T348 7',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W2T348U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W2N348   DPAGE CURSOR=((5,07)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'SELECT PART INFORMATION DC',                           +        
               POS=(1,11),LTH=26,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD0140  DFLD  POS=(1,40),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Mail',                                                 +        
               POS=(5,02),LTH=4,                                       +        
               ATTR=(PROT)                                                      
KDARBTYP DFLD  POS=(5,07),LTH=4,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDPERSON DFLD  POS=(5,12),LTH=3,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'DC',                                                   +        
               POS=(7,02),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDDC     DFLD  POS=(7,05),LTH=2,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Backorder',                                            +        
               POS=(7,40),LTH=10,                                      +        
               ATTR=(PROT)                                                      
FLKVROS  DFLD  POS=(7,51),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Buyer',                                                +        
               POS=(8,02),LTH=5,                                       +        
               ATTR=(PROT)                                                      
IDBUYER  DFLD  POS=(8,08),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'until',                                                +        
               POS=(8,12),LTH=5,                                       +        
               ATTR=(PROT)                                                      
IDBUYTO  DFLD  POS=(8,18),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'or',                                                   +        
               POS=(8,22),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDBUY2   DFLD  POS=(8,26),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
IDBUY3   DFLD  POS=(8,30),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
IDBUY4   DFLD  POS=(8,34),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'On Order ',                                            +        
               POS=(8,40),LTH=10,                                      +        
               ATTR=(PROT)                                                      
FLONORD  DFLD  POS=(8,51),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Project',                                              +        
               POS=(9,02),LTH=7,                                       +        
               ATTR=(PROT)                                                      
IDPROJ1  DFLD  POS=(9,10),LTH=4,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDPROJ2  DFLD  POS=(9,15),LTH=4,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDPROJ3  DFLD  POS=(9,20),LTH=4,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'AK in DC',                                             +        
               POS=(9,40),LTH=08,                                      +        
               ATTR=(PROT)                                                      
FLAKDC   DFLD  POS=(9,49),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Model',                                                +        
               POS=(10,02),LTH=5,                                      +        
               ATTR=(PROT)                                                      
MODEL    DFLD  POS=(10,8),LTH=15,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Season',                                               +        
               POS=(10,40),LTH=06,                                     +        
               ATTR=(PROT)                                                      
FLASEAS  DFLD  POS=(10,49),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Product group',                                        +        
               POS=(11,02),LTH=13,                                     +        
               ATTR=(PROT)                                                      
KDPSLLOC DFLD  POS=(11,16),LTH=2,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Always Air',                                           +        
               POS=(11,40),LTH=10,                                     +        
               ATTR=(PROT)                                                      
AIR      DFLD  POS=(11,51),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Function group',                                       +        
               POS=(12,2),LTH=14,                                      +        
               ATTR=(PROT)                                                      
FKNGRFOM DFLD  POS=(12,17),LTH=4,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'until',                                                +        
               POS=(12,22),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FKNGRTOM DFLD  POS=(12,28),LTH=4,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Supplier in CDC',                                      +        
               POS=(12,40),LTH=15,                                     +        
               ATTR=(PROT)                                                      
LEVNRCDC DFLD  POS=(12,56),LTH=5,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Price',                                                +        
               POS=(13,2),LTH=5,                                       +        
               ATTR=(PROT)                                                      
PRICE    DFLD  POS=(13,08),LTH=2,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Class',                                                +        
               POS=(13,12),LTH=5,                                      +        
               ATTR=(PROT)                                                      
CLASS    DFLD  POS=(13,18),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Supplier in DC',                                       +        
               POS=(13,40),LTH=15,                                     +        
               ATTR=(PROT)                                                      
LEVNRDC  DFLD  POS=(13,56),LTH=5,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Table',                                                +        
               POS=(14,02),LTH=5,                                      +        
               ATTR=(PROT)                                                      
IDREFTAB DFLD  POS=(14,08),LTH=1,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Refillpart',                                           +        
               POS=(14,40),LTH=11,                                     +        
               ATTR=(PROT)                                                      
FLREFILL DFLD  POS=(14,52),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Forecast',                                             +        
               POS=(15,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
KVPBFOM  DFLD  POS=(15,11),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'until',                                                +        
               POS=(15,20),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KVPBTOM  DFLD  POS=(15,26),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Refill status',                                        +        
               POS=(15,40),LTH=13,                                     +        
               ATTR=(PROT)                                                      
REFSTAT  DFLD  POS=(15,54),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Location',                                             +        
               POS=(16,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
ADLAGOMR DFLD  POS=(16,11),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
ADGANG   DFLD  POS=(16,15),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
PLATSFOM DFLD  POS=(16,19),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'until',                                                +        
               POS=(16,25),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
PLATSTOM DFLD  POS=(16,31),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Autorefillpart',                                       +        
               POS=(16,40),LTH=15,                                     +        
               ATTR=(PROT)                                                      
FLREFBEO DFLD  POS=(16,56),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Sup code',                                             +        
               POS=(17,02),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
KDERS    DFLD  POS=(17,11),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Weight < = >',                                         +        
               POS=(17,40),LTH=13,                                     +        
               ATTR=(PROT)                                                      
VKARTTKN DFLD  POS=(17,54),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
VKART    DFLD  POS=(17,56),LTH=7,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Stock balance < = >',                                  +        
               POS=(18,02),LTH=19,                                     +        
               ATTR=(NUM,PROT)                                                  
KVLSTKN  DFLD  POS=(18,22),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
KVLS     DFLD  POS=(18,24),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Volume < = >',                                         +        
               POS=(18,40),LTH=13,                                     +        
               ATTR=(PROT)                                                      
ARTNTTKN DFLD  POS=(18,54),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
VLARTNTO DFLD  POS=(18,56),LTH=9,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Supweek < = >',                                        +        
               POS=(19,02),LTH=13,                                     +        
               ATTR=(NUM,PROT)                                                  
SWEEKTKN DFLD  POS=(19,16),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
SWEEK    DFLD  POS=(19,18),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Part price    < = >',                                  +        
               POS=(19,40),LTH=19,                                     +        
               ATTR=(PROT)                                                      
ARTSTTKN DFLD  POS=(19,60),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
PRARTSTD DFLD  POS=(19,62),LTH=9,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Last sales date < = >',                                +        
               POS=(20,02),LTH=21,                                     +        
               ATTR=(NUM,PROT)                                                  
TIREFTKN DFLD  POS=(20,24),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
TIREFEFT DFLD  POS=(20,26),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Publ week < = >',                                      +        
               POS=(20,40),LTH=15,                                     +        
               ATTR=(NUM,PROT)                                                  
FINLVTKN DFLD  POS=(20,56),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
TIFINLV  DFLD  POS=(20,58),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Descr',                                                +        
               POS=(21,02),LTH=5,                                      +        
               ATTR=(PROT)                                                      
BEART    DFLD  POS=(21,08),LTH=25,                                     +        
               ATTR=(NOPROT,MOD)                                                
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W2O348N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W2N348,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W2I348N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W2N348                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0140,                                                +        
               LTH=40                                                           
         MFLD  KDARBTYP,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDPERSON,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDDC,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLKVROS,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDBUYER,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDBUYTO,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDBUY2,                                                 +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDBUY3,                                                 +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDBUY4,                                                 +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLONORD,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDPROJ1,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDPROJ2,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDPROJ3,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLAKDC,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEVNRCDC,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDPSLLOC,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLASEAS,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEVNRDC,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FKNGRFOM,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FKNGRTOM,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLREFILL,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRICE,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CLASS,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLREFBEO,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDREFTAB,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VKARTTKN,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VKART,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVPBFOM,                                                +        
               LTH=09,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVPBTOM,                                                +        
               LTH=09,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNTTKN,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VLARTNTO,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ADLAGOMR,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ADGANG,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PLATSFOM,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PLATSTOM,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDERS,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ARTSTTKN,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRARTSTD,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVLSTKN,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVLS,                                                   +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FINLVTKN,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TIFINLV,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TIREFTKN,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TIREFEFT,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BEART,                                                  +        
               LTH=27,                                                 +        
               ATTR=(YES)                                                       
         MFLD  MODEL,                                                  +        
               LTH=17,                                                 +        
               ATTR=(YES)                                                       
         MFLD  REFSTAT,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SWEEKTKN,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SWEEK,                                                  +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AIR,                                                    +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W2I348N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W2N348),                                           +        
               OPT=2,                                                  +        
               NXT=W2O348N1                                                     
MID      LPAGE SOR=(W2N348)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F8'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '23482',                                                +        
               LTH=5                                                            
         MFLD  (KDARBTYP,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDPERSON,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDDC,                                                  +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLKVROS,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDBUYER,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDBUYTO,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDBUY2,                                                +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDBUY3,                                                +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDBUY4,                                                +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLONORD,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDPROJ1,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDPROJ2,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDPROJ3,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLAKDC,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (LEVNRCDC,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KDPSLLOC,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLASEAS,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (LEVNRDC,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FKNGRFOM,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FKNGRTOM,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLREFILL,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (PRICE,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CLASS,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLREFBEO,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDREFTAB,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (VKARTTKN,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (VKART,                                                 +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVPBFOM,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVPBTOM,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNTTKN,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (VLARTNTO,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ADLAGOMR,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ADGANG,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PLATSFOM,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PLATSTOM,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDERS,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTSTTKN,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (PRARTSTD,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVLSTKN,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KVLS,                                                  +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FINLVTKN,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TIFINLV,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TIREFTKN,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TIREFEFT,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (BEART,                                                 +        
               '+++++++++++++++++++++++++'),                           +        
               LTH=25,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (MODEL,                                                 +        
               '+++++++++++++++'),                                     +        
               LTH=15,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (REFSTAT,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (SWEEKTKN,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (SWEEK,                                                 +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AIR,                                                   +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
