***********************************************************************         
* CREATED BY R040073   ON 92/03/30  AT 10:13                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'SELECTION SUPPLIER INFO         '                               
W2N323   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W2T323 7',                                           +        
               8='W2T323 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W2T323U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W2T323 7',                                          +        
               20='W2T323 8',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W2T323U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W2N323   DPAGE CURSOR=((6,18)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'SELECTION SUPPLIER INFO  ',                            +        
               POS=(1,10),LTH=25,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD0140  DFLD  POS=(1,40),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Supplier assessment ',                                 +        
               POS=(5,2),LTH=20,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Supplier  ',                                           +        
               POS=(6,2),LTH=10,                                       +        
               ATTR=(PROT)                                                      
IDLEVNR  DFLD  POS=(6,18),LTH=5,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Product grp',                                          +        
               POS=(7,2),LTH=11,                                       +        
               ATTR=(PROT)                                                      
KDPRODSL DFLD  POS=(7,18),LTH=2,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Mail',                                                 +        
               POS=(9,2),LTH=4,                                        +        
               ATTR=(PROT)                                                      
KDARBTYP DFLD  POS=(9,8),LTH=4,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDPERSON DFLD  POS=(9,14),LTH=3,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Procurer   From',                                      +        
               POS=(11,2),LTH=15,                                      +        
               ATTR=(PROT)                                                      
IDANSKFO DFLD  POS=(11,18),LTH=3,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  ' To',                                                  +        
               POS=(11,23),LTH=3,                                      +        
               ATTR=(PROT)                                                      
IDANSKTO DFLD  POS=(11,27),LTH=3,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Supplier  ',                                           +        
               POS=(12,2),LTH=10,                                      +        
               ATTR=(PROT)                                                      
IDLEVNR2 DFLD  POS=(12,18),LTH=5,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Future call off',                                      +        
               POS=(14,2),LTH=15,                                      +        
               ATTR=(PROT)                                                      
AVROPVEC DFLD  POS=(14,18),LTH=2,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Passed call off',                                      +        
               POS=(15,2),LTH=15,                                      +        
               ATTR=(PROT)                                                      
FLPASAVR DFLD  POS=(15,18),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Delivery note',                                        +        
               POS=(16,2),LTH=13,                                      +        
               ATTR=(PROT)                                                      
FLLEVBES DFLD  POS=(16,18),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'In a separate file  ',                                 +        
               POS=(16,21),LTH=20,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '13',                                                   +        
               POS=(21,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '14',                                                   +        
               POS=(21,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '15',                                                   +        
               POS=(21,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16',                                                   +        
               POS=(21,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 Whelp',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  ' VCP ',POS=(23,58)                                              
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W2O323N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W2N323,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W2I323N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W2N323                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0140,                                                +        
               LTH=40                                                           
         MFLD  IDLEVNR,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDPRODSL,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDARBTYP,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDPERSON,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDANSKFO,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDANSKTO,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDLEVNR2,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AVROPVEC,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLPASAVR,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLLEVBES,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W2I323N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W2N323),                                           +        
               OPT=2,                                                  +        
               NXT=W2O323N1                                                     
MID      LPAGE SOR=(W2N323)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '23231',                                                +        
               LTH=5                                                            
         MFLD  (IDLEVNR,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KDPRODSL,                                              +        
               '++++'),                                                +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDARBTYP,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDPERSON,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDANSKFO,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDANSKTO,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDLEVNR2,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (AVROPVEC,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLPASAVR,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLLEVBES,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
