***********************************************************************         
* CREATED BY PC30186   ON 97/06/10  AT 14:22                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'CROSS DOCKING                   '                               
W2F344   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W2T344 7',                                           +        
               8='W2T344 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W2T344U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W2F344   DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
TRANS1   DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
TRANS2   DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
TRANS3   DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
TRANS4   DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'CROSS DOCKING        ',                                +        
               POS=(1,11),LTH=21,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Part No.',                                             +        
               POS=(2,2),LTH=8,                                        +        
               ATTR=(NUM,PROT)                                                  
ARTNRIN  DFLD  POS=(2,12),LTH=9,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'DC',                                                   +        
               POS=(2,24),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDDCIN   DFLD  POS=(2,27),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
ARTNRUT  DFLD  POS=(3,12),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
IDDCUT   DFLD  POS=(3,27),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Descr',                                                +        
               POS=(5,2),LTH=5,                                        +        
               ATTR=(PROT)                                                      
BEARTSVE DFLD  POS=(5,8),LTH=25,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'CMD',                                                  +        
               POS=(6,02),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'DC',                                                   +        
               POS=(6,09),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'CD',                                                   +        
               POS=(6,18),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Days',                                                 +        
               POS=(6,24),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Release',                                              +        
               POS=(6,39),LTH=16,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Delay date',                                           +        
               POS=(6,59),LTH=10,                                      +        
               ATTR=(PROT)                                                      
CMD1     DFLD  POS=(7,03),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DC1      DFLD  POS=(7,09),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
CD1      DFLD  POS=(7,15),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
CDUT1    DFLD  POS=(7,18),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DGR1     DFLD  POS=(7,27),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
DGRUT1   DFLD  POS=(7,30),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
REL1     DFLD  POS=(7,45),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
RELUT1   DFLD  POS=(7,48),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DATIN1   DFLD  POS=(7,56),LTH=6,                                       +        
               ATTR=(NOPROT)                                                    
DATUT1   DFLD  POS=(7,63),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
CMD2     DFLD  POS=(8,03),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DC2      DFLD  POS=(8,09),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
CD2      DFLD  POS=(8,15),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
CDUT2    DFLD  POS=(8,18),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DGR2     DFLD  POS=(8,27),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
DGRUT2   DFLD  POS=(8,30),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
REL2     DFLD  POS=(8,45),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
RELUT2   DFLD  POS=(8,48),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DATIN2   DFLD  POS=(8,56),LTH=6,                                       +        
               ATTR=(NOPROT)                                                    
DATUT2   DFLD  POS=(8,63),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
CMD3     DFLD  POS=(9,03),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DC3      DFLD  POS=(9,09),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
CD3      DFLD  POS=(9,15),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
CDUT3    DFLD  POS=(9,18),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DGR3     DFLD  POS=(9,27),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
DGRUT3   DFLD  POS=(9,30),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
REL3     DFLD  POS=(9,45),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
RELUT3   DFLD  POS=(9,48),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DATIN3   DFLD  POS=(9,56),LTH=6,                                       +        
               ATTR=(NOPROT)                                                    
DATUT3   DFLD  POS=(9,63),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
CMD4     DFLD  POS=(10,03),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
DC4      DFLD  POS=(10,09),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
CD4      DFLD  POS=(10,15),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
CDUT4    DFLD  POS=(10,18),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGR4     DFLD  POS=(10,27),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
DGRUT4   DFLD  POS=(10,30),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
REL4     DFLD  POS=(10,45),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
RELUT4   DFLD  POS=(10,48),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DATIN4   DFLD  POS=(10,56),LTH=6,                                      +        
               ATTR=(NOPROT)                                                    
DATUT4   DFLD  POS=(10,63),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
CMD5     DFLD  POS=(11,03),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
DC5      DFLD  POS=(11,09),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
CD5      DFLD  POS=(11,15),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
CDUT5    DFLD  POS=(11,18),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGR5     DFLD  POS=(11,27),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
DGRUT5   DFLD  POS=(11,30),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
REL5     DFLD  POS=(11,45),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
RELUT5   DFLD  POS=(11,48),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DATIN5   DFLD  POS=(11,56),LTH=6,                                      +        
               ATTR=(NOPROT)                                                    
DATUT5   DFLD  POS=(11,63),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
CMD6     DFLD  POS=(12,03),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
DC6      DFLD  POS=(12,09),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
CD6      DFLD  POS=(12,15),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
CDUT6    DFLD  POS=(12,18),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGR6     DFLD  POS=(12,27),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
DGRUT6   DFLD  POS=(12,30),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
REL6     DFLD  POS=(12,45),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
RELUT6   DFLD  POS=(12,48),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DATIN6   DFLD  POS=(12,56),LTH=6,                                      +        
               ATTR=(NOPROT)                                                    
DATUT6   DFLD  POS=(12,63),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
CMD7     DFLD  POS=(13,03),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
DC7      DFLD  POS=(13,09),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
CD7      DFLD  POS=(13,15),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
CDUT7    DFLD  POS=(13,18),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGR7     DFLD  POS=(13,27),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
DGRUT7   DFLD  POS=(13,30),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
REL7     DFLD  POS=(13,45),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
RELUT7   DFLD  POS=(13,48),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DATIN7   DFLD  POS=(13,56),LTH=6,                                      +        
               ATTR=(NOPROT)                                                    
DATUT7   DFLD  POS=(13,63),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
CMD8     DFLD  POS=(14,03),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
DC8      DFLD  POS=(14,09),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
CD8      DFLD  POS=(14,15),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
CDUT8    DFLD  POS=(14,18),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGR8     DFLD  POS=(14,27),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
DGRUT8   DFLD  POS=(14,30),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
REL8     DFLD  POS=(14,45),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
RELUT8   DFLD  POS=(14,48),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DATIN8   DFLD  POS=(14,56),LTH=6,                                      +        
               ATTR=(NOPROT)                                                    
DATUT8   DFLD  POS=(14,63),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
CMD9     DFLD  POS=(15,03),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
DC9      DFLD  POS=(15,09),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
CD9      DFLD  POS=(15,15),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
CDUT9    DFLD  POS=(15,18),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGR9     DFLD  POS=(15,27),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
DGRUT9   DFLD  POS=(15,30),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
REL9     DFLD  POS=(15,45),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
RELUT9   DFLD  POS=(15,48),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DATIN9   DFLD  POS=(15,56),LTH=6,                                      +        
               ATTR=(NOPROT)                                                    
DATUT9   DFLD  POS=(15,63),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
CMD10    DFLD  POS=(16,03),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
DC10     DFLD  POS=(16,09),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
CD10     DFLD  POS=(16,15),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
CDUT10   DFLD  POS=(16,18),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGR10    DFLD  POS=(16,27),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
DGRUT10  DFLD  POS=(16,30),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
REL10    DFLD  POS=(16,45),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
RELUT10  DFLD  POS=(16,48),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DATIN10  DFLD  POS=(16,56),LTH=6,                                      +        
               ATTR=(NOPROT)                                                    
DATUT10  DFLD  POS=(16,63),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
CMD11    DFLD  POS=(17,03),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
DC11     DFLD  POS=(17,09),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
CD11     DFLD  POS=(17,15),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
CDUT11   DFLD  POS=(17,18),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGR11    DFLD  POS=(17,27),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
DGRUT11  DFLD  POS=(17,30),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
REL11    DFLD  POS=(17,45),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
RELUT11  DFLD  POS=(17,48),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DATIN11  DFLD  POS=(17,56),LTH=6,                                      +        
               ATTR=(NOPROT)                                                    
DATUT11  DFLD  POS=(17,63),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'New',                                                  +        
               POS=(19,02),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DCNY     DFLD  POS=(19,09),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
CDNY     DFLD  POS=(19,18),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
DGRNY    DFLD  POS=(19,30),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
RELNY    DFLD  POS=(19,48),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  '13             14             ',                       +        
               POS=(21,2),LTH=30,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,17),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,33),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,49),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '22      ',                                             +        
               POS=(22,65),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W2O344N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W2F344,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W2I344N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W2F344                                                       
         SEG                                                                    
         MFLD  TRANS1,                                                 +        
               LTH=1                                                            
         MFLD  TRANS2,                                                 +        
               LTH=1                                                            
         MFLD  TRANS3,                                                 +        
               LTH=1                                                            
         MFLD  TRANS4,                                                 +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  ARTNRIN,                                                +        
               LTH=9                                                            
         MFLD  IDDCIN,                                                 +        
               LTH=2                                                            
         MFLD  ARTNRUT,                                                +        
               LTH=9                                                            
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  BEARTSVE,                                               +        
               LTH=25                                                           
         MFLD  CMD1,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DC1,                                                    +        
               LTH=2                                                            
         MFLD  CD1,                                                    +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CDUT1,                                                  +        
               LTH=2                                                            
         MFLD  DGR1,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGRUT1,                                                 +        
               LTH=2                                                            
         MFLD  REL1,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RELUT1,                                                 +        
               LTH=1                                                            
         MFLD  DATIN1,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DATUT1,                                                 +        
               LTH=6                                                            
         MFLD  CMD2,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DC2,                                                    +        
               LTH=2                                                            
         MFLD  CD2,                                                    +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CDUT2,                                                  +        
               LTH=2                                                            
         MFLD  DGR2,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGRUT2,                                                 +        
               LTH=2                                                            
         MFLD  REL2,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RELUT2,                                                 +        
               LTH=1                                                            
         MFLD  DATIN2,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DATUT2,                                                 +        
               LTH=6                                                            
         MFLD  CMD3,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DC3,                                                    +        
               LTH=2                                                            
         MFLD  CD3,                                                    +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CDUT3,                                                  +        
               LTH=2                                                            
         MFLD  DGR3,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGRUT3,                                                 +        
               LTH=2                                                            
         MFLD  REL3,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RELUT3,                                                 +        
               LTH=1                                                            
         MFLD  DATIN3,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DATUT3,                                                 +        
               LTH=6                                                            
         MFLD  CMD4,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DC4,                                                    +        
               LTH=2                                                            
         MFLD  CD4,                                                    +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CDUT4,                                                  +        
               LTH=2                                                            
         MFLD  DGR4,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGRUT4,                                                 +        
               LTH=2                                                            
         MFLD  REL4,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RELUT4,                                                 +        
               LTH=1                                                            
         MFLD  DATIN4,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DATUT4,                                                 +        
               LTH=6                                                            
         MFLD  CMD5,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DC5,                                                    +        
               LTH=2                                                            
         MFLD  CD5,                                                    +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CDUT5,                                                  +        
               LTH=2                                                            
         MFLD  DGR5,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGRUT5,                                                 +        
               LTH=2                                                            
         MFLD  REL5,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RELUT5,                                                 +        
               LTH=1                                                            
         MFLD  DATIN5,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DATUT5,                                                 +        
               LTH=6                                                            
         MFLD  CMD6,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DC6,                                                    +        
               LTH=2                                                            
         MFLD  CD6,                                                    +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CDUT6,                                                  +        
               LTH=2                                                            
         MFLD  DGR6,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGRUT6,                                                 +        
               LTH=2                                                            
         MFLD  REL6,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RELUT6,                                                 +        
               LTH=1                                                            
         MFLD  DATIN6,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DATUT6,                                                 +        
               LTH=6                                                            
         MFLD  CMD7,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DC7,                                                    +        
               LTH=2                                                            
         MFLD  CD7,                                                    +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CDUT7,                                                  +        
               LTH=2                                                            
         MFLD  DGR7,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGRUT7,                                                 +        
               LTH=2                                                            
         MFLD  REL7,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RELUT7,                                                 +        
               LTH=1                                                            
         MFLD  DATIN7,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DATUT7,                                                 +        
               LTH=6                                                            
         MFLD  CMD8,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DC8,                                                    +        
               LTH=2                                                            
         MFLD  CD8,                                                    +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CDUT8,                                                  +        
               LTH=2                                                            
         MFLD  DGR8,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGRUT8,                                                 +        
               LTH=2                                                            
         MFLD  REL8,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RELUT8,                                                 +        
               LTH=1                                                            
         MFLD  DATIN8,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DATUT8,                                                 +        
               LTH=6                                                            
         MFLD  CMD9,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DC9,                                                    +        
               LTH=2                                                            
         MFLD  CD9,                                                    +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CDUT9,                                                  +        
               LTH=2                                                            
         MFLD  DGR9,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGRUT9,                                                 +        
               LTH=2                                                            
         MFLD  REL9,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RELUT9,                                                 +        
               LTH=1                                                            
         MFLD  DATIN9,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DATUT9,                                                 +        
               LTH=6                                                            
         MFLD  CMD10,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DC10,                                                   +        
               LTH=2                                                            
         MFLD  CD10,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CDUT10,                                                 +        
               LTH=2                                                            
         MFLD  DGR10,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGRUT10,                                                +        
               LTH=2                                                            
         MFLD  REL10,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RELUT10,                                                +        
               LTH=1                                                            
         MFLD  DATIN10,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DATUT10,                                                +        
               LTH=6                                                            
         MFLD  CMD11,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DC11,                                                   +        
               LTH=2                                                            
         MFLD  CD11,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CDUT11,                                                 +        
               LTH=2                                                            
         MFLD  DGR11,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGRUT11,                                                +        
               LTH=2                                                            
         MFLD  REL11,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RELUT11,                                                +        
               LTH=1                                                            
         MFLD  DATIN11,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DATUT11,                                                +        
               LTH=6                                                            
         MFLD  DCNY,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CDNY,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGRNY,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RELNY,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W2I344N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W2F344),                                           +        
               OPT=2,                                                  +        
               NXT=W2O344N1                                                     
MID      LPAGE SOR=(W2F344)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  TRANS1,                                                 +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  TRANS2,                                                 +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  TRANS3,                                                 +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  TRANS4,                                                 +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '23441',                                                +        
               LTH=5                                                            
         MFLD  (ARTNRIN,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNRUT,                                               +        
               '         '),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDDCIN,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (IDDCUT,                                                +        
               '  '),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD1,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CD1,                                                   +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGR1,                                                  +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (REL1,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DATIN1,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CMD2,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CD2,                                                   +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGR2,                                                  +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (REL2,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DATIN2,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CMD3,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CD3,                                                   +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGR3,                                                  +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (REL3,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DATIN3,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CMD4,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CD4,                                                   +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGR4,                                                  +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (REL4,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DATIN4,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CMD5,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CD5,                                                   +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGR5,                                                  +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (REL5,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DATIN5,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CMD6,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CD6,                                                   +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGR6,                                                  +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (REL6,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DATIN6,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CMD7,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CD7,                                                   +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGR7,                                                  +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (REL7,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DATIN7,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CMD8,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CD8,                                                   +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGR8,                                                  +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (REL8,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DATIN8,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CMD9,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CD9,                                                   +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGR9,                                                  +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (REL9,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DATIN9,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CMD10,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CD10,                                                  +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGR10,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (REL10,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DATIN10,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CMD11,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CD11,                                                  +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGR11,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (REL11,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DATIN11,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DCNY,                                                  +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CDNY,                                                  +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGRNY,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RELNY,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
