***********************************************************************         
* CREATED BY A039186   ON 15/10/21  AT 14:20                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'PURCHASE NDC/SDC                '                               
W2N392   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W2T392 7',                                           +        
               8='W2T392 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W2T392U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W2T391  ',                                          +        
               14='W2T353  ',                                          +        
               15='W2T354  ',                                          +        
               16='W0T501  ',                                          +        
               17='W2T105  ',                                          +        
               18='W2T107  ',                                          +        
               19='W2T341  ',                                          +        
               20='W0T501  ',                                          +        
               21='W2T359  ',                                          +        
               22='WHELP   ',                                          +        
               23='W2T392V ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W2N392   DPAGE CURSOR=((2,10)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'PURCHASE DC11',                                        +        
               POS=(1,12),LTH=13,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Part No',                                              +        
               POS=(2,2),LTH=7,                                        +        
               ATTR=(ALPHA,PROT)                                                
ARTNRIN  DFLD  POS=(2,10),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
DCREFIN  DFLD  POS=(2,22),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Type',                                                 +        
               POS=(2,33),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
TYPEIN   DFLD  POS=(2,38),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Buyer',                                                +        
               POS=(2,44),LTH=5,                                       +        
               ATTR=(PROT)                                                      
BUYERIN  DFLD  POS=(2,50),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Status',                                               +        
               POS=(2,54),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
STATUSIN DFLD  POS=(2,61),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
ARTNRUT  DFLD  POS=(3,10),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
DCREFUT  DFLD  POS=(3,22),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
TYPEUT   DFLD  POS=(3,38),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
BUYERUT  DFLD  POS=(3,50),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
STATUSUT DFLD  POS=(3,61),LTH=12,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Ot',                                                   +        
               POS=(5,2),LTH=2,                                        +        
               ATTR=(PROT)                                                      
FLD0505  DFLD  POS=(5,5),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
FLD0507  DFLD  POS=(5,7),LTH=5,                                        +        
               ATTR=(NUM,PROT,HI,MOD)                                           
BEN      DFLD  POS=(5,13),LTH=22,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FLD0536  DFLD  POS=(5,36),LTH=21,                                      +        
               ATTR=(PROT,HI,MOD)                                               
ANTART   DFLD  POS=(5,65),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'to review',                                            +        
               POS=(5,71),LTH=9,                                       +        
               ATTR=(NUM,PROT)                                                  
FOREGAAR DFLD  POS=(6,2),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
FLD0611  DFLD  POS=(6,11),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'L slsdte',                                             +        
               POS=(6,19),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0629  DFLD  POS=(6,29),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Qual block',                                           +        
               POS=(6,36),LTH=10,                                      +        
               ATTR=(PROT)                                                      
FLD0647  DFLD  POS=(6,47),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'FG',                                                   +        
               POS=(6,49),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0652  DFLD  POS=(6,52),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Model',                                                +        
               POS=(6,58),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
MOD1     DFLD  POS=(6,64),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
MOD2     DFLD  POS=(6,70),LTH=5,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
MOD3     DFLD  POS=(6,76),LTH=5,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
AKTAAR   DFLD  POS=(7,2),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
FLD0711  DFLD  POS=(7,11),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'L bindte',                                             +        
               POS=(7,19),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0729  DFLD  POS=(7,29),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Alw air',                                              +        
               POS=(07,36),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD0747  DFLD  POS=(07,47),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'PG',                                                   +        
               POS=(7,49),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0755  DFLD  POS=(7,55),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Pubw',                                                 +        
               POS=(7,58),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0763  DFLD  POS=(7,63),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'EOP',                                                  +        
               POS=(7,69),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0772  DFLD  POS=(7,73),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0802  DFLD  POS=(8,2),LTH=2,                                        +        
               ATTR=(PROT,MOD)                                                  
FLD0805  DFLD  POS=(8,5),LTH=5,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
FLD0811  DFLD  POS=(8,11),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  'L reford',                                             +        
               POS=(8,19),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0829  DFLD  POS=(8,29),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Aut refill',                                           +        
               POS=(8,36),LTH=10,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD0847  DFLD  POS=(8,47),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Wilson',                                               +        
               POS=(8,49),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0856  DFLD  POS=(8,56),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Weight',                                               +        
               POS=(8,58),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0868  DFLD  POS=(8,68),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0902  DFLD  POS=(9,2),LTH=2,                                        +        
               ATTR=(PROT,MOD)                                                  
FLD0905  DFLD  POS=(9,5),LTH=5,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
FLD0911  DFLD  POS=(9,11),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  'Loc',                                                  +        
               POS=(9,19),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0924  DFLD  POS=(9,24),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0927  DFLD  POS=(9,27),LTH=2,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
FLD0930  DFLD  POS=(9,30),LTH=5,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  'Repl',                                                 +        
               POS=(9,36),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0943  DFLD  POS=(9,43),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Volume',                                               +        
               POS=(9,58),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0967  DFLD  POS=(9,67),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1002  DFLD  POS=(10,2),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD1005  DFLD  POS=(10,5),LTH=5,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
FLD1011  DFLD  POS=(10,11),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  'Orderpt',                                              +        
               POS=(10,19),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1028  DFLD  POS=(10,28),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Replby',                                               +        
               POS=(10,36),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1043  DFLD  POS=(10,43),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1053  DFLD  POS=(10,53),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Code',                                                 +        
               POS=(10,58),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD1063  DFLD  POS=(10,63),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Q0',                                                   +        
               POS=(10,67),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1070  DFLD  POS=(10,70),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1102  DFLD  POS=(11,2),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD1105  DFLD  POS=(11,5),LTH=5,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
FLD1111  DFLD  POS=(11,11),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  'Refillqt',                                             +        
               POS=(11,19),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1128  DFLD  POS=(11,28),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Std price',                                            +        
               POS=(11,36),LTH=9,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1146  DFLD  POS=(11,46),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Q1',                                                   +        
               POS=(11,67),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1170  DFLD  POS=(11,70),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1202  DFLD  POS=(12,2),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD1205  DFLD  POS=(12,5),LTH=5,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
FLD1211  DFLD  POS=(12,11),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  'Fc-sep',                                               +        
               POS=(12,19),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1227  DFLD  POS=(12,27),LTH=8,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Air cost  SEK',                                        +        
               POS=(12,36),LTH=13,                                     +        
               ATTR=(NUM,PROT)                                                  
FLD1250  DFLD  POS=(12,50),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Q3',                                                   +        
               POS=(12,67),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1270  DFLD  POS=(12,70),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1302  DFLD  POS=(13,2),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD1305  DFLD  POS=(13,5),LTH=5,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
FLD1311  DFLD  POS=(13,11),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  'Fc-tot',                                               +        
               POS=(13,19),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1327  DFLD  POS=(13,27),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'PubwDC',                                               +        
               POS=(13,36),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1344  DFLD  POS=(13,44),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Q4',                                                   +        
               POS=(13,67),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1370  DFLD  POS=(13,70),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1402  DFLD  POS=(14,2),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD1405  DFLD  POS=(14,5),LTH=5,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
FLD1411  DFLD  POS=(14,11),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  'Balance',                                              +        
               POS=(14,19),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1427  DFLD  POS=(14,27),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Ref DC',                                               +        
               POS=(14,36),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
IDDCREF  DFLD  POS=(14,43),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Seas',                                                 +        
               POS=(14,46),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1451  DFLD  POS=(14,51),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Seas Fcpl',                                            +        
               POS=(14,53),LTH=9,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1463  DFLD  POS=(14,63),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'MOQ',                                                  +        
               POS=(14,65),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1469  DFLD  POS=(14,69),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1502  DFLD  POS=(15,2),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD1505  DFLD  POS=(15,5),LTH=5,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
FLD1511  DFLD  POS=(15,11),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  'AK',                                                   +        
               POS=(15,19),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1527  DFLD  POS=(15,27),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Preadv',                                               +        
               POS=(15,36),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1543  DFLD  POS=(15,43),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Forecast',                                             +        
               POS=(15,51),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1560  DFLD  POS=(15,60),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1602  DFLD  POS=(16,2),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD1605  DFLD  POS=(16,5),LTH=5,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
FLD1611  DFLD  POS=(16,11),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  'Ordered',                                              +        
               POS=(16,19),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1627  DFLD  POS=(16,27),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Avail',                                                +        
               POS=(16,36),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1643  DFLD  POS=(16,42),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'AK',                                                   +        
               POS=(16,51),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1654  DFLD  POS=(16,54),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'BO',                                                   +        
               POS=(16,62),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1665  DFLD  POS=(16,65),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1702  DFLD  POS=(17,2),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD1705  DFLD  POS=(17,5),LTH=5,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
FLD1711  DFLD  POS=(17,11),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  'Retl BO',                                              +        
               POS=(17,19),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1727  DFLD  POS=(17,27),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'BO DC',                                                +        
               POS=(17,36),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1743  DFLD  POS=(17,43),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Qty',                                                  +        
               POS=(17,51),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1755  DFLD  POS=(17,55),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Eta',                                                  +        
               POS=(17,62),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1766  DFLD  POS=(17,66),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1802  DFLD  POS=(18,2),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD1805  DFLD  POS=(18,5),LTH=5,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
FLD1811  DFLD  POS=(18,11),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  'Crit BO',                                              +        
               POS=(18,19),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1827  DFLD  POS=(18,27),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'DirD CDC',                                             +        
               POS=(18,36),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1845  DFLD  POS=(18,45),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Qty',                                                  +        
               POS=(18,51),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD1855  DFLD  POS=(18,55),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Eta',                                                  +        
               POS=(18,62),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1866  DFLD  POS=(18,66),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD1902  DFLD  POS=(19,2),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD1905  DFLD  POS=(19,5),LTH=5,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
FLD1911  DFLD  POS=(19,11),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  'Supweek',                                              +        
               POS=(19,19),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1932  DFLD  POS=(19,32),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Comm: 1',                                              +        
               POS=(19,36),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1944  DFLD  POS=(19,44),LTH=36,                                     +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Curr w',                                               +        
               POS=(20,2),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD2009  DFLD  POS=(20,9),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD2011  DFLD  POS=(20,11),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  'Purchqty',                                             +        
               POS=(20,19),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD2028  DFLD  POS=(20,28),LTH=7,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Comm: 2',                                              +        
               POS=(20,36),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD2044  DFLD  POS=(20,44),LTH=36,                                     +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Pf10 WHELP Pf11 Update Pf12 Logoff',                   +        
               POS=(22,2),LTH=34,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W2O392N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W2N392,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W2I392N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W2N392                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  ARTNRIN,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNRUT,                                                +        
               LTH=9                                                            
         MFLD  DCREFIN,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DCREFUT,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TYPEIN,                                                 +        
               LTH=1                                                            
         MFLD  TYPEUT,                                                 +        
               LTH=5                                                            
         MFLD  BUYERIN,                                                +        
               LTH=3                                                            
         MFLD  BUYERUT,                                                +        
               LTH=3                                                            
         MFLD  STATUSIN,                                               +        
               LTH=1                                                            
         MFLD  STATUSUT,                                               +        
               LTH=12                                                           
         MFLD  FLD0505,                                                +        
               LTH=1                                                            
         MFLD  FLD0507,                                                +        
               LTH=5                                                            
         MFLD  BEN,                                                    +        
               LTH=22                                                           
         MFLD  FLD0536,                                                +        
               LTH=21                                                           
         MFLD  ANTART,                                                 +        
               LTH=5                                                            
         MFLD  FOREGAAR,                                               +        
               LTH=4                                                            
         MFLD  FLD0611,                                                +        
               LTH=7                                                            
         MFLD  AKTAAR,                                                 +        
               LTH=4                                                            
         MFLD  FLD0711,                                                +        
               LTH=7                                                            
         MFLD  FLD0802,                                                +        
               LTH=2                                                            
         MFLD  FLD0805,                                                +        
               LTH=5                                                            
         MFLD  FLD0811,                                                +        
               LTH=7                                                            
         MFLD  FLD0902,                                                +        
               LTH=2                                                            
         MFLD  FLD0905,                                                +        
               LTH=5                                                            
         MFLD  FLD0911,                                                +        
               LTH=7                                                            
         MFLD  FLD1002,                                                +        
               LTH=2                                                            
         MFLD  FLD1005,                                                +        
               LTH=5                                                            
         MFLD  FLD1011,                                                +        
               LTH=7                                                            
         MFLD  FLD1102,                                                +        
               LTH=2                                                            
         MFLD  FLD1105,                                                +        
               LTH=5                                                            
         MFLD  FLD1111,                                                +        
               LTH=7                                                            
         MFLD  FLD1202,                                                +        
               LTH=2                                                            
         MFLD  FLD1205,                                                +        
               LTH=5                                                            
         MFLD  FLD1211,                                                +        
               LTH=7                                                            
         MFLD  FLD1302,                                                +        
               LTH=2                                                            
         MFLD  FLD1305,                                                +        
               LTH=5                                                            
         MFLD  FLD1311,                                                +        
               LTH=7                                                            
         MFLD  FLD1402,                                                +        
               LTH=2                                                            
         MFLD  FLD1405,                                                +        
               LTH=5                                                            
         MFLD  FLD1411,                                                +        
               LTH=7                                                            
         MFLD  FLD1502,                                                +        
               LTH=2                                                            
         MFLD  FLD1505,                                                +        
               LTH=5                                                            
         MFLD  FLD1511,                                                +        
               LTH=7                                                            
         MFLD  FLD1602,                                                +        
               LTH=2                                                            
         MFLD  FLD1605,                                                +        
               LTH=5                                                            
         MFLD  FLD1611,                                                +        
               LTH=7                                                            
         MFLD  FLD1702,                                                +        
               LTH=2                                                            
         MFLD  FLD1705,                                                +        
               LTH=5                                                            
         MFLD  FLD1711,                                                +        
               LTH=7                                                            
         MFLD  FLD1802,                                                +        
               LTH=2                                                            
         MFLD  FLD1805,                                                +        
               LTH=5                                                            
         MFLD  FLD1811,                                                +        
               LTH=7                                                            
         MFLD  FLD1902,                                                +        
               LTH=2                                                            
         MFLD  FLD1905,                                                +        
               LTH=5                                                            
         MFLD  FLD1911,                                                +        
               LTH=7                                                            
         MFLD  FLD2009,                                                +        
               LTH=1                                                            
         MFLD  FLD2011,                                                +        
               LTH=7                                                            
         MFLD  FLD0629,                                                +        
               LTH=6                                                            
         MFLD  FLD0729,                                                +        
               LTH=6                                                            
         MFLD  FLD0829,                                                +        
               LTH=6                                                            
         MFLD  FLD0924,                                                +        
               LTH=2                                                            
         MFLD  FLD0927,                                                +        
               LTH=2                                                            
         MFLD  FLD0930,                                                +        
               LTH=5                                                            
         MFLD  FLD1028,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1128,                                                +        
               LTH=7                                                            
         MFLD  FLD1227,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1427,                                                +        
               LTH=8                                                            
         MFLD  FLD1527,                                                +        
               LTH=8                                                            
         MFLD  FLD1627,                                                +        
               LTH=8                                                            
         MFLD  FLD1727,                                                +        
               LTH=8                                                            
         MFLD  FLD1827,                                                +        
               LTH=8                                                            
         MFLD  FLD1932,                                                +        
               LTH=3                                                            
         MFLD  FLD2028,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0647,                                                +        
               LTH=1                                                            
         MFLD  FLD0652,                                                +        
               LTH=5                                                            
         MFLD  MOD1,                                                   +        
               LTH=5                                                            
         MFLD  MOD2,                                                   +        
               LTH=5                                                            
         MFLD  MOD3,                                                   +        
               LTH=5                                                            
         MFLD  FLD0747,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0755,                                                +        
               LTH=2                                                            
         MFLD  FLD0763,                                                +        
               LTH=5                                                            
         MFLD  FLD0772,                                                +        
               LTH=4                                                            
         MFLD  FLD0847,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0856,                                                +        
               LTH=1                                                            
         MFLD  FLD0868,                                                +        
               LTH=7                                                            
         MFLD  FLD0943,                                                +        
               LTH=9                                                            
         MFLD  FLD0967,                                                +        
               LTH=10                                                           
         MFLD  FLD1043,                                                +        
               LTH=9                                                            
         MFLD  FLD1053,                                                +        
               LTH=4                                                            
         MFLD  FLD1063,                                                +        
               LTH=2                                                            
         MFLD  FLD1070,                                                +        
               LTH=5                                                            
         MFLD  FLD1146,                                                +        
               LTH=10                                                           
         MFLD  FLD1170,                                                +        
               LTH=5                                                            
         MFLD  FLD1250,                                                +        
               LTH=7                                                            
         MFLD  FLD1270,                                                +        
               LTH=5                                                            
         MFLD  FLD1327,                                                +        
               LTH=8                                                            
         MFLD  FLD1344,                                                +        
               LTH=5                                                            
         MFLD  FLD1370,                                                +        
               LTH=5                                                            
         MFLD  IDDCREF,                                                +        
               LTH=2                                                            
         MFLD  FLD1451,                                                +        
               LTH=1                                                            
         MFLD  FLD1463,                                                +        
               LTH=1                                                            
         MFLD  FLD1469,                                                +        
               LTH=7                                                            
         MFLD  FLD1543,                                                +        
               LTH=7                                                            
         MFLD  FLD1643,                                                +        
               LTH=8                                                            
         MFLD  FLD1654,                                                +        
               LTH=7                                                            
         MFLD  FLD1665,                                                +        
               LTH=7                                                            
         MFLD  FLD1560,                                                +        
               LTH=8                                                            
         MFLD  FLD1743,                                                +        
               LTH=7                                                            
         MFLD  FLD1845,                                                +        
               LTH=4                                                            
         MFLD  FLD1755,                                                +        
               LTH=6                                                            
         MFLD  FLD1766,                                                +        
               LTH=6                                                            
         MFLD  FLD1855,                                                +        
               LTH=6                                                            
         MFLD  FLD1866,                                                +        
               LTH=6                                                            
         MFLD  FLD1944,                                                +        
               LTH=38,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD2044,                                                +        
               LTH=38,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W2I392N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W2N392),                                           +        
               OPT=2,                                                  +        
               NXT=W2O392N1                                                     
MID      LPAGE SOR=(W2N392)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F9'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '23922',                                                +        
               LTH=5                                                            
         MFLD  (ARTNRIN,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNRUT,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DCREFIN,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DCREFUT,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TYPEIN,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TYPEUT,                                                +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (BUYERIN,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (BUYERUT,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (STATUSIN,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (STATUSUT,                                              +        
               '++++++++++++'),                                        +        
               LTH=12,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLD0505,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0507,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1227,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0747,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0847,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1944,                                               +        
               '++++++++++++++++++++++++++++++++++++'),                +        
               LTH=36,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLD2028,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD2044,                                               +        
               '++++++++++++++++++++++++++++++++++++'),                +        
               LTH=36,                                                 +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
