***********************************************************************         
* CREATED BY V006144   ON 03/11/25  AT 08:59                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'CAMPAIGN INFORMATION - OVERVIEW '                               
W2N313   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T553 9',                                           +        
               7='W2T313 7',                                           +        
               8='W2T313 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W2T313U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='W0T501  ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((2,14)),                                        +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'CAMPAIGN INFO. - OVERVIEW',                            +        
               POS=(1,12),LTH=25,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Campaign no',                                          +        
               POS=(2,2),LTH=11,                                       +        
               ATTR=(NUM,PROT)                                                  
KAMPIN   DFLD  POS=(2,14),LTH=7,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Campaign group',                                       +        
               POS=(2,23),LTH=14,                                      +        
               ATTR=(PROT)                                                      
KGRPIN   DFLD  POS=(2,38),LTH=7,                                       +        
               ATTR=(NOPROT)                                                    
KAMPUT   DFLD  POS=(3,14),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
KGRPUT   DFLD  POS=(3,38),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'S  Campaign  Type  No of cars  Start   Stop    Resp rat+        
               e %',                                                   +        
               POS=(5,2),LTH=58,                                       +        
               ATTR=(PROT)                                                      
CMD1     DFLD  POS=(6,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
KAMP1    DFLD  POS=(6,5),LTH=7,                                        +        
               ATTR=(PROT)                                                      
KDKAMPRA DFLD  POS=(6,16),LTH=1,                                       +        
               ATTR=(PROT)                                                      
NOCARS1  DFLD  POS=(6,21),LTH=7,                                       +        
               ATTR=(PROT)                                                      
TISTA1   DFLD  POS=(6,33),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
TISTO1   DFLD  POS=(6,41),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
RESPRTIN DFLD  POS=(6,49),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
RESPRTUT DFLD  POS=(6,53),LTH=3,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
CMD2     DFLD  POS=(7,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
KAMP2    DFLD  POS=(7,5),LTH=7,                                        +        
               ATTR=(PROT)                                                      
NOCARS2  DFLD  POS=(7,21),LTH=7,                                       +        
               ATTR=(PROT)                                                      
TISTA2   DFLD  POS=(7,33),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
TISTO2   DFLD  POS=(7,41),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
CMD3     DFLD  POS=(8,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
KAMP3    DFLD  POS=(8,5),LTH=7,                                        +        
               ATTR=(PROT)                                                      
NOCARS3  DFLD  POS=(8,21),LTH=7,                                       +        
               ATTR=(PROT)                                                      
TISTA3   DFLD  POS=(8,33),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
TISTO3   DFLD  POS=(8,41),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
CMD4     DFLD  POS=(9,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
KAMP4    DFLD  POS=(9,5),LTH=7,                                        +        
               ATTR=(PROT)                                                      
NOCARS4  DFLD  POS=(9,21),LTH=7,                                       +        
               ATTR=(PROT)                                                      
TISTA4   DFLD  POS=(9,33),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
TISTO4   DFLD  POS=(9,41),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
CMD5     DFLD  POS=(10,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
KAMP5    DFLD  POS=(10,5),LTH=7,                                       +        
               ATTR=(PROT)                                                      
NOCARS5  DFLD  POS=(10,21),LTH=7,                                      +        
               ATTR=(PROT)                                                      
TISTA5   DFLD  POS=(10,33),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
TISTO5   DFLD  POS=(10,41),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
CMD6     DFLD  POS=(11,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
KAMP6    DFLD  POS=(11,5),LTH=7,                                       +        
               ATTR=(PROT)                                                      
NOCARS6  DFLD  POS=(11,21),LTH=7,                                      +        
               ATTR=(PROT)                                                      
TISTA6   DFLD  POS=(11,33),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
TISTO6   DFLD  POS=(11,41),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
CMD7     DFLD  POS=(12,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
KAMP7    DFLD  POS=(12,5),LTH=7,                                       +        
               ATTR=(PROT)                                                      
NOCARS7  DFLD  POS=(12,21),LTH=7,                                      +        
               ATTR=(PROT)                                                      
TISTA7   DFLD  POS=(12,33),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
TISTO7   DFLD  POS=(12,41),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Total:',                                               +        
               POS=(13,8),LTH=6,                                       +        
               ATTR=(PROT)                                                      
TOTAL    DFLD  POS=(13,21),LTH=7,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Comments',                                             +        
               POS=(15,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
NOTE1    DFLD  POS=(16,2),LTH=79,                                      +        
               ATTR=(NOPROT)                                                    
NOTE2    DFLD  POS=(17,2),LTH=79,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Type  Start   Stop',                                   +        
               POS=(19,2),LTH=18,                                      +        
               ATTR=(PROT)                                                      
KDKAMP   DFLD  POS=(20,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
TISTAIN  DFLD  POS=(20,8),LTH=6,                                       +        
               ATTR=(NOPROT)                                                    
TISTOIN  DFLD  POS=(20,16),LTH=6,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'PF6 CAMP TXT  PF10 WHELP  PF11 UPDATE',                +        
               POS=(22,2),LTH=37,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,MOD)                                                  
         FMTEND                                                                 
W2I313N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W2N313),                                           +        
               OPT=2,                                                  +        
               NXT=W2O313N1                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '23132',                                                +        
               LTH=5                                                            
         MFLD  (KAMPIN,                                                +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KAMPUT,                                                +        
               '       '),                                             +        
               LTH=7,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KGRPIN,                                                +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KGRPUT,                                                +        
               '       '),                                             +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (CMD1,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD2,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD3,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD4,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD5,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD6,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD7,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TISTA1,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (TISTA2,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (TISTA3,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (TISTA4,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (TISTA5,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (TISTA6,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (TISTA7,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (TISTO1,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (TISTO2,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (TISTO3,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (TISTO4,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (TISTO5,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (TISTO6,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (TISTO7,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (RESPRTIN,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RESPRTUT,                                              +        
               '   '),                                                 +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (NOTE1,                                                 +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               ++++++++++++++++++++++++'),                             +        
               LTH=79,                                                 +        
               FILL=X'40'                                                       
         MFLD  (NOTE2,                                                 +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               ++++++++++++++++++++++++'),                             +        
               LTH=79,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KDKAMP,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TISTAIN,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (TISTOIN,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
W2O313N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W2N313,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W2I313N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  KAMPIN,                                                 +        
               LTH=7                                                            
         MFLD  KAMPUT,                                                 +        
               LTH=7                                                            
         MFLD  KGRPIN,                                                 +        
               LTH=7                                                            
         MFLD  KGRPUT,                                                 +        
               LTH=7                                                            
         MFLD  CMD1,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KAMP1,                                                  +        
               LTH=7                                                            
         MFLD  NOCARS1,                                                +        
               LTH=7                                                            
         MFLD  TISTA1,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TISTO1,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CMD2,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KAMP2,                                                  +        
               LTH=7                                                            
         MFLD  NOCARS2,                                                +        
               LTH=7                                                            
         MFLD  TISTA2,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TISTO2,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CMD3,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KAMP3,                                                  +        
               LTH=7                                                            
         MFLD  NOCARS3,                                                +        
               LTH=7                                                            
         MFLD  TISTA3,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TISTO3,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CMD4,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KAMP4,                                                  +        
               LTH=7                                                            
         MFLD  NOCARS4,                                                +        
               LTH=7                                                            
         MFLD  TISTA4,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TISTO4,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CMD5,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KAMP5,                                                  +        
               LTH=7                                                            
         MFLD  NOCARS5,                                                +        
               LTH=7                                                            
         MFLD  TISTA5,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TISTO5,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CMD6,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KAMP6,                                                  +        
               LTH=7                                                            
         MFLD  NOCARS6,                                                +        
               LTH=7                                                            
         MFLD  TISTA6,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TISTO6,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CMD7,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KAMP7,                                                  +        
               LTH=7                                                            
         MFLD  NOCARS7,                                                +        
               LTH=7                                                            
         MFLD  TISTA7,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TISTO7,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDKAMPRA,                                               +        
               LTH=1                                                            
         MFLD  RESPRTIN,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RESPRTUT,                                               +        
               LTH=3                                                            
         MFLD  TOTAL,                                                  +        
               LTH=7                                                            
         MFLD  NOTE1,                                                  +        
               LTH=81,                                                 +        
               ATTR=(YES)                                                       
         MFLD  NOTE2,                                                  +        
               LTH=81,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDKAMP,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TISTAIN,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TISTOIN,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
