***********************************************************************         
* CREATED BY PC30186   ON 97/03/20  AT 16:31                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'ON ORDER FROM LOCAL VENDORS NDC '                               
W2N358   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W2T358 7',                                           +        
               8='W2T358 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W2T358U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W2T351  ',                                          +        
               14='W2T352  ',                                          +        
               15='W2T353  ',                                          +        
               16='W2T354  ',                                          +        
               17='W2T355  ',                                          +        
               18='W2T356  ',                                          +        
               19='W2T357  ',                                          +        
               20='W2T358  ',                                          +        
               21='W2T359  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,11)),                                        +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'ON ORDER FROM LOCAL VENDORS',                          +        
               POS=(1,12),LTH=27,                                      +        
               ATTR=(PROT)                                                      
TEMSFEL  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Part No.',                                             +        
               POS=(2,2),LTH=8,                                        +        
               ATTR=(NUM,PROT)                                                  
IDARTIN  DFLD  POS=(2,11),LTH=9,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'DC',                                                   +        
               POS=(2,21),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
IDDCIN   DFLD  POS=(2,24),LTH=2,                                       +        
               ATTR=(ALPHA,NOPROT,MOD)                                          
IDARTUT  DFLD  POS=(3,12),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
IDDCUT   DFLD  POS=(3,25),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Description:',                                         +        
               POS=(5,2),LTH=12,                                       +        
               ATTR=(PROT)                                                      
BEART    DFLD  POS=(5,15),LTH=25,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'DC  Vendor  Order date  Order No    Order qty',        +        
               POS=(6,2),LTH=45,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'New',                                                  +        
               POS=(6,52),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'ETA',                                                  +        
               POS=(6,60),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'New',                                                  +        
               POS=(6,68),LTH=3,                                       +        
               ATTR=(PROT)                                                      
A1       DFLD  POS=(7,2),LTH=2,                                        +        
               ATTR=(PROT,MOD)                                                  
A2       DFLD  POS=(7,7),LTH=5,                                        +        
               ATTR=(PROT)                                                      
A3       DFLD  POS=(7,18),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
A4       DFLD  POS=(7,26),LTH=10,                                      +        
               ATTR=(PROT)                                                      
A5       DFLD  POS=(7,41),LTH=6,                                       +        
               ATTR=(PROT)                                                      
A6       DFLD  POS=(7,49),LTH=6,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
A7       DFLD  POS=(7,57),LTH=6,                                       +        
               ATTR=(PROT)                                                      
A8       DFLD  POS=(7,65),LTH=6,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
A9       DFLD  POS=(7,72),LTH=6,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
B1       DFLD  POS=(8,2),LTH=2,                                        +        
               ATTR=(PROT,MOD)                                                  
B2       DFLD  POS=(8,7),LTH=5,                                        +        
               ATTR=(PROT)                                                      
B3       DFLD  POS=(8,18),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
B4       DFLD  POS=(8,26),LTH=10,                                      +        
               ATTR=(PROT)                                                      
B5       DFLD  POS=(8,41),LTH=6,                                       +        
               ATTR=(PROT)                                                      
B6       DFLD  POS=(8,49),LTH=6,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
B7       DFLD  POS=(8,57),LTH=6,                                       +        
               ATTR=(PROT)                                                      
B8       DFLD  POS=(8,65),LTH=6,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
B9       DFLD  POS=(8,72),LTH=6,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
C1       DFLD  POS=(9,2),LTH=2,                                        +        
               ATTR=(PROT,MOD)                                                  
C2       DFLD  POS=(9,7),LTH=5,                                        +        
               ATTR=(PROT)                                                      
C3       DFLD  POS=(9,18),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
C4       DFLD  POS=(9,26),LTH=10,                                      +        
               ATTR=(PROT)                                                      
C5       DFLD  POS=(9,41),LTH=6,                                       +        
               ATTR=(PROT)                                                      
C6       DFLD  POS=(9,49),LTH=6,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
C7       DFLD  POS=(9,57),LTH=6,                                       +        
               ATTR=(PROT)                                                      
C8       DFLD  POS=(9,65),LTH=6,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
C9       DFLD  POS=(9,72),LTH=6,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
D1       DFLD  POS=(10,2),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
D2       DFLD  POS=(10,7),LTH=5,                                       +        
               ATTR=(PROT)                                                      
D3       DFLD  POS=(10,18),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
D4       DFLD  POS=(10,26),LTH=10,                                     +        
               ATTR=(PROT)                                                      
D5       DFLD  POS=(10,41),LTH=6,                                      +        
               ATTR=(PROT)                                                      
D6       DFLD  POS=(10,49),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
D7       DFLD  POS=(10,57),LTH=6,                                      +        
               ATTR=(PROT)                                                      
D8       DFLD  POS=(10,65),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
D9       DFLD  POS=(10,72),LTH=6,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
E1       DFLD  POS=(11,2),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
E2       DFLD  POS=(11,7),LTH=5,                                       +        
               ATTR=(PROT)                                                      
E3       DFLD  POS=(11,18),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
E4       DFLD  POS=(11,26),LTH=10,                                     +        
               ATTR=(PROT)                                                      
E5       DFLD  POS=(11,41),LTH=6,                                      +        
               ATTR=(PROT)                                                      
E6       DFLD  POS=(11,49),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
E7       DFLD  POS=(11,57),LTH=6,                                      +        
               ATTR=(PROT)                                                      
E8       DFLD  POS=(11,65),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
E9       DFLD  POS=(11,72),LTH=6,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
F1       DFLD  POS=(12,2),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
F2       DFLD  POS=(12,7),LTH=5,                                       +        
               ATTR=(PROT)                                                      
F3       DFLD  POS=(12,18),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
F4       DFLD  POS=(12,26),LTH=10,                                     +        
               ATTR=(PROT)                                                      
F5       DFLD  POS=(12,41),LTH=6,                                      +        
               ATTR=(PROT)                                                      
F6       DFLD  POS=(12,49),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
F7       DFLD  POS=(12,57),LTH=6,                                      +        
               ATTR=(PROT)                                                      
F8       DFLD  POS=(12,65),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
F9       DFLD  POS=(12,72),LTH=6,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
G1       DFLD  POS=(13,2),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
G2       DFLD  POS=(13,7),LTH=5,                                       +        
               ATTR=(PROT)                                                      
G3       DFLD  POS=(13,18),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
G4       DFLD  POS=(13,26),LTH=10,                                     +        
               ATTR=(PROT)                                                      
G5       DFLD  POS=(13,41),LTH=6,                                      +        
               ATTR=(PROT)                                                      
G6       DFLD  POS=(13,49),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
G7       DFLD  POS=(13,57),LTH=6,                                      +        
               ATTR=(PROT)                                                      
G8       DFLD  POS=(13,65),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
G9       DFLD  POS=(13,72),LTH=6,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
H1       DFLD  POS=(14,2),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
H2       DFLD  POS=(14,7),LTH=5,                                       +        
               ATTR=(PROT)                                                      
H3       DFLD  POS=(14,18),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
H4       DFLD  POS=(14,26),LTH=10,                                     +        
               ATTR=(PROT)                                                      
H5       DFLD  POS=(14,41),LTH=6,                                      +        
               ATTR=(PROT)                                                      
H6       DFLD  POS=(14,49),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
H7       DFLD  POS=(14,57),LTH=6,                                      +        
               ATTR=(PROT)                                                      
H8       DFLD  POS=(14,65),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
H9       DFLD  POS=(14,72),LTH=6,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
I1       DFLD  POS=(15,2),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
I2       DFLD  POS=(15,7),LTH=5,                                       +        
               ATTR=(PROT)                                                      
I3       DFLD  POS=(15,18),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
I4       DFLD  POS=(15,26),LTH=10,                                     +        
               ATTR=(PROT)                                                      
I5       DFLD  POS=(15,41),LTH=6,                                      +        
               ATTR=(PROT)                                                      
I6       DFLD  POS=(15,49),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
I7       DFLD  POS=(15,57),LTH=6,                                      +        
               ATTR=(PROT)                                                      
I8       DFLD  POS=(15,65),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
I9       DFLD  POS=(15,72),LTH=6,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
J1       DFLD  POS=(16,2),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
J2       DFLD  POS=(16,7),LTH=5,                                       +        
               ATTR=(PROT)                                                      
J3       DFLD  POS=(16,18),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
J4       DFLD  POS=(16,26),LTH=10,                                     +        
               ATTR=(PROT)                                                      
J5       DFLD  POS=(16,41),LTH=6,                                      +        
               ATTR=(PROT)                                                      
J6       DFLD  POS=(16,49),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
J7       DFLD  POS=(16,57),LTH=6,                                      +        
               ATTR=(PROT)                                                      
J8       DFLD  POS=(16,65),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
J9       DFLD  POS=(16,72),LTH=6,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
K1       DFLD  POS=(17,2),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
K2       DFLD  POS=(17,7),LTH=5,                                       +        
               ATTR=(PROT)                                                      
K3       DFLD  POS=(17,18),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
K4       DFLD  POS=(17,26),LTH=10,                                     +        
               ATTR=(PROT)                                                      
K5       DFLD  POS=(17,41),LTH=6,                                      +        
               ATTR=(PROT)                                                      
K6       DFLD  POS=(17,49),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
K7       DFLD  POS=(17,57),LTH=6,                                      +        
               ATTR=(PROT)                                                      
K8       DFLD  POS=(17,65),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
K9       DFLD  POS=(17,72),LTH=6,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
L1       DFLD  POS=(18,2),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
L2       DFLD  POS=(18,7),LTH=5,                                       +        
               ATTR=(PROT)                                                      
L3       DFLD  POS=(18,18),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
L4       DFLD  POS=(18,26),LTH=10,                                     +        
               ATTR=(PROT)                                                      
L5       DFLD  POS=(18,41),LTH=6,                                      +        
               ATTR=(PROT)                                                      
L6       DFLD  POS=(18,49),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
L7       DFLD  POS=(18,57),LTH=6,                                      +        
               ATTR=(PROT)                                                      
L8       DFLD  POS=(18,65),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
L9       DFLD  POS=(18,72),LTH=6,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
M1       DFLD  POS=(19,2),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
M2       DFLD  POS=(19,7),LTH=5,                                       +        
               ATTR=(PROT)                                                      
M3       DFLD  POS=(19,18),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
M4       DFLD  POS=(19,26),LTH=10,                                     +        
               ATTR=(PROT)                                                      
M5       DFLD  POS=(19,41),LTH=6,                                      +        
               ATTR=(PROT)                                                      
M6       DFLD  POS=(19,49),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
M7       DFLD  POS=(19,57),LTH=6,                                      +        
               ATTR=(PROT)                                                      
M8       DFLD  POS=(19,65),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
M9       DFLD  POS=(19,72),LTH=6,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
         DFLD  '13 Purch menu   14 Purch prop   15 On order',          +        
               POS=(21,2),LTH=43,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16 ETA week',                                          +        
               POS=(21,50),LTH=11,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '17 Season',                                            +        
               POS=(21,66),LTH=9,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18 Sales hist   19 Refill info  20 On ord local 21 Tran+        
                Scrap   10 WHELP',                                     +        
               POS=(22,2),LTH=72,                                      +        
               ATTR=(PROT)                                                      
TEMSINF  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W2O358N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W2N358,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W2I358N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMSFEL,                                                +        
               LTH=40                                                           
         MFLD  IDARTIN,                                                +        
               LTH=9                                                            
         MFLD  IDARTUT,                                                +        
               LTH=9                                                            
         MFLD  IDDCIN,                                                 +        
               LTH=2                                                            
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  BEART,                                                  +        
               LTH=25                                                           
         MFLD  A1,                                                     +        
               LTH=2                                                            
         MFLD  A2,                                                     +        
               LTH=5                                                            
         MFLD  A3,                                                     +        
               LTH=6                                                            
         MFLD  A4,                                                     +        
               LTH=10                                                           
         MFLD  A5,                                                     +        
               LTH=6                                                            
         MFLD  A6,                                                     +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  A7,                                                     +        
               LTH=6                                                            
         MFLD  A8,                                                     +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  A9,                                                     +        
               LTH=6                                                            
         MFLD  B1,                                                     +        
               LTH=2                                                            
         MFLD  B2,                                                     +        
               LTH=5                                                            
         MFLD  B3,                                                     +        
               LTH=6                                                            
         MFLD  B4,                                                     +        
               LTH=10                                                           
         MFLD  B5,                                                     +        
               LTH=6                                                            
         MFLD  B6,                                                     +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  B7,                                                     +        
               LTH=6                                                            
         MFLD  B8,                                                     +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  B9,                                                     +        
               LTH=6                                                            
         MFLD  C1,                                                     +        
               LTH=2                                                            
         MFLD  C2,                                                     +        
               LTH=5                                                            
         MFLD  C3,                                                     +        
               LTH=6                                                            
         MFLD  C4,                                                     +        
               LTH=10                                                           
         MFLD  C5,                                                     +        
               LTH=6                                                            
         MFLD  C6,                                                     +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  C7,                                                     +        
               LTH=6                                                            
         MFLD  C8,                                                     +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  C9,                                                     +        
               LTH=6                                                            
         MFLD  D1,                                                     +        
               LTH=2                                                            
         MFLD  D2,                                                     +        
               LTH=5                                                            
         MFLD  D3,                                                     +        
               LTH=6                                                            
         MFLD  D4,                                                     +        
               LTH=10                                                           
         MFLD  D5,                                                     +        
               LTH=6                                                            
         MFLD  D6,                                                     +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  D7,                                                     +        
               LTH=6                                                            
         MFLD  D8,                                                     +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  D9,                                                     +        
               LTH=6                                                            
         MFLD  E1,                                                     +        
               LTH=2                                                            
         MFLD  E2,                                                     +        
               LTH=5                                                            
         MFLD  E3,                                                     +        
               LTH=6                                                            
         MFLD  E4,                                                     +        
               LTH=10                                                           
         MFLD  E5,                                                     +        
               LTH=6                                                            
         MFLD  E6,                                                     +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  E7,                                                     +        
               LTH=6                                                            
         MFLD  E8,                                                     +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  E9,                                                     +        
               LTH=6                                                            
         MFLD  F1,                                                     +        
               LTH=2                                                            
         MFLD  F2,                                                     +        
               LTH=5                                                            
         MFLD  F3,                                                     +        
               LTH=6                                                            
         MFLD  F4,                                                     +        
               LTH=10                                                           
         MFLD  F5,                                                     +        
               LTH=6                                                            
         MFLD  F6,                                                     +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  F7,                                                     +        
               LTH=6                                                            
         MFLD  F8,                                                     +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  F9,                                                     +        
               LTH=6                                                            
         MFLD  G1,                                                     +        
               LTH=2                                                            
         MFLD  G2,                                                     +        
               LTH=5                                                            
         MFLD  G3,                                                     +        
               LTH=6                                                            
         MFLD  G4,                                                     +        
               LTH=10                                                           
         MFLD  G5,                                                     +        
               LTH=6                                                            
         MFLD  G6,                                                     +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  G7,                                                     +        
               LTH=6                                                            
         MFLD  G8,                                                     +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  G9,                                                     +        
               LTH=6                                                            
         MFLD  H1,                                                     +        
               LTH=2                                                            
         MFLD  H2,                                                     +        
               LTH=5                                                            
         MFLD  H3,                                                     +        
               LTH=6                                                            
         MFLD  H4,                                                     +        
               LTH=10                                                           
         MFLD  H5,                                                     +        
               LTH=6                                                            
         MFLD  H6,                                                     +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  H7,                                                     +        
               LTH=6                                                            
         MFLD  H8,                                                     +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  H9,                                                     +        
               LTH=6                                                            
         MFLD  I1,                                                     +        
               LTH=2                                                            
         MFLD  I2,                                                     +        
               LTH=5                                                            
         MFLD  I3,                                                     +        
               LTH=6                                                            
         MFLD  I4,                                                     +        
               LTH=10                                                           
         MFLD  I5,                                                     +        
               LTH=6                                                            
         MFLD  I6,                                                     +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  I7,                                                     +        
               LTH=6                                                            
         MFLD  I8,                                                     +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  I9,                                                     +        
               LTH=6                                                            
         MFLD  J1,                                                     +        
               LTH=2                                                            
         MFLD  J2,                                                     +        
               LTH=5                                                            
         MFLD  J3,                                                     +        
               LTH=6                                                            
         MFLD  J4,                                                     +        
               LTH=10                                                           
         MFLD  J5,                                                     +        
               LTH=6                                                            
         MFLD  J6,                                                     +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  J7,                                                     +        
               LTH=6                                                            
         MFLD  J8,                                                     +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  J9,                                                     +        
               LTH=6                                                            
         MFLD  K1,                                                     +        
               LTH=2                                                            
         MFLD  K2,                                                     +        
               LTH=5                                                            
         MFLD  K3,                                                     +        
               LTH=6                                                            
         MFLD  K4,                                                     +        
               LTH=10                                                           
         MFLD  K5,                                                     +        
               LTH=6                                                            
         MFLD  K6,                                                     +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  K7,                                                     +        
               LTH=6                                                            
         MFLD  K8,                                                     +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  K9,                                                     +        
               LTH=6                                                            
         MFLD  L1,                                                     +        
               LTH=2                                                            
         MFLD  L2,                                                     +        
               LTH=5                                                            
         MFLD  L3,                                                     +        
               LTH=6                                                            
         MFLD  L4,                                                     +        
               LTH=10                                                           
         MFLD  L5,                                                     +        
               LTH=6                                                            
         MFLD  L6,                                                     +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  L7,                                                     +        
               LTH=6                                                            
         MFLD  L8,                                                     +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  L9,                                                     +        
               LTH=6                                                            
         MFLD  M1,                                                     +        
               LTH=2                                                            
         MFLD  M2,                                                     +        
               LTH=5                                                            
         MFLD  M3,                                                     +        
               LTH=6                                                            
         MFLD  M4,                                                     +        
               LTH=10                                                           
         MFLD  M5,                                                     +        
               LTH=6                                                            
         MFLD  M6,                                                     +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  M7,                                                     +        
               LTH=6                                                            
         MFLD  M8,                                                     +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  M9,                                                     +        
               LTH=6                                                            
         MFLD  TEMSINF,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W2I358N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W2N358),                                           +        
               OPT=2,                                                  +        
               NXT=W2O358N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F8'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '23582',                                                +        
               LTH=5                                                            
         MFLD  (IDARTIN,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDARTUT,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDDCIN,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDDCUT,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (A1,                                                    +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (A3,                                                    +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (A6,                                                    +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (A8,                                                    +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (A9,                                                    +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (B1,                                                    +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (B3,                                                    +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (B6,                                                    +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (B8,                                                    +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (B9,                                                    +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (C1,                                                    +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (C3,                                                    +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (C6,                                                    +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (C8,                                                    +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (C9,                                                    +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (D1,                                                    +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (D3,                                                    +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (D6,                                                    +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (D8,                                                    +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (D9,                                                    +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (E1,                                                    +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (E3,                                                    +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (E6,                                                    +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (E8,                                                    +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (E9,                                                    +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (F1,                                                    +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (F3,                                                    +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (F6,                                                    +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (F8,                                                    +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (F9,                                                    +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (G1,                                                    +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (G3,                                                    +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (G6,                                                    +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (G8,                                                    +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (G9,                                                    +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (H1,                                                    +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (H3,                                                    +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (H6,                                                    +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (H8,                                                    +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (H9,                                                    +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (I1,                                                    +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (I3,                                                    +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (I6,                                                    +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (I8,                                                    +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (I9,                                                    +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (J1,                                                    +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (J3,                                                    +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (J6,                                                    +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (J8,                                                    +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (J9,                                                    +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (K1,                                                    +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (K3,                                                    +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (K6,                                                    +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (K8,                                                    +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (K9,                                                    +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (L1,                                                    +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (L3,                                                    +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (L6,                                                    +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (L8,                                                    +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (L9,                                                    +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (M1,                                                    +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (M3,                                                    +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (M6,                                                    +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (M8,                                                    +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (M9,                                                    +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
