***********************************************************************         
* CREATED BY PCC6483   ON 00/10/23  AT 13:36                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'Supplier groups                 '                               
W2N336   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W2T336 7',                                           +        
               8='W2T336 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W2T336U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W2T336V ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,11)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'PART GROUPS FOR DEL BLOCK',                            +        
               POS=(1,11),LTH=25,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Group:',                                               +        
               POS=(2,2),LTH=6,                                        +        
               ATTR=(ALPHA,PROT)                                                
GRPIN    DFLD  POS=(2,11),LTH=10,                                      +        
               ATTR=(NOPROT)                                                    
GRPUT    DFLD  POS=(3,11),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Cmd Group',                                            +        
               POS=(5,2),LTH=10,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Auto',                                                 +        
               POS=(4,18),LTH=4,                                       +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  'Start',                                                +        
               POS=(4,23),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'upd',                                                  +        
               POS=(5,18),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'date',                                                 +        
               POS=(5,23),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Block',                                                +        
               POS=(4,30),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'code',                                                 +        
               POS=(5,30),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Notes',                                                +        
               POS=(5,36),LTH=5,                                       +        
               ATTR=(PROT)                                                      
CMD1     DFLD  POS=(6,3),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDGRP1   DFLD  POS=(6,6),LTH=10,                                       +        
               ATTR=(PROT,MOD)                                                  
AUT1     DFLD  POS=(6,19),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
DAT1     DFLD  POS=(6,23),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
BLKKOD1  DFLD  POS=(6,30),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
NOTESA1  DFLD  POS=(06,36),LTH=40,                                     +        
               ATTR=(PROT,MOD)                                                  
USER1    DFLD  POS=(07,06),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
NOTESB1  DFLD  POS=(07,19),LTH=60,                                     +        
               ATTR=(PROT,MOD)                                                  
CMD2     DFLD  POS=(8,3),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDGRP2   DFLD  POS=(8,6),LTH=10,                                       +        
               ATTR=(PROT,MOD)                                                  
AUT2     DFLD  POS=(8,19),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
DAT2     DFLD  POS=(8,23),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
BLKKOD2  DFLD  POS=(8,30),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
NOTESA2  DFLD  POS=(08,36),LTH=40,                                     +        
               ATTR=(PROT,MOD)                                                  
USER2    DFLD  POS=(09,06),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
NOTESB2  DFLD  POS=(09,19),LTH=60,                                     +        
               ATTR=(PROT,MOD)                                                  
CMD3     DFLD  POS=(10,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDGRP3   DFLD  POS=(10,6),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
AUT3     DFLD  POS=(10,19),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
DAT3     DFLD  POS=(10,23),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
BLKKOD3  DFLD  POS=(10,30),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
NOTESA3  DFLD  POS=(10,36),LTH=40,                                     +        
               ATTR=(PROT,MOD)                                                  
USER3    DFLD  POS=(11,06),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
NOTESB3  DFLD  POS=(11,19),LTH=60,                                     +        
               ATTR=(PROT,MOD)                                                  
CMD4     DFLD  POS=(12,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDGRP4   DFLD  POS=(12,6),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
AUT4     DFLD  POS=(12,19),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
DAT4     DFLD  POS=(12,23),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
BLKKOD4  DFLD  POS=(12,30),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
NOTESA4  DFLD  POS=(12,36),LTH=40,                                     +        
               ATTR=(PROT,MOD)                                                  
USER4    DFLD  POS=(13,06),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
NOTESB4  DFLD  POS=(13,19),LTH=60,                                     +        
               ATTR=(PROT,MOD)                                                  
CMD5     DFLD  POS=(14,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDGRP5   DFLD  POS=(14,6),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
AUT5     DFLD  POS=(14,19),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
DAT5     DFLD  POS=(14,23),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
BLKKOD5  DFLD  POS=(14,30),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
NOTESA5  DFLD  POS=(14,36),LTH=40,                                     +        
               ATTR=(PROT,MOD)                                                  
USER5    DFLD  POS=(15,06),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
NOTESB5  DFLD  POS=(15,19),LTH=60,                                     +        
               ATTR=(PROT,MOD)                                                  
CMD6     DFLD  POS=(16,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDGRP6   DFLD  POS=(16,6),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
AUT6     DFLD  POS=(16,19),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
DAT6     DFLD  POS=(16,23),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
BLKKOD6  DFLD  POS=(16,30),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
NOTESA6  DFLD  POS=(16,36),LTH=40,                                     +        
               ATTR=(PROT,MOD)                                                  
USER6    DFLD  POS=(17,06),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
NOTESB6  DFLD  POS=(17,19),LTH=60,                                     +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'New/Change',                                           +        
               POS=(18,2),LTH=10,                                      +        
               ATTR=(PROT)                                                      
CMD      DFLD  POS=(19,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDGRPIN  DFLD  POS=(19,6),LTH=10,                                      +        
               ATTR=(NOPROT)                                                    
AUTOIN   DFLD  POS=(19,19),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
DATIN    DFLD  POS=(19,23),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
BLKKOD   DFLD  POS=(19,30),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
NOTEINA  DFLD  POS=(19,36),LTH=40,                                     +        
               ATTR=(NOPROT)                                                    
NOTEINB  DFLD  POS=(20,19),LTH=60,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'F10=WHELP  F11=Update',                                +        
               POS=(22,2),LTH=21,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W2O336N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W2N336,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W2I336N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  GRPIN,                                                  +        
               LTH=10                                                           
         MFLD  GRPUT,                                                  +        
               LTH=10                                                           
         MFLD  CMD1,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDGRP1,                                                 +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  AUT1,                                                   +        
               LTH=1                                                            
         MFLD  DAT1,                                                   +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BLKKOD1,                                                +        
               LTH=3                                                            
         MFLD  NOTESA1,                                                +        
               LTH=40                                                           
         MFLD  USER1,                                                  +        
               LTH=10                                                           
         MFLD  NOTESB1,                                                +        
               LTH=60                                                           
         MFLD  CMD2,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDGRP2,                                                 +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  AUT2,                                                   +        
               LTH=1                                                            
         MFLD  DAT2,                                                   +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BLKKOD2,                                                +        
               LTH=3                                                            
         MFLD  NOTESA2,                                                +        
               LTH=40                                                           
         MFLD  USER2,                                                  +        
               LTH=10                                                           
         MFLD  NOTESB2,                                                +        
               LTH=60                                                           
         MFLD  CMD3,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDGRP3,                                                 +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  AUT3,                                                   +        
               LTH=1                                                            
         MFLD  DAT3,                                                   +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BLKKOD3,                                                +        
               LTH=3                                                            
         MFLD  NOTESA3,                                                +        
               LTH=40                                                           
         MFLD  USER3,                                                  +        
               LTH=10                                                           
         MFLD  NOTESB3,                                                +        
               LTH=60                                                           
         MFLD  CMD4,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDGRP4,                                                 +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  AUT4,                                                   +        
               LTH=1                                                            
         MFLD  DAT4,                                                   +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BLKKOD4,                                                +        
               LTH=3                                                            
         MFLD  NOTESA4,                                                +        
               LTH=40                                                           
         MFLD  USER4,                                                  +        
               LTH=10                                                           
         MFLD  NOTESB4,                                                +        
               LTH=60                                                           
         MFLD  CMD5,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDGRP5,                                                 +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  AUT5,                                                   +        
               LTH=1                                                            
         MFLD  DAT5,                                                   +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BLKKOD5,                                                +        
               LTH=3                                                            
         MFLD  NOTESA5,                                                +        
               LTH=40                                                           
         MFLD  USER5,                                                  +        
               LTH=10                                                           
         MFLD  NOTESB5,                                                +        
               LTH=60                                                           
         MFLD  CMD6,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDGRP6,                                                 +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  AUT6,                                                   +        
               LTH=1                                                            
         MFLD  DAT6,                                                   +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BLKKOD6,                                                +        
               LTH=3                                                            
         MFLD  NOTESA6,                                                +        
               LTH=40                                                           
         MFLD  USER6,                                                  +        
               LTH=10                                                           
         MFLD  NOTESB6,                                                +        
               LTH=60                                                           
         MFLD  CMD,                                                    +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDGRPIN,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  AUTOIN,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DATIN,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BLKKOD,                                                 +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  NOTEINA,                                                +        
               LTH=42,                                                 +        
               ATTR=(YES)                                                       
         MFLD  NOTEINB,                                                +        
               LTH=62,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W2I336N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W2N336),                                           +        
               OPT=2,                                                  +        
               NXT=W2O336N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '23362',                                                +        
               LTH=5                                                            
         MFLD  (GRPIN,                                                 +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               FILL=X'40'                                                       
         MFLD  (GRPUT,                                                 +        
               '          '),                                          +        
               LTH=10,                                                 +        
               FILL=X'40'                                                       
         MFLD  (CMD1,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDGRP1,                                                 +        
               LTH=10                                                           
         MFLD  (CMD2,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDGRP2,                                                 +        
               LTH=10                                                           
         MFLD  (CMD3,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDGRP3,                                                 +        
               LTH=10                                                           
         MFLD  (CMD4,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDGRP4,                                                 +        
               LTH=10                                                           
         MFLD  (CMD5,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDGRP5,                                                 +        
               LTH=10                                                           
         MFLD  (CMD6,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDGRP6,                                                 +        
               LTH=10                                                           
         MFLD  (CMD,                                                   +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (IDGRPIN,                                               +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               FILL=X'40'                                                       
         MFLD  (AUTOIN,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DATIN,                                                 +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               FILL=X'40'                                                       
         MFLD  (BLKKOD,                                                +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R                                                           
         MFLD  (NOTEINA,                                               +        
               '++++++++++++++++++++++++++++++++++++++++'),            +        
               LTH=40,                                                 +        
               FILL=X'40'                                                       
         MFLD  (NOTEINB,                                               +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++'),                                                +        
               LTH=60,                                                 +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
