***********************************************************************         
* CREATED BY PC40073   ON 97/04/15  AT 12:56                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'Updating Procurement Data       '                               
W2N433   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W2T431  ',                                           +        
               2='W2T432  ',                                           +        
               3='W2T433  ',                                           +        
               4='W2T434  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W2T441  ',                                           +        
               10='WHELP   ',                                          +        
               11='W2T433U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W2T431  ',                                          +        
               14='W2T432  ',                                          +        
               15='W2T433  ',                                          +        
               16='W2T434  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W2T433U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W2N433   DPAGE CURSOR=((2,13)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Updating Procurement Data',                            +        
               POS=(1,13),LTH=25,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Partnumber',                                           +        
               POS=(2,2),LTH=10,                                       +        
               ATTR=(ALPHA,PROT)                                                
IDARTIN  DFLD  POS=(2,13),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
IDARTUT  DFLD  POS=(3,13),LTH=11,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'DC',                                                   +        
               POS=(2,25),LTH=2,                                       +        
               ATTR=(ALPHA,PROT)                                                
IDDCIN   DFLD  POS=(2,28),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
IDDCUT   DFLD  POS=(3,28),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Description',                                          +        
               POS=(5,2),LTH=11,                                       +        
               ATTR=(PROT)                                                      
BEART    DFLD  POS=(5,14),LTH=25,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Pub.week CDC',                                         +        
               POS=(5,40),LTH=12,                                      +        
               ATTR=(ALPHA,PROT)                                                
TIFINLEV DFLD  POS=(5,53),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Parts planner',                                        +        
               POS=(5,61),LTH=13,                                      +        
               ATTR=(PROT)                                                      
IDBERED  DFLD  POS=(5,75),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Reason',                                               +        
               POS=(6,2),LTH=6,                                        +        
               ATTR=(ALPHA,PROT)                                                
TEORSAK  DFLD  POS=(6,10),LTH=50,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Am Ord ID',                                            +        
               POS=(6,61),LTH=9,                                       +        
               ATTR=(ALPHA,PROT)                                                
IDAO     DFLD  POS=(6,71),LTH=10,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Reg for',                                              +        
               POS=(7,2),LTH=7,                                        +        
               ATTR=(ALPHA,PROT)                                                
IDKAT1   DFLD  POS=(7,10),LTH=5,                                       +        
               ATTR=(PROT)                                                      
IDKAT2   DFLD  POS=(7,16),LTH=5,                                       +        
               ATTR=(PROT)                                                      
IDKAT3   DFLD  POS=(7,22),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Del Unit',                                             +        
               POS=(7,28),LTH=8,                                       +        
               ATTR=(PROT)                                                      
PROENH1  DFLD  POS=(7,37),LTH=8,                                       +        
               ATTR=(PROT)                                                      
PROENH2  DFLD  POS=(7,46),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Proj',                                                 +        
               POS=(7,61),LTH=4,                                       +        
               ATTR=(PROT)                                                      
IDPROJ   DFLD  POS=(7,71),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'VarNotes',                                             +        
               POS=(8,2),LTH=8,                                        +        
               ATTR=(ALPHA,PROT)                                                
VARNOT   DFLD  POS=(8,11),LTH=40,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Proj-k',                                               +        
               POS=(8,61),LTH=6,                                       +        
               ATTR=(PROT)                                                      
IDPROJK  DFLD  POS=(8,71),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'PP Notes',                                             +        
               POS=(9,2),LTH=8,                                        +        
               ATTR=(ALPHA,PROT)                                                
PPNOT    DFLD  POS=(9,11),LTH=40,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Exch',                                                 +        
               POS=(9,61),LTH=4,                                       +        
               ATTR=(ALPHA,PROT)                                                
EXCH     DFLD  POS=(9,71),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Sup:s / SS code',                                      +        
               POS=(10,02),LTH=15,                                     +        
               ATTR=(ALPHA,PROT)                                                
ERSART   DFLD  POS=(10,18),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '/',                                                    +        
               POS=(10,27),LTH=1,                                      +        
               ATTR=(ALPHA,PROT)                                                
KDERS    DFLD  POS=(10,29),LTH=2,                                      +        
               ATTR=(PROT)                                                      
AO       DFLD  POS=(10,32),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Comparable',                                           +        
               POS=(10,40),LTH=10,                                     +        
               ATTR=(ALPHA,PROT)                                                
ARTCOMP  DFLD  POS=(10,51),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Numb/Veh.',                                            +        
               POS=(10,61),LTH=9,                                      +        
               ATTR=(PROT)                                                      
KVARTVGN DFLD  POS=(10,71),LTH=3,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Suppl.CDC',                                            +        
               POS=(11,2),LTH=9,                                       +        
               ATTR=(ALPHA,PROT)                                                
IDLEVNR  DFLD  POS=(11,12),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Price CDC',                                            +        
               POS=(11,18),LTH=9,                                      +        
               ATTR=(PROT)                                                      
PRARTSTD DFLD  POS=(11,28),LTH=10,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Procurer CDC',                                         +        
               POS=(11,40),LTH=12,                                     +        
               ATTR=(NUM,PROT)                                                  
IDANSK   DFLD  POS=(11,53),LTH=3,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Purch CDC',                                            +        
               POS=(11,61),LTH=9,                                      +        
               ATTR=(PROT)                                                      
IDINKCDC DFLD  POS=(11,71),LTH=4,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'UoM ',                                                 +        
               POS=(12,61),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KDSORT   DFLD  POS=(12,71),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'New Price',                                            +        
               POS=(15,2),LTH=9,                                       +        
               ATTR=(ALPHA,PROT)                                                
PRMATRL  DFLD  POS=(15,12),LTH=10,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'Fcst',                                                 +        
               POS=(15,23),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KVPBREF  DFLD  POS=(15,28),LTH=9,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Blocked until',                                        +        
               POS=(15,38),LTH=13,                                     +        
               ATTR=(PROT)                                                      
TIREFMPB DFLD  POS=(15,52),LTH=6,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Local Pub Date',                                       +        
               POS=(15,59),LTH=14,                                     +        
               ATTR=(NUM,PROT)                                                  
DAPUBL   DFLD  POS=(15,74),LTH=5,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'First call',                                           +        
               POS=(17,2),LTH=10,                                      +        
               ATTR=(PROT)                                                      
TILEVBEG DFLD  POS=(17,13),LTH=4,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Yearly fcst',                                          +        
               POS=(17,19),LTH=11,                                     +        
               ATTR=(PROT)                                                      
KVPROG   DFLD  POS=(17,31),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Purchaser',                                            +        
               POS=(17,39),LTH=9,                                      +        
               ATTR=(PROT)                                                      
IDINK    DFLD  POS=(17,49),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Procurer',                                             +        
               POS=(17,53),LTH=9,                                      +        
               ATTR=(NUM,PROT)                                                  
IDANSKCN DFLD  POS=(17,63),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  '13 Proc-data   14 Proc-data-2 15 Proc/newpur 16 Proc-da+        
               ta-3 17',                                               +        
               POS=(21,2),LTH=62,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,17),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,32),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,47),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '9 New Parts',                                          +        
               POS=(22,63),LTH=11,                                     +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W2O433N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W2N433,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W2I433N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W2N433                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  IDARTIN,                                                +        
               LTH=9                                                            
         MFLD  IDARTUT,                                                +        
               LTH=11                                                           
         MFLD  IDDCIN,                                                 +        
               LTH=2                                                            
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  BEART,                                                  +        
               LTH=25                                                           
         MFLD  TIFINLEV,                                               +        
               LTH=5                                                            
         MFLD  IDBERED,                                                +        
               LTH=2                                                            
         MFLD  TEORSAK,                                                +        
               LTH=50                                                           
         MFLD  IDAO,                                                   +        
               LTH=10                                                           
         MFLD  IDKAT1,                                                 +        
               LTH=5                                                            
         MFLD  IDKAT2,                                                 +        
               LTH=5                                                            
         MFLD  IDKAT3,                                                 +        
               LTH=5                                                            
         MFLD  PROENH1,                                                +        
               LTH=8                                                            
         MFLD  PROENH2,                                                +        
               LTH=8                                                            
         MFLD  IDPROJ,                                                 +        
               LTH=4                                                            
         MFLD  VARNOT,                                                 +        
               LTH=40                                                           
         MFLD  IDPROJK,                                                +        
               LTH=4                                                            
         MFLD  PPNOT,                                                  +        
               LTH=40                                                           
         MFLD  EXCH,                                                   +        
               LTH=1                                                            
         MFLD  ERSART,                                                 +        
               LTH=8                                                            
         MFLD  KDERS,                                                  +        
               LTH=2                                                            
         MFLD  AO,                                                     +        
               LTH=2                                                            
         MFLD  ARTCOMP,                                                +        
               LTH=8                                                            
         MFLD  KVARTVGN,                                               +        
               LTH=3                                                            
         MFLD  IDLEVNR,                                                +        
               LTH=5                                                            
         MFLD  PRARTSTD,                                               +        
               LTH=10                                                           
         MFLD  IDANSK,                                                 +        
               LTH=3                                                            
         MFLD  IDINKCDC,                                               +        
               LTH=4                                                            
         MFLD  KDSORT,                                                 +        
               LTH=2                                                            
         MFLD  PRMATRL,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVPBREF,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TIREFMPB,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DAPUBL,                                                 +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TILEVBEG,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVPROG,                                                 +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDINK,                                                  +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDANSKCN,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W2I433N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W2N433),                                           +        
               OPT=2,                                                  +        
               NXT=W2O433N1                                                     
MID      LPAGE SOR=(W2N433)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '24332',                                                +        
               LTH=5                                                            
         MFLD  (IDARTIN,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDARTUT,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (IDDCIN,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDDCUT,                                                 +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (PRMATRL,                                               +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVPBREF,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TIREFMPB,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DAPUBL,                                                +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TILEVBEG,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVPROG,                                                +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDINK,                                                 +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDANSKCN,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
