***********************************************************************         
* CREATED BY V0C1505   ON 12/11/20  AT 02:00                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'NEW PARTS                       '                               
W2N441   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W2T441 7',                                           +        
               8='W2T441 8',                                           +        
               9='W2T433  ',                                           +        
               10='WHELP   ',                                          +        
               11='W2T441U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W2T441U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,24)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'NEW PARTS',                                            +        
               POS=(1,13),LTH=9,                                       +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Procurer fr',                                          +        
               POS=(2,2),LTH=11,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0224  DFLD  POS=(2,24),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'to',                                                   +        
               POS=(2,29),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FLD0234  DFLD  POS=(2,34),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Proj',                                                 +        
               POS=(2,39),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FLD0245  DFLD  POS=(2,45),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
FLD0324  DFLD  POS=(3,24),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0334  DFLD  POS=(3,34),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0345  DFLD  POS=(3,45),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Cmd Part No. DC Proj AO-Number  Pub.Week Reg.Date',    +        
               POS=(7,2),LTH=48,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'FKNGRP Proc New Proc  RegCDC',                         +        
               POS=(7,52),LTH=28,                                      +        
               ATTR=(PROT)                                                      
         DO 12                                                                  
CMD      DFLD  POS=(8,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
ARTNR    DFLD  POS=(8,5),LTH=9,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
IDDC     DFLD  POS=(8,15),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
PROJ     DFLD  POS=(8,18),LTH=4,                                       +        
               ATTR=(PROT)                                                      
AONUM    DFLD  POS=(8,23),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
PUBWK    DFLD  POS=(8,36),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
REGDT    DFLD  POS=(8,46),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
FKNGRP   DFLD  POS=(8,54),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
PROC     DFLD  POS=(8,59),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
NEWPROC  DFLD  POS=(8,68),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
REGCDC   DFLD  POS=(8,75),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
         ENDDO                                                                  
         DFLD  '13 New parts    14 Parts purch  15',                   +        
               POS=(21,2),LTH=34,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16',                                                   +        
               POS=(21,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '9 ANSK/NYK',                                           +        
               POS=(22,67),LTH=10,                                     +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W2O441N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W2N441,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W2I441N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  FLD0224,                                                +        
               LTH=2                                                            
         MFLD  FLD0324,                                                +        
               LTH=3                                                            
         MFLD  FLD0234,                                                +        
               LTH=2                                                            
         MFLD  FLD0334,                                                +        
               LTH=3                                                            
         MFLD  FLD0245,                                                +        
               LTH=2                                                            
         MFLD  FLD0345,                                                +        
               LTH=4                                                            
         DO 12                                                                  
         MFLD  CMD,                                                    +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ARTNR,                                                  +        
               LTH=9                                                            
         MFLD  IDDC,                                                   +        
               LTH=2                                                            
         MFLD  PROJ,                                                   +        
               LTH=4                                                            
         MFLD  AONUM,                                                  +        
               LTH=10                                                           
         MFLD  PUBWK,                                                  +        
               LTH=5                                                            
         MFLD  REGDT,                                                  +        
               LTH=6                                                            
         MFLD  FKNGRP,                                                 +        
               LTH=4                                                            
         MFLD  PROC,                                                   +        
               LTH=3                                                            
         MFLD  NEWPROC,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  REGCDC,                                                 +        
               LTH=1                                                            
         ENDDO                                                                  
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W2I441N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W2N441),                                           +        
               OPT=2,                                                  +        
               NXT=W2O441N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '24412',                                                +        
               LTH=5                                                            
         MFLD  (FLD0224,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0324,                                                +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0234,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0334,                                                +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0245,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               FILL=X'40'                                                       
         MFLD  FLD0345,                                                +        
               LTH=4,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         DO 12                                                                  
         MFLD  (CMD,                                                   +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (ARTNR,                                                 +        
               '+++++++++'),                                           +        
               LTH=9                                                            
         MFLD  IDDC,                                                   +        
               LTH=2                                                            
         MFLD  (NEWPROC,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         ENDDO                                                                  
         MSGEND                                                                 
         END                                                                    
