***********************************************************************         
* CREATED BY V028439   ON 06/06/19  AT 14:38                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'URVAL ARTIKELINFORMATION        '                               
W2N422   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W2T422U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W2T421  ',                                          +        
               14='W2T422  ',                                          +        
               15='W2T423  ',                                          +        
               16='W2T424  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W2T422U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((4,8)),                                         +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Partsinfo depending on choice',                        +        
               POS=(1,10),LTH=29,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD0140  DFLD  POS=(1,40),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
******* rad 4 *******                                                           
         DFLD  'Mail',                                                 +        
               POS=(4,2),LTH=4,                                        +        
               ATTR=(PROT)                                                      
KDARBTYP DFLD  POS=(4,8),LTH=4,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDPERSON DFLD  POS=(4,13),LTH=3,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
******* rad 5 *******                                                           
         DFLD  'DC',                                                   +        
               POS=(5,2),LTH=2,                                        +        
               ATTR=(PROT)                                                      
IDDC     DFLD  POS=(5,8),LTH=2,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
******* rad 6 *******                                                           
         DFLD  'RespNo      from-to',                                  +        
               POS=(6,2),LTH=19,                                       +        
               ATTR=(PROT)                                                      
IDANSKF  DFLD  POS=(6,23),LTH=3,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  '-',                                                    +        
               POS=(6,27),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
IDANSKT  DFLD  POS=(6,29),LTH=3,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'RespNo(max 5)',                                        +        
               POS=(6,34),LTH=13,                                      +        
               ATTR=(PROT)                                                      
IDANSK1  DFLD  POS=(6,48),LTH=3,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDANSK2  DFLD  POS=(6,52),LTH=3,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDANSK3  DFLD  POS=(6,56),LTH=3,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDANSK4  DFLD  POS=(6,60),LTH=3,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDANSK5  DFLD  POS=(6,64),LTH=3,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Planner.no',                                           +        
               POS=(6,68),LTH=10,                                      +        
               ATTR=(PROT)                                                      
FLBERED  DFLD  POS=(6,80),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
******* rad 7 *******                                                           
         DFLD  'SHP',                                                  +        
               POS=(7,2),LTH=3,                                        +        
               ATTR=(PROT)                                                      
FLSHIP   DFLD  POS=(7,08),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Suppl(max 5)',                                         +        
               POS=(7,14),LTH=12,                                      +        
               ATTR=(PROT)                                                      
IDLEVN1  DFLD  POS=(7,27),LTH=5,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDLEVN2  DFLD  POS=(7,33),LTH=5,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDLEVN3  DFLD  POS=(7,39),LTH=5,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDLEVN4  DFLD  POS=(7,45),LTH=5,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDLEVN5  DFLD  POS=(7,51),LTH=5,                                       +        
               ATTR=(NOPROT,MOD)                                                
******* rad 8 *******                                                           
         DFLD  'SS-code CDC from-to',                                  +        
               POS=(8,2),LTH=19,                                       +        
               ATTR=(PROT)                                                      
KDERSF   DFLD  POS=(8,24),LTH=2,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  '-',                                                    +        
               POS=(8,27),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
KDERST   DFLD  POS=(8,29),LTH=2,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'SS-codeCDC(max 5)',                                    +        
               POS=(8,34),LTH=17,                                      +        
               ATTR=(PROT)                                                      
KDERS1   DFLD  POS=(8,52),LTH=2,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
KDERS2   DFLD  POS=(8,55),LTH=2,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
KDERS3   DFLD  POS=(8,58),LTH=2,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
KDERS4   DFLD  POS=(8,61),LTH=2,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
KDERS5   DFLD  POS=(8,64),LTH=2,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'SS-code loc',                                          +        
               POS=(8,68),LTH=11,                                      +        
               ATTR=(PROT)                                                      
FLERSDAT DFLD  POS=(8,80),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
******* rad 9 *******                                                           
         DFLD  'FuncGrp     from-to',                                  +        
               POS=(9,2),LTH=19,                                       +        
               ATTR=(PROT)                                                      
FNKGRPF  DFLD  POS=(9,22),LTH=4,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  '-',                                                    +        
               POS=(9,27),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
FNKGRPT  DFLD  POS=(9,29),LTH=4,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Funcgrp(max 5)',                                       +        
               POS=(9,34),LTH=14,                                      +        
               ATTR=(NUM,PROT)                                                  
FNKGRP1  DFLD  POS=(9,49),LTH=4,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
FNKGRP2  DFLD  POS=(9,54),LTH=4,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
FNKGRP3  DFLD  POS=(9,59),LTH=4,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
FNKGRP4  DFLD  POS=(9,64),LTH=4,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
FNKGRP5  DFLD  POS=(9,69),LTH=4,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
******* rad 10 *******                                                          
         DFLD  'Packtype(max 4)',                                      +        
               POS=(10,2),LTH=15,                                      +        
               ATTR=(PROT)                                                      
FPTYP1   DFLD  POS=(10,22),LTH=2,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FPTYP2   DFLD  POS=(10,25),LTH=2,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FPTYP3   DFLD  POS=(10,28),LTH=2,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FPTYP4   DFLD  POS=(10,31),LTH=2,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Description',                                          +        
               POS=(10,34),LTH=11,                                     +        
               ATTR=(PROT)                                                      
BEART    DFLD  POS=(10,47),LTH=25,                                     +        
               ATTR=(NOPROT,MOD)                                                
******* rad 11 *******                                                          
         DFLD  'Prodgrp     from-to',                                  +        
               POS=(11,2),LTH=19,                                      +        
               ATTR=(PROT)                                                      
PRODSLF  DFLD  POS=(11,24),LTH=2,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  '-',                                                    +        
               POS=(11,27),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
PRODSLT  DFLD  POS=(11,29),LTH=2,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Proj',                                                 +        
               POS=(11,34),LTH=4,                                      +        
               ATTR=(PROT)                                                      
PROJURV  DFLD  POS=(11,39),LTH=4,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'WH area',                                              +        
               POS=(11,44),LTH=7,                                      +        
               ATTR=(PROT)                                                      
ADLAGOMR DFLD  POS=(11,52),LTH=2,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Aisle',                                                +        
               POS=(11,55),LTH=5,                                      +        
               ATTR=(PROT)                                                      
ADGANGF  DFLD  POS=(11,61),LTH=2,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  '-',                                                    +        
               POS=(11,64),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
ADGANGT  DFLD  POS=(11,66),LTH=2,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
******* rad 13 *******                                                          
         DFLD  'Suppl',                                                +        
               POS=(13,2),LTH=5,                                       +        
               ATTR=(PROT)                                                      
SUPPL    DFLD  POS=(13,10),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'SupDescr',                                             +        
               POS=(13,12),LTH=8,                                      +        
               ATTR=(PROT)                                                      
SUPDESCR DFLD  POS=(13,23),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Descr',                                                +        
               POS=(13,25),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DESCR    DFLD  POS=(13,33),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Stock',                                                +        
               POS=(13,35),LTH=5,                                      +        
               ATTR=(PROT)                                                      
STOCK    DFLD  POS=(13,44),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'AK',                                                   +        
               POS=(13,46),LTH=2,                                      +        
               ATTR=(PROT)                                                      
AK       DFLD  POS=(13,53),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'VOR/BO',                                               +        
               POS=(13,55),LTH=6,                                      +        
               ATTR=(PROT)                                                      
VORROS   DFLD  POS=(13,65),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
******* rad 14 *******                                                          
         DFLD  'Arrears',                                              +        
               POS=(14,02),LTH=7,                                      +        
               ATTR=(PROT)                                                      
ARREARS  DFLD  POS=(14,10),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'DelProm.',                                             +        
               POS=(14,12),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DELPROM  DFLD  POS=(14,23),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Pre.Adv',                                              +        
               POS=(14,25),LTH=7,                                      +        
               ATTR=(PROT)                                                      
PREADV   DFLD  POS=(14,33),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'LeadTime',                                             +        
               POS=(14,35),LTH=8,                                      +        
               ATTR=(PROT)                                                      
LEADTIME DFLD  POS=(14,44),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'ProcPl',                                               +        
               POS=(14,46),LTH=6,                                      +        
               ATTR=(PROT)                                                      
PROC     DFLD  POS=(14,53),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'SendDay',                                              +        
               POS=(14,55),LTH=7,                                      +        
               ATTR=(PROT)                                                      
SENDDAY  DFLD  POS=(14,65),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'LatesDel',                                             +        
               POS=(14,67),LTH=8,                                      +        
               ATTR=(PROT)                                                      
LATDEL   DFLD  POS=(14,80),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
******* rad 15 *******                                                          
         DFLD  'PurchID',                                              +        
               POS=(15,02),LTH=7,                                      +        
               ATTR=(PROT)                                                      
PURCHID  DFLD  POS=(15,10),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Agreem.',                                              +        
               POS=(15,12),LTH=7,                                      +        
               ATTR=(PROT)                                                      
AGREEM   DFLD  POS=(15,23),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'PerDem',                                               +        
               POS=(15,25),LTH=6,                                      +        
               ATTR=(PROT)                                                      
PERDEM   DFLD  POS=(15,33),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Trend',                                                +        
               POS=(15,35),LTH=5,                                      +        
               ATTR=(PROT)                                                      
TREND    DFLD  POS=(15,44),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Seas.',                                                +        
               POS=(15,46),LTH=5,                                      +        
               ATTR=(PROT)                                                      
SEAS     DFLD  POS=(15,53),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'DemHist',                                              +        
               POS=(15,55),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DEMHIST  DFLD  POS=(15,65),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'DemHist Year',                                         +        
               POS=(15,67),LTH=12,                                     +        
               ATTR=(PROT)                                                      
DEMHISTY DFLD  POS=(15,80),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
******* rad 16 *******                                                          
         DFLD  'SS CDC',                                               +        
               POS=(16,02),LTH=6,                                      +        
               ATTR=(PROT)                                                      
SSCDC    DFLD  POS=(16,10),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'SS local',                                             +        
               POS=(16,12),LTH=8,                                      +        
               ATTR=(PROT)                                                      
SSLOCAL  DFLD  POS=(16,23),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Price',                                                +        
               POS=(16,25),LTH=5,                                      +        
               ATTR=(PROT)                                                      
PRICE    DFLD  POS=(16,33),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'PackFL',                                               +        
               POS=(16,35),LTH=6,                                      +        
               ATTR=(PROT)                                                      
PACKFL   DFLD  POS=(16,44),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Sort',                                                 +        
               POS=(16,46),LTH=4,                                      +        
               ATTR=(PROT)                                                      
SORT     DFLD  POS=(16,53),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'RefStop',                                              +        
               POS=(16,55),LTH=7,                                      +        
               ATTR=(PROT)                                                      
REFSTOP  DFLD  POS=(16,65),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Weight/Vol',                                           +        
               POS=(16,67),LTH=10,                                     +        
               ATTR=(PROT)                                                      
WEIGHVOL DFLD  POS=(16,80),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
******* rad 17 *******                                                          
         DFLD  'PubWeek',                                              +        
               POS=(17,2),LTH=7,                                       +        
               ATTR=(PROT)                                                      
PUBWEEK  DFLD  POS=(17,10),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'PubWeekLoc',                                           +        
               POS=(17,12),LTH=10,                                     +        
               ATTR=(PROT)                                                      
PUBWEEKL DFLD  POS=(17,23),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'OutProd',                                              +        
               POS=(17,25),LTH=7,                                      +        
               ATTR=(PROT)                                                      
OUTPROD  DFLD  POS=(17,33),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Prodgrp',                                              +        
               POS=(17,35),LTH=7,                                      +        
               ATTR=(PROT)                                                      
PRODGRP  DFLD  POS=(17,44),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Fcngrp',                                               +        
               POS=(17,46),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FCNGRP   DFLD  POS=(17,53),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Tot.dem',                                              +        
               POS=(17,55),LTH=7,                                      +        
               ATTR=(PROT)                                                      
TOTDEM   DFLD  POS=(17,64),LTH=2,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'CallOffs',                                             +        
               POS=(17,67),LTH=8,                                      +        
               ATTR=(PROT)                                                      
CALLOFFS DFLD  POS=(17,79),LTH=2,                                      +        
               ATTR=(NOPROT,MOD)                                                
******* rad 18 *******                                                          
         DFLD  'Service',                                              +        
               POS=(18,2),LTH=7,                                       +        
               ATTR=(PROT)                                                      
SERVICE  DFLD  POS=(18,10),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Parameters',                                           +        
               POS=(18,12),LTH=10,                                     +        
               ATTR=(PROT)                                                      
PARM     DFLD  POS=(18,23),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Quants',                                               +        
               POS=(18,25),LTH=7,                                      +        
               ATTR=(PROT)                                                      
QUANT    DFLD  POS=(18,33),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Packinfo',                                             +        
               POS=(18,35),LTH=8,                                      +        
               ATTR=(PROT)                                                      
PACKINFO DFLD  POS=(18,44),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'MaxPt',                                                +        
               POS=(18,46),LTH=5,                                      +        
               ATTR=(PROT)                                                      
MAXPT    DFLD  POS=(18,53),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Blocked',                                              +        
               POS=(18,55),LTH=7,                                      +        
               ATTR=(PROT)                                                      
BLOCKED  DFLD  POS=(18,65),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Safety Stock',                                         +        
               POS=(18,67),LTH=12,                                     +        
               ATTR=(PROT)                                                      
SAFSTOCK DFLD  POS=(18,80),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
******* rad 19 *******                                                          
         DFLD  'Origin',                                               +        
               POS=(19,2),LTH=6,                                       +        
               ATTR=(PROT)                                                      
ORIGIN   DFLD  POS=(19,10),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'W-H Area',                                             +        
               POS=(19,12),LTH=8,                                      +        
               ATTR=(PROT)                                                      
WHAREA   DFLD  POS=(19,23),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Aut/Jit',                                              +        
               POS=(19,25),LTH=7,                                      +        
               ATTR=(PROT)                                                      
AUTJIT   DFLD  POS=(19,33),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Proj/mod',                                             +        
               POS=(19,35),LTH=8,                                      +        
               ATTR=(PROT)                                                      
PRODMOD  DFLD  POS=(19,44),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'S-part',                                               +        
               POS=(19,46),LTH=6,                                      +        
               ATTR=(PROT)                                                      
SPART    DFLD  POS=(19,53),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'IR-status',                                            +        
               POS=(19,55),LTH=9,                                      +        
               ATTR=(PROT)                                                      
IRSTA    DFLD  POS=(19,65),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
******* rad 22 *******                                                          
         DFLD  'F10 WHELP   F12 Logoff',                               +        
               POS=(22,2),LTH=22,                                      +        
               ATTR=(PROT)                                                      
******* rad 23 *******                                                          
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
******* rad 24 *******                                                          
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W2O422N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W2N422,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W2I422N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0140,                                                +        
               LTH=40                                                           
         MFLD  IDDC,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDANSKF,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDANSKT,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDANSK1,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDANSK2,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDANSK3,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDANSK4,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDANSK5,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLBERED,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLSHIP,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDLEVN1,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDLEVN2,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDLEVN3,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDLEVN4,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDLEVN5,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDERSF,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDERST,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDERS1,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDERS2,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDERS3,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDERS4,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDERS5,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLERSDAT,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FNKGRPF,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FNKGRPT,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FNKGRP1,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FNKGRP2,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FNKGRP3,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FNKGRP4,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FNKGRP5,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FPTYP1,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FPTYP2,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FPTYP3,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FPTYP4,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BEART,                                                  +        
               LTH=27,                                                 +        
               ATTR=(YES)                                                       
         MFLD  PRODSLF,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRODSLT,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PROJURV,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ADLAGOMR,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ADGANGF,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ADGANGT,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TOTDEM,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CALLOFFS,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SUPPL,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SUPDESCR,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DESCR,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  STOCK,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AK,                                                     +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VORROS,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ARREARS,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DELPROM,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PREADV,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEADTIME,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PROC,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SENDDAY,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LATDEL,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PURCHID,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AGREEM,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PERDEM,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TREND,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SEAS,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DEMHIST,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DEMHISTY,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SSCDC,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SSLOCAL,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRICE,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PACKFL,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SORT,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  REFSTOP,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  WEIGHVOL,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PUBWEEK,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PUBWEEKL,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OUTPROD,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRODGRP,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FCNGRP,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SERVICE,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PARM,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  QUANT,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PACKINFO,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  MAXPT,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BLOCKED,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SAFSTOCK,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ORIGIN,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  WHAREA,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AUTJIT,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRODMOD,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SPART,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IRSTA,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDARBTYP,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDPERSON,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W2I422N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W2N422),                                           +        
               OPT=2,                                                  +        
               NXT=W2O422N1                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '24221',                                                +        
               LTH=5                                                            
         MFLD  (KDARBTYP,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDPERSON,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDDC,                                                  +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDANSKF,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDANSKT,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDANSK1,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDANSK2,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDANSK3,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDANSK4,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDANSK5,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLBERED,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLSHIP,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDLEVN1,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDLEVN2,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDLEVN3,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDLEVN4,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDLEVN5,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KDERSF,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDERST,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDERS1,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDERS2,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDERS3,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDERS4,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDERS5,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLERSDAT,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FNKGRPF,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FNKGRPT,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FNKGRP1,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FNKGRP2,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FNKGRP3,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FNKGRP4,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FNKGRP5,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FPTYP1,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FPTYP2,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FPTYP3,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FPTYP4,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (BEART,                                                 +        
               '+++++++++++++++++++++++++'),                           +        
               LTH=25,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (PRODSLF,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PRODSLT,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PROJURV,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (ADLAGOMR,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ADGANGF,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ADGANGT,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TOTDEM,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CALLOFFS,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (SUPPL,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (SUPDESCR,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (DESCR,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (STOCK,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (AK,                                                    +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (VORROS,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (ARREARS,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (DELPROM,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (PREADV,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (LEADTIME,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (PROC,                                                  +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (SENDDAY,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (LATDEL,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (PURCHID,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (AGREEM,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (PERDEM,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (TREND,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (SEAS,                                                  +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (DEMHIST,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (DEMHISTY,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (SSCDC,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (SSLOCAL,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (PRICE,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (PACKFL,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (SORT,                                                  +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (REFSTOP,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (WEIGHVOL,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (PUBWEEK,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (PUBWEEKL,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (OUTPROD,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (PRODGRP,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (FCNGRP,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (SERVICE,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (PARM,                                                  +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (QUANT,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (PACKINFO,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (MAXPT,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (BLOCKED,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (SAFSTOCK,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (ORIGIN,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (WHAREA,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (AUTJIT,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (PRODMOD,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (SPART,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (IRSTA,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
