***********************************************************************         
* CREATED BY TIN2681   ON 12/11/21  AT 07:24                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'Parts that miss prepacking info'                                
W2N446   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W2T446 7',                                           +        
               8='W2T446 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,14)),                                        +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Parts that miss prepacking info',                      +        
               POS=(1,11),LTH=31,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,43),LTH=38,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Pub week fr',                                          +        
               POS=(2,2),LTH=11,                                       +        
               ATTR=(PROT)                                                      
FOMIN    DFLD  POS=(2,14),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'to',                                                   +        
               POS=(2,20),LTH=2,                                       +        
               ATTR=(PROT)                                                      
TOMIN    DFLD  POS=(2,23),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Proj',                                                 +        
               POS=(2,29),LTH=4,                                       +        
               ATTR=(PROT)                                                      
PROJIN   DFLD  POS=(2,34),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'DC',                                                   +        
               POS=(2,39),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DCIN     DFLD  POS=(2,42),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
FOMUT    DFLD  POS=(3,14),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
TOMUT    DFLD  POS=(3,23),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
PROJUT   DFLD  POS=(3,34),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DCUT     DFLD  POS=(3,42),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
LEVNRUT  DFLD  POS=(3,45),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Part No  Proj EmbcodeQ2 Publ.Week Pisk Date from Wareho+        
               use',                                                   +        
               POS=(5,3),LTH=58,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Procurer',                                             +        
               POS=(6,42),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DO 12                                                                  
ARTNR    DFLD  POS=(7,2),LTH=9,                                        +        
               ATTR=(PROT)                                                      
PROJ     DFLD  POS=(7,12),LTH=4,                                       +        
               ATTR=(PROT)                                                      
EMBQ2    DFLD  POS=(7,23),LTH=3,                                       +        
               ATTR=(PROT)                                                      
PUBL     DFLD  POS=(7,31),LTH=5,                                       +        
               ATTR=(PROT)                                                      
PISK     DFLD  POS=(7,39),LTH=1,                                       +        
               ATTR=(PROT)                                                      
REGDAT   DFLD  POS=(7,45),LTH=6,                                       +        
               ATTR=(PROT)                                                      
LEVNR    DFLD  POS=(7,52),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         ENDDO                                                                  
         DFLD  'F7=First  F8=Next                   F10=WHELP          +        
                 ',                                                    +        
               POS=(21,2),LTH=57,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W2O446N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W2N446,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W2I446N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  FOMIN,                                                  +        
               LTH=2                                                            
         MFLD  FOMUT,                                                  +        
               LTH=5                                                            
         MFLD  TOMIN,                                                  +        
               LTH=2                                                            
         MFLD  TOMUT,                                                  +        
               LTH=5                                                            
         MFLD  PROJIN,                                                 +        
               LTH=2                                                            
         MFLD  PROJUT,                                                 +        
               LTH=4                                                            
         MFLD  DCIN,                                                   +        
               LTH=2                                                            
         MFLD  DCUT,                                                   +        
               LTH=2                                                            
         MFLD  LEVNRUT,                                                +        
               LTH=5                                                            
         DO 12                                                                  
         MFLD  ARTNR,                                                  +        
               LTH=9                                                            
         MFLD  PROJ,                                                   +        
               LTH=4                                                            
         MFLD  EMBQ2,                                                  +        
               LTH=3                                                            
         MFLD  PUBL,                                                   +        
               LTH=5                                                            
         MFLD  PISK,                                                   +        
               LTH=1                                                            
         MFLD  REGDAT,                                                 +        
               LTH=6                                                            
         MFLD  LEVNR,                                                  +        
               LTH=5                                                            
         ENDDO                                                                  
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  FSYSMSG,                                                +        
               LTH=79                                                           
         MSGEND                                                                 
W2I446N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W2N446),                                           +        
               OPT=2,                                                  +        
               NXT=W2O446N1                                                     
MID      LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '24462',                                                +        
               LTH=5                                                            
         MFLD  (FOMIN,                                                 +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  FOMUT,                                                  +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (TOMIN,                                                 +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  TOMUT,                                                  +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (PROJIN,                                                +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  PROJUT,                                                 +        
               LTH=4,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DCIN,                                                  +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  DCUT,                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
