***********************************************************************         
* CREATED BY PC51312   ON 46/11/23  AT 15:30                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'DC Segment Table Steering       '                               
W2N455   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W2T455 6',                                           +        
               7='W2T455 7',                                           +        
               8='W2T455 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W2T455U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='W0T501  ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W2N455   DPAGE CURSOR=((2,5)),                                         +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DC Segment Table Steering',                            +        
               POS=(1,12),LTH=25,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'DC',                                                   +        
               POS=(2,2),LTH=2,                                        +        
               ATTR=(NUM,PROT)                                                  
IDDCI    DFLD  POS=(2,5),LTH=2,                                        +        
               ATTR=(NOPROT)                                                    
         DFLD  'Copy from DC',                                         +        
               POS=(2,10),LTH=12,                                      +        
               ATTR=(NUM,PROT)                                                  
IDDCCPY  DFLD  POS=(2,23),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Minimum Picks roll 12 HF:',                            +        
               POS=(2,28),LTH=25,                                      +        
               ATTR=(PROT)                                                      
KVOTU    DFLD  POS=(2,54),LTH=7,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Maximum LeadTimes',                                    +        
               POS=(2,64),LTH=17,                                      +        
               ATTR=(PROT)                                                      
IDDCU    DFLD  POS=(3,5),LTH=2,                                        +        
               ATTR=(PROT,MOD)                                                  
KVOTI    DFLD  POS=(3,54),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Low   :',                                              +        
               POS=(3,65),LTH=7,                                       +        
               ATTR=(PROT)                                                      
KVECFTLU DFLD  POS=(3,73),LTH=3,                                       +        
               ATTR=(PROT)                                                      
KVECFTLI DFLD  POS=(3,77),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'ID:',                                                  +        
               POS=(4,13),LTH=3,                                       +        
               ATTR=(PROT)                                                      
IDUSER   DFLD  POS=(4,17),LTH=08,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
         DFLD  'Date Changed:',                                        +        
               POS=(4,28),LTH=13,                                      +        
               ATTR=(PROT)                                                      
TIUPPDAT DFLD  POS=(4,42),LTH=06,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  'Medium:',                                              +        
               POS=(4,65),LTH=7,                                       +        
               ATTR=(PROT)                                                      
KVECFTMU DFLD  POS=(4,73),LTH=3,                                       +        
               ATTR=(PROT)                                                      
KVECFTMI DFLD  POS=(4,77),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'High  :',                                              +        
               POS=(5,65),LTH=7,                                       +        
               ATTR=(PROT)                                                      
KVECFTHU DFLD  POS=(5,73),LTH=3,                                       +        
               ATTR=(PROT)                                                      
KVECFTHI DFLD  POS=(5,77),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Frequency:',                                           +        
               POS=(6,38),LTH=10,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'LF',                                                   +        
               POS=(6,49),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'HF',                                                   +        
               POS=(6,66),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Seg.',                                                 +        
               POS=(7,2),LTH=4,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'Description',                                          +        
               POS=(7,8),LTH=11,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'LeadTime :',                                           +        
               POS=(7,38),LTH=10,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Low',                                                  +        
               POS=(7,49),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Med',                                                  +        
               POS=(7,53),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Hi ',                                                  +        
               POS=(7,57),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Hi+',                                                  +        
               POS=(7,61),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Low',                                                  +        
               POS=(7,66),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Med',                                                  +        
               POS=(7,70),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Hi ',                                                  +        
               POS=(7,74),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Hi+',                                                  +        
               POS=(7,78),LTH=3,                                       +        
               ATTR=(PROT)                                                      
KDSEG01  DFLD  POS=(8,2),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
DESCR01  DFLD  POS=(8,8),LTH=40,                                       +        
               ATTR=(PROT,MOD)                                                  
TBLFLU01 DFLD  POS=(8,49),LTH=1,                                       +        
               ATTR=(PROT)                                                      
TBLFLI01 DFLD  POS=(8,51),LTH=1,                                       +        
               ATTR=(ALPHA,NOPROT)                                              
TBLFMU01 DFLD  POS=(8,53),LTH=1,                                       +        
               ATTR=(PROT)                                                      
TBLFMI01 DFLD  POS=(8,55),LTH=1,                                       +        
               ATTR=(ALPHA,NOPROT)                                              
TBLFHU01 DFLD  POS=(8,57),LTH=1,                                       +        
               ATTR=(PROT)                                                      
TBLFHI01 DFLD  POS=(8,59),LTH=1,                                       +        
               ATTR=(ALPHA,NOPROT)                                              
TBLFXU01 DFLD  POS=(8,61),LTH=1,                                       +        
               ATTR=(PROT)                                                      
TBLFXI01 DFLD  POS=(8,63),LTH=1,                                       +        
               ATTR=(ALPHA,NOPROT)                                              
TBHFLU01 DFLD  POS=(8,66),LTH=1,                                       +        
               ATTR=(PROT)                                                      
TBHFLI01 DFLD  POS=(8,68),LTH=1,                                       +        
               ATTR=(ALPHA,NOPROT)                                              
TBHFMU01 DFLD  POS=(8,70),LTH=1,                                       +        
               ATTR=(PROT)                                                      
TBHFMI01 DFLD  POS=(8,72),LTH=1,                                       +        
               ATTR=(ALPHA,NOPROT)                                              
TBHFHU01 DFLD  POS=(8,74),LTH=1,                                       +        
               ATTR=(PROT)                                                      
TBHFHI01 DFLD  POS=(8,76),LTH=1,                                       +        
               ATTR=(ALPHA,NOPROT)                                              
TBHFXU01 DFLD  POS=(8,78),LTH=1,                                       +        
               ATTR=(PROT)                                                      
TBHFXI01 DFLD  POS=(8,80),LTH=1,                                       +        
               ATTR=(ALPHA,NOPROT)                                              
KDSEG02  DFLD  POS=(9,2),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
DESCR02  DFLD  POS=(9,8),LTH=40,                                       +        
               ATTR=(PROT,MOD)                                                  
TBLFLU02 DFLD  POS=(9,49),LTH=1,                                       +        
               ATTR=(PROT)                                                      
TBLFLI02 DFLD  POS=(9,51),LTH=1,                                       +        
               ATTR=(ALPHA,NOPROT)                                              
TBLFMU02 DFLD  POS=(9,53),LTH=1,                                       +        
               ATTR=(PROT)                                                      
TBLFMI02 DFLD  POS=(9,55),LTH=1,                                       +        
               ATTR=(ALPHA,NOPROT)                                              
TBLFHU02 DFLD  POS=(9,57),LTH=1,                                       +        
               ATTR=(PROT)                                                      
TBLFHI02 DFLD  POS=(9,59),LTH=1,                                       +        
               ATTR=(ALPHA,NOPROT)                                              
TBLFXU02 DFLD  POS=(9,61),LTH=1,                                       +        
               ATTR=(PROT)                                                      
TBLFXI02 DFLD  POS=(9,63),LTH=1,                                       +        
               ATTR=(ALPHA,NOPROT)                                              
TBHFLU02 DFLD  POS=(9,66),LTH=1,                                       +        
               ATTR=(PROT)                                                      
TBHFLI02 DFLD  POS=(9,68),LTH=1,                                       +        
               ATTR=(ALPHA,NOPROT)                                              
TBHFMU02 DFLD  POS=(9,70),LTH=1,                                       +        
               ATTR=(PROT)                                                      
TBHFMI02 DFLD  POS=(9,72),LTH=1,                                       +        
               ATTR=(ALPHA,NOPROT)                                              
TBHFHU02 DFLD  POS=(9,74),LTH=1,                                       +        
               ATTR=(PROT)                                                      
TBHFHI02 DFLD  POS=(9,76),LTH=1,                                       +        
               ATTR=(ALPHA,NOPROT)                                              
TBHFXU02 DFLD  POS=(9,78),LTH=1,                                       +        
               ATTR=(PROT)                                                      
TBHFXI02 DFLD  POS=(9,80),LTH=1,                                       +        
               ATTR=(ALPHA,NOPROT)                                              
KDSEG03  DFLD  POS=(10,2),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DESCR03  DFLD  POS=(10,8),LTH=40,                                      +        
               ATTR=(PROT,MOD)                                                  
TBLFLU03 DFLD  POS=(10,49),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBLFLI03 DFLD  POS=(10,51),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TBLFMU03 DFLD  POS=(10,53),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBLFMI03 DFLD  POS=(10,55),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TBLFHU03 DFLD  POS=(10,57),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBLFHI03 DFLD  POS=(10,59),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TBLFXU03 DFLD  POS=(10,61),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBLFXI03 DFLD  POS=(10,63),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TBHFLU03 DFLD  POS=(10,66),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBHFLI03 DFLD  POS=(10,68),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TBHFMU03 DFLD  POS=(10,70),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBHFMI03 DFLD  POS=(10,72),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TBHFHU03 DFLD  POS=(10,74),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBHFHI03 DFLD  POS=(10,76),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TBHFXU03 DFLD  POS=(10,78),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBHFXI03 DFLD  POS=(10,80),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
KDSEG04  DFLD  POS=(11,2),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DESCR04  DFLD  POS=(11,8),LTH=40,                                      +        
               ATTR=(PROT,MOD)                                                  
TBLFLU04 DFLD  POS=(11,49),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBLFLI04 DFLD  POS=(11,51),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TBLFMU04 DFLD  POS=(11,53),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBLFMI04 DFLD  POS=(11,55),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TBLFHU04 DFLD  POS=(11,57),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBLFHI04 DFLD  POS=(11,59),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TBLFXU04 DFLD  POS=(11,61),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBLFXI04 DFLD  POS=(11,63),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TBHFLU04 DFLD  POS=(11,66),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBHFLI04 DFLD  POS=(11,68),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TBHFMU04 DFLD  POS=(11,70),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBHFMI04 DFLD  POS=(11,72),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TBHFHU04 DFLD  POS=(11,74),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBHFHI04 DFLD  POS=(11,76),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TBHFXU04 DFLD  POS=(11,78),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBHFXI04 DFLD  POS=(11,80),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
KDSEG05  DFLD  POS=(12,2),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DESCR05  DFLD  POS=(12,8),LTH=40,                                      +        
               ATTR=(PROT,MOD)                                                  
TBLFLU05 DFLD  POS=(12,49),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBLFLI05 DFLD  POS=(12,51),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TBLFMU05 DFLD  POS=(12,53),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBLFMI05 DFLD  POS=(12,55),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TBLFHU05 DFLD  POS=(12,57),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBLFHI05 DFLD  POS=(12,59),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TBLFXU05 DFLD  POS=(12,61),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBLFXI05 DFLD  POS=(12,63),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TBHFLU05 DFLD  POS=(12,66),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBHFLI05 DFLD  POS=(12,68),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TBHFMU05 DFLD  POS=(12,70),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBHFMI05 DFLD  POS=(12,72),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TBHFHU05 DFLD  POS=(12,74),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBHFHI05 DFLD  POS=(12,76),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TBHFXU05 DFLD  POS=(12,78),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBHFXI05 DFLD  POS=(12,80),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
KDSEG06  DFLD  POS=(13,2),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DESCR06  DFLD  POS=(13,8),LTH=40,                                      +        
               ATTR=(PROT,MOD)                                                  
TBLFLU06 DFLD  POS=(13,49),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBLFLI06 DFLD  POS=(13,51),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TBLFMU06 DFLD  POS=(13,53),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBLFMI06 DFLD  POS=(13,55),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TBLFHU06 DFLD  POS=(13,57),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBLFHI06 DFLD  POS=(13,59),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TBLFXU06 DFLD  POS=(13,61),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBLFXI06 DFLD  POS=(13,63),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TBHFLU06 DFLD  POS=(13,66),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBHFLI06 DFLD  POS=(13,68),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TBHFMU06 DFLD  POS=(13,70),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBHFMI06 DFLD  POS=(13,72),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TBHFHU06 DFLD  POS=(13,74),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBHFHI06 DFLD  POS=(13,76),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TBHFXU06 DFLD  POS=(13,78),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBHFXI06 DFLD  POS=(13,80),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
KDSEG07  DFLD  POS=(14,2),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DESCR07  DFLD  POS=(14,8),LTH=40,                                      +        
               ATTR=(PROT,MOD)                                                  
TBLFLU07 DFLD  POS=(14,49),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBLFLI07 DFLD  POS=(14,51),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TBLFMU07 DFLD  POS=(14,53),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBLFMI07 DFLD  POS=(14,55),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TBLFHU07 DFLD  POS=(14,57),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBLFHI07 DFLD  POS=(14,59),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TBLFXU07 DFLD  POS=(14,61),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBLFXI07 DFLD  POS=(14,63),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TBHFLU07 DFLD  POS=(14,66),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBHFLI07 DFLD  POS=(14,68),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TBHFMU07 DFLD  POS=(14,70),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBHFMI07 DFLD  POS=(14,72),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TBHFHU07 DFLD  POS=(14,74),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBHFHI07 DFLD  POS=(14,76),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TBHFXU07 DFLD  POS=(14,78),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBHFXI07 DFLD  POS=(14,80),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
KDSEG08  DFLD  POS=(15,2),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DESCR08  DFLD  POS=(15,8),LTH=40,                                      +        
               ATTR=(PROT,MOD)                                                  
TBLFLU08 DFLD  POS=(15,49),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBLFLI08 DFLD  POS=(15,51),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TBLFMU08 DFLD  POS=(15,53),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBLFMI08 DFLD  POS=(15,55),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TBLFHU08 DFLD  POS=(15,57),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBLFHI08 DFLD  POS=(15,59),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TBLFXU08 DFLD  POS=(15,61),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBLFXI08 DFLD  POS=(15,63),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TBHFLU08 DFLD  POS=(15,66),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBHFLI08 DFLD  POS=(15,68),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TBHFMU08 DFLD  POS=(15,70),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBHFMI08 DFLD  POS=(15,72),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TBHFHU08 DFLD  POS=(15,74),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBHFHI08 DFLD  POS=(15,76),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TBHFXU08 DFLD  POS=(15,78),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBHFXI08 DFLD  POS=(15,80),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
KDSEG09  DFLD  POS=(16,2),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DESCR09  DFLD  POS=(16,8),LTH=40,                                      +        
               ATTR=(PROT,MOD)                                                  
TBLFLU09 DFLD  POS=(16,49),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBLFLI09 DFLD  POS=(16,51),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TBLFMU09 DFLD  POS=(16,53),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBLFMI09 DFLD  POS=(16,55),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TBLFHU09 DFLD  POS=(16,57),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBLFHI09 DFLD  POS=(16,59),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TBLFXU09 DFLD  POS=(16,61),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBLFXI09 DFLD  POS=(16,63),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TBHFLU09 DFLD  POS=(16,66),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBHFLI09 DFLD  POS=(16,68),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TBHFMU09 DFLD  POS=(16,70),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBHFMI09 DFLD  POS=(16,72),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TBHFHU09 DFLD  POS=(16,74),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBHFHI09 DFLD  POS=(16,76),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TBHFXU09 DFLD  POS=(16,78),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBHFXI09 DFLD  POS=(16,80),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
KDSEG10  DFLD  POS=(17,2),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DESCR10  DFLD  POS=(17,8),LTH=40,                                      +        
               ATTR=(PROT,MOD)                                                  
TBLFLU10 DFLD  POS=(17,49),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBLFLI10 DFLD  POS=(17,51),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TBLFMU10 DFLD  POS=(17,53),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBLFMI10 DFLD  POS=(17,55),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TBLFHU10 DFLD  POS=(17,57),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBLFHI10 DFLD  POS=(17,59),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TBLFXU10 DFLD  POS=(17,61),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBLFXI10 DFLD  POS=(17,63),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TBHFLU10 DFLD  POS=(17,66),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBHFLI10 DFLD  POS=(17,68),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TBHFMU10 DFLD  POS=(17,70),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBHFMI10 DFLD  POS=(17,72),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TBHFHU10 DFLD  POS=(17,74),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBHFHI10 DFLD  POS=(17,76),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TBHFXU10 DFLD  POS=(17,78),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBHFXI10 DFLD  POS=(17,80),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
KDSEG11  DFLD  POS=(18,2),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DESCR11  DFLD  POS=(18,8),LTH=40,                                      +        
               ATTR=(PROT,MOD)                                                  
TBLFLU11 DFLD  POS=(18,49),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBLFLI11 DFLD  POS=(18,51),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TBLFMU11 DFLD  POS=(18,53),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBLFMI11 DFLD  POS=(18,55),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TBLFHU11 DFLD  POS=(18,57),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBLFHI11 DFLD  POS=(18,59),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TBLFXU11 DFLD  POS=(18,61),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBLFXI11 DFLD  POS=(18,63),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TBHFLU11 DFLD  POS=(18,66),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBHFLI11 DFLD  POS=(18,68),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TBHFMU11 DFLD  POS=(18,70),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBHFMI11 DFLD  POS=(18,72),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TBHFHU11 DFLD  POS=(18,74),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBHFHI11 DFLD  POS=(18,76),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TBHFXU11 DFLD  POS=(18,78),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBHFXI11 DFLD  POS=(18,80),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
KDSEG12  DFLD  POS=(19,2),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DESCR12  DFLD  POS=(19,8),LTH=40,                                      +        
               ATTR=(PROT,MOD)                                                  
TBLFLU12 DFLD  POS=(19,49),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBLFLI12 DFLD  POS=(19,51),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TBLFMU12 DFLD  POS=(19,53),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBLFMI12 DFLD  POS=(19,55),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TBLFHU12 DFLD  POS=(19,57),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBLFHI12 DFLD  POS=(19,59),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TBLFXU12 DFLD  POS=(19,61),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBLFXI12 DFLD  POS=(19,63),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TBHFLU12 DFLD  POS=(19,66),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBHFLI12 DFLD  POS=(19,68),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TBHFMU12 DFLD  POS=(19,70),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBHFMI12 DFLD  POS=(19,72),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TBHFHU12 DFLD  POS=(19,74),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBHFHI12 DFLD  POS=(19,76),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TBHFXU12 DFLD  POS=(19,78),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBHFXI12 DFLD  POS=(19,80),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
KDSEG13  DFLD  POS=(20,2),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DESCR13  DFLD  POS=(20,8),LTH=40,                                      +        
               ATTR=(PROT,MOD)                                                  
TBLFLU13 DFLD  POS=(20,49),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBLFLI13 DFLD  POS=(20,51),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TBLFMU13 DFLD  POS=(20,53),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBLFMI13 DFLD  POS=(20,55),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TBLFHU13 DFLD  POS=(20,57),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBLFHI13 DFLD  POS=(20,59),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TBLFXU13 DFLD  POS=(20,61),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBLFXI13 DFLD  POS=(20,63),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TBHFLU13 DFLD  POS=(20,66),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBHFLI13 DFLD  POS=(20,68),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TBHFMU13 DFLD  POS=(20,70),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBHFMI13 DFLD  POS=(20,72),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TBHFHU13 DFLD  POS=(20,74),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBHFHI13 DFLD  POS=(20,76),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TBHFXU13 DFLD  POS=(20,78),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TBHFXI13 DFLD  POS=(20,80),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
         DFLD  'F10=WHELP  F11=Update',                                +        
               POS=(22,2),LTH=21,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W2O455N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W2N455,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W2I455N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W2N455                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  IDDCI,                                                  +        
               LTH=2                                                            
         MFLD  IDDCU,                                                  +        
               LTH=2                                                            
         MFLD  IDDCCPY,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVOTU,                                                  +        
               LTH=7                                                            
         MFLD  KVOTI,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVECFTLU,                                               +        
               LTH=3                                                            
         MFLD  KVECFTLI,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVECFTMU,                                               +        
               LTH=3                                                            
         MFLD  KVECFTMI,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVECFTHU,                                               +        
               LTH=3                                                            
         MFLD  KVECFTHI,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDUSER,                                                 +        
               LTH=08                                                           
         MFLD  TIUPPDAT,                                               +        
               LTH=06                                                           
         MFLD  KDSEG01,                                                +        
               LTH=4                                                            
         MFLD  DESCR01,                                                +        
               LTH=40                                                           
         MFLD  TBLFLU01,                                               +        
               LTH=1                                                            
         MFLD  TBLFLI01,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBLFMU01,                                               +        
               LTH=1                                                            
         MFLD  TBLFMI01,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBLFHU01,                                               +        
               LTH=1                                                            
         MFLD  TBLFHI01,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBLFXU01,                                               +        
               LTH=1                                                            
         MFLD  TBLFXI01,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBHFLU01,                                               +        
               LTH=1                                                            
         MFLD  TBHFLI01,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBHFMU01,                                               +        
               LTH=1                                                            
         MFLD  TBHFMI01,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBHFHU01,                                               +        
               LTH=1                                                            
         MFLD  TBHFHI01,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBHFXU01,                                               +        
               LTH=1                                                            
         MFLD  TBHFXI01,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDSEG02,                                                +        
               LTH=4                                                            
         MFLD  DESCR02,                                                +        
               LTH=40                                                           
         MFLD  TBLFLU02,                                               +        
               LTH=1                                                            
         MFLD  TBLFLI02,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBLFMU02,                                               +        
               LTH=1                                                            
         MFLD  TBLFMI02,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBLFHU02,                                               +        
               LTH=1                                                            
         MFLD  TBLFHI02,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBLFXU02,                                               +        
               LTH=1                                                            
         MFLD  TBLFXI02,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBHFLU02,                                               +        
               LTH=1                                                            
         MFLD  TBHFLI02,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBHFMU02,                                               +        
               LTH=1                                                            
         MFLD  TBHFMI02,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBHFHU02,                                               +        
               LTH=1                                                            
         MFLD  TBHFHI02,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBHFXU02,                                               +        
               LTH=1                                                            
         MFLD  TBHFXI02,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDSEG03,                                                +        
               LTH=4                                                            
         MFLD  DESCR03,                                                +        
               LTH=40                                                           
         MFLD  TBLFLU03,                                               +        
               LTH=1                                                            
         MFLD  TBLFLI03,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBLFMU03,                                               +        
               LTH=1                                                            
         MFLD  TBLFMI03,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBLFHU03,                                               +        
               LTH=1                                                            
         MFLD  TBLFHI03,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBLFXU03,                                               +        
               LTH=1                                                            
         MFLD  TBLFXI03,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBHFLU03,                                               +        
               LTH=1                                                            
         MFLD  TBHFLI03,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBHFMU03,                                               +        
               LTH=1                                                            
         MFLD  TBHFMI03,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBHFHU03,                                               +        
               LTH=1                                                            
         MFLD  TBHFHI03,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBHFXU03,                                               +        
               LTH=1                                                            
         MFLD  TBHFXI03,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDSEG04,                                                +        
               LTH=4                                                            
         MFLD  DESCR04,                                                +        
               LTH=40                                                           
         MFLD  TBLFLU04,                                               +        
               LTH=1                                                            
         MFLD  TBLFLI04,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBLFMU04,                                               +        
               LTH=1                                                            
         MFLD  TBLFMI04,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBLFHU04,                                               +        
               LTH=1                                                            
         MFLD  TBLFHI04,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBLFXU04,                                               +        
               LTH=1                                                            
         MFLD  TBLFXI04,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBHFLU04,                                               +        
               LTH=1                                                            
         MFLD  TBHFLI04,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBHFMU04,                                               +        
               LTH=1                                                            
         MFLD  TBHFMI04,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBHFHU04,                                               +        
               LTH=1                                                            
         MFLD  TBHFHI04,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBHFXU04,                                               +        
               LTH=1                                                            
         MFLD  TBHFXI04,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDSEG05,                                                +        
               LTH=4                                                            
         MFLD  DESCR05,                                                +        
               LTH=40                                                           
         MFLD  TBLFLU05,                                               +        
               LTH=1                                                            
         MFLD  TBLFLI05,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBLFMU05,                                               +        
               LTH=1                                                            
         MFLD  TBLFMI05,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBLFHU05,                                               +        
               LTH=1                                                            
         MFLD  TBLFHI05,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBLFXU05,                                               +        
               LTH=1                                                            
         MFLD  TBLFXI05,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBHFLU05,                                               +        
               LTH=1                                                            
         MFLD  TBHFLI05,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBHFMU05,                                               +        
               LTH=1                                                            
         MFLD  TBHFMI05,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBHFHU05,                                               +        
               LTH=1                                                            
         MFLD  TBHFHI05,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBHFXU05,                                               +        
               LTH=1                                                            
         MFLD  TBHFXI05,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDSEG06,                                                +        
               LTH=4                                                            
         MFLD  DESCR06,                                                +        
               LTH=40                                                           
         MFLD  TBLFLU06,                                               +        
               LTH=1                                                            
         MFLD  TBLFLI06,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBLFMU06,                                               +        
               LTH=1                                                            
         MFLD  TBLFMI06,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBLFHU06,                                               +        
               LTH=1                                                            
         MFLD  TBLFHI06,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBLFXU06,                                               +        
               LTH=1                                                            
         MFLD  TBLFXI06,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBHFLU06,                                               +        
               LTH=1                                                            
         MFLD  TBHFLI06,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBHFMU06,                                               +        
               LTH=1                                                            
         MFLD  TBHFMI06,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBHFHU06,                                               +        
               LTH=1                                                            
         MFLD  TBHFHI06,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBHFXU06,                                               +        
               LTH=1                                                            
         MFLD  TBHFXI06,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDSEG07,                                                +        
               LTH=4                                                            
         MFLD  DESCR07,                                                +        
               LTH=40                                                           
         MFLD  TBLFLU07,                                               +        
               LTH=1                                                            
         MFLD  TBLFLI07,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBLFMU07,                                               +        
               LTH=1                                                            
         MFLD  TBLFMI07,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBLFHU07,                                               +        
               LTH=1                                                            
         MFLD  TBLFHI07,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBLFXU07,                                               +        
               LTH=1                                                            
         MFLD  TBLFXI07,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBHFLU07,                                               +        
               LTH=1                                                            
         MFLD  TBHFLI07,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBHFMU07,                                               +        
               LTH=1                                                            
         MFLD  TBHFMI07,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBHFHU07,                                               +        
               LTH=1                                                            
         MFLD  TBHFHI07,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBHFXU07,                                               +        
               LTH=1                                                            
         MFLD  TBHFXI07,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDSEG08,                                                +        
               LTH=4                                                            
         MFLD  DESCR08,                                                +        
               LTH=40                                                           
         MFLD  TBLFLU08,                                               +        
               LTH=1                                                            
         MFLD  TBLFLI08,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBLFMU08,                                               +        
               LTH=1                                                            
         MFLD  TBLFMI08,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBLFHU08,                                               +        
               LTH=1                                                            
         MFLD  TBLFHI08,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBLFXU08,                                               +        
               LTH=1                                                            
         MFLD  TBLFXI08,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBHFLU08,                                               +        
               LTH=1                                                            
         MFLD  TBHFLI08,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBHFMU08,                                               +        
               LTH=1                                                            
         MFLD  TBHFMI08,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBHFHU08,                                               +        
               LTH=1                                                            
         MFLD  TBHFHI08,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBHFXU08,                                               +        
               LTH=1                                                            
         MFLD  TBHFXI08,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDSEG09,                                                +        
               LTH=4                                                            
         MFLD  DESCR09,                                                +        
               LTH=40                                                           
         MFLD  TBLFLU09,                                               +        
               LTH=1                                                            
         MFLD  TBLFLI09,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBLFMU09,                                               +        
               LTH=1                                                            
         MFLD  TBLFMI09,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBLFHU09,                                               +        
               LTH=1                                                            
         MFLD  TBLFHI09,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBLFXU09,                                               +        
               LTH=1                                                            
         MFLD  TBLFXI09,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBHFLU09,                                               +        
               LTH=1                                                            
         MFLD  TBHFLI09,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBHFMU09,                                               +        
               LTH=1                                                            
         MFLD  TBHFMI09,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBHFHU09,                                               +        
               LTH=1                                                            
         MFLD  TBHFHI09,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBHFXU09,                                               +        
               LTH=1                                                            
         MFLD  TBHFXI09,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDSEG10,                                                +        
               LTH=4                                                            
         MFLD  DESCR10,                                                +        
               LTH=40                                                           
         MFLD  TBLFLU10,                                               +        
               LTH=1                                                            
         MFLD  TBLFLI10,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBLFMU10,                                               +        
               LTH=1                                                            
         MFLD  TBLFMI10,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBLFHU10,                                               +        
               LTH=1                                                            
         MFLD  TBLFHI10,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBLFXU10,                                               +        
               LTH=1                                                            
         MFLD  TBLFXI10,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBHFLU10,                                               +        
               LTH=1                                                            
         MFLD  TBHFLI10,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBHFMU10,                                               +        
               LTH=1                                                            
         MFLD  TBHFMI10,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBHFHU10,                                               +        
               LTH=1                                                            
         MFLD  TBHFHI10,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBHFXU10,                                               +        
               LTH=1                                                            
         MFLD  TBHFXI10,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDSEG11,                                                +        
               LTH=4                                                            
         MFLD  DESCR11,                                                +        
               LTH=40                                                           
         MFLD  TBLFLU11,                                               +        
               LTH=1                                                            
         MFLD  TBLFLI11,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBLFMU11,                                               +        
               LTH=1                                                            
         MFLD  TBLFMI11,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBLFHU11,                                               +        
               LTH=1                                                            
         MFLD  TBLFHI11,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBLFXU11,                                               +        
               LTH=1                                                            
         MFLD  TBLFXI11,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBHFLU11,                                               +        
               LTH=1                                                            
         MFLD  TBHFLI11,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBHFMU11,                                               +        
               LTH=1                                                            
         MFLD  TBHFMI11,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBHFHU11,                                               +        
               LTH=1                                                            
         MFLD  TBHFHI11,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBHFXU11,                                               +        
               LTH=1                                                            
         MFLD  TBHFXI11,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDSEG12,                                                +        
               LTH=4                                                            
         MFLD  DESCR12,                                                +        
               LTH=40                                                           
         MFLD  TBLFLU12,                                               +        
               LTH=1                                                            
         MFLD  TBLFLI12,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBLFMU12,                                               +        
               LTH=1                                                            
         MFLD  TBLFMI12,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBLFHU12,                                               +        
               LTH=1                                                            
         MFLD  TBLFHI12,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBLFXU12,                                               +        
               LTH=1                                                            
         MFLD  TBLFXI12,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBHFLU12,                                               +        
               LTH=1                                                            
         MFLD  TBHFLI12,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBHFMU12,                                               +        
               LTH=1                                                            
         MFLD  TBHFMI12,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBHFHU12,                                               +        
               LTH=1                                                            
         MFLD  TBHFHI12,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBHFXU12,                                               +        
               LTH=1                                                            
         MFLD  TBHFXI12,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDSEG13,                                                +        
               LTH=4                                                            
         MFLD  DESCR13,                                                +        
               LTH=40                                                           
         MFLD  TBLFLU13,                                               +        
               LTH=1                                                            
         MFLD  TBLFLI13,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBLFMU13,                                               +        
               LTH=1                                                            
         MFLD  TBLFMI13,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBLFHU13,                                               +        
               LTH=1                                                            
         MFLD  TBLFHI13,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBLFXU13,                                               +        
               LTH=1                                                            
         MFLD  TBLFXI13,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBHFLU13,                                               +        
               LTH=1                                                            
         MFLD  TBHFLI13,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBHFMU13,                                               +        
               LTH=1                                                            
         MFLD  TBHFMI13,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBHFHU13,                                               +        
               LTH=1                                                            
         MFLD  TBHFHI13,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TBHFXU13,                                               +        
               LTH=1                                                            
         MFLD  TBHFXI13,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W2I455N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W2N455),                                           +        
               OPT=2,                                                  +        
               NXT=W2O455N1                                                     
MID      LPAGE SOR=(W2N455)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '24552',                                                +        
               LTH=5                                                            
         MFLD  (IDDCI,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (IDDCU,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (IDDCCPY,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KVOTI,                                                 +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVECFTLI,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVECFTMI,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVECFTHI,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDSEG01,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DESCR01,                                               +        
               '++++++++++++++++++++++++++++++++++++++++'),            +        
               LTH=40,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TBLFLI01,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBLFMI01,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBLFHI01,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBLFXI01,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBHFLI01,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBHFMI01,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBHFHI01,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBHFXI01,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KDSEG02,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DESCR02,                                               +        
               '++++++++++++++++++++++++++++++++++++++++'),            +        
               LTH=40,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TBLFLI02,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBLFMI02,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBLFHI02,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBLFXI02,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBHFLI02,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBHFMI02,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBHFHI02,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBHFXI02,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KDSEG03,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DESCR03,                                               +        
               '++++++++++++++++++++++++++++++++++++++++'),            +        
               LTH=40,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TBLFLI03,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBLFMI03,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBLFHI03,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBLFXI03,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBHFLI03,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBHFMI03,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBHFHI03,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBHFXI03,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KDSEG04,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DESCR04,                                               +        
               '++++++++++++++++++++++++++++++++++++++++'),            +        
               LTH=40,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TBLFLI04,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBLFMI04,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBLFHI04,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBLFXI04,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBHFLI04,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBHFMI04,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBHFHI04,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBHFXI04,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KDSEG05,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DESCR05,                                               +        
               '++++++++++++++++++++++++++++++++++++++++'),            +        
               LTH=40,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TBLFLI05,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBLFMI05,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBLFHI05,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBLFXI05,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBHFLI05,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBHFMI05,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBHFHI05,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBHFXI05,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KDSEG06,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DESCR06,                                               +        
               '++++++++++++++++++++++++++++++++++++++++'),            +        
               LTH=40,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TBLFLI06,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBLFMI06,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBLFHI06,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBLFXI06,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBHFLI06,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBHFMI06,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBHFHI06,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBHFXI06,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KDSEG07,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DESCR07,                                               +        
               '++++++++++++++++++++++++++++++++++++++++'),            +        
               LTH=40,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TBLFLI07,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBLFMI07,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBLFHI07,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBLFXI07,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBHFLI07,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBHFMI07,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBHFHI07,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBHFXI07,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KDSEG08,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DESCR08,                                               +        
               '++++++++++++++++++++++++++++++++++++++++'),            +        
               LTH=40,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TBLFLI08,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBLFMI08,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBLFHI08,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBLFXI08,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBHFLI08,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBHFMI08,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBHFHI08,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBHFXI08,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KDSEG09,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DESCR09,                                               +        
               '++++++++++++++++++++++++++++++++++++++++'),            +        
               LTH=40,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TBLFLI09,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBLFMI09,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBLFHI09,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBLFXI09,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBHFLI09,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBHFMI09,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBHFHI09,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBHFXI09,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KDSEG10,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DESCR10,                                               +        
               '++++++++++++++++++++++++++++++++++++++++'),            +        
               LTH=40,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TBLFLI10,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBLFMI10,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBLFHI10,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBLFXI10,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBHFLI10,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBHFMI10,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBHFHI10,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBHFXI10,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KDSEG11,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DESCR11,                                               +        
               '++++++++++++++++++++++++++++++++++++++++'),            +        
               LTH=40,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TBLFLI11,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBLFMI11,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBLFHI11,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBLFXI11,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBHFLI11,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBHFMI11,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBHFHI11,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBHFXI11,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KDSEG12,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DESCR12,                                               +        
               '++++++++++++++++++++++++++++++++++++++++'),            +        
               LTH=40,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TBLFLI12,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBLFMI12,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBLFHI12,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBLFXI12,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBHFLI12,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBHFMI12,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBHFHI12,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBHFXI12,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KDSEG13,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DESCR13,                                               +        
               '++++++++++++++++++++++++++++++++++++++++'),            +        
               LTH=40,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TBLFLI13,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBLFMI13,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBLFHI13,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBLFXI13,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBHFLI13,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBHFMI13,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBHFHI13,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TBHFXI13,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
