***********************************************************************         
* CREATED BY V0C1505   ON 12/08/27  AT 12:10                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'Backorder Information.          '                               
W2N425   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W2T421  ',                                           +        
               2='W2T422  ',                                           +        
               3='W2T423  ',                                           +        
               4='W2T424  ',                                           +        
               5='W2T425  ',                                           +        
               6='W2T426  ',                                           +        
               7='W2T425 7',                                           +        
               8='W2T425 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W2T425U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W2T421  ',                                          +        
               14='W2T422  ',                                          +        
               15='W2T423  ',                                          +        
               16='W2T424  ',                                          +        
               17='W2T425  ',                                          +        
               18='W2T426  ',                                          +        
               19='W2T427  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W2T425  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,13)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Backorder Information.',                               +        
               POS=(1,14),LTH=22,                                      +        
               ATTR=(PROT)                                                      
FLD0140  DFLD  POS=(1,40),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'PartNumber',                                           +        
               POS=(2,2),LTH=10,                                       +        
               ATTR=(PROT)                                                      
FLD0213  DFLD  POS=(2,13),LTH=9,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'DC',                                                   +        
               POS=(2,25),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0228  DFLD  POS=(2,28),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
FLD0313  DFLD  POS=(3,13),LTH=11,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD0328  DFLD  POS=(3,28),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'DC   Part No Dist Custom   Order',                     +        
               POS=(5,2),LTH=32,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Qty BO-dt  Res-dt C R Proc. Status  Prio',             +        
               POS=(5,39),LTH=40,                                      +        
               ATTR=(PROT)                                                      
COL0207  DFLD  POS=(7,2),LTH=2,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
COL0507  DFLD  POS=(7,5),LTH=9,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
COL1507  DFLD  POS=(7,15),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL2007  DFLD  POS=(7,20),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL2707  DFLD  POS=(7,27),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
COL3507  DFLD  POS=(7,35),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL4307  DFLD  POS=(7,43),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL5007  DFLD  POS=(7,50),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL5707  DFLD  POS=(7,57),LTH=1,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL5907  DFLD  POS=(7,59),LTH=1,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL6307  DFLD  POS=(7,63),LTH=3,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL7007  DFLD  POS=(7,70),LTH=1,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL7607  DFLD  POS=(7,76),LTH=3,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL0208  DFLD  POS=(8,2),LTH=2,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
COL0508  DFLD  POS=(8,5),LTH=9,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
COL1508  DFLD  POS=(8,15),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL2008  DFLD  POS=(8,20),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL2708  DFLD  POS=(8,27),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
COL3508  DFLD  POS=(8,35),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL4308  DFLD  POS=(8,43),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL5008  DFLD  POS=(8,50),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL5708  DFLD  POS=(8,57),LTH=1,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL5908  DFLD  POS=(8,59),LTH=1,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL6308  DFLD  POS=(8,63),LTH=3,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL7008  DFLD  POS=(8,70),LTH=1,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL7608  DFLD  POS=(8,76),LTH=3,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL0209  DFLD  POS=(9,2),LTH=2,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
COL0509  DFLD  POS=(9,5),LTH=9,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
COL1509  DFLD  POS=(9,15),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL2009  DFLD  POS=(9,20),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL2709  DFLD  POS=(9,27),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
COL3509  DFLD  POS=(9,35),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL4309  DFLD  POS=(9,43),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL5009  DFLD  POS=(9,50),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL5709  DFLD  POS=(9,57),LTH=1,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL5909  DFLD  POS=(9,59),LTH=1,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL6309  DFLD  POS=(9,63),LTH=3,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL7009  DFLD  POS=(9,70),LTH=1,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL7609  DFLD  POS=(9,76),LTH=3,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL0210  DFLD  POS=(10,2),LTH=2,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL0510  DFLD  POS=(10,5),LTH=9,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL1510  DFLD  POS=(10,15),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2010  DFLD  POS=(10,20),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2710  DFLD  POS=(10,27),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
COL3510  DFLD  POS=(10,35),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL4310  DFLD  POS=(10,43),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL5010  DFLD  POS=(10,50),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL5710  DFLD  POS=(10,57),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL5910  DFLD  POS=(10,59),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL6310  DFLD  POS=(10,63),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL7010  DFLD  POS=(10,70),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL7610  DFLD  POS=(10,76),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL0211  DFLD  POS=(11,2),LTH=2,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL0511  DFLD  POS=(11,5),LTH=9,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL1511  DFLD  POS=(11,15),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2011  DFLD  POS=(11,20),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2711  DFLD  POS=(11,27),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
COL3511  DFLD  POS=(11,35),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL4311  DFLD  POS=(11,43),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL5011  DFLD  POS=(11,50),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL5711  DFLD  POS=(11,57),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL5911  DFLD  POS=(11,59),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL6311  DFLD  POS=(11,63),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL7011  DFLD  POS=(11,70),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL7611  DFLD  POS=(11,76),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL0212  DFLD  POS=(12,2),LTH=2,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL0512  DFLD  POS=(12,5),LTH=9,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL1512  DFLD  POS=(12,15),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2012  DFLD  POS=(12,20),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2712  DFLD  POS=(12,27),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
COL3512  DFLD  POS=(12,35),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL4312  DFLD  POS=(12,43),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL5012  DFLD  POS=(12,50),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL5712  DFLD  POS=(12,57),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL5912  DFLD  POS=(12,59),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL6312  DFLD  POS=(12,63),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL7012  DFLD  POS=(12,70),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL7612  DFLD  POS=(12,76),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL0213  DFLD  POS=(13,2),LTH=2,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL0513  DFLD  POS=(13,5),LTH=9,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL1513  DFLD  POS=(13,15),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2013  DFLD  POS=(13,20),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2713  DFLD  POS=(13,27),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
COL3513  DFLD  POS=(13,35),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL4313  DFLD  POS=(13,43),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL5013  DFLD  POS=(13,50),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL5713  DFLD  POS=(13,57),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL5913  DFLD  POS=(13,59),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL6313  DFLD  POS=(13,63),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL7013  DFLD  POS=(13,70),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL7613  DFLD  POS=(13,76),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL0214  DFLD  POS=(14,2),LTH=2,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL0514  DFLD  POS=(14,5),LTH=9,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL1514  DFLD  POS=(14,15),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2014  DFLD  POS=(14,20),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2714  DFLD  POS=(14,27),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
COL3514  DFLD  POS=(14,35),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL4314  DFLD  POS=(14,43),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL5014  DFLD  POS=(14,50),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL5714  DFLD  POS=(14,57),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL5914  DFLD  POS=(14,59),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL6314  DFLD  POS=(14,63),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL7014  DFLD  POS=(14,70),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL7614  DFLD  POS=(14,76),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL0215  DFLD  POS=(15,2),LTH=2,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL0515  DFLD  POS=(15,5),LTH=9,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL1515  DFLD  POS=(15,15),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2015  DFLD  POS=(15,20),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2715  DFLD  POS=(15,27),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
COL3515  DFLD  POS=(15,35),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL4315  DFLD  POS=(15,43),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL5015  DFLD  POS=(15,50),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL5715  DFLD  POS=(15,57),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL5915  DFLD  POS=(15,59),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL6315  DFLD  POS=(15,63),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL7015  DFLD  POS=(15,70),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL7615  DFLD  POS=(15,76),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL0216  DFLD  POS=(16,2),LTH=2,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL0516  DFLD  POS=(16,5),LTH=9,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL1516  DFLD  POS=(16,15),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2016  DFLD  POS=(16,20),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2716  DFLD  POS=(16,27),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
COL3516  DFLD  POS=(16,35),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL4316  DFLD  POS=(16,43),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL5016  DFLD  POS=(16,50),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL5716  DFLD  POS=(16,57),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL5916  DFLD  POS=(16,59),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL6316  DFLD  POS=(16,63),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL7016  DFLD  POS=(16,70),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL7616  DFLD  POS=(16,76),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL0217  DFLD  POS=(17,2),LTH=2,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL0517  DFLD  POS=(17,5),LTH=9,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL1517  DFLD  POS=(17,15),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2017  DFLD  POS=(17,20),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2717  DFLD  POS=(17,27),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
COL3517  DFLD  POS=(17,35),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL4317  DFLD  POS=(17,43),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL5017  DFLD  POS=(17,50),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL5717  DFLD  POS=(17,57),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL5917  DFLD  POS=(17,59),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL6317  DFLD  POS=(17,63),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL7017  DFLD  POS=(17,70),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL7617  DFLD  POS=(17,76),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL0218  DFLD  POS=(18,2),LTH=2,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL0518  DFLD  POS=(18,5),LTH=9,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL1518  DFLD  POS=(18,15),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2018  DFLD  POS=(18,20),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2718  DFLD  POS=(18,27),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
COL3518  DFLD  POS=(18,35),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL4318  DFLD  POS=(18,43),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL5018  DFLD  POS=(18,50),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL5718  DFLD  POS=(18,57),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL5918  DFLD  POS=(18,59),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL6318  DFLD  POS=(18,63),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL7018  DFLD  POS=(18,70),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL7618  DFLD  POS=(18,76),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL0219  DFLD  POS=(19,2),LTH=2,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL0519  DFLD  POS=(19,5),LTH=9,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL1519  DFLD  POS=(19,15),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2019  DFLD  POS=(19,20),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2719  DFLD  POS=(19,27),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
COL3519  DFLD  POS=(19,35),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL4319  DFLD  POS=(19,43),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL5019  DFLD  POS=(19,50),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL5719  DFLD  POS=(19,57),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL5919  DFLD  POS=(19,59),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL6319  DFLD  POS=(19,63),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL7019  DFLD  POS=(19,70),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL7619  DFLD  POS=(19,76),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  '13 Order-Agreem 14              15 Forecast inf 16',   +        
               POS=(21,2),LTH=50,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17 BO/TPO',                                            +        
               POS=(21,65),LTH=9,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18              19              20',                   +        
               POS=(22,2),LTH=34,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '22 WHELP',                                             +        
               POS=(22,65),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W2O425N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W2N425,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W2I425N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0140,                                                +        
               LTH=40                                                           
         MFLD  FLD0213,                                                +        
               LTH=9                                                            
         MFLD  FLD0228,                                                +        
               LTH=2                                                            
         MFLD  FLD0313,                                                +        
               LTH=11                                                           
         MFLD  FLD0328,                                                +        
               LTH=2                                                            
         MFLD  COL0207,                                                +        
               LTH=2                                                            
         MFLD  COL0507,                                                +        
               LTH=9                                                            
         MFLD  COL1507,                                                +        
               LTH=4                                                            
         MFLD  COL2007,                                                +        
               LTH=6                                                            
         MFLD  COL2707,                                                +        
               LTH=7                                                            
         MFLD  COL3507,                                                +        
               LTH=7                                                            
         MFLD  COL4307,                                                +        
               LTH=6                                                            
         MFLD  COL5007,                                                +        
               LTH=6                                                            
         MFLD  COL5707,                                                +        
               LTH=1                                                            
         MFLD  COL5907,                                                +        
               LTH=1                                                            
         MFLD  COL6307,                                                +        
               LTH=3                                                            
         MFLD  COL7007,                                                +        
               LTH=1                                                            
         MFLD  COL7607,                                                +        
               LTH=3                                                            
         MFLD  COL0208,                                                +        
               LTH=2                                                            
         MFLD  COL0508,                                                +        
               LTH=9                                                            
         MFLD  COL1508,                                                +        
               LTH=4                                                            
         MFLD  COL2008,                                                +        
               LTH=6                                                            
         MFLD  COL2708,                                                +        
               LTH=7                                                            
         MFLD  COL3508,                                                +        
               LTH=7                                                            
         MFLD  COL4308,                                                +        
               LTH=6                                                            
         MFLD  COL5008,                                                +        
               LTH=6                                                            
         MFLD  COL5708,                                                +        
               LTH=1                                                            
         MFLD  COL5908,                                                +        
               LTH=1                                                            
         MFLD  COL6308,                                                +        
               LTH=3                                                            
         MFLD  COL7008,                                                +        
               LTH=1                                                            
         MFLD  COL7608,                                                +        
               LTH=3                                                            
         MFLD  COL0209,                                                +        
               LTH=2                                                            
         MFLD  COL0509,                                                +        
               LTH=9                                                            
         MFLD  COL1509,                                                +        
               LTH=4                                                            
         MFLD  COL2009,                                                +        
               LTH=6                                                            
         MFLD  COL2709,                                                +        
               LTH=7                                                            
         MFLD  COL3509,                                                +        
               LTH=7                                                            
         MFLD  COL4309,                                                +        
               LTH=6                                                            
         MFLD  COL5009,                                                +        
               LTH=6                                                            
         MFLD  COL5709,                                                +        
               LTH=1                                                            
         MFLD  COL5909,                                                +        
               LTH=1                                                            
         MFLD  COL6309,                                                +        
               LTH=3                                                            
         MFLD  COL7009,                                                +        
               LTH=1                                                            
         MFLD  COL7609,                                                +        
               LTH=3                                                            
         MFLD  COL0210,                                                +        
               LTH=2                                                            
         MFLD  COL0510,                                                +        
               LTH=9                                                            
         MFLD  COL1510,                                                +        
               LTH=4                                                            
         MFLD  COL2010,                                                +        
               LTH=6                                                            
         MFLD  COL2710,                                                +        
               LTH=7                                                            
         MFLD  COL3510,                                                +        
               LTH=7                                                            
         MFLD  COL4310,                                                +        
               LTH=6                                                            
         MFLD  COL5010,                                                +        
               LTH=6                                                            
         MFLD  COL5710,                                                +        
               LTH=1                                                            
         MFLD  COL5910,                                                +        
               LTH=1                                                            
         MFLD  COL6310,                                                +        
               LTH=3                                                            
         MFLD  COL7010,                                                +        
               LTH=1                                                            
         MFLD  COL7610,                                                +        
               LTH=3                                                            
         MFLD  COL0211,                                                +        
               LTH=2                                                            
         MFLD  COL0511,                                                +        
               LTH=9                                                            
         MFLD  COL1511,                                                +        
               LTH=4                                                            
         MFLD  COL2011,                                                +        
               LTH=6                                                            
         MFLD  COL2711,                                                +        
               LTH=7                                                            
         MFLD  COL3511,                                                +        
               LTH=7                                                            
         MFLD  COL4311,                                                +        
               LTH=6                                                            
         MFLD  COL5011,                                                +        
               LTH=6                                                            
         MFLD  COL5711,                                                +        
               LTH=1                                                            
         MFLD  COL5911,                                                +        
               LTH=1                                                            
         MFLD  COL6311,                                                +        
               LTH=3                                                            
         MFLD  COL7011,                                                +        
               LTH=1                                                            
         MFLD  COL7611,                                                +        
               LTH=3                                                            
         MFLD  COL0212,                                                +        
               LTH=2                                                            
         MFLD  COL0512,                                                +        
               LTH=9                                                            
         MFLD  COL1512,                                                +        
               LTH=4                                                            
         MFLD  COL2012,                                                +        
               LTH=6                                                            
         MFLD  COL2712,                                                +        
               LTH=7                                                            
         MFLD  COL3512,                                                +        
               LTH=7                                                            
         MFLD  COL4312,                                                +        
               LTH=6                                                            
         MFLD  COL5012,                                                +        
               LTH=6                                                            
         MFLD  COL5712,                                                +        
               LTH=1                                                            
         MFLD  COL5912,                                                +        
               LTH=1                                                            
         MFLD  COL6312,                                                +        
               LTH=3                                                            
         MFLD  COL7012,                                                +        
               LTH=1                                                            
         MFLD  COL7612,                                                +        
               LTH=3                                                            
         MFLD  COL0213,                                                +        
               LTH=2                                                            
         MFLD  COL0513,                                                +        
               LTH=9                                                            
         MFLD  COL1513,                                                +        
               LTH=4                                                            
         MFLD  COL2013,                                                +        
               LTH=6                                                            
         MFLD  COL2713,                                                +        
               LTH=7                                                            
         MFLD  COL3513,                                                +        
               LTH=7                                                            
         MFLD  COL4313,                                                +        
               LTH=6                                                            
         MFLD  COL5013,                                                +        
               LTH=6                                                            
         MFLD  COL5713,                                                +        
               LTH=1                                                            
         MFLD  COL5913,                                                +        
               LTH=1                                                            
         MFLD  COL6313,                                                +        
               LTH=3                                                            
         MFLD  COL7013,                                                +        
               LTH=1                                                            
         MFLD  COL7613,                                                +        
               LTH=3                                                            
         MFLD  COL0214,                                                +        
               LTH=2                                                            
         MFLD  COL0514,                                                +        
               LTH=9                                                            
         MFLD  COL1514,                                                +        
               LTH=4                                                            
         MFLD  COL2014,                                                +        
               LTH=6                                                            
         MFLD  COL2714,                                                +        
               LTH=7                                                            
         MFLD  COL3514,                                                +        
               LTH=7                                                            
         MFLD  COL4314,                                                +        
               LTH=6                                                            
         MFLD  COL5014,                                                +        
               LTH=6                                                            
         MFLD  COL5714,                                                +        
               LTH=1                                                            
         MFLD  COL5914,                                                +        
               LTH=1                                                            
         MFLD  COL6314,                                                +        
               LTH=3                                                            
         MFLD  COL7014,                                                +        
               LTH=1                                                            
         MFLD  COL7614,                                                +        
               LTH=3                                                            
         MFLD  COL0215,                                                +        
               LTH=2                                                            
         MFLD  COL0515,                                                +        
               LTH=9                                                            
         MFLD  COL1515,                                                +        
               LTH=4                                                            
         MFLD  COL2015,                                                +        
               LTH=6                                                            
         MFLD  COL2715,                                                +        
               LTH=7                                                            
         MFLD  COL3515,                                                +        
               LTH=7                                                            
         MFLD  COL4315,                                                +        
               LTH=6                                                            
         MFLD  COL5015,                                                +        
               LTH=6                                                            
         MFLD  COL5715,                                                +        
               LTH=1                                                            
         MFLD  COL5915,                                                +        
               LTH=1                                                            
         MFLD  COL6315,                                                +        
               LTH=3                                                            
         MFLD  COL7015,                                                +        
               LTH=1                                                            
         MFLD  COL7615,                                                +        
               LTH=3                                                            
         MFLD  COL0216,                                                +        
               LTH=2                                                            
         MFLD  COL0516,                                                +        
               LTH=9                                                            
         MFLD  COL1516,                                                +        
               LTH=4                                                            
         MFLD  COL2016,                                                +        
               LTH=6                                                            
         MFLD  COL2716,                                                +        
               LTH=7                                                            
         MFLD  COL3516,                                                +        
               LTH=7                                                            
         MFLD  COL4316,                                                +        
               LTH=6                                                            
         MFLD  COL5016,                                                +        
               LTH=6                                                            
         MFLD  COL5716,                                                +        
               LTH=1                                                            
         MFLD  COL5916,                                                +        
               LTH=1                                                            
         MFLD  COL6316,                                                +        
               LTH=3                                                            
         MFLD  COL7016,                                                +        
               LTH=1                                                            
         MFLD  COL7616,                                                +        
               LTH=3                                                            
         MFLD  COL0217,                                                +        
               LTH=2                                                            
         MFLD  COL0517,                                                +        
               LTH=9                                                            
         MFLD  COL1517,                                                +        
               LTH=4                                                            
         MFLD  COL2017,                                                +        
               LTH=6                                                            
         MFLD  COL2717,                                                +        
               LTH=7                                                            
         MFLD  COL3517,                                                +        
               LTH=7                                                            
         MFLD  COL4317,                                                +        
               LTH=6                                                            
         MFLD  COL5017,                                                +        
               LTH=6                                                            
         MFLD  COL5717,                                                +        
               LTH=1                                                            
         MFLD  COL5917,                                                +        
               LTH=1                                                            
         MFLD  COL6317,                                                +        
               LTH=3                                                            
         MFLD  COL7017,                                                +        
               LTH=1                                                            
         MFLD  COL7617,                                                +        
               LTH=3                                                            
         MFLD  COL0218,                                                +        
               LTH=2                                                            
         MFLD  COL0518,                                                +        
               LTH=9                                                            
         MFLD  COL1518,                                                +        
               LTH=4                                                            
         MFLD  COL2018,                                                +        
               LTH=6                                                            
         MFLD  COL2718,                                                +        
               LTH=7                                                            
         MFLD  COL3518,                                                +        
               LTH=7                                                            
         MFLD  COL4318,                                                +        
               LTH=6                                                            
         MFLD  COL5018,                                                +        
               LTH=6                                                            
         MFLD  COL5718,                                                +        
               LTH=1                                                            
         MFLD  COL5918,                                                +        
               LTH=1                                                            
         MFLD  COL6318,                                                +        
               LTH=3                                                            
         MFLD  COL7018,                                                +        
               LTH=1                                                            
         MFLD  COL7618,                                                +        
               LTH=3                                                            
         MFLD  COL0219,                                                +        
               LTH=2                                                            
         MFLD  COL0519,                                                +        
               LTH=9                                                            
         MFLD  COL1519,                                                +        
               LTH=4                                                            
         MFLD  COL2019,                                                +        
               LTH=6                                                            
         MFLD  COL2719,                                                +        
               LTH=7                                                            
         MFLD  COL3519,                                                +        
               LTH=7                                                            
         MFLD  COL4319,                                                +        
               LTH=6                                                            
         MFLD  COL5019,                                                +        
               LTH=6                                                            
         MFLD  COL5719,                                                +        
               LTH=1                                                            
         MFLD  COL5919,                                                +        
               LTH=1                                                            
         MFLD  COL6319,                                                +        
               LTH=3                                                            
         MFLD  COL7019,                                                +        
               LTH=1                                                            
         MFLD  COL7619,                                                +        
               LTH=3                                                            
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W2I425N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W2N425),                                           +        
               OPT=2,                                                  +        
               NXT=W2O425N1                                                     
MID      LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '24252',                                                +        
               LTH=5                                                            
         MFLD  (FLD0213,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0228,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  FLD0328,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL0207,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL0507,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1507,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2007,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2707,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL3507,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL4307,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5007,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5707,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5907,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL6307,                                                +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7007,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7607,                                                +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL0208,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL0508,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1508,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2008,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2708,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL3508,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL4308,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5008,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5708,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5908,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL6308,                                                +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7008,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7608,                                                +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL0209,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL0509,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1509,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2009,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2709,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL3509,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL4309,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5009,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5709,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5909,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL6309,                                                +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7009,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7609,                                                +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL0210,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL0510,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1510,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2010,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2710,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL3510,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL4310,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5010,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5710,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5910,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL6310,                                                +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7010,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7610,                                                +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL0211,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL0511,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1511,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2011,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2711,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL3511,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL4311,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5011,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5711,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5911,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL6311,                                                +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7011,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7611,                                                +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL0212,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL0512,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1512,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2012,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2712,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL3512,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL4312,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5012,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5712,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5912,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL6312,                                                +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7012,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7612,                                                +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL0213,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL0513,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1513,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2013,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2713,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL3513,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL4313,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5013,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5713,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5913,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL6313,                                                +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7013,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7613,                                                +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL0214,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL0514,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1514,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2014,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2714,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL3514,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL4314,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5014,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5714,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5914,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL6314,                                                +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7014,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7614,                                                +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL0215,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL0515,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1515,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2015,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2715,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL3515,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL4315,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5015,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5715,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5915,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL6315,                                                +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7015,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7615,                                                +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL0216,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL0516,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1516,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2016,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2716,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL3516,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL4316,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5016,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5716,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5916,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL6316,                                                +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7016,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7616,                                                +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL0217,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL0517,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1517,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2017,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2717,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL3517,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL4317,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5017,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5717,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5917,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL6317,                                                +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7017,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7617,                                                +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL0218,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL0518,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1518,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2018,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2718,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL3518,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL4318,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5018,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5718,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5918,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL6318,                                                +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7018,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7618,                                                +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL0219,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL0519,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1519,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2019,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2719,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL3519,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL4319,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5019,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5719,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5919,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL6319,                                                +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7019,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7619,                                                +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
