***********************************************************************         
* CREATED BY VXC0259   ON 12/12/18  AT 11:43                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'AGREEMENTS                      '                               
W2N421   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W2T421 7',                                           +        
               8='W2T421 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W2T421U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W2T421  ',                                          +        
               14='W2T422  ',                                          +        
               15='W2T423  ',                                          +        
               16='W2T424  ',                                          +        
               17='W0T501  ',                                          +        
               18='W2T426  ',                                          +        
               19='W0T501  ',                                          +        
               20='W2T428  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((2,13)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'AGREEMENTS.',                                          +        
               POS=(1,13),LTH=11,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Partnumber',                                           +        
               POS=(2,2),LTH=10,                                       +        
               ATTR=(NUM,PROT)                                                  
ARTNRIN  DFLD  POS=(2,13),LTH=9,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'DC',                                                   +        
               POS=(2,28),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
IDDCIN   DFLD  POS=(2,31),LTH=2,                                       +        
               ATTR=(NOPROT,MOD)                                                
ARTNRUT  DFLD  POS=(3,13),LTH=11,                                      +        
               ATTR=(PROT,MOD)                                                  
IDDCUT   DFLD  POS=(3,31),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
LEVNRDC  DFLD  POS=(3,34),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Agreement',                                            +        
               POS=(4,2),LTH=9,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'MFG           Date  Reason    ',                       +        
               POS=(4,19),LTH=30,                                      +        
               ATTR=(PROT)                                                      
IDBEST1  DFLD  POS=(5,2),LTH=12,                                       +        
               ATTR=(PROT)                                                      
LEVBEST1 DFLD  POS=(5,19),LTH=5,                                       +        
               ATTR=(PROT)                                                      
TIBEST1  DFLD  POS=(5,31),LTH=6,                                       +        
               ATTR=(PROT)                                                      
BEHBEST1 DFLD  POS=(5,39),LTH=15,                                      +        
               ATTR=(PROT)                                                      
IDBEST2  DFLD  POS=(6,2),LTH=12,                                       +        
               ATTR=(PROT)                                                      
LEVBEST2 DFLD  POS=(6,19),LTH=5,                                       +        
               ATTR=(PROT)                                                      
TIBEST2  DFLD  POS=(6,31),LTH=6,                                       +        
               ATTR=(PROT)                                                      
BEHBEST2 DFLD  POS=(6,39),LTH=15,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Valid Agreements',                                     +        
               POS=(8,2),LTH=16,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'MFG   SHP     Date  Pre Packed',                       +        
               POS=(8,19),LTH=30,                                      +        
               ATTR=(PROT)                                                      
IDAVTAL1 DFLD  POS=(9,2),LTH=12,                                       +        
               ATTR=(PROT)                                                      
LEVAVT1  DFLD  POS=(9,19),LTH=5,                                       +        
               ATTR=(PROT)                                                      
LEVSHP1  DFLD  POS=(9,25),LTH=5,                                       +        
               ATTR=(PROT)                                                      
TIAVTAL1 DFLD  POS=(9,31),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FPKPRI1  DFLD  POS=(9,39),LTH=1,                                       +        
               ATTR=(PROT)                                                      
IDAVTAL2 DFLD  POS=(10,2),LTH=12,                                      +        
               ATTR=(PROT)                                                      
LEVAVT2  DFLD  POS=(10,19),LTH=5,                                      +        
               ATTR=(PROT)                                                      
LEVSHP2  DFLD  POS=(10,25),LTH=5,                                      +        
               ATTR=(PROT)                                                      
TIAVTAL2 DFLD  POS=(10,31),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FPKPRI2  DFLD  POS=(10,39),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'MFG.  Date   Order Price Curr Order Price(Sup)',       +        
               POS=(12,2),LTH=46,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Curr Status Material Price P',                         +        
               POS=(12,49),LTH=28,                                     +        
               ATTR=(PROT)                                                      
LEVNR1   DFLD  POS=(13,2),LTH=5,                                       +        
               ATTR=(PROT)                                                      
PRLIST1  DFLD  POS=(13,8),LTH=6,                                       +        
               ATTR=(PROT)                                                      
PRSEK1   DFLD  POS=(13,16),LTH=10,                                     +        
               ATTR=(PROT)                                                      
VALSEK1  DFLD  POS=(13,27),LTH=3,                                      +        
               ATTR=(PROT)                                                      
PRSUP1   DFLD  POS=(13,38),LTH=10,                                     +        
               ATTR=(PROT)                                                      
VALSUP1  DFLD  POS=(13,49),LTH=3,                                      +        
               ATTR=(PROT)                                                      
STATUS1  DFLD  POS=(13,54),LTH=4,                                      +        
               ATTR=(PROT)                                                      
PRMATRL1 DFLD  POS=(13,65),LTH=10,                                     +        
               ATTR=(PROT)                                                      
KDMATPR1 DFLD  POS=(13,76),LTH=1,                                      +        
               ATTR=(PROT)                                                      
LEVNR2   DFLD  POS=(14,2),LTH=5,                                       +        
               ATTR=(PROT)                                                      
PRLIST2  DFLD  POS=(14,8),LTH=6,                                       +        
               ATTR=(PROT)                                                      
PRSEK2   DFLD  POS=(14,16),LTH=10,                                     +        
               ATTR=(PROT)                                                      
VALSEK2  DFLD  POS=(14,27),LTH=3,                                      +        
               ATTR=(PROT)                                                      
PRSUP2   DFLD  POS=(14,38),LTH=10,                                     +        
               ATTR=(PROT)                                                      
VALSUP2  DFLD  POS=(14,49),LTH=3,                                      +        
               ATTR=(PROT)                                                      
STATUS2  DFLD  POS=(14,54),LTH=4,                                      +        
               ATTR=(PROT)                                                      
PRMATRL2 DFLD  POS=(14,65),LTH=10,                                     +        
               ATTR=(PROT)                                                      
KDMATPR2 DFLD  POS=(14,76),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Update Agreement:',                                    +        
               POS=(16,2),LTH=17,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Agreement',                                            +        
               POS=(17,2),LTH=9,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'MFG   SHP     Date  New/Cancel',                       +        
               POS=(17,19),LTH=30,                                     +        
               ATTR=(PROT)                                                      
AVTALIN  DFLD  POS=(18,2),LTH=12,                                      +        
               ATTR=(NOPROT,MOD)                                                
LEVAVTIN DFLD  POS=(18,19),LTH=5,                                      +        
               ATTR=(NOPROT,MOD)                                                
LEVSHPIN DFLD  POS=(18,25),LTH=5,                                      +        
               ATTR=(NOPROT,MOD)                                                
TIAVTIN  DFLD  POS=(18,31),LTH=6,                                      +        
               ATTR=(NOPROT,MOD)                                                
KDCMD    DFLD  POS=(18,39),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Request for Cancellation of Agreement:',               +        
               POS=(20,2),LTH=38,                                      +        
               ATTR=(PROT)                                                      
CANCEL   DFLD  POS=(20,41),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'PF7 Up  PF8 Down  PF10 WHELP  PF11 Update',            +        
               POS=(21,2),LTH=41,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W2O421N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W2N421,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W2I421N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  ARTNRIN,                                                +        
               LTH=9                                                            
         MFLD  ARTNRUT,                                                +        
               LTH=11                                                           
         MFLD  IDDCIN,                                                 +        
               LTH=2                                                            
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  LEVNRDC,                                                +        
               LTH=5                                                            
         MFLD  IDBEST1,                                                +        
               LTH=12                                                           
         MFLD  LEVBEST1,                                               +        
               LTH=5                                                            
         MFLD  TIBEST1,                                                +        
               LTH=6                                                            
         MFLD  BEHBEST1,                                               +        
               LTH=15                                                           
         MFLD  IDBEST2,                                                +        
               LTH=12                                                           
         MFLD  LEVBEST2,                                               +        
               LTH=5                                                            
         MFLD  TIBEST2,                                                +        
               LTH=6                                                            
         MFLD  BEHBEST2,                                               +        
               LTH=15                                                           
         MFLD  IDAVTAL1,                                               +        
               LTH=12                                                           
         MFLD  LEVAVT1,                                                +        
               LTH=5                                                            
         MFLD  LEVSHP1,                                                +        
               LTH=5                                                            
         MFLD  TIAVTAL1,                                               +        
               LTH=6                                                            
         MFLD  FPKPRI1,                                                +        
               LTH=1                                                            
         MFLD  IDAVTAL2,                                               +        
               LTH=12                                                           
         MFLD  LEVAVT2,                                                +        
               LTH=5                                                            
         MFLD  LEVSHP2,                                                +        
               LTH=5                                                            
         MFLD  TIAVTAL2,                                               +        
               LTH=6                                                            
         MFLD  FPKPRI2,                                                +        
               LTH=1                                                            
         MFLD  LEVNR1,                                                 +        
               LTH=5                                                            
         MFLD  PRLIST1,                                                +        
               LTH=6                                                            
         MFLD  PRSEK1,                                                 +        
               LTH=10                                                           
         MFLD  VALSEK1,                                                +        
               LTH=3                                                            
         MFLD  PRSUP1,                                                 +        
               LTH=10                                                           
         MFLD  VALSUP1,                                                +        
               LTH=3                                                            
         MFLD  STATUS1,                                                +        
               LTH=4                                                            
         MFLD  PRMATRL1,                                               +        
               LTH=10                                                           
         MFLD  KDMATPR1,                                               +        
               LTH=1                                                            
         MFLD  LEVNR2,                                                 +        
               LTH=5                                                            
         MFLD  PRLIST2,                                                +        
               LTH=6                                                            
         MFLD  PRSEK2,                                                 +        
               LTH=10                                                           
         MFLD  VALSEK2,                                                +        
               LTH=3                                                            
         MFLD  PRSUP2,                                                 +        
               LTH=10                                                           
         MFLD  VALSUP2,                                                +        
               LTH=3                                                            
         MFLD  STATUS2,                                                +        
               LTH=4                                                            
         MFLD  PRMATRL2,                                               +        
               LTH=10                                                           
         MFLD  KDMATPR2,                                               +        
               LTH=1                                                            
         MFLD  AVTALIN,                                                +        
               LTH=14,                                                 +        
               ATTR=(YES)                                                       
         MFLD  LEVAVTIN,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEVSHPIN,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TIAVTIN,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDCMD,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CANCEL,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W2I421N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W2N421),                                           +        
               OPT=2,                                                  +        
               NXT=W2O421N1                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '24212',                                                +        
               LTH=5                                                            
         MFLD  (ARTNRIN,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  ARTNRUT,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (IDDCIN,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDDCUT,                                                 +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (AVTALIN,                                               +        
               '++++++++++++'),                                        +        
               LTH=12,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (LEVAVTIN,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (LEVSHPIN,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TIAVTIN,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDCMD,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (CANCEL,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
