***********************************************************************         
* CREATED BY V036147   ON 16/02/18  AT 09:21                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'DEMAND PER PART                 '                               
W2N428   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W2T421  ',                                           +        
               2='W0T501  ',                                           +        
               3='W2T403  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W2T421  ',                                          +        
               14='W2T432  ',                                          +        
               15='W2T423  ',                                          +        
               16='W2T424  ',                                          +        
               17='W2T425  ',                                          +        
               18='W2T426  ',                                          +        
               19='W2T427  ',                                          +        
               20='W2T428  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W2N428   DPAGE CURSOR=((2,13)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DEMAND PER PART',                                      +        
               POS=(1,11),LTH=15,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'PartNumber',                                           +        
               POS=(2,2),LTH=10,                                       +        
               ATTR=(ALPHA,PROT)                                                
IDARTNRI DFLD  POS=(2,13),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DC',                                                   +        
               POS=(2,25),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DCIN     DFLD  POS=(2,28),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
IDARTNRU DFLD  POS=(3,13),LTH=11,                                      +        
               ATTR=(PROT,MOD)                                                  
DCUT     DFLD  POS=(3,28),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Week Separate    LOC Ref',                             +        
               POS=(5,2),LTH=24,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'DC11 Ref',                                             +        
               POS=(5,29),LTH=9,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Glob Ref',                                             +        
               POS=(5,40),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Trend',                                                +        
               POS=(5,54),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Total  FC-Plan',                                       +        
               POS=(5,65),LTH=16,                                      +        
               ATTR=(PROT)                                                      
WEEK01   DFLD  POS=(6,2),LTH=4,                                        +        
               ATTR=(PROT)                                                      
SEPARA01 DFLD  POS=(6,7),LTH=8,                                        +        
               ATTR=(NUM,PROT)                                                  
REFILL01 DFLD  POS=(6,18),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DC110000 DFLD  POS=(6,29),LTH=8,                                       +        
               ATTR=(PROT)                                                      
GLOBAL01 DFLD  POS=(6,40),LTH=8,                                       +        
               ATTR=(PROT)                                                      
TREND01  DFLD  POS=(6,51),LTH=8,                                       +        
               ATTR=(PROT)                                                      
TOTAL01  DFLD  POS=(6,62),LTH=8,                                       +        
               ATTR=(PROT)                                                      
PBPLAN01 DFLD  POS=(6,71),LTH=8,                                       +        
               ATTR=(PROT)                                                      
WEEK02   DFLD  POS=(7,2),LTH=4,                                        +        
               ATTR=(PROT)                                                      
SEPARA02 DFLD  POS=(7,7),LTH=8,                                        +        
               ATTR=(NUM,PROT)                                                  
REFILL02 DFLD  POS=(7,18),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DC110001 DFLD  POS=(7,29),LTH=8,                                       +        
               ATTR=(PROT)                                                      
GLOBAL02 DFLD  POS=(7,40),LTH=8,                                       +        
               ATTR=(PROT)                                                      
TREND02  DFLD  POS=(7,51),LTH=8,                                       +        
               ATTR=(PROT)                                                      
TOTAL02  DFLD  POS=(7,62),LTH=8,                                       +        
               ATTR=(PROT)                                                      
PBPLAN02 DFLD  POS=(7,71),LTH=8,                                       +        
               ATTR=(PROT)                                                      
WEEK03   DFLD  POS=(8,2),LTH=4,                                        +        
               ATTR=(PROT)                                                      
SEPARA03 DFLD  POS=(8,7),LTH=8,                                        +        
               ATTR=(NUM,PROT)                                                  
REFILL03 DFLD  POS=(8,18),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DC110002 DFLD  POS=(8,29),LTH=8,                                       +        
               ATTR=(PROT)                                                      
GLOBAL03 DFLD  POS=(8,40),LTH=8,                                       +        
               ATTR=(PROT)                                                      
TREND03  DFLD  POS=(8,51),LTH=8,                                       +        
               ATTR=(PROT)                                                      
TOTAL03  DFLD  POS=(8,62),LTH=8,                                       +        
               ATTR=(PROT)                                                      
PBPLAN03 DFLD  POS=(8,71),LTH=8,                                       +        
               ATTR=(PROT)                                                      
WEEK04   DFLD  POS=(9,2),LTH=4,                                        +        
               ATTR=(PROT)                                                      
SEPARA04 DFLD  POS=(9,7),LTH=8,                                        +        
               ATTR=(NUM,PROT)                                                  
REFILL04 DFLD  POS=(9,18),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DC110003 DFLD  POS=(9,29),LTH=8,                                       +        
               ATTR=(PROT)                                                      
GLOBAL04 DFLD  POS=(9,40),LTH=8,                                       +        
               ATTR=(PROT)                                                      
TREND04  DFLD  POS=(9,51),LTH=8,                                       +        
               ATTR=(PROT)                                                      
TOTAL04  DFLD  POS=(9,62),LTH=8,                                       +        
               ATTR=(PROT)                                                      
PBPLAN04 DFLD  POS=(9,71),LTH=8,                                       +        
               ATTR=(PROT)                                                      
WEEK05   DFLD  POS=(10,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
SEPARA05 DFLD  POS=(10,7),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
REFILL05 DFLD  POS=(10,18),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DC110004 DFLD  POS=(10,29),LTH=8,                                      +        
               ATTR=(PROT)                                                      
GLOBAL05 DFLD  POS=(10,40),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TREND05  DFLD  POS=(10,51),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TOTAL05  DFLD  POS=(10,62),LTH=8,                                      +        
               ATTR=(PROT)                                                      
PBPLAN05 DFLD  POS=(10,71),LTH=8,                                      +        
               ATTR=(PROT)                                                      
WEEK06   DFLD  POS=(11,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
SEPARA06 DFLD  POS=(11,7),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
REFILL06 DFLD  POS=(11,18),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DC110005 DFLD  POS=(11,29),LTH=8,                                      +        
               ATTR=(PROT)                                                      
GLOBAL06 DFLD  POS=(11,40),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TREND06  DFLD  POS=(11,51),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TOTAL06  DFLD  POS=(11,62),LTH=8,                                      +        
               ATTR=(PROT)                                                      
PBPLAN06 DFLD  POS=(11,71),LTH=8,                                      +        
               ATTR=(PROT)                                                      
WEEK07   DFLD  POS=(12,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
SEPARA07 DFLD  POS=(12,7),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
REFILL07 DFLD  POS=(12,18),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DC110006 DFLD  POS=(12,29),LTH=8,                                      +        
               ATTR=(PROT)                                                      
GLOBAL07 DFLD  POS=(12,40),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TREND07  DFLD  POS=(12,51),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TOTAL07  DFLD  POS=(12,62),LTH=8,                                      +        
               ATTR=(PROT)                                                      
PBPLAN07 DFLD  POS=(12,71),LTH=8,                                      +        
               ATTR=(PROT)                                                      
WEEK08   DFLD  POS=(13,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
SEPARA08 DFLD  POS=(13,7),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
REFILL08 DFLD  POS=(13,18),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DC110007 DFLD  POS=(13,29),LTH=8,                                      +        
               ATTR=(PROT)                                                      
GLOBAL08 DFLD  POS=(13,40),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TREND08  DFLD  POS=(13,51),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TOTAL08  DFLD  POS=(13,62),LTH=8,                                      +        
               ATTR=(PROT)                                                      
PBPLAN08 DFLD  POS=(13,71),LTH=8,                                      +        
               ATTR=(PROT)                                                      
WEEK09   DFLD  POS=(14,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
SEPARA09 DFLD  POS=(14,7),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
REFILL09 DFLD  POS=(14,18),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DC110008 DFLD  POS=(14,29),LTH=8,                                      +        
               ATTR=(PROT)                                                      
GLOBAL09 DFLD  POS=(14,40),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TREND09  DFLD  POS=(14,51),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TOTAL09  DFLD  POS=(14,62),LTH=8,                                      +        
               ATTR=(PROT)                                                      
PBPLAN09 DFLD  POS=(14,71),LTH=8,                                      +        
               ATTR=(PROT)                                                      
WEEK10   DFLD  POS=(15,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
SEPARA10 DFLD  POS=(15,7),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
REFILL10 DFLD  POS=(15,18),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DC110009 DFLD  POS=(15,29),LTH=8,                                      +        
               ATTR=(PROT)                                                      
GLOBAL10 DFLD  POS=(15,40),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TREND10  DFLD  POS=(15,51),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TOTAL10  DFLD  POS=(15,62),LTH=8,                                      +        
               ATTR=(PROT)                                                      
PBPLAN10 DFLD  POS=(15,71),LTH=8,                                      +        
               ATTR=(PROT)                                                      
WEEK11   DFLD  POS=(16,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
SEPARA11 DFLD  POS=(16,7),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
REFILL11 DFLD  POS=(16,18),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DC110010 DFLD  POS=(16,29),LTH=8,                                      +        
               ATTR=(PROT)                                                      
GLOBAL11 DFLD  POS=(16,40),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TREND11  DFLD  POS=(16,51),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TOTAL11  DFLD  POS=(16,62),LTH=8,                                      +        
               ATTR=(PROT)                                                      
PBPLAN11 DFLD  POS=(16,71),LTH=8,                                      +        
               ATTR=(PROT)                                                      
WEEK12   DFLD  POS=(17,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
SEPARA12 DFLD  POS=(17,7),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
REFILL12 DFLD  POS=(17,18),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DC110011 DFLD  POS=(17,29),LTH=8,                                      +        
               ATTR=(PROT)                                                      
GLOBAL12 DFLD  POS=(17,40),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TREND12  DFLD  POS=(17,51),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TOTAL12  DFLD  POS=(17,62),LTH=8,                                      +        
               ATTR=(PROT)                                                      
PBPLAN12 DFLD  POS=(17,71),LTH=8,                                      +        
               ATTR=(PROT)                                                      
WEEK13   DFLD  POS=(18,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
SEPARA13 DFLD  POS=(18,7),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
REFILL13 DFLD  POS=(18,18),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DC110012 DFLD  POS=(18,29),LTH=8,                                      +        
               ATTR=(PROT)                                                      
GLOBAL13 DFLD  POS=(18,40),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TREND13  DFLD  POS=(18,51),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TOTAL13  DFLD  POS=(18,62),LTH=8,                                      +        
               ATTR=(PROT)                                                      
PBPLAN13 DFLD  POS=(18,71),LTH=8,                                      +        
               ATTR=(PROT)                                                      
WEEK14   DFLD  POS=(19,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
SEPARA14 DFLD  POS=(19,7),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
REFILL14 DFLD  POS=(19,18),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DC110013 DFLD  POS=(19,29),LTH=8,                                      +        
               ATTR=(PROT)                                                      
GLOBAL14 DFLD  POS=(19,40),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TREND14  DFLD  POS=(19,51),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TOTAL14  DFLD  POS=(19,62),LTH=8,                                      +        
               ATTR=(PROT)                                                      
PBPLAN14 DFLD  POS=(19,71),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'PF1 Agreem   PF3 Dlv-sched PF14 Proc-data-2',          +        
               POS=(22,2),LTH=43,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(23,59),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W2O428N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W2N428,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W2I428N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W2N428                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDARTNRI,                                               +        
               LTH=9                                                            
         MFLD  IDARTNRU,                                               +        
               LTH=11                                                           
         MFLD  DCIN,                                                   +        
               LTH=2                                                            
         MFLD  DCUT,                                                   +        
               LTH=2                                                            
         MFLD  WEEK01,                                                 +        
               LTH=4                                                            
         MFLD  SEPARA01,                                               +        
               LTH=8                                                            
         MFLD  REFILL01,                                               +        
               LTH=8                                                            
         MFLD  DC110000,                                               +        
               LTH=8                                                            
         MFLD  GLOBAL01,                                               +        
               LTH=8                                                            
         MFLD  TREND01,                                                +        
               LTH=8                                                            
         MFLD  TOTAL01,                                                +        
               LTH=8                                                            
         MFLD  PBPLAN01,                                               +        
               LTH=8                                                            
         MFLD  WEEK02,                                                 +        
               LTH=4                                                            
         MFLD  SEPARA02,                                               +        
               LTH=8                                                            
         MFLD  REFILL02,                                               +        
               LTH=8                                                            
         MFLD  DC110001,                                               +        
               LTH=8                                                            
         MFLD  GLOBAL02,                                               +        
               LTH=8                                                            
         MFLD  TREND02,                                                +        
               LTH=8                                                            
         MFLD  TOTAL02,                                                +        
               LTH=8                                                            
         MFLD  PBPLAN02,                                               +        
               LTH=8                                                            
         MFLD  WEEK03,                                                 +        
               LTH=4                                                            
         MFLD  SEPARA03,                                               +        
               LTH=8                                                            
         MFLD  REFILL03,                                               +        
               LTH=8                                                            
         MFLD  DC110002,                                               +        
               LTH=8                                                            
         MFLD  GLOBAL03,                                               +        
               LTH=8                                                            
         MFLD  TREND03,                                                +        
               LTH=8                                                            
         MFLD  TOTAL03,                                                +        
               LTH=8                                                            
         MFLD  PBPLAN03,                                               +        
               LTH=8                                                            
         MFLD  WEEK04,                                                 +        
               LTH=4                                                            
         MFLD  SEPARA04,                                               +        
               LTH=8                                                            
         MFLD  REFILL04,                                               +        
               LTH=8                                                            
         MFLD  DC110003,                                               +        
               LTH=8                                                            
         MFLD  GLOBAL04,                                               +        
               LTH=8                                                            
         MFLD  TREND04,                                                +        
               LTH=8                                                            
         MFLD  TOTAL04,                                                +        
               LTH=8                                                            
         MFLD  PBPLAN04,                                               +        
               LTH=8                                                            
         MFLD  WEEK05,                                                 +        
               LTH=4                                                            
         MFLD  SEPARA05,                                               +        
               LTH=8                                                            
         MFLD  REFILL05,                                               +        
               LTH=8                                                            
         MFLD  DC110004,                                               +        
               LTH=8                                                            
         MFLD  GLOBAL05,                                               +        
               LTH=8                                                            
         MFLD  TREND05,                                                +        
               LTH=8                                                            
         MFLD  TOTAL05,                                                +        
               LTH=8                                                            
         MFLD  PBPLAN05,                                               +        
               LTH=8                                                            
         MFLD  WEEK06,                                                 +        
               LTH=4                                                            
         MFLD  SEPARA06,                                               +        
               LTH=8                                                            
         MFLD  REFILL06,                                               +        
               LTH=8                                                            
         MFLD  DC110005,                                               +        
               LTH=8                                                            
         MFLD  GLOBAL06,                                               +        
               LTH=8                                                            
         MFLD  TREND06,                                                +        
               LTH=8                                                            
         MFLD  TOTAL06,                                                +        
               LTH=8                                                            
         MFLD  PBPLAN06,                                               +        
               LTH=8                                                            
         MFLD  WEEK07,                                                 +        
               LTH=4                                                            
         MFLD  SEPARA07,                                               +        
               LTH=8                                                            
         MFLD  REFILL07,                                               +        
               LTH=8                                                            
         MFLD  DC110006,                                               +        
               LTH=8                                                            
         MFLD  GLOBAL07,                                               +        
               LTH=8                                                            
         MFLD  TREND07,                                                +        
               LTH=8                                                            
         MFLD  TOTAL07,                                                +        
               LTH=8                                                            
         MFLD  PBPLAN07,                                               +        
               LTH=8                                                            
         MFLD  WEEK08,                                                 +        
               LTH=4                                                            
         MFLD  SEPARA08,                                               +        
               LTH=8                                                            
         MFLD  REFILL08,                                               +        
               LTH=8                                                            
         MFLD  DC110007,                                               +        
               LTH=8                                                            
         MFLD  GLOBAL08,                                               +        
               LTH=8                                                            
         MFLD  TREND08,                                                +        
               LTH=8                                                            
         MFLD  TOTAL08,                                                +        
               LTH=8                                                            
         MFLD  PBPLAN08,                                               +        
               LTH=8                                                            
         MFLD  WEEK09,                                                 +        
               LTH=4                                                            
         MFLD  SEPARA09,                                               +        
               LTH=8                                                            
         MFLD  REFILL09,                                               +        
               LTH=8                                                            
         MFLD  DC110008,                                               +        
               LTH=8                                                            
         MFLD  GLOBAL09,                                               +        
               LTH=8                                                            
         MFLD  TREND09,                                                +        
               LTH=8                                                            
         MFLD  TOTAL09,                                                +        
               LTH=8                                                            
         MFLD  PBPLAN09,                                               +        
               LTH=8                                                            
         MFLD  WEEK10,                                                 +        
               LTH=4                                                            
         MFLD  SEPARA10,                                               +        
               LTH=8                                                            
         MFLD  REFILL10,                                               +        
               LTH=8                                                            
         MFLD  DC110009,                                               +        
               LTH=8                                                            
         MFLD  GLOBAL10,                                               +        
               LTH=8                                                            
         MFLD  TREND10,                                                +        
               LTH=8                                                            
         MFLD  TOTAL10,                                                +        
               LTH=8                                                            
         MFLD  PBPLAN10,                                               +        
               LTH=8                                                            
         MFLD  WEEK11,                                                 +        
               LTH=4                                                            
         MFLD  SEPARA11,                                               +        
               LTH=8                                                            
         MFLD  REFILL11,                                               +        
               LTH=8                                                            
         MFLD  DC110010,                                               +        
               LTH=8                                                            
         MFLD  GLOBAL11,                                               +        
               LTH=8                                                            
         MFLD  TREND11,                                                +        
               LTH=8                                                            
         MFLD  TOTAL11,                                                +        
               LTH=8                                                            
         MFLD  PBPLAN11,                                               +        
               LTH=8                                                            
         MFLD  WEEK12,                                                 +        
               LTH=4                                                            
         MFLD  SEPARA12,                                               +        
               LTH=8                                                            
         MFLD  REFILL12,                                               +        
               LTH=8                                                            
         MFLD  DC110011,                                               +        
               LTH=8                                                            
         MFLD  GLOBAL12,                                               +        
               LTH=8                                                            
         MFLD  TREND12,                                                +        
               LTH=8                                                            
         MFLD  TOTAL12,                                                +        
               LTH=8                                                            
         MFLD  PBPLAN12,                                               +        
               LTH=8                                                            
         MFLD  WEEK13,                                                 +        
               LTH=4                                                            
         MFLD  SEPARA13,                                               +        
               LTH=8                                                            
         MFLD  REFILL13,                                               +        
               LTH=8                                                            
         MFLD  DC110012,                                               +        
               LTH=8                                                            
         MFLD  GLOBAL13,                                               +        
               LTH=8                                                            
         MFLD  TREND13,                                                +        
               LTH=8                                                            
         MFLD  TOTAL13,                                                +        
               LTH=8                                                            
         MFLD  PBPLAN13,                                               +        
               LTH=8                                                            
         MFLD  WEEK14,                                                 +        
               LTH=4                                                            
         MFLD  SEPARA14,                                               +        
               LTH=8                                                            
         MFLD  REFILL14,                                               +        
               LTH=8                                                            
         MFLD  DC110013,                                               +        
               LTH=8                                                            
         MFLD  GLOBAL14,                                               +        
               LTH=8                                                            
         MFLD  TREND14,                                                +        
               LTH=8                                                            
         MFLD  TOTAL14,                                                +        
               LTH=8                                                            
         MFLD  PBPLAN14,                                               +        
               LTH=8                                                            
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W2I428N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W2N428),                                           +        
               OPT=2,                                                  +        
               NXT=W2O428N1                                                     
MID      LPAGE SOR=(W2N428)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F8'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '24282',                                                +        
               LTH=5                                                            
         MFLD  (IDARTNRI,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDARTNRU,                                               +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DCIN,                                                  +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  DCUT,                                                   +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
