***********************************************************************         
* CREATED BY PC68246   ON 99/01/05  AT 09:44                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'XCHANGE CLEARING                '                               
W3F182   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='WOT501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W3T182 7',                                           +        
               8='W3T182 8',                                           +        
               9='W3T182 9',                                           +        
               10='WHELP   ',                                          +        
               11='W3T182U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W3T182 7',                                          +        
               20='W3T182 8',                                          +        
               21='W3T182 9',                                          +        
               22='WHELP   ',                                          +        
               23='W3T182U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W3F182   DPAGE CURSOR=((8,2)),                                         +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'EXCHANGE CLEARING',                                    +        
               POS=(1,13),LTH=17,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Case',                                                 +        
               POS=(2,2),LTH=4,                                        +        
               ATTR=(ALPHA,PROT)                                                
INCASE   DFLD  POS=(2,8),LTH=5,                                        +        
               ATTR=(NOPROT,NUM)                                                
         DFLD  'Invoice:',                                             +        
               POS=(2,52),LTH=8,                                       +        
               ATTR=(PROT)                                                      
UTCASE   DFLD  POS=(3,8),LTH=5,                                        +        
               ATTR=(PROT)                                                      
UTINVOIC DFLD  POS=(3,63),LTH=7,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'New Case:',                                            +        
               POS=(5,2),LTH=9,                                        +        
               ATTR=(PROT)                                                      
INNEWCAS DFLD  POS=(5,12),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  '(Y) Case Weight',                                      +        
               POS=(5,16),LTH=15,                                      +        
               ATTR=(PROT)                                                      
INKOLVIK DFLD  POS=(5,32),LTH=8,                                       +        
               ATTR=(NOPROT,NUM)                                                
         DFLD  'Case Vol',                                             +        
               POS=(5,42),LTH=8,                                       +        
               ATTR=(PROT)                                                      
INKOLVOL DFLD  POS=(5,52),LTH=8,                                       +        
               ATTR=(NOPROT,NUM)                                                
         DFLD  'Delete case:',                                         +        
               POS=(5,62),LTH=12,                                      +        
               ATTR=(PROT)                                                      
INDELCAS DFLD  POS=(5,76),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  '(Y)',                                                  +        
               POS=(5,78),LTH=3,                                       +        
               ATTR=(PROT)                                                      
UTKOLVIK DFLD  POS=(6,32),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'kg',                                                   +        
               POS=(6,42),LTH=2,                                       +        
               ATTR=(PROT)                                                      
UTKOLVOL DFLD  POS=(6,52),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'm3',                                                   +        
               POS=(6,62),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Object',                                               +        
               POS=(7,2),LTH=6,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'Quantity',                                             +        
               POS=(7,15),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Description',                                          +        
               POS=(7,30),LTH=11,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Stock balance',                                        +        
               POS=(7,56),LTH=13,                                      +        
               ATTR=(PROT)                                                      
IDART01  DFLD  POS=(8,2),LTH=9,                                        +        
               ATTR=(NUM,NOPROT)                                                
KVANT01  DFLD  POS=(8,15),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
BEART01  DFLD  POS=(8,30),LTH=25,                                      +        
               ATTR=(PROT)                                                      
SALDO01  DFLD  POS=(8,57),LTH=8,                                       +        
               ATTR=(PROT,HI)                                                   
IDART02  DFLD  POS=(9,2),LTH=9,                                        +        
               ATTR=(NUM,NOPROT)                                                
KVANT02  DFLD  POS=(9,15),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
BEART02  DFLD  POS=(9,30),LTH=25,                                      +        
               ATTR=(PROT)                                                      
SALDO02  DFLD  POS=(9,57),LTH=8,                                       +        
               ATTR=(PROT,HI)                                                   
IDART03  DFLD  POS=(10,2),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
KVANT03  DFLD  POS=(10,15),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
BEART03  DFLD  POS=(10,30),LTH=25,                                     +        
               ATTR=(PROT)                                                      
SALDO03  DFLD  POS=(10,57),LTH=8,                                      +        
               ATTR=(PROT,HI)                                                   
IDART04  DFLD  POS=(11,2),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
KVANT04  DFLD  POS=(11,15),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
BEART04  DFLD  POS=(11,30),LTH=25,                                     +        
               ATTR=(PROT)                                                      
SALDO04  DFLD  POS=(11,57),LTH=8,                                      +        
               ATTR=(PROT,HI)                                                   
IDART05  DFLD  POS=(12,2),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
KVANT05  DFLD  POS=(12,15),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
BEART05  DFLD  POS=(12,30),LTH=25,                                     +        
               ATTR=(PROT)                                                      
SALDO05  DFLD  POS=(12,57),LTH=8,                                      +        
               ATTR=(PROT,HI)                                                   
IDART06  DFLD  POS=(13,2),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
KVANT06  DFLD  POS=(13,15),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
BEART06  DFLD  POS=(13,30),LTH=25,                                     +        
               ATTR=(PROT)                                                      
SALDO06  DFLD  POS=(13,57),LTH=8,                                      +        
               ATTR=(PROT,HI)                                                   
IDART07  DFLD  POS=(14,2),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
KVANT07  DFLD  POS=(14,15),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
BEART07  DFLD  POS=(14,30),LTH=25,                                     +        
               ATTR=(PROT)                                                      
SALDO07  DFLD  POS=(14,57),LTH=8,                                      +        
               ATTR=(PROT,HI)                                                   
IDART08  DFLD  POS=(15,2),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
KVANT08  DFLD  POS=(15,15),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
BEART08  DFLD  POS=(15,30),LTH=25,                                     +        
               ATTR=(PROT)                                                      
SALDO08  DFLD  POS=(15,57),LTH=8,                                      +        
               ATTR=(PROT,HI)                                                   
IDART09  DFLD  POS=(16,2),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
KVANT09  DFLD  POS=(16,15),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
BEART09  DFLD  POS=(16,30),LTH=25,                                     +        
               ATTR=(PROT)                                                      
SALDO09  DFLD  POS=(16,57),LTH=8,                                      +        
               ATTR=(PROT,HI)                                                   
IDART10  DFLD  POS=(17,2),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
KVANT10  DFLD  POS=(17,15),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
BEART10  DFLD  POS=(17,30),LTH=25,                                     +        
               ATTR=(PROT)                                                      
SALDO10  DFLD  POS=(17,57),LTH=8,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Delete:',                                              +        
               POS=(18,2),LTH=7,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Tot:',                                                 +        
               POS=(18,30),LTH=4,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Create Proforma',                                      +        
               POS=(18,57),LTH=15,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Object',                                               +        
               POS=(19,2),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Quant          Weight',                                +        
               POS=(19,15),LTH=21,                                     +        
               ATTR=(PROT)                                                      
INTOTVIK DFLD  POS=(19,37),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Vol',                                                  +        
               POS=(19,47),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
INTOTVOL DFLD  POS=(19,52),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
PROFORMA DFLD  POS=(19,62),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  '(Y)',                                                  +        
               POS=(19,64),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
INDELOBJ DFLD  POS=(20,2),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
INDELQTY DFLD  POS=(20,15),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
UTTOTVIK DFLD  POS=(20,37),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'kg',                                                   +        
               POS=(20,47),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
UTTOTVOL DFLD  POS=(20,52),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'm3',                                                   +        
               POS=(20,62),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '      ',                                               +        
               POS=(22,50),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '11 Update',                                            +        
               POS=(22,66),LTH=9,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W3O18201 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W3F182,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W3I18201,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W3F182                                                       
         SEG                                                                    
         MFLD   FLD0102,                                               +        
               LTH=1                                                            
         MFLD   FLD0104,                                               +        
               LTH=1                                                            
         MFLD   FLD0106,                                               +        
               LTH=1                                                            
         MFLD   FLD0108,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  INCASE,                                                 +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  UTCASE,                                                 +        
               LTH=5                                                            
         MFLD  UTINVOIC,                                               +        
               LTH=7                                                            
         MFLD  INNEWCAS,                                               +        
               LTH=3                                                            
         MFLD  INKOLVIK,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  INKOLVOL,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  UTKOLVIK,                                               +        
               LTH=8                                                            
         MFLD  UTKOLVOL,                                               +        
               LTH=8                                                            
         MFLD  IDART01,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVANT01,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BEART01,                                                +        
               LTH=25                                                           
         MFLD  SALDO01,                                                +        
               LTH=8                                                            
         MFLD  IDART02,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVANT02,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BEART02,                                                +        
               LTH=25                                                           
         MFLD  SALDO02,                                                +        
               LTH=8                                                            
         MFLD  IDART03,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVANT03,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BEART03,                                                +        
               LTH=25                                                           
         MFLD  SALDO03,                                                +        
               LTH=8                                                            
         MFLD  IDART04,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVANT04,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BEART04,                                                +        
               LTH=25                                                           
         MFLD  SALDO04,                                                +        
               LTH=8                                                            
         MFLD  IDART05,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVANT05,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BEART05,                                                +        
               LTH=25                                                           
         MFLD  SALDO05,                                                +        
               LTH=8                                                            
         MFLD  IDART06,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVANT06,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BEART06,                                                +        
               LTH=25                                                           
         MFLD  SALDO06,                                                +        
               LTH=8                                                            
         MFLD  IDART07,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVANT07,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BEART07,                                                +        
               LTH=25                                                           
         MFLD  SALDO07,                                                +        
               LTH=8                                                            
         MFLD  IDART08,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVANT08,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BEART08,                                                +        
               LTH=25                                                           
         MFLD  SALDO08,                                                +        
               LTH=8                                                            
         MFLD  IDART09,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVANT09,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BEART09,                                                +        
               LTH=25                                                           
         MFLD  SALDO09,                                                +        
               LTH=8                                                            
         MFLD  IDART10,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVANT10,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BEART10,                                                +        
               LTH=25                                                           
         MFLD  SALDO10,                                                +        
               LTH=8                                                            
         MFLD  INTOTVIK,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  INTOTVOL,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  PROFORMA,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  INDELOBJ,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  INDELQTY,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  INDELCAS,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  UTTOTVIK,                                               +        
               LTH=8                                                            
         MFLD  UTTOTVOL,                                               +        
               LTH=8                                                            
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=79                                                           
         MSGEND                                                                 
W3I18201 MSG   TYPE=INPUT,                                             +        
               SOR=(W3F182),                                           +        
               OPT=2,                                                  +        
               NXT=W3O18201                                                     
MID      LPAGE SOR=(W3F182)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F8'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '31821',                                                +        
               LTH=5                                                            
         MFLD  (INCASE,                                                +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (INNEWCAS,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (INKOLVIK,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (INKOLVOL,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDART01,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVANT01,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDART02,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVANT02,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDART03,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVANT03,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDART04,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVANT04,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDART05,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVANT05,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDART06,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVANT06,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDART07,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVANT07,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDART08,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVANT08,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDART09,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVANT09,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDART10,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVANT10,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (INTOTVIK,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (INTOTVOL,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PROFORMA,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (INDELOBJ,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (INDELQTY,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (INDELCAS,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
