***********************************************************************         
* CREATED BY PC59009   ON 99/01/27  AT 19:05                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'UPPD BYTES IDREG                '                               
W3F151   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W3T151 7',                                           +        
               8='W3T151 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W3T151U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W3T151  ',                                          +        
               14='W3T152  ',                                          +        
               15='W3T153  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W3T151U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W3F151   DPAGE CURSOR=((2,15)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'UPPDAT IDENTITETSREG BYTES',                           +        
               POS=(1,11),LTH=26,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Bytesartikel',                                         +        
               POS=(2,2),LTH=12,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0215  DFLD  POS=(2,15),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
FLD0315  DFLD  POS=(3,15),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0325  DFLD  POS=(3,25),LTH=9,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0335  DFLD  POS=(3,35),LTH=9,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
FLD0345  DFLD  POS=(3,45),LTH=30,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'Benämning',                                            +        
               POS=(4,2),LTH=9,                                        +        
               ATTR=(PROT)                                                      
FLD0413  DFLD  POS=(4,13),LTH=25,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Notering',                                             +        
               POS=(4,42),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FLD0451  DFLD  POS=(4,51),LTH=30,                                      +        
               ATTR=(NOPROT)                                                    
FLD0551  DFLD  POS=(5,51),LTH=30,                                      +        
               ATTR=(NOPROT)                                                    
FLD0651  DFLD  POS=(6,51),LTH=30,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Distrikt',                                             +        
               POS=(7,16),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FLD0751  DFLD  POS=(7,51),LTH=30,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'EU   USA   CAN   JAP   AUS  KINA   KOR',               +        
               POS=(8,5),LTH=38,                                       +        
               ATTR=(PROT)                                                      
DGIA0001 DFLD  POS=(9,2),LTH=5,                                        +        
               ATTR=(PROT,MOD)                                                  
RENUSA   DFLD  POS=(9,8),LTH=5,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
RENCAN   DFLD  POS=(9,14),LTH=5,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
RENPAC   DFLD  POS=(9,20),LTH=5,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
RENAUS   DFLD  POS=(9,26),LTH=5,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
RENCHN   DFLD  POS=(9,32),LTH=5,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
RENKOR   DFLD  POS=(9,38),LTH=5,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  'Alternativ',                                           +        
               POS=(10,2),LTH=10,                                      +        
               ATTR=(PROT)                                                      
FLD1018  DFLD  POS=(10,18),LTH=30,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'Core-LS',                                              +        
               POS=(10,50),LTH=07,                                     +        
               ATTR=(PROT)                                                      
FLD1062  DFLD  POS=(10,62),LTH=08,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Främmande beteckning',                                 +        
               POS=(11,2),LTH=20,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Max-LS',                                               +        
               POS=(11,50),LTH=10,                                     +        
               ATTR=(PROT)                                                      
FLD1162  DFLD  POS=(11,62),LTH=08,                                     +        
               ATTR=(PROT)                                                      
FLD1171  DFLD  POS=(11,71),LTH=07,                                     +        
               ATTR=(NUM,NOPROT)                                                
COL0212  DFLD  POS=(12,2),LTH=30,                                      +        
               ATTR=(PROT)                                                      
COL3512  DFLD  POS=(12,35),LTH=30,                                     +        
               ATTR=(PROT)                                                      
COL0213  DFLD  POS=(13,2),LTH=30,                                      +        
               ATTR=(PROT)                                                      
COL3513  DFLD  POS=(13,35),LTH=30,                                     +        
               ATTR=(PROT)                                                      
COL0214  DFLD  POS=(14,2),LTH=30,                                      +        
               ATTR=(PROT)                                                      
COL3514  DFLD  POS=(14,35),LTH=30,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Produktnr',                                            +        
               POS=(15,2),LTH=9,                                       +        
               ATTR=(PROT)                                                      
COL1315  DFLD  POS=(15,12),LTH=9,                                      +        
               ATTR=(PROT)                                                      
COL2415  DFLD  POS=(15,23),LTH=9,                                      +        
               ATTR=(PROT)                                                      
COL3515  DFLD  POS=(15,34),LTH=9,                                      +        
               ATTR=(PROT)                                                      
COL4615  DFLD  POS=(15,45),LTH=9,                                      +        
               ATTR=(PROT)                                                      
COL5715  DFLD  POS=(15,56),LTH=9,                                      +        
               ATTR=(PROT)                                                      
COL6815  DFLD  POS=(15,67),LTH=9,                                      +        
               ATTR=(PROT)                                                      
COL1316  DFLD  POS=(16,12),LTH=9,                                      +        
               ATTR=(PROT)                                                      
COL2416  DFLD  POS=(16,23),LTH=9,                                      +        
               ATTR=(PROT)                                                      
COL3516  DFLD  POS=(16,34),LTH=9,                                      +        
               ATTR=(PROT)                                                      
COL4616  DFLD  POS=(16,45),LTH=9,                                      +        
               ATTR=(PROT)                                                      
COL5716  DFLD  POS=(16,56),LTH=9,                                      +        
               ATTR=(PROT)                                                      
COL6816  DFLD  POS=(16,67),LTH=9,                                      +        
               ATTR=(PROT)                                                      
COL1317  DFLD  POS=(17,12),LTH=9,                                      +        
               ATTR=(PROT)                                                      
COL2417  DFLD  POS=(17,23),LTH=9,                                      +        
               ATTR=(PROT)                                                      
COL3517  DFLD  POS=(17,34),LTH=9,                                      +        
               ATTR=(PROT)                                                      
COL4617  DFLD  POS=(17,45),LTH=9,                                      +        
               ATTR=(PROT)                                                      
COL5717  DFLD  POS=(17,56),LTH=9,                                      +        
               ATTR=(PROT)                                                      
COL6817  DFLD  POS=(17,67),LTH=9,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'b/n  Produktnr  R-EU R-USA R-CAN R-JAP R-AUS R-KINA',  +        
               POS=(18,2),LTH=51,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'R-KOR',                                                +        
               POS=(18,54),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FLD1903  DFLD  POS=(19,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
FLD1907  DFLD  POS=(19,7),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0000 DFLD  POS=(19,17),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
RUSA     DFLD  POS=(19,23),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
RCAN     DFLD  POS=(19,29),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
RPAC     DFLD  POS=(19,35),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
RAUS     DFLD  POS=(19,41),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
RCHN     DFLD  POS=(19,48),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
RKOR     DFLD  POS=(19,54),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
FLD2002  DFLD  POS=(20,2),LTH=30,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'Främmande bet.',                                       +        
               POS=(20,35),LTH=14,                                     +        
               ATTR=(PROT)                                                      
FLD2050  DFLD  POS=(20,50),LTH=30,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  '13 Uppd bytreg1  14 Bytart/pr-art 15 Uppd bytreg2  16',+        
               POS=(21,2),LTH=53,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,68),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,19),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,36),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,53),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 Whelp',                                             +        
               POS=(22,68),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W3O15101 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W3F151,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W3I15101,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W3F151,                                             +        
               NXT=W3I15101                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  FLD0215,                                                +        
               LTH=2                                                            
         MFLD  FLD0315,                                                +        
               LTH=9                                                            
         MFLD  FLD0325,                                                +        
               LTH=9                                                            
         MFLD  FLD0335,                                                +        
               LTH=9                                                            
         MFLD  FLD0345,                                                +        
               LTH=30                                                           
         MFLD  FLD0413,                                                +        
               LTH=25                                                           
         MFLD  DGIA0001,                                               +        
               LTH=5                                                            
         MFLD  RENUSA,                                                 +        
               LTH=5                                                            
         MFLD  RENCAN,                                                 +        
               LTH=5                                                            
         MFLD  RENPAC,                                                 +        
               LTH=5                                                            
         MFLD  RENAUS,                                                 +        
               LTH=5                                                            
         MFLD  RENCHN,                                                 +        
               LTH=5                                                            
         MFLD  RENKOR,                                                 +        
               LTH=5                                                            
         MFLD  FLD0451,                                                +        
               LTH=32,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD0551,                                                +        
               LTH=32,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD0651,                                                +        
               LTH=32,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD0751,                                                +        
               LTH=32,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1018,                                                +        
               LTH=32,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1062,                                                +        
               LTH=08                                                           
         MFLD  FLD1162,                                                +        
               LTH=08                                                           
         MFLD  FLD1171,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL0212,                                                +        
               LTH=30                                                           
         MFLD  COL3512,                                                +        
               LTH=30                                                           
         MFLD  COL0213,                                                +        
               LTH=30                                                           
         MFLD  COL3513,                                                +        
               LTH=30                                                           
         MFLD  COL0214,                                                +        
               LTH=30                                                           
         MFLD  COL3514,                                                +        
               LTH=30                                                           
         MFLD  COL1315,                                                +        
               LTH=9                                                            
         MFLD  COL2415,                                                +        
               LTH=9                                                            
         MFLD  COL3515,                                                +        
               LTH=9                                                            
         MFLD  COL4615,                                                +        
               LTH=9                                                            
         MFLD  COL5715,                                                +        
               LTH=9                                                            
         MFLD  COL6815,                                                +        
               LTH=9                                                            
         MFLD  COL1316,                                                +        
               LTH=9                                                            
         MFLD  COL2416,                                                +        
               LTH=9                                                            
         MFLD  COL3516,                                                +        
               LTH=9                                                            
         MFLD  COL4616,                                                +        
               LTH=9                                                            
         MFLD  COL5716,                                                +        
               LTH=9                                                            
         MFLD  COL6816,                                                +        
               LTH=9                                                            
         MFLD  COL1317,                                                +        
               LTH=9                                                            
         MFLD  COL2417,                                                +        
               LTH=9                                                            
         MFLD  COL3517,                                                +        
               LTH=9                                                            
         MFLD  COL4617,                                                +        
               LTH=9                                                            
         MFLD  COL5717,                                                +        
               LTH=9                                                            
         MFLD  COL6817,                                                +        
               LTH=9                                                            
         MFLD  FLD1903,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1907,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0000,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RUSA,                                                   +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RCAN,                                                   +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RPAC,                                                   +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RAUS,                                                   +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RCHN,                                                   +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RKOR,                                                   +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2002,                                                +        
               LTH=30                                                           
         MFLD  FLD2050,                                                +        
               LTH=32,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W3I15101 MSG   TYPE=INPUT,                                             +        
               SOR=(W3F151),                                           +        
               OPT=2,                                                  +        
               NXT=W3O15101                                                     
MID      LPAGE SOR=(W3F151),                                           +        
               NXT=W3O15301                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '31511',                                                +        
               LTH=5                                                            
         MFLD  (FLD0215,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0315,                                                +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0325,                                                +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0335,                                                +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0345,                                                +        
               LTH=30,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  DGIA0001,                                               +        
               LTH=5                                                            
         MFLD  RENUSA,                                                 +        
               LTH=5                                                            
         MFLD  RENCAN,                                                 +        
               LTH=5                                                            
         MFLD  RENPAC,                                                 +        
               LTH=5                                                            
         MFLD  RENAUS,                                                 +        
               LTH=5                                                            
         MFLD  RENCHN,                                                 +        
               LTH=5                                                            
         MFLD  RENKOR,                                                 +        
               LTH=5                                                            
         MFLD  (FLD0451,                                               +        
               '++++++++++++++++++++++++++++++'),                      +        
               LTH=30,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLD0551,                                               +        
               '++++++++++++++++++++++++++++++'),                      +        
               LTH=30,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLD0651,                                               +        
               '++++++++++++++++++++++++++++++'),                      +        
               LTH=30,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLD0751,                                               +        
               '++++++++++++++++++++++++++++++'),                      +        
               LTH=30,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLD1018,                                               +        
               '++++++++++++++++++++++++++++++'),                      +        
               LTH=30,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLD1171,                                               +        
               '+++++++'),                                             +        
               LTH=07,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1903,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1907,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0000,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RUSA,                                                  +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RCAN,                                                  +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RPAC,                                                  +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RAUS,                                                  +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RCHN,                                                  +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RKOR,                                                  +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD2002,                                                +        
               LTH=30,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLD2050,                                               +        
               '++++++++++++++++++++++++++++++'),                      +        
               LTH=30,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
