*          DATA SET W3F213FII0 AT LEVEL 028 AS OF 89/10/25                      
         PRINT NOGEN                                                            
W3F213   FMT                                                                    
         DEV   TYPE=(3270,2),                                          *        
               FEAT=IGNORE,                                            *        
               PFK=(FLDPFK,'W0T551U ','W0T501  ','W0T501  ','W0T501  ',*        
               'W0T501  ','W0T501  ','W3T213 7','W3T213 8','W0T501  ', *        
               'WHELP   ','W3T213U ','/RCL.   ','W3T211  ','W3T213  ', *        
               'W3T212  ','W0T501  ','W0T501  ','W0T501  ','W0T501  ', *        
               'W0T501  ','W0T501  ','WHELP   ','W0T501  ','/RCL.   '),*        
               DSCA=X'0080',SYSMSG=FSYSMSG                                      
         DIV   TYPE=INOUT                                                       
         DPAGE CURSOR=((19,03)),                                       *        
               FILL=NONE                                                        
         ALPHA  'abcdefghijklmnopqrstuvwxyzåäö'                                 
FLD0102  DFLD  POS=(01,02),LTH=0001,ATTR=(ALPHA,NOPROT,MOD)                     
FLD0104  DFLD  POS=(01,04),LTH=0001,ATTR=(NUM)                                  
FLD0106  DFLD  POS=(01,06),LTH=0001,ATTR=(NUM)                                  
FLD0108  DFLD  POS=(01,08),LTH=0001,ATTR=(NUM)                                  
         DFLD  'ART.STAT  SÄSONG        ',                             *        
               POS=(01,11),LTH=0024,ATTR=(NUM,PROT)                             
FLD0140  DFLD  POS=(01,40),LTH=0040,ATTR=(NUM,PROT,HI)                          
FLD0410  DFLD  POS=(04,10),LTH=0001,ATTR=(NUM,PROT,MOD,NODISP)                  
         DFLD  'Kurva',                                                *        
               POS=(05,02),LTH=0005,ATTR=(NUM,PROT)                             
         DFLD  'Per1',                                                 *        
               POS=(05,08),LTH=0004,ATTR=(NUM,PROT)                             
         DFLD  'Per2',                                                 *        
               POS=(05,14),LTH=0004,ATTR=(NUM,PROT)                             
         DFLD  'Per3',                                                 *        
               POS=(05,20),LTH=0004,ATTR=(NUM,PROT)                             
         DFLD  'Per4',                                                 *        
               POS=(05,26),LTH=0004,ATTR=(NUM,PROT)                             
         DFLD  'Per5',                                                 *        
               POS=(05,32),LTH=0004,ATTR=(NUM,PROT)                             
         DFLD  'Per6',                                                 *        
               POS=(05,38),LTH=0004,ATTR=(NUM,PROT)                             
         DFLD  'Per7',                                                 *        
               POS=(05,44),LTH=0004,ATTR=(NUM,PROT)                             
         DFLD  'Per8',                                                 *        
               POS=(05,50),LTH=0004,ATTR=(NUM,PROT)                             
         DFLD  'Per9',                                                 *        
               POS=(05,56),LTH=0004,ATTR=(NUM,PROT)                             
         DFLD  'Per10',                                                *        
               POS=(05,62),LTH=0005,ATTR=(NUM,PROT)                             
         DFLD  'Per11',                                                *        
               POS=(05,68),LTH=0005,ATTR=(NUM,PROT)                             
         DFLD  'Per12',                                                *        
               POS=(05,74),LTH=0005,ATTR=(NUM,PROT)                             
         DO    10,SUF=06                                                        
COL03    DFLD  POS=(06,03),LTH=0002,ATTR=(NUM,PROT)                             
COL08    DFLD  POS=(06,08),LTH=0004,ATTR=(NUM,PROT)                             
COL14    DFLD  POS=(06,14),LTH=0004,ATTR=(NUM,PROT)                             
COL20    DFLD  POS=(06,20),LTH=0004,ATTR=(NUM,PROT)                             
COL26    DFLD  POS=(06,26),LTH=0004,ATTR=(NUM,PROT)                             
COL32    DFLD  POS=(06,32),LTH=0004,ATTR=(NUM,PROT)                             
COL38    DFLD  POS=(06,38),LTH=0004,ATTR=(NUM,PROT)                             
COL44    DFLD  POS=(06,44),LTH=0004,ATTR=(NUM,PROT)                             
COL50    DFLD  POS=(06,50),LTH=0004,ATTR=(NUM,PROT)                             
COL56    DFLD  POS=(06,56),LTH=0004,ATTR=(NUM,PROT)                             
COL62    DFLD  POS=(06,62),LTH=0004,ATTR=(NUM,PROT)                             
COL68    DFLD  POS=(06,68),LTH=0004,ATTR=(NUM,PROT)                             
COL74    DFLD  POS=(06,74),LTH=0004,ATTR=(NUM,PROT)                             
         ENDDO                                                                  
         DFLD  'Kurva',                                                *        
               POS=(18,02),LTH=0005,ATTR=(NUM,PROT)                             
         DFLD  'Per1',                                                 *        
               POS=(18,08),LTH=0004,ATTR=(NUM,PROT)                             
         DFLD  'Per2',                                                 *        
               POS=(18,14),LTH=0004,ATTR=(NUM,PROT)                             
         DFLD  'Per3',                                                 *        
               POS=(18,20),LTH=0004,ATTR=(NUM,PROT)                             
         DFLD  'Per4',                                                 *        
               POS=(18,26),LTH=0004,ATTR=(NUM,PROT)                             
         DFLD  'Per5',                                                 *        
               POS=(18,32),LTH=0004,ATTR=(NUM,PROT)                             
         DFLD  'Per6',                                                 *        
               POS=(18,38),LTH=0004,ATTR=(NUM,PROT)                             
         DFLD  'Per7',                                                 *        
               POS=(18,44),LTH=0004,ATTR=(NUM,PROT)                             
         DFLD  'Per8',                                                 *        
               POS=(18,50),LTH=0004,ATTR=(NUM,PROT)                             
         DFLD  'Per9',                                                 *        
               POS=(18,56),LTH=0004,ATTR=(NUM,PROT)                             
         DFLD  'Per10',                                                *        
               POS=(18,62),LTH=0005,ATTR=(NUM,PROT)                             
         DFLD  'Per11',                                                *        
               POS=(18,68),LTH=0005,ATTR=(NUM,PROT)                             
         DFLD  'Per12',                                                *        
               POS=(18,74),LTH=0005,ATTR=(NUM,PROT)                             
FLD1903  DFLD  POS=(19,03),LTH=0002,ATTR=(NUM)                                  
FLD1908  DFLD  POS=(19,08),LTH=0004,ATTR=(NUM)                                  
FLD1914  DFLD  POS=(19,14),LTH=0004,ATTR=(NUM)                                  
FLD1920  DFLD  POS=(19,20),LTH=0004,ATTR=(NUM)                                  
FLD1926  DFLD  POS=(19,26),LTH=0004,ATTR=(NUM)                                  
FLD1932  DFLD  POS=(19,32),LTH=0004,ATTR=(NUM)                                  
FLD1938  DFLD  POS=(19,38),LTH=0004,ATTR=(NUM)                                  
FLD1944  DFLD  POS=(19,44),LTH=0004,ATTR=(NUM)                                  
FLD1950  DFLD  POS=(19,50),LTH=0004,ATTR=(NUM)                                  
FLD1956  DFLD  POS=(19,56),LTH=0004,ATTR=(NUM)                                  
FLD1962  DFLD  POS=(19,62),LTH=0004,ATTR=(NUM)                                  
FLD1968  DFLD  POS=(19,68),LTH=0004,ATTR=(NUM)                                  
FLD1974  DFLD  POS=(19,74),LTH=0004,ATTR=(NUM)                                  
         DFLD  '13 Justering    14 Säsongskurva  15 Delbudget   16     *        
                        17              18              19             *        
                20              21              10 Whelp',             *        
               POS=(21,02),LTH=0152,ATTR=(NUM,PROT)                             
FLD2302  DFLD  POS=(23,02),LTH=0055,ATTR=(NUM,PROT,HI)                          
         DFLD  ' VCP ',POS=(23,58)                                              
FLD2364  DFLD  POS=(23,64),LTH=0008,ATTR=(NUM,PROT)                             
FLD2373  DFLD  POS=(23,73),LTH=0008,ATTR=(NUM,PROT)                             
FSYSMSG  DFLD  POS=(24,02),LTH=0079,ATTR=(NUM,PROT,HI)                          
         FMTEND                                                                 
         EJECT                                                                  
W3O21301 MSG   TYPE=OUTPUT,                                            *        
               SOR=(W3F213,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W3I21301,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  FLD0102,LTH=0001                                                 
         MFLD  FLD0104,LTH=0001                                                 
         MFLD  FLD0106,LTH=0001                                                 
         MFLD  FLD0108,LTH=0001                                                 
         MFLD  FLD0140,LTH=0040                                                 
         MFLD  FLD0410,LTH=0001                                                 
         DO    10,SUF=06                                                        
         MFLD  COL03,LTH=0002                                                   
         MFLD  COL08,LTH=0004                                                   
         MFLD  COL14,LTH=0004                                                   
         MFLD  COL20,LTH=0004                                                   
         MFLD  COL26,LTH=0004                                                   
         MFLD  COL32,LTH=0004                                                   
         MFLD  COL38,LTH=0004                                                   
         MFLD  COL44,LTH=0004                                                   
         MFLD  COL50,LTH=0004                                                   
         MFLD  COL56,LTH=0004                                                   
         MFLD  COL62,LTH=0004                                                   
         MFLD  COL68,LTH=0004                                                   
         MFLD  COL74,LTH=0004                                                   
         ENDDO                                                                  
         MFLD  FLD1903,LTH=0004,ATTR=YES                                        
         MFLD  FLD1908,LTH=0004,ATTR=YES                                        
         MFLD  FLD1914,LTH=0004,ATTR=YES                                        
         MFLD  FLD1920,LTH=0004,ATTR=YES                                        
         MFLD  FLD1926,LTH=0004,ATTR=YES                                        
         MFLD  FLD1932,LTH=0004,ATTR=YES                                        
         MFLD  FLD1938,LTH=0004,ATTR=YES                                        
         MFLD  FLD1944,LTH=0004,ATTR=YES                                        
         MFLD  FLD1950,LTH=0004,ATTR=YES                                        
         MFLD  FLD1956,LTH=0004,ATTR=YES                                        
         MFLD  FLD1962,LTH=0004,ATTR=YES                                        
         MFLD  FLD1968,LTH=0004,ATTR=YES                                        
         MFLD  FLD1974,LTH=0004,ATTR=YES                                        
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W3I21301 MSG   TYPE=INPUT,                                             *        
               SOR=W3F213,                                             *        
               OPT=2,                                                  *        
               NXT=W3O21301                                                     
         SEG                                                                    
         MFLD  FLDPFK,LTH=0008,FILL=NULL                                        
         MFLD  'W',LTH=0001                                                     
         MFLD  FLD0102,LTH=0001,FILL=C'3'                                       
         MFLD  'T',LTH=0001                                                     
         MFLD  FLD0104,LTH=0001,FILL=C'2'                                       
         MFLD  FLD0106,LTH=0001,FILL=C'1'                                       
         MFLD  FLD0108,LTH=0001,FILL=C'3'                                       
         MFLD  '  ',LTH=0002                                                    
         MFLD  '32131',LTH=0005                                                 
         MFLD  FLD0410,LTH=0001                                                 
         MFLD  (FLD1903,'++'),LTH=0002,FILL=C'0',JUST=R                         
         MFLD  (FLD1908,'++++'),LTH=0004,FILL=C'0',JUST=R                       
         MFLD  (FLD1914,'++++'),LTH=0004,FILL=C'0',JUST=R                       
         MFLD  (FLD1920,'++++'),LTH=0004,FILL=C'0',JUST=R                       
         MFLD  (FLD1926,'++++'),LTH=0004,FILL=C'0',JUST=R                       
         MFLD  (FLD1932,'++++'),LTH=0004,FILL=C'0',JUST=R                       
         MFLD  (FLD1938,'++++'),LTH=0004,FILL=C'0',JUST=R                       
         MFLD  (FLD1944,'++++'),LTH=0004,FILL=C'0',JUST=R                       
         MFLD  (FLD1950,'++++'),LTH=0004,FILL=C'0',JUST=R                       
         MFLD  (FLD1956,'++++'),LTH=0004,FILL=C'0',JUST=R                       
         MFLD  (FLD1962,'++++'),LTH=0004,FILL=C'0',JUST=R                       
         MFLD  (FLD1968,'++++'),LTH=0004,FILL=C'0',JUST=R                       
         MFLD  (FLD1974,'++++'),LTH=0004,FILL=C'0',JUST=R                       
         MSGEND                                                                 
         EJECT                                                                  
         END                                                                    
