***********************************************************************         
* CREATED BY PC59009   ON 97/05/23  AT 13:49                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'ART.STAT. URVAL ARTIKEL         '                               
W3F203   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W3T203 7',                                           +        
               8='W3T203 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W3T203U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W3T201  ',                                          +        
               14='W3T202  ',                                          +        
               15='W3T203  ',                                          +        
               16='W3T204  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W3T203U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W3F203   DPAGE CURSOR=((5,36)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'ART.STAT  URVAL ARTIKEL',                              +        
               POS=(1,10),LTH=23,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD0140  DFLD  POS=(1,40),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Urval',                                                +        
               POS=(2,10),LTH=5,                                       +        
               ATTR=(PROT)                                                      
FLD0216  DFLD  POS=(2,16),LTH=8,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Userid',                                               +        
               POS=(2,27),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0234  DFLD  POS=(2,34),LTH=8,                                       +        
               ATTR=(NOPROT)                                                    
FLD0316  DFLD  POS=(3,16),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0334  DFLD  POS=(3,34),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0402  DFLD  POS=(4,2),LTH=9,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0412  DFLD  POS=(4,12),LTH=9,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0422  DFLD  POS=(4,22),LTH=8,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0429  DFLD  POS=(4,31),LTH=6,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'Start vecka',                                          +        
               POS=(5,2),LTH=11,                                       +        
               ATTR=(PROT)                                                      
FLD0519  DFLD  POS=(5,19),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Ska sparas',                                           +        
               POS=(5,25),LTH=10,                                      +        
               ATTR=(PROT)                                                      
FLD0536  DFLD  POS=(5,36),LTH=8,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Tag bort',                                             +        
               POS=(5,48),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FLD0557  DFLD  POS=(5,57),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Listtyp',                                              +        
               POS=(5,62),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FLD0570  DFLD  POS=(5,70),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Slut  vecka',                                          +        
               POS=(6,2),LTH=11,                                       +        
               ATTR=(PROT)                                                      
FLD0619  DFLD  POS=(6,19),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Pristyp',                                              +        
               POS=(6,62),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FLD0670  DFLD  POS=(6,70),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
FLD0821  DFLD  POS=(8,21),LTH=3,                                       +        
               ATTR=(PROT)                                                      
FLD0828  DFLD  POS=(8,28),LTH=3,                                       +        
               ATTR=(PROT)                                                      
FLD0835  DFLD  POS=(8,35),LTH=3,                                       +        
               ATTR=(PROT)                                                      
FLD0842  DFLD  POS=(8,42),LTH=3,                                       +        
               ATTR=(PROT)                                                      
FLD0849  DFLD  POS=(8,49),LTH=3,                                       +        
               ATTR=(PROT)                                                      
FLD0856  DFLD  POS=(8,56),LTH=3,                                       +        
               ATTR=(PROT)                                                      
FLD0863  DFLD  POS=(8,63),LTH=3,                                       +        
               ATTR=(PROT)                                                      
FLD0870  DFLD  POS=(8,70),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'From -  Tom   From -  Tom   From -  Tom   From -  Tom',+        
               POS=(9,20),LTH=53,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Marknad',                                              +        
               POS=(10,2),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FLD1021  DFLD  POS=(10,21),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(10,25),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1028  DFLD  POS=(10,28),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
FLD1035  DFLD  POS=(10,35),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(10,39),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1042  DFLD  POS=(10,42),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
FLD1049  DFLD  POS=(10,49),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(10,53),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1056  DFLD  POS=(10,56),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
FLD1063  DFLD  POS=(10,63),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(10,67),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1070  DFLD  POS=(10,70),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
FLD1121  DFLD  POS=(11,21),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(11,25),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1128  DFLD  POS=(11,28),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
FLD1135  DFLD  POS=(11,35),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(11,39),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1142  DFLD  POS=(11,42),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
FLD1149  DFLD  POS=(11,49),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(11,53),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1156  DFLD  POS=(11,56),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
FLD1163  DFLD  POS=(11,63),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(11,67),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1170  DFLD  POS=(11,70),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Distrikt',                                             +        
               POS=(12,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FLD1220  DFLD  POS=(12,20),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(12,25),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1227  DFLD  POS=(12,27),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
FLD1234  DFLD  POS=(12,34),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(12,39),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1241  DFLD  POS=(12,41),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
FLD1248  DFLD  POS=(12,48),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(12,53),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1255  DFLD  POS=(12,55),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
FLD1262  DFLD  POS=(12,62),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(12,67),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1269  DFLD  POS=(12,69),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Artikelnr',                                            +        
               POS=(13,2),LTH=9,                                       +        
               ATTR=(PROT)                                                      
COL1213  DFLD  POS=(13,12),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL2213  DFLD  POS=(13,22),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL3213  DFLD  POS=(13,32),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL4213  DFLD  POS=(13,42),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL5213  DFLD  POS=(13,52),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL6213  DFLD  POS=(13,62),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL7213  DFLD  POS=(13,72),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL1214  DFLD  POS=(14,12),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL2214  DFLD  POS=(14,22),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL3214  DFLD  POS=(14,32),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL4214  DFLD  POS=(14,42),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL5214  DFLD  POS=(14,52),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL6214  DFLD  POS=(14,62),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL7214  DFLD  POS=(14,72),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL1215  DFLD  POS=(15,12),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL2215  DFLD  POS=(15,22),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL3215  DFLD  POS=(15,32),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL4215  DFLD  POS=(15,42),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL5215  DFLD  POS=(15,52),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL6215  DFLD  POS=(15,62),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL7215  DFLD  POS=(15,72),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL1216  DFLD  POS=(16,12),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL2216  DFLD  POS=(16,22),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL3216  DFLD  POS=(16,32),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL4216  DFLD  POS=(16,42),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL5216  DFLD  POS=(16,52),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL6216  DFLD  POS=(16,62),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL7216  DFLD  POS=(16,72),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL1217  DFLD  POS=(17,12),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL2217  DFLD  POS=(17,22),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL3217  DFLD  POS=(17,32),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL4217  DFLD  POS=(17,42),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL5217  DFLD  POS=(17,52),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL6217  DFLD  POS=(17,62),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL7217  DFLD  POS=(17,72),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Borttag',                                              +        
               POS=(18,2),LTH=7,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'artnr',                                                +        
               POS=(19,2),LTH=5,                                       +        
               ATTR=(PROT)                                                      
FLD1906  DFLD  POS=(19,10),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
FLD1912  DFLD  POS=(19,12),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
FLD1922  DFLD  POS=(19,22),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
FLD1932  DFLD  POS=(19,32),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
FLD1942  DFLD  POS=(19,42),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
FLD1952  DFLD  POS=(19,52),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
FLD1962  DFLD  POS=(19,62),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
FLD1972  DFLD  POS=(19,72),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '13 Katalog-bild 14 Fkngrp-urval 15 Artikelurval 16 Stor+        
               säljare  17',                                           +        
               POS=(21,2),LTH=66,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 Whelp',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W3O20301 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W3F203,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W3I20301,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W3F203                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0140,                                                +        
               LTH=40                                                           
         MFLD  FLD0216,                                                +        
               LTH=2                                                            
         MFLD  FLD0234,                                                +        
               LTH=2                                                            
         MFLD  FLD0316,                                                +        
               LTH=8                                                            
         MFLD  FLD0334,                                                +        
               LTH=8                                                            
         MFLD  FLD0402,                                                +        
               LTH=9                                                            
         MFLD  FLD0412,                                                +        
               LTH=9                                                            
         MFLD  FLD0422,                                                +        
               LTH=8                                                            
         MFLD  FLD0429,                                                +        
               LTH=6                                                            
         MFLD  FLD0519,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0536,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD0557,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0570,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0619,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0670,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0821,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0828,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0835,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0842,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0849,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0856,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0863,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0870,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1021,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1028,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1035,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1042,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1049,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1056,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1063,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1070,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1121,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1128,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1135,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1142,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1149,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1156,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1163,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1170,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1220,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1227,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1234,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1241,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1248,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1255,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1262,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1269,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1213,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL2213,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL3213,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL4213,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL5213,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL6213,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL7213,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL1214,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL2214,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL3214,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL4214,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL5214,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL6214,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL7214,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL1215,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL2215,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL3215,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL4215,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL5215,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL6215,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL7215,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL1216,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL2216,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL3216,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL4216,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL5216,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL6216,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL7216,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL1217,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL2217,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL3217,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL4217,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL5217,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL6217,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL7217,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1906,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1912,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1922,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1932,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1942,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1952,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1962,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1972,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W3I20301 MSG   TYPE=INPUT,                                             +        
               SOR=(W3F203),                                           +        
               OPT=2,                                                  +        
               NXT=W3O20301                                                     
MID      LPAGE SOR=(W3F203)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '32031',                                                +        
               LTH=5                                                            
         MFLD  (FLD0216,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLD0234,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  FLD0316,                                                +        
               LTH=8,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  FLD0334,                                                +        
               LTH=8,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  FLD0402,                                                +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0412,                                                +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0422,                                                +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0429,                                                +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0519,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0536,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLD0557,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLD0570,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLD0619,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0670,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLD0821,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0828,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0835,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0842,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0849,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0856,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0863,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0870,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1021,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1028,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1035,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1042,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1049,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1056,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1063,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1070,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1121,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1128,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1135,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1142,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1149,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1156,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1163,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1170,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1220,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1227,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1234,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1241,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1248,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1255,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1262,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1269,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1213,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2213,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL3213,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4213,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL5213,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL6213,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL7213,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1214,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2214,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL3214,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4214,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL5214,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL6214,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL7214,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1215,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2215,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL3215,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4215,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL5215,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL6215,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL7215,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1216,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2216,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL3216,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4216,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL5216,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL6216,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL7216,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1217,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2217,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL3217,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4217,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL5217,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL6217,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL7217,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1906,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLD1912,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1922,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1932,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1942,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1952,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1962,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1972,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
