*          DATA SET W3F201FII0 AT LEVEL 042 AS OF 89/11/16                      
         PRINT NOGEN                                                            
W3F201   FMT                                                                    
         DEV   TYPE=(3270,2),                                          *        
               FEAT=IGNORE,                                            *        
               PFK=(FLDPFK,'W0T551U ','W0T501  ','W0T501  ','W0T501  ',*        
               'W0T501  ','W0T501  ','W3T201 7','W3T201 8','W3T201 9', *        
               'WHELP   ','W0T501  ','/RCL.   ','W3T201  ','W3T202  ', *        
               'W3T203  ','W3T204  ','W0T501  ','W0T501  ','W0T501  ', *        
               'W0T501  ','W0T501  ','WHELP   ','W0T501  ','/RCL.   '),*        
               DSCA=X'0080',SYSMSG=FSYSMSG                                      
         DIV   TYPE=INOUT                                                       
         DPAGE CURSOR=((02,16)),                                       *        
               FILL=NONE                                                        
         ALPHA  'abcdefghijklmnopqrstuvwxyzåäö'                                 
FLD0102  DFLD  POS=(01,02),LTH=0001,ATTR=(ALPHA,NOPROT,MOD)                     
FLD0104  DFLD  POS=(01,04),LTH=0001,ATTR=(NUM)                                  
FLD0106  DFLD  POS=(01,06),LTH=0001,ATTR=(NUM)                                  
FLD0108  DFLD  POS=(01,08),LTH=0001,ATTR=(NUM)                                  
         DFLD  'ART.STAT  KATALOG ÖVER URVAL ',                        *        
               POS=(01,10),LTH=0029,ATTR=(NUM,PROT)                             
FLD0140  DFLD  POS=(01,40),LTH=0040,ATTR=(NUM,PROT,HI)                          
         DFLD  'Urval',                                                *        
               POS=(02,10),LTH=0005,ATTR=(NUM,PROT)                             
FLD0216  DFLD  POS=(02,16),LTH=0008,ATTR=(ALPHA)                                
         DFLD  'Userid',                                               *        
               POS=(02,27),LTH=0006,ATTR=(NUM,PROT)                             
FLD0234  DFLD  POS=(02,34),LTH=0008,ATTR=(ALPHA)                                
FLD0316  DFLD  POS=(03,16),LTH=0008,ATTR=(NUM,PROT,MOD)                         
FLD0334  DFLD  POS=(03,34),LTH=0008,ATTR=(NUM,PROT,MOD)                         
FLD0402  DFLD  POS=(04,02),LTH=0004,ATTR=(NUM,PROT,MOD,NODISP)                  
FLD0407  DFLD  POS=(04,07),LTH=0004,ATTR=(NUM,PROT,MOD,NODISP)                  
FLD0412  DFLD  POS=(04,12),LTH=0008,ATTR=(NUM,PROT,MOD,NODISP)                  
FLD0419  DFLD  POS=(04,21),LTH=0008,ATTR=(NUM,PROT,MOD,NODISP)                  
FLD0426  DFLD  POS=(04,30),LTH=0006,ATTR=(NUM,PROT,MOD,NODISP)                  
FLD0433  DFLD  POS=(04,43),LTH=0006,ATTR=(NUM,PROT,MOD,NODISP)                  
FLD0440  DFLD  POS=(04,50),LTH=0008,ATTR=(NUM,PROT,MOD,NODISP)                  
FLD0450  DFLD  POS=(04,60),LTH=0008,ATTR=(NUM,PROT,MOD,NODISP)                  
         DFLD  'S  Namn     Datum   Klockslag   Bild  S  Namn     Datum*        
                  Klockslag   Bild',                                   *        
               POS=(05,02),LTH=0074,ATTR=(NUM,PROT)                             
         DO    14,SUF=06                                                        
COL02    DFLD  POS=(06,02),LTH=0001,ATTR=(ALPHA,MOD)                            
COL05    DFLD  POS=(06,05),LTH=0008,ATTR=(NUM,PROT,MOD)                         
COL14    DFLD  POS=(06,14),LTH=0008,ATTR=(NUM,PROT,MOD)                         
COL22    DFLD  POS=(06,23),LTH=0006,ATTR=(NUM,PROT,MOD)                         
COL34    DFLD  POS=(06,34),LTH=0004,ATTR=(NUM,PROT,MOD)                         
         ENDDO                                                                  
         DO    14,SUF=06                                                        
COL40    DFLD  POS=(06,40),LTH=0001,ATTR=(ALPHA,MOD)                            
COL43    DFLD  POS=(06,43),LTH=0008,ATTR=(NUM,PROT,MOD)                         
COL52    DFLD  POS=(06,52),LTH=0008,ATTR=(NUM,PROT,MOD)                         
COL60    DFLD  POS=(06,61),LTH=0006,ATTR=(NUM,PROT,MOD)                         
COL69    DFLD  POS=(06,72),LTH=0004,ATTR=(NUM,PROT,MOD)                         
         ENDDO                                                                  
         DFLD  '13 Katalog-bild 14 Fkngrp-urval 15 Artikelurval 16 Stor*        
               säljare  17              18              19             *        
                20              21              10 Whelp',             *        
               POS=(21,02),LTH=0152,ATTR=(NUM,PROT)                             
FLD2302  DFLD  POS=(23,02),LTH=0055,ATTR=(NUM,PROT,HI)                          
         DFLD  ' VCP ',POS=(23,58)                                              
FLD2364  DFLD  POS=(23,64),LTH=0008,ATTR=(NUM,PROT)                             
FLD2373  DFLD  POS=(23,73),LTH=0008,ATTR=(NUM,PROT)                             
FSYSMSG  DFLD  POS=(24,02),LTH=0079,ATTR=(NUM,PROT,HI)                          
         FMTEND                                                                 
         EJECT                                                                  
W3O20101 MSG   TYPE=OUTPUT,                                            *        
               SOR=(W3F201,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W3I20101,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  FLD0102,LTH=0001                                                 
         MFLD  FLD0104,LTH=0001                                                 
         MFLD  FLD0106,LTH=0001                                                 
         MFLD  FLD0108,LTH=0001                                                 
         MFLD  FLD0140,LTH=0040                                                 
         MFLD  FLD0216,LTH=0002                                                 
         MFLD  FLD0234,LTH=0002                                                 
         MFLD  FLD0316,LTH=0008                                                 
         MFLD  FLD0334,LTH=0008                                                 
         MFLD  FLD0402,LTH=0004                                                 
         MFLD  FLD0407,LTH=0004                                                 
         MFLD  FLD0412,LTH=0008                                                 
         MFLD  FLD0419,LTH=0008                                                 
         MFLD  FLD0426,LTH=0006                                                 
         MFLD  FLD0433,LTH=0006                                                 
         MFLD  FLD0440,LTH=0008                                                 
         MFLD  FLD0450,LTH=0008                                                 
         DO    14,SUF=06                                                        
         MFLD  COL02,LTH=0004,ATTR=YES                                          
         MFLD  COL05,LTH=0010,ATTR=YES                                          
         MFLD  COL14,LTH=0010,ATTR=YES                                          
         MFLD  COL22,LTH=0008,ATTR=YES                                          
         MFLD  COL34,LTH=0006,ATTR=YES                                          
         ENDDO                                                                  
         DO    14,SUF=06                                                        
         MFLD  COL40,LTH=0004,ATTR=YES                                          
         MFLD  COL43,LTH=0010,ATTR=YES                                          
         MFLD  COL52,LTH=0010,ATTR=YES                                          
         MFLD  COL60,LTH=0008,ATTR=YES                                          
         MFLD  COL69,LTH=0006,ATTR=YES                                          
         ENDDO                                                                  
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W3I20101 MSG   TYPE=INPUT,                                             *        
               SOR=W3F201,                                             *        
               OPT=2,                                                  *        
               NXT=W3O20101                                                     
         SEG                                                                    
         MFLD  FLDPFK,LTH=0008,FILL=NULL                                        
         MFLD  'W',LTH=0001                                                     
         MFLD  FLD0102,LTH=0001,FILL=C'3'                                       
         MFLD  'T',LTH=0001                                                     
         MFLD  FLD0104,LTH=0001,FILL=C'2'                                       
         MFLD  FLD0106,LTH=0001,FILL=C'0'                                       
         MFLD  FLD0108,LTH=0001,FILL=C'1'                                       
         MFLD  '  ',LTH=0002                                                    
         MFLD  '32011',LTH=0005                                                 
         MFLD  (FLD0216,'++++++++'),LTH=0008,FILL=C' ',JUST=L                   
         MFLD  (FLD0234,'++++++++'),LTH=0008,FILL=C' ',JUST=L                   
         MFLD  FLD0316,LTH=0008,FILL=C' ',JUST=L                                
         MFLD  FLD0334,LTH=0008,FILL=C' ',JUST=L                                
         MFLD  FLD0402,LTH=0004,FILL=C' ',JUST=L                                
         MFLD  FLD0407,LTH=0004,FILL=C' ',JUST=L                                
         MFLD  FLD0412,LTH=0008,FILL=C'0',JUST=R                                
         MFLD  FLD0419,LTH=0008,FILL=C'0',JUST=R                                
         MFLD  FLD0426,LTH=0006,FILL=C'0',JUST=R                                
         MFLD  FLD0433,LTH=0006,FILL=C'0',JUST=R                                
         MFLD  FLD0440,LTH=0008,FILL=C' ',JUST=L                                
         MFLD  FLD0450,LTH=0008,FILL=C' ',JUST=L                                
         DO    14,SUF=06                                                        
         MFLD  (COL02,'+'),LTH=0001,FILL=C' ',JUST=L                            
         MFLD  COL05,LTH=0008,JUST=L                                            
         MFLD  COL14,LTH=0008,JUST=R                                            
         MFLD  COL22,LTH=0006,JUST=R                                            
         MFLD  COL34,LTH=0004,JUST=L                                            
         ENDDO                                                                  
         DO    14,SUF=06                                                        
         MFLD  (COL40,'+'),LTH=0001,FILL=C' ',JUST=L                            
         MFLD  COL43,LTH=0008,JUST=L                                            
         MFLD  COL52,LTH=0008,JUST=R                                            
         MFLD  COL60,LTH=0006,JUST=R                                            
         MFLD  COL69,LTH=0004,JUST=L                                            
         ENDDO                                                                  
         MSGEND                                                                 
         END                                                                    
