*          DATA SET W3F211FII0 AT LEVEL 088 AS OF 89/10/25                      
         PRINT NOGEN                                                            
W3F211   FMT                                                                    
         DEV   TYPE=(3270,2),                                          *        
               FEAT=IGNORE,                                            *        
               PFK=(FLDPFK,'W0T551U ','W0T501  ','W0T501  ','W0T501 4',*        
               'W0T501  ','W0T501  ','W3T211 7','W3T211 8','W0T501  ', *        
               'WHELP   ','W3T211U ','/RCL.   ','W3T211  ','W3T213  ', *        
               'W3T212  ','W0T501  ','W0T501  ','W0T501  ','W0T501  ', *        
               'W0T501  ','W0T501  ','WHELP   ','W0T501  ','/RCL.   '),*        
               DSCA=X'0080',SYSMSG=FSYSMSG                                      
         DIV   TYPE=INOUT                                                       
         DPAGE CURSOR=((19,06)),                                       *        
               FILL=NONE                                                        
         ALPHA  'abcdefghijklmnopqrstuvwxyzåäö'                                 
FLD0102  DFLD  POS=(01,02),LTH=0001,ATTR=(ALPHA,NOPROT,MOD)                     
FLD0104  DFLD  POS=(01,04),LTH=0001,ATTR=(NUM)                                  
FLD0106  DFLD  POS=(01,06),LTH=0001,ATTR=(NUM)                                  
FLD0108  DFLD  POS=(01,08),LTH=0001,ATTR=(NUM)                                  
         DFLD  'ART.STAT  JUSTERING       ',                           *        
               POS=(01,13),LTH=0026,ATTR=(NUM,PROT)                             
FLD0140  DFLD  POS=(01,40),LTH=0040,ATTR=(NUM,PROT,HI)                          
FLD0401  DFLD  POS=(04,01),LTH=0009,ATTR=(NUM,PROT,MOD,NODISP)                  
FLD0411  DFLD  POS=(04,11),LTH=0004,ATTR=(NUM,PROT,MOD,NODISP)                  
FLD0416  DFLD  POS=(04,16),LTH=0004,ATTR=(NUM,PROT,MOD,NODISP)                  
FLD0431  DFLD  POS=(04,31),LTH=0009,ATTR=(NUM,PROT,MOD,NODISP)                  
FLD0441  DFLD  POS=(04,41),LTH=0004,ATTR=(NUM,PROT,MOD,NODISP)                  
FLD0446  DFLD  POS=(04,46),LTH=0004,ATTR=(NUM,PROT,MOD,NODISP)                  
         DFLD  'Artikelnr Distr Vecka',                                *        
               POS=(05,12),LTH=0021,ATTR=(NUM,PROT)                             
         DFLD  'Justerat  ',                                           *        
               POS=(05,41),LTH=0010,ATTR=(NUM,PROT)                             
         DFLD  'Självkostnad',                                         *        
               POS=(05,61),LTH=0012,ATTR=(NUM,PROT)                             
         DFLD  'ÅÅVV   Kronor+öre     Styck',                          *        
               POS=(06,29),LTH=0027,ATTR=(NUM,PROT)                             
         DFLD  'Kronor+öre',                                           *        
               POS=(06,63),LTH=0010,ATTR=(NUM,PROT)                             
         DO    12,SUF=07                                                        
COL12    DFLD  POS=(07,12),LTH=0009,ATTR=(NUM,PROT)                             
COL23    DFLD  POS=(07,23),LTH=0004,ATTR=(NUM,PROT)                             
COL29    DFLD  POS=(07,29),LTH=0004,ATTR=(NUM,PROT)                             
COL36    DFLD  POS=(07,36),LTH=0011,ATTR=(NUM,PROT)                             
COL49    DFLD  POS=(07,49),LTH=0008,ATTR=(NUM,PROT)                             
COL63    DFLD  POS=(07,63),LTH=0010,ATTR=(NUM,PROT)                             
         ENDDO                                                                  
         DFLD  'B/N',                                                  *        
               POS=(19,02),LTH=0003,ATTR=(NUM,PROT)                             
FLD1906  DFLD  POS=(19,06),LTH=0001,ATTR=(ALPHA)                                
FLD1912  DFLD  POS=(19,12),LTH=0009,ATTR=(NUM)                                  
FLD1923  DFLD  POS=(19,23),LTH=0004,ATTR=(NUM)                                  
FLD1929  DFLD  POS=(19,29),LTH=0004,ATTR=(NUM)                                  
FLD1936  DFLD  POS=(19,36),LTH=0010,ATTR=(NUM)                                  
FLD1949  DFLD  POS=(19,49),LTH=0007,ATTR=(NUM)                                  
FLD1963  DFLD  POS=(19,63),LTH=0010,ATTR=(NUM)                                  
         DFLD  '13 Justering    14 Säsongskurva 15 Delbudget    16     *        
                        17              18              19             *        
                20              21              10 Whelp',             *        
               POS=(21,02),LTH=0152,ATTR=(NUM,PROT)                             
FLD2302  DFLD  POS=(23,02),LTH=0055,ATTR=(NUM,PROT,HI)                          
         DFLD  ' VCP ',POS=(23,58)                                              
FLD2364  DFLD  POS=(23,64),LTH=0008,ATTR=(NUM,PROT)                             
FLD2373  DFLD  POS=(23,73),LTH=0008,ATTR=(NUM,PROT)                             
FSYSMSG  DFLD  POS=(24,02),LTH=0079,ATTR=(NUM,PROT,HI)                          
         FMTEND                                                                 
         EJECT                                                                  
W3O21101 MSG   TYPE=OUTPUT,                                            *        
               SOR=(W3F211,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W3I21101,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  FLD0102,LTH=0001                                                 
         MFLD  FLD0104,LTH=0001                                                 
         MFLD  FLD0106,LTH=0001                                                 
         MFLD  FLD0108,LTH=0001                                                 
         MFLD  FLD0140,LTH=0040                                                 
         MFLD  FLD0401,LTH=0009                                                 
         MFLD  FLD0411,LTH=0004                                                 
         MFLD  FLD0416,LTH=0004                                                 
         MFLD  FLD0431,LTH=0009                                                 
         MFLD  FLD0441,LTH=0004                                                 
         MFLD  FLD0446,LTH=0004                                                 
         DO    12,SUF=07                                                        
         MFLD  COL12,LTH=0009                                                   
         MFLD  COL23,LTH=0004                                                   
         MFLD  COL29,LTH=0004                                                   
         MFLD  COL36,LTH=0011                                                   
         MFLD  COL49,LTH=0008                                                   
         MFLD  COL63,LTH=0010                                                   
         ENDDO                                                                  
         MFLD  FLD1906,LTH=0004,ATTR=YES                                        
         MFLD  FLD1912,LTH=0004,ATTR=YES                                        
         MFLD  FLD1923,LTH=0004,ATTR=YES                                        
         MFLD  FLD1929,LTH=0004,ATTR=YES                                        
         MFLD  FLD1936,LTH=0004,ATTR=YES                                        
         MFLD  FLD1949,LTH=0004,ATTR=YES                                        
         MFLD  FLD1963,LTH=0004,ATTR=YES                                        
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W3I21101 MSG   TYPE=INPUT,                                             *        
               SOR=W3F211,                                             *        
               OPT=2,                                                  *        
               NXT=W3O21101                                                     
         SEG                                                                    
         MFLD  FLDPFK,LTH=0008,FILL=NULL                                        
         MFLD  'W',LTH=0001                                                     
         MFLD  FLD0102,LTH=0001,FILL=C'3'                                       
         MFLD  'T',LTH=0001                                                     
         MFLD  FLD0104,LTH=0001,FILL=C'2'                                       
         MFLD  FLD0106,LTH=0001,FILL=C'1'                                       
         MFLD  FLD0108,LTH=0001,FILL=C'1'                                       
         MFLD  '  ',LTH=0002                                                    
         MFLD  '32111',LTH=0005                                                 
         MFLD  FLD0401,LTH=0009,FILL=C'0',JUST=R                                
         MFLD  FLD0411,LTH=0004,FILL=C'0',JUST=R                                
         MFLD  FLD0416,LTH=0004,FILL=C'0',JUST=R                                
         MFLD  FLD0431,LTH=0009,FILL=C'0',JUST=R                                
         MFLD  FLD0441,LTH=0004,FILL=C'0',JUST=R                                
         MFLD  FLD0446,LTH=0004,FILL=C'0',JUST=R                                
         MFLD  (FLD1906,'+'),LTH=0001                                           
         MFLD  (FLD1912,'+++++++++'),LTH=0009,FILL=C'0',JUST=R                  
         MFLD  (FLD1923,'++++'),LTH=0004,FILL=C'0',JUST=R                       
         MFLD  (FLD1929,'++++'),LTH=0004,FILL=C' '                              
         MFLD  (FLD1936,'++++++++++'),LTH=0010,FILL=C'0',JUST=R                 
         MFLD  (FLD1949,'+++++++'),LTH=0007,FILL=C'0',JUST=R                    
         MFLD  (FLD1963,'++++++++++'),LTH=0010,FILL=C'0',JUST=R                 
         MSGEND                                                                 
         EJECT                                                                  
         END                                                                    
