***********************************************************************         
* CREATED BY PC59009   ON 95/10/03  AT 15:16                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'TRANSFERRABATT/KAMPANJ          '                               
W3F316   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W3T316 7',                                           +        
               8='W3T316 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W3T311  ',                                          +        
               14='W3T312  ',                                          +        
               15='W3T313  ',                                          +        
               16='W3T314  ',                                          +        
               17='W3T315  ',                                          +        
               18='W3T316  ',                                          +        
               19='W3T317  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W3F316   DPAGE CURSOR=((2,13)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'GÄLLANDE TRANSFER RABATTER',                           +        
               POS=(1,11),LTH=26,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,40),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Prisområde',                                           +        
               POS=(2,2),LTH=10,                                       +        
               ATTR=(PROT)                                                      
DGIA0015 DFLD  POS=(2,13),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  '   Transferkod',                                       +        
               POS=(2,17),LTH=14,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0020 DFLD  POS=(2,32),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Distrikt',                                             +        
               POS=(2,38),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
IDDISTRI DFLD  POS=(2,47),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0017 DFLD  POS=(3,13),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0021 DFLD  POS=(3,32),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
IDDISTRU DFLD  POS=(3,47),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0016 DFLD  POS=(4,2),LTH=3,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0018 DFLD  POS=(4,6),LTH=5,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0019 DFLD  POS=(4,12),LTH=5,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0000 DFLD  POS=(4,18),LTH=6,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0001 DFLD  POS=(4,25),LTH=6,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
         DFLD  'Transferkod     MO-%   DO-%    Start datum   Stopp datu+        
               m',                                                     +        
               POS=(5,2),LTH=56,                                       +        
               ATTR=(PROT)                                                      
DGIA0022 DFLD  POS=(6,7),LTH=5,                                        +        
               ATTR=(PROT,MOD)                                                  
DGIA0035 DFLD  POS=(6,17),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DGIA0002 DFLD  POS=(6,24),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DGIA0048 DFLD  POS=(6,38),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0061 DFLD  POS=(6,52),LTH=6,                                       +        
               ATTR=(PROT)                                                      
DGIA0027 DFLD  POS=(7,7),LTH=5,                                        +        
               ATTR=(PROT,MOD)                                                  
DGIA0040 DFLD  POS=(7,17),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DGIA0007 DFLD  POS=(7,24),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DGIA0053 DFLD  POS=(7,38),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0066 DFLD  POS=(7,52),LTH=6,                                       +        
               ATTR=(PROT)                                                      
DGIA0028 DFLD  POS=(8,7),LTH=5,                                        +        
               ATTR=(PROT,MOD)                                                  
DGIA0041 DFLD  POS=(8,17),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DGIA0008 DFLD  POS=(8,24),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DGIA0054 DFLD  POS=(8,38),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0067 DFLD  POS=(8,52),LTH=6,                                       +        
               ATTR=(PROT)                                                      
DGIA0029 DFLD  POS=(9,7),LTH=5,                                        +        
               ATTR=(PROT,MOD)                                                  
DGIA0042 DFLD  POS=(9,17),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DGIA0009 DFLD  POS=(9,24),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DGIA0055 DFLD  POS=(9,38),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0068 DFLD  POS=(9,52),LTH=6,                                       +        
               ATTR=(PROT)                                                      
DGIA0030 DFLD  POS=(10,7),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0043 DFLD  POS=(10,17),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0010 DFLD  POS=(10,24),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0056 DFLD  POS=(10,38),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0069 DFLD  POS=(10,52),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0031 DFLD  POS=(11,7),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0044 DFLD  POS=(11,17),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0011 DFLD  POS=(11,24),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0057 DFLD  POS=(11,38),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0070 DFLD  POS=(11,52),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0032 DFLD  POS=(12,7),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0045 DFLD  POS=(12,17),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0012 DFLD  POS=(12,24),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0058 DFLD  POS=(12,38),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0071 DFLD  POS=(12,52),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0033 DFLD  POS=(13,7),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0046 DFLD  POS=(13,17),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0013 DFLD  POS=(13,24),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0059 DFLD  POS=(13,38),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0072 DFLD  POS=(13,52),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0034 DFLD  POS=(14,7),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0047 DFLD  POS=(14,17),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0014 DFLD  POS=(14,24),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0060 DFLD  POS=(14,38),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0073 DFLD  POS=(14,52),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0023 DFLD  POS=(15,7),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0036 DFLD  POS=(15,17),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0003 DFLD  POS=(15,24),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0049 DFLD  POS=(15,38),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0062 DFLD  POS=(15,52),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0024 DFLD  POS=(16,7),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0037 DFLD  POS=(16,17),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0004 DFLD  POS=(16,24),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0050 DFLD  POS=(16,38),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0063 DFLD  POS=(16,52),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0025 DFLD  POS=(17,7),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0038 DFLD  POS=(17,17),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0005 DFLD  POS=(17,24),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0051 DFLD  POS=(17,38),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0064 DFLD  POS=(17,52),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0026 DFLD  POS=(18,7),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0039 DFLD  POS=(18,17),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0006 DFLD  POS=(18,24),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0052 DFLD  POS=(18,38),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0065 DFLD  POS=(18,52),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '13 Betalarreg   14 Prisområde   15 Pris artnr   16 Art +        
               kam rab  17 Norm rabatt',                               +        
               POS=(21,2),LTH=78,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18 Tran rabatt  19 Art rabatt   20',                   +        
               POS=(22,2),LTH=34,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '22 Whelp',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W3O31601 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W3F316,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W3I31601,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W3F316                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  DGIA0015,                                               +        
               LTH=3                                                            
         MFLD  DGIA0017,                                               +        
               LTH=3                                                            
         MFLD  DGIA0020,                                               +        
               LTH=5                                                            
         MFLD  DGIA0021,                                               +        
               LTH=5                                                            
         MFLD  IDDISTRI,                                               +        
               LTH=4                                                            
         MFLD  IDDISTRU,                                               +        
               LTH=4                                                            
         MFLD  DGIA0016,                                               +        
               LTH=3                                                            
         MFLD  DGIA0018,                                               +        
               LTH=5                                                            
         MFLD  DGIA0019,                                               +        
               LTH=5                                                            
         MFLD  DGIA0000,                                               +        
               LTH=6                                                            
         MFLD  DGIA0001,                                               +        
               LTH=6                                                            
         MFLD  DGIA0022,                                               +        
               LTH=5                                                            
         MFLD  DGIA0035,                                               +        
               LTH=5                                                            
         MFLD  DGIA0002,                                               +        
               LTH=5                                                            
         MFLD  DGIA0048,                                               +        
               LTH=6                                                            
         MFLD  DGIA0061,                                               +        
               LTH=6                                                            
         MFLD  DGIA0027,                                               +        
               LTH=5                                                            
         MFLD  DGIA0040,                                               +        
               LTH=5                                                            
         MFLD  DGIA0007,                                               +        
               LTH=5                                                            
         MFLD  DGIA0053,                                               +        
               LTH=6                                                            
         MFLD  DGIA0066,                                               +        
               LTH=6                                                            
         MFLD  DGIA0028,                                               +        
               LTH=5                                                            
         MFLD  DGIA0041,                                               +        
               LTH=5                                                            
         MFLD  DGIA0008,                                               +        
               LTH=5                                                            
         MFLD  DGIA0054,                                               +        
               LTH=6                                                            
         MFLD  DGIA0067,                                               +        
               LTH=6                                                            
         MFLD  DGIA0029,                                               +        
               LTH=5                                                            
         MFLD  DGIA0042,                                               +        
               LTH=5                                                            
         MFLD  DGIA0009,                                               +        
               LTH=5                                                            
         MFLD  DGIA0055,                                               +        
               LTH=6                                                            
         MFLD  DGIA0068,                                               +        
               LTH=6                                                            
         MFLD  DGIA0030,                                               +        
               LTH=5                                                            
         MFLD  DGIA0043,                                               +        
               LTH=5                                                            
         MFLD  DGIA0010,                                               +        
               LTH=5                                                            
         MFLD  DGIA0056,                                               +        
               LTH=6                                                            
         MFLD  DGIA0069,                                               +        
               LTH=6                                                            
         MFLD  DGIA0031,                                               +        
               LTH=5                                                            
         MFLD  DGIA0044,                                               +        
               LTH=5                                                            
         MFLD  DGIA0011,                                               +        
               LTH=5                                                            
         MFLD  DGIA0057,                                               +        
               LTH=6                                                            
         MFLD  DGIA0070,                                               +        
               LTH=6                                                            
         MFLD  DGIA0032,                                               +        
               LTH=5                                                            
         MFLD  DGIA0045,                                               +        
               LTH=5                                                            
         MFLD  DGIA0012,                                               +        
               LTH=5                                                            
         MFLD  DGIA0058,                                               +        
               LTH=6                                                            
         MFLD  DGIA0071,                                               +        
               LTH=6                                                            
         MFLD  DGIA0033,                                               +        
               LTH=5                                                            
         MFLD  DGIA0046,                                               +        
               LTH=5                                                            
         MFLD  DGIA0013,                                               +        
               LTH=5                                                            
         MFLD  DGIA0059,                                               +        
               LTH=6                                                            
         MFLD  DGIA0072,                                               +        
               LTH=6                                                            
         MFLD  DGIA0034,                                               +        
               LTH=5                                                            
         MFLD  DGIA0047,                                               +        
               LTH=5                                                            
         MFLD  DGIA0014,                                               +        
               LTH=5                                                            
         MFLD  DGIA0060,                                               +        
               LTH=6                                                            
         MFLD  DGIA0073,                                               +        
               LTH=6                                                            
         MFLD  DGIA0023,                                               +        
               LTH=5                                                            
         MFLD  DGIA0036,                                               +        
               LTH=5                                                            
         MFLD  DGIA0003,                                               +        
               LTH=5                                                            
         MFLD  DGIA0049,                                               +        
               LTH=6                                                            
         MFLD  DGIA0062,                                               +        
               LTH=6                                                            
         MFLD  DGIA0024,                                               +        
               LTH=5                                                            
         MFLD  DGIA0037,                                               +        
               LTH=5                                                            
         MFLD  DGIA0004,                                               +        
               LTH=5                                                            
         MFLD  DGIA0050,                                               +        
               LTH=6                                                            
         MFLD  DGIA0063,                                               +        
               LTH=6                                                            
         MFLD  DGIA0025,                                               +        
               LTH=5                                                            
         MFLD  DGIA0038,                                               +        
               LTH=5                                                            
         MFLD  DGIA0005,                                               +        
               LTH=5                                                            
         MFLD  DGIA0051,                                               +        
               LTH=6                                                            
         MFLD  DGIA0064,                                               +        
               LTH=6                                                            
         MFLD  DGIA0026,                                               +        
               LTH=5                                                            
         MFLD  DGIA0039,                                               +        
               LTH=5                                                            
         MFLD  DGIA0006,                                               +        
               LTH=5                                                            
         MFLD  DGIA0052,                                               +        
               LTH=6                                                            
         MFLD  DGIA0065,                                               +        
               LTH=6                                                            
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W3I31601 MSG   TYPE=INPUT,                                             +        
               SOR=(W3F316),                                           +        
               OPT=2,                                                  +        
               NXT=W3O31601                                                     
MID      LPAGE SOR=(W3F316)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  (FLD0102,                                               +        
               '3'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  (FLD0104,                                               +        
               '3'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  (FLD0106,                                               +        
               '1'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  (FLD0108,                                               +        
               '6'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '33161',                                                +        
               LTH=5                                                            
         MFLD  (DGIA0015,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  DGIA0017,                                               +        
               LTH=3                                                            
         MFLD  (DGIA0020,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0021,                                               +        
               LTH=5                                                            
         MFLD  (IDDISTRI,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDDISTRU,                                               +        
               LTH=4                                                            
         MFLD  DGIA0016,                                               +        
               LTH=3                                                            
         MFLD  DGIA0018,                                               +        
               LTH=5                                                            
         MFLD  DGIA0019,                                               +        
               LTH=5                                                            
         MFLD  DGIA0000,                                               +        
               LTH=6                                                            
         MFLD  DGIA0001,                                               +        
               LTH=6                                                            
         MSGEND                                                                 
         END                                                                    
