***********************************************************************         
* CREATED BY PC59009   ON 95/10/03  AT 15:15                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'KAMPANJRABATT/TRANSFERRABATT    '                               
W3F314   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W3T314 7',                                           +        
               8='W3T314 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W3T311  ',                                          +        
               14='W3T312  ',                                          +        
               15='W3T313  ',                                          +        
               16='W3T314  ',                                          +        
               17='W3T315  ',                                          +        
               18='W3T316  ',                                          +        
               19='W3T317  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W3F314   DPAGE CURSOR=((2,13)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'ARTIKELTRANSFERRABATT',                                +        
               POS=(1,11),LTH=21,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Prisområde',                                           +        
               POS=(2,2),LTH=10,                                       +        
               ATTR=(ALPHA,PROT)                                                
DGIA0019 DFLD  POS=(2,13),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Artikelnr',                                            +        
               POS=(2,17),LTH=9,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0002 DFLD  POS=(2,27),LTH=9,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  '   Transferkod',                                       +        
               POS=(2,37),LTH=14,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0021 DFLD  POS=(2,52),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Distrikt',                                             +        
               POS=(2,58),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
IDDISTRI DFLD  POS=(2,67),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0020 DFLD  POS=(3,13),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0003 DFLD  POS=(3,27),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0022 DFLD  POS=(3,52),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
IDDISTRU DFLD  POS=(3,67),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0000 DFLD  POS=(4,2),LTH=9,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0001 DFLD  POS=(4,12),LTH=9,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0017 DFLD  POS=(4,22),LTH=1,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0018 DFLD  POS=(4,24),LTH=1,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'Artikelnr  Fkngrp  Pslag Rab kod Tran kod Brutto pris  +        
                  Benämning',                                          +        
               POS=(5,2),LTH=67,                                       +        
               ATTR=(PROT)                                                      
ARTNR1   DFLD  POS=(6,2),LTH=9,                                        +        
               ATTR=(PROT,MOD)                                                  
DGIA0004 DFLD  POS=(6,15),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0023 DFLD  POS=(6,23),LTH=2,                                       +        
               ATTR=(PROT)                                                      
NORAB1   DFLD  POS=(6,29),LTH=2,                                       +        
               ATTR=(PROT)                                                      
KAMRAB1  DFLD  POS=(6,36),LTH=5,                                       +        
               ATTR=(PROT)                                                      
RETAIL1  DFLD  POS=(6,45),LTH=10,                                      +        
               ATTR=(PROT)                                                      
KDVALIS1 DFLD  POS=(6,56),LTH=3,                                       +        
               ATTR=(PROT)                                                      
BENAM1   DFLD  POS=(6,60),LTH=20,                                      +        
               ATTR=(PROT)                                                      
ARTNR2   DFLD  POS=(7,2),LTH=9,                                        +        
               ATTR=(PROT,MOD)                                                  
DGIA0009 DFLD  POS=(7,15),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0028 DFLD  POS=(7,23),LTH=2,                                       +        
               ATTR=(PROT)                                                      
NORAB2   DFLD  POS=(7,29),LTH=2,                                       +        
               ATTR=(PROT)                                                      
KAMRAB2  DFLD  POS=(7,36),LTH=5,                                       +        
               ATTR=(PROT)                                                      
RETAIL2  DFLD  POS=(7,45),LTH=10,                                      +        
               ATTR=(PROT)                                                      
KDVALIS2 DFLD  POS=(7,56),LTH=3,                                       +        
               ATTR=(PROT)                                                      
BENAM2   DFLD  POS=(7,60),LTH=20,                                      +        
               ATTR=(PROT)                                                      
ARTNR3   DFLD  POS=(8,2),LTH=9,                                        +        
               ATTR=(PROT,MOD)                                                  
DGIA0010 DFLD  POS=(8,15),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0029 DFLD  POS=(8,23),LTH=2,                                       +        
               ATTR=(PROT)                                                      
NORAB3   DFLD  POS=(8,29),LTH=2,                                       +        
               ATTR=(PROT)                                                      
KAMRAB3  DFLD  POS=(8,36),LTH=5,                                       +        
               ATTR=(PROT)                                                      
RETAIL3  DFLD  POS=(8,45),LTH=10,                                      +        
               ATTR=(PROT)                                                      
KDVALIS3 DFLD  POS=(8,56),LTH=3,                                       +        
               ATTR=(PROT)                                                      
BENAM3   DFLD  POS=(8,60),LTH=20,                                      +        
               ATTR=(PROT)                                                      
ARTNR4   DFLD  POS=(9,2),LTH=9,                                        +        
               ATTR=(PROT,MOD)                                                  
DGIA0011 DFLD  POS=(9,15),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0030 DFLD  POS=(9,23),LTH=2,                                       +        
               ATTR=(PROT)                                                      
NORAB4   DFLD  POS=(9,29),LTH=2,                                       +        
               ATTR=(PROT)                                                      
KAMRAB4  DFLD  POS=(9,36),LTH=5,                                       +        
               ATTR=(PROT)                                                      
RETAIL4  DFLD  POS=(9,45),LTH=10,                                      +        
               ATTR=(PROT)                                                      
KDVALIS4 DFLD  POS=(9,56),LTH=3,                                       +        
               ATTR=(PROT)                                                      
BENAM4   DFLD  POS=(9,60),LTH=20,                                      +        
               ATTR=(PROT)                                                      
ARTNR5   DFLD  POS=(10,2),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0012 DFLD  POS=(10,15),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0031 DFLD  POS=(10,23),LTH=2,                                      +        
               ATTR=(PROT)                                                      
NORAB5   DFLD  POS=(10,29),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KAMRAB5  DFLD  POS=(10,36),LTH=5,                                      +        
               ATTR=(PROT)                                                      
RETAIL5  DFLD  POS=(10,45),LTH=10,                                     +        
               ATTR=(PROT)                                                      
KDVALIS5 DFLD  POS=(10,56),LTH=3,                                      +        
               ATTR=(PROT)                                                      
BENAM5   DFLD  POS=(10,60),LTH=20,                                     +        
               ATTR=(PROT)                                                      
ARTNR6   DFLD  POS=(11,2),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0013 DFLD  POS=(11,15),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0032 DFLD  POS=(11,23),LTH=2,                                      +        
               ATTR=(PROT)                                                      
NORAB6   DFLD  POS=(11,29),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KAMRAB6  DFLD  POS=(11,36),LTH=5,                                      +        
               ATTR=(PROT)                                                      
RETAIL6  DFLD  POS=(11,45),LTH=10,                                     +        
               ATTR=(PROT)                                                      
KDVALIS6 DFLD  POS=(11,56),LTH=3,                                      +        
               ATTR=(PROT)                                                      
BENAM6   DFLD  POS=(11,60),LTH=20,                                     +        
               ATTR=(PROT)                                                      
ARTNR7   DFLD  POS=(12,2),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0014 DFLD  POS=(12,15),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0033 DFLD  POS=(12,23),LTH=2,                                      +        
               ATTR=(PROT)                                                      
NORAB7   DFLD  POS=(12,29),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KAMRAB7  DFLD  POS=(12,36),LTH=5,                                      +        
               ATTR=(PROT)                                                      
RETAIL7  DFLD  POS=(12,45),LTH=10,                                     +        
               ATTR=(PROT)                                                      
KDVALIS7 DFLD  POS=(12,56),LTH=3,                                      +        
               ATTR=(PROT)                                                      
BENAM7   DFLD  POS=(12,60),LTH=20,                                     +        
               ATTR=(PROT)                                                      
ARTNR8   DFLD  POS=(13,2),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0015 DFLD  POS=(13,15),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0034 DFLD  POS=(13,23),LTH=2,                                      +        
               ATTR=(PROT)                                                      
NORAB8   DFLD  POS=(13,29),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KAMRAB8  DFLD  POS=(13,36),LTH=5,                                      +        
               ATTR=(PROT)                                                      
RETAIL8  DFLD  POS=(13,45),LTH=10,                                     +        
               ATTR=(PROT)                                                      
KDVALIS8 DFLD  POS=(13,56),LTH=3,                                      +        
               ATTR=(PROT)                                                      
BENAM8   DFLD  POS=(13,60),LTH=20,                                     +        
               ATTR=(PROT)                                                      
ARTNR9   DFLD  POS=(14,2),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0016 DFLD  POS=(14,15),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0035 DFLD  POS=(14,23),LTH=2,                                      +        
               ATTR=(PROT)                                                      
NORAB9   DFLD  POS=(14,29),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KAMRAB9  DFLD  POS=(14,36),LTH=5,                                      +        
               ATTR=(PROT)                                                      
RETAIL9  DFLD  POS=(14,45),LTH=10,                                     +        
               ATTR=(PROT)                                                      
KDVALIS9 DFLD  POS=(14,56),LTH=3,                                      +        
               ATTR=(PROT)                                                      
BENAM9   DFLD  POS=(14,60),LTH=20,                                     +        
               ATTR=(PROT)                                                      
ARTNR10  DFLD  POS=(15,2),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0005 DFLD  POS=(15,15),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0024 DFLD  POS=(15,23),LTH=2,                                      +        
               ATTR=(PROT)                                                      
NORAB10  DFLD  POS=(15,29),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KAMRAB10 DFLD  POS=(15,36),LTH=5,                                      +        
               ATTR=(PROT)                                                      
RETAIL10 DFLD  POS=(15,45),LTH=10,                                     +        
               ATTR=(PROT)                                                      
KDVALI10 DFLD  POS=(15,56),LTH=3,                                      +        
               ATTR=(PROT)                                                      
BENAM10  DFLD  POS=(15,60),LTH=20,                                     +        
               ATTR=(PROT)                                                      
ARTNR11  DFLD  POS=(16,2),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0006 DFLD  POS=(16,15),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0025 DFLD  POS=(16,23),LTH=2,                                      +        
               ATTR=(PROT)                                                      
NORAB11  DFLD  POS=(16,29),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KAMRAB11 DFLD  POS=(16,36),LTH=5,                                      +        
               ATTR=(PROT)                                                      
RETAIL11 DFLD  POS=(16,45),LTH=10,                                     +        
               ATTR=(PROT)                                                      
KDVALI11 DFLD  POS=(16,56),LTH=3,                                      +        
               ATTR=(PROT)                                                      
BENAM11  DFLD  POS=(16,60),LTH=20,                                     +        
               ATTR=(PROT)                                                      
ARTNR12  DFLD  POS=(17,2),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0007 DFLD  POS=(17,15),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0026 DFLD  POS=(17,23),LTH=2,                                      +        
               ATTR=(PROT)                                                      
NORAB12  DFLD  POS=(17,29),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KAMRAB12 DFLD  POS=(17,36),LTH=5,                                      +        
               ATTR=(PROT)                                                      
RETAIL12 DFLD  POS=(17,45),LTH=10,                                     +        
               ATTR=(PROT)                                                      
KDVALI12 DFLD  POS=(17,56),LTH=3,                                      +        
               ATTR=(PROT)                                                      
BENAM12  DFLD  POS=(17,60),LTH=20,                                     +        
               ATTR=(PROT)                                                      
ARTNR13  DFLD  POS=(18,2),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0008 DFLD  POS=(18,15),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0027 DFLD  POS=(18,23),LTH=2,                                      +        
               ATTR=(PROT)                                                      
NORAB13  DFLD  POS=(18,29),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KAMRAB13 DFLD  POS=(18,36),LTH=5,                                      +        
               ATTR=(PROT)                                                      
RETAIL13 DFLD  POS=(18,45),LTH=10,                                     +        
               ATTR=(PROT)                                                      
KDVALI13 DFLD  POS=(18,56),LTH=3,                                      +        
               ATTR=(PROT)                                                      
BENAM13  DFLD  POS=(18,60),LTH=20,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '13 Betalarreg   14 Prisområde   15 Pris artnr   16 Art +        
               kam rab  17 Norm rabatt',                               +        
               POS=(21,2),LTH=78,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18 Tran rabatt  19 Art rabatt   20',                   +        
               POS=(22,2),LTH=34,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '22 Whelp',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W3O31401 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W3F314,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W3I31401,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W3F314                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  DGIA0019,                                               +        
               LTH=3                                                            
         MFLD  DGIA0020,                                               +        
               LTH=3                                                            
         MFLD  DGIA0002,                                               +        
               LTH=9                                                            
         MFLD  DGIA0003,                                               +        
               LTH=9                                                            
         MFLD  DGIA0021,                                               +        
               LTH=5                                                            
         MFLD  DGIA0022,                                               +        
               LTH=5                                                            
         MFLD  IDDISTRI,                                               +        
               LTH=4                                                            
         MFLD  IDDISTRU,                                               +        
               LTH=4                                                            
         MFLD  DGIA0000,                                               +        
               LTH=9                                                            
         MFLD  DGIA0001,                                               +        
               LTH=9                                                            
         MFLD  DGIA0017,                                               +        
               LTH=1                                                            
         MFLD  DGIA0018,                                               +        
               LTH=1                                                            
         MFLD  ARTNR1,                                                 +        
               LTH=9                                                            
         MFLD  DGIA0004,                                               +        
               LTH=4                                                            
         MFLD  DGIA0023,                                               +        
               LTH=2                                                            
         MFLD  NORAB1,                                                 +        
               LTH=2                                                            
         MFLD  KAMRAB1,                                                +        
               LTH=5                                                            
         MFLD  RETAIL1,                                                +        
               LTH=10                                                           
         MFLD  KDVALIS1,                                               +        
               LTH=3                                                            
         MFLD  BENAM1,                                                 +        
               LTH=20                                                           
         MFLD  ARTNR2,                                                 +        
               LTH=9                                                            
         MFLD  DGIA0009,                                               +        
               LTH=4                                                            
         MFLD  DGIA0028,                                               +        
               LTH=2                                                            
         MFLD  NORAB2,                                                 +        
               LTH=2                                                            
         MFLD  KAMRAB2,                                                +        
               LTH=5                                                            
         MFLD  RETAIL2,                                                +        
               LTH=10                                                           
         MFLD  KDVALIS2,                                               +        
               LTH=3                                                            
         MFLD  BENAM2,                                                 +        
               LTH=20                                                           
         MFLD  ARTNR3,                                                 +        
               LTH=9                                                            
         MFLD  DGIA0010,                                               +        
               LTH=4                                                            
         MFLD  DGIA0029,                                               +        
               LTH=2                                                            
         MFLD  NORAB3,                                                 +        
               LTH=2                                                            
         MFLD  KAMRAB3,                                                +        
               LTH=5                                                            
         MFLD  RETAIL3,                                                +        
               LTH=10                                                           
         MFLD  KDVALIS3,                                               +        
               LTH=3                                                            
         MFLD  BENAM3,                                                 +        
               LTH=20                                                           
         MFLD  ARTNR4,                                                 +        
               LTH=9                                                            
         MFLD  DGIA0011,                                               +        
               LTH=4                                                            
         MFLD  DGIA0030,                                               +        
               LTH=2                                                            
         MFLD  NORAB4,                                                 +        
               LTH=2                                                            
         MFLD  KAMRAB4,                                                +        
               LTH=5                                                            
         MFLD  RETAIL4,                                                +        
               LTH=10                                                           
         MFLD  KDVALIS4,                                               +        
               LTH=3                                                            
         MFLD  BENAM4,                                                 +        
               LTH=20                                                           
         MFLD  ARTNR5,                                                 +        
               LTH=9                                                            
         MFLD  DGIA0012,                                               +        
               LTH=4                                                            
         MFLD  DGIA0031,                                               +        
               LTH=2                                                            
         MFLD  NORAB5,                                                 +        
               LTH=2                                                            
         MFLD  KAMRAB5,                                                +        
               LTH=5                                                            
         MFLD  RETAIL5,                                                +        
               LTH=10                                                           
         MFLD  KDVALIS5,                                               +        
               LTH=3                                                            
         MFLD  BENAM5,                                                 +        
               LTH=20                                                           
         MFLD  ARTNR6,                                                 +        
               LTH=9                                                            
         MFLD  DGIA0013,                                               +        
               LTH=4                                                            
         MFLD  DGIA0032,                                               +        
               LTH=2                                                            
         MFLD  NORAB6,                                                 +        
               LTH=2                                                            
         MFLD  KAMRAB6,                                                +        
               LTH=5                                                            
         MFLD  RETAIL6,                                                +        
               LTH=10                                                           
         MFLD  KDVALIS6,                                               +        
               LTH=3                                                            
         MFLD  BENAM6,                                                 +        
               LTH=20                                                           
         MFLD  ARTNR7,                                                 +        
               LTH=9                                                            
         MFLD  DGIA0014,                                               +        
               LTH=4                                                            
         MFLD  DGIA0033,                                               +        
               LTH=2                                                            
         MFLD  NORAB7,                                                 +        
               LTH=2                                                            
         MFLD  KAMRAB7,                                                +        
               LTH=5                                                            
         MFLD  RETAIL7,                                                +        
               LTH=10                                                           
         MFLD  KDVALIS7,                                               +        
               LTH=3                                                            
         MFLD  BENAM7,                                                 +        
               LTH=20                                                           
         MFLD  ARTNR8,                                                 +        
               LTH=9                                                            
         MFLD  DGIA0015,                                               +        
               LTH=4                                                            
         MFLD  DGIA0034,                                               +        
               LTH=2                                                            
         MFLD  NORAB8,                                                 +        
               LTH=2                                                            
         MFLD  KAMRAB8,                                                +        
               LTH=5                                                            
         MFLD  RETAIL8,                                                +        
               LTH=10                                                           
         MFLD  KDVALIS8,                                               +        
               LTH=3                                                            
         MFLD  BENAM8,                                                 +        
               LTH=20                                                           
         MFLD  ARTNR9,                                                 +        
               LTH=9                                                            
         MFLD  DGIA0016,                                               +        
               LTH=4                                                            
         MFLD  DGIA0035,                                               +        
               LTH=2                                                            
         MFLD  NORAB9,                                                 +        
               LTH=2                                                            
         MFLD  KAMRAB9,                                                +        
               LTH=5                                                            
         MFLD  RETAIL9,                                                +        
               LTH=10                                                           
         MFLD  KDVALIS9,                                               +        
               LTH=3                                                            
         MFLD  BENAM9,                                                 +        
               LTH=20                                                           
         MFLD  ARTNR10,                                                +        
               LTH=9                                                            
         MFLD  DGIA0005,                                               +        
               LTH=4                                                            
         MFLD  DGIA0024,                                               +        
               LTH=2                                                            
         MFLD  NORAB10,                                                +        
               LTH=2                                                            
         MFLD  KAMRAB10,                                               +        
               LTH=5                                                            
         MFLD  RETAIL10,                                               +        
               LTH=10                                                           
         MFLD  KDVALI10,                                               +        
               LTH=3                                                            
         MFLD  BENAM10,                                                +        
               LTH=20                                                           
         MFLD  ARTNR11,                                                +        
               LTH=9                                                            
         MFLD  DGIA0006,                                               +        
               LTH=4                                                            
         MFLD  DGIA0025,                                               +        
               LTH=2                                                            
         MFLD  NORAB11,                                                +        
               LTH=2                                                            
         MFLD  KAMRAB11,                                               +        
               LTH=5                                                            
         MFLD  RETAIL11,                                               +        
               LTH=10                                                           
         MFLD  KDVALI11,                                               +        
               LTH=3                                                            
         MFLD  BENAM11,                                                +        
               LTH=20                                                           
         MFLD  ARTNR12,                                                +        
               LTH=9                                                            
         MFLD  DGIA0007,                                               +        
               LTH=4                                                            
         MFLD  DGIA0026,                                               +        
               LTH=2                                                            
         MFLD  NORAB12,                                                +        
               LTH=2                                                            
         MFLD  KAMRAB12,                                               +        
               LTH=5                                                            
         MFLD  RETAIL12,                                               +        
               LTH=10                                                           
         MFLD  KDVALI12,                                               +        
               LTH=3                                                            
         MFLD  BENAM12,                                                +        
               LTH=20                                                           
         MFLD  ARTNR13,                                                +        
               LTH=9                                                            
         MFLD  DGIA0008,                                               +        
               LTH=4                                                            
         MFLD  DGIA0027,                                               +        
               LTH=2                                                            
         MFLD  NORAB13,                                                +        
               LTH=2                                                            
         MFLD  KAMRAB13,                                               +        
               LTH=5                                                            
         MFLD  RETAIL13,                                               +        
               LTH=10                                                           
         MFLD  KDVALI13,                                               +        
               LTH=3                                                            
         MFLD  BENAM13,                                                +        
               LTH=20                                                           
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W3I31401 MSG   TYPE=INPUT,                                             +        
               SOR=(W3F314),                                           +        
               OPT=2,                                                  +        
               NXT=W3O31401                                                     
MID      LPAGE SOR=(W3F314)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  (FLD0102,                                               +        
               '3'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  (FLD0104,                                               +        
               '3'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  (FLD0106,                                               +        
               '1'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  (FLD0108,                                               +        
               '4'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '33141',                                                +        
               LTH=5                                                            
         MFLD  (DGIA0019,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  DGIA0020,                                               +        
               LTH=3                                                            
         MFLD  (DGIA0002,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0003,                                               +        
               LTH=9                                                            
         MFLD  (DGIA0021,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0022,                                               +        
               LTH=5                                                            
         MFLD  (IDDISTRI,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDDISTRU,                                               +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  DGIA0000,                                               +        
               LTH=9                                                            
         MFLD  DGIA0001,                                               +        
               LTH=9                                                            
         MFLD  DGIA0017,                                               +        
               LTH=1                                                            
         MFLD  DGIA0018,                                               +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
