***********************************************************************         
* CREATED BY PCC6483   ON 99/10/19  AT 16:37                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'ART. STAT. FRÅGA ARTIKEL/PRISOMR'                               
W3F304   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W3T304  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W3T304  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W3F304   DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'ART.STAT  FRÅGA PÅ ARTIKEL',                           +        
               POS=(1,11),LTH=26,                                      +        
               ATTR=(PROT)                                                      
FELMEDD  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Artikelnr',                                            +        
               POS=(2,2),LTH=9,                                        +        
               ATTR=(ALPHA,PROT)                                                
DGIA0025 DFLD  POS=(2,12),LTH=9,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Prisområde',                                           +        
               POS=(2,23),LTH=10,                                      +        
               ATTR=(PROT)                                                      
DGIA0038 DFLD  POS=(2,34),LTH=3,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Distrikt',                                             +        
               POS=(2,39),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DGIA0027 DFLD  POS=(2,49),LTH=4,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'MC-val J/N',                                           +        
               POS=(2,56),LTH=10,                                      +        
               ATTR=(PROT)                                                      
FLVALIN  DFLD  POS=(2,67),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Valuta  ',                                             +        
               POS=(2,70),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DGIA0026 DFLD  POS=(3,12),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0039 DFLD  POS=(3,34),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0028 DFLD  POS=(3,49),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
FLVALUT  DFLD  POS=(3,67),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
KDVALISO DFLD  POS=(3,73),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Benämning',                                            +        
               POS=(5,2),LTH=9,                                        +        
               ATTR=(PROT)                                                      
BENÄMN   DFLD  POS=(5,12),LTH=25,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Ers kod',                                              +        
               POS=(5,38),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
ERSKOD   DFLD  POS=(5,46),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Transfer',                                             +        
               POS=(5,49),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
TRANSFER DFLD  POS=(5,58),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Ladd datum',                                           +        
               POS=(5,64),LTH=10,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0033 DFLD  POS=(5,75),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Köpare',                                               +        
               POS=(6,2),LTH=6,                                        +        
               ATTR=(NUM,PROT)                                                  
KÖPARE   DFLD  POS=(6,12),LTH=27,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'PS',                                                   +        
               POS=(6,41),LTH=2,                                       +        
               ATTR=(PROT)                                                      
PRODSLAG DFLD  POS=(6,44),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Fkngrp',                                               +        
               POS=(6,49),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
FKNGRP   DFLD  POS=(6,56),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Inlev-sen dat',                                        +        
               POS=(6,61),LTH=13,                                      +        
               ATTR=(PROT)                                                      
DGIA0040 DFLD  POS=(6,75),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Standardpris',                                         +        
               POS=(7,2),LTH=12,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0042 DFLD  POS=(7,20),LTH=10,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Självkost',                                            +        
               POS=(7,38),LTH=9,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0041 DFLD  POS=(7,59),LTH=10,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Självkost mån.val',                                    +        
               POS=(8,2),LTH=17,                                       +        
               ATTR=(NUM,PROT)                                                  
SJKMANCU DFLD  POS=(8,20),LTH=10,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Sjkkost lok.mån.val',                                  +        
               POS=(8,38),LTH=20,                                      +        
               ATTR=(NUM,PROT)                                                  
SJKMANLO DFLD  POS=(8,59),LTH=10,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Lokalt anskaffad J/N',                                 +        
               POS=(9,2),LTH=20,                                       +        
               ATTR=(PROT)                                                      
FLSOURCE DFLD  POS=(9,26),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '    Fsg  Avv    TG',                                   +        
               POS=(10,26),LTH=18,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'T-bidrag',                                             +        
               POS=(10,49),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Styck  Avv',                                           +        
               POS=(10,65),LTH=10,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Senaste perioden',                                     +        
               POS=(11,2),LTH=16,                                      +        
               ATTR=(PROT)                                                      
DGIA0020 DFLD  POS=(11,22),LTH=11,                                     +        
               ATTR=(PROT)                                                      
DGIA0023 DFLD  POS=(11,40),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0022 DFLD  POS=(11,46),LTH=11,                                     +        
               ATTR=(PROT)                                                      
DGIA0021 DFLD  POS=(11,59),LTH=11,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'AF5',                                                  +        
               POS=(11,77),LTH=3,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Hittills i år',                                        +        
               POS=(12,2),LTH=13,                                      +        
               ATTR=(PROT)                                                      
DGIA0014 DFLD  POS=(12,22),LTH=11,                                     +        
               ATTR=(PROT)                                                      
DGIA0018 DFLD  POS=(12,34),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0017 DFLD  POS=(12,40),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0016 DFLD  POS=(12,46),LTH=11,                                     +        
               ATTR=(PROT)                                                      
DGIA0015 DFLD  POS=(12,59),LTH=11,                                     +        
               ATTR=(PROT)                                                      
DGIA0019 DFLD  POS=(12,71),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'AF4',                                                  +        
               POS=(12,77),LTH=3,                                      +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  'Motsv. föreg år',                                      +        
               POS=(13,2),LTH=15,                                      +        
               ATTR=(PROT)                                                      
DGIA0010 DFLD  POS=(13,22),LTH=11,                                     +        
               ATTR=(PROT)                                                      
DGIA0013 DFLD  POS=(13,40),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0012 DFLD  POS=(13,46),LTH=11,                                     +        
               ATTR=(PROT)                                                      
DGIA0011 DFLD  POS=(13,59),LTH=11,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'AF3',                                                  +        
               POS=(13,77),LTH=3,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Rullande år',                                          +        
               POS=(14,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
DGIA0004 DFLD  POS=(14,22),LTH=11,                                     +        
               ATTR=(PROT)                                                      
DGIA0008 DFLD  POS=(14,34),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0007 DFLD  POS=(14,40),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0006 DFLD  POS=(14,46),LTH=11,                                     +        
               ATTR=(PROT)                                                      
DGIA0005 DFLD  POS=(14,59),LTH=11,                                     +        
               ATTR=(PROT)                                                      
DGIA0009 DFLD  POS=(14,71),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'AF2',                                                  +        
               POS=(14,77),LTH=3,                                      +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  'Rullande föreg år',                                    +        
               POS=(15,2),LTH=17,                                      +        
               ATTR=(PROT)                                                      
DGIA0000 DFLD  POS=(15,22),LTH=11,                                     +        
               ATTR=(PROT)                                                      
DGIA0003 DFLD  POS=(15,40),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0002 DFLD  POS=(15,46),LTH=11,                                     +        
               ATTR=(PROT)                                                      
DGIA0001 DFLD  POS=(15,59),LTH=11,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'AF1',                                                  +        
               POS=(15,77),LTH=3,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Specialrabatt',                                        +        
               POS=(16,2),LTH=13,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Transfer Artikel',                                     +        
               POS=(17,2),LTH=16,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'MO-pris',                                              +        
               POS=(17,24),LTH=7,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'DO-pris   MO-%   DO-%',                                +        
               POS=(17,37),LTH=21,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Bytespoäng',                                           +        
               POS=(17,71),LTH=10,                                     +        
               ATTR=(PROT)                                                      
DGIA0024 DFLD  POS=(18,4),LTH=4,                                       +        
               ATTR=(PROT)                                                      
ARTRAB   DFLD  POS=(18,13),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0034 DFLD  POS=(18,21),LTH=10,                                     +        
               ATTR=(PROT)                                                      
DGIA0029 DFLD  POS=(18,33),LTH=11,                                     +        
               ATTR=(PROT)                                                      
DGIA0036 DFLD  POS=(18,46),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0031 DFLD  POS=(18,53),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVPOINT  DFLD  POS=(18,71),LTH=7,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Rabatt kod',                                           +        
               POS=(19,2),LTH=10,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Brutto pris',                                          +        
               POS=(19,59),LTH=11,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Sen uppdat',                                           +        
               POS=(19,71),LTH=10,                                     +        
               ATTR=(PROT)                                                      
NORMALKD DFLD  POS=(20,12),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0035 DFLD  POS=(20,21),LTH=10,                                     +        
               ATTR=(PROT)                                                      
DGIA0030 DFLD  POS=(20,33),LTH=11,                                     +        
               ATTR=(PROT)                                                      
DGIA0037 DFLD  POS=(20,46),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0032 DFLD  POS=(20,53),LTH=5,                                      +        
               ATTR=(PROT)                                                      
BRUTTOPR DFLD  POS=(20,60),LTH=10.                                     +        
               ATTR=(PROT)                                                      
SENUPDAT DFLD  POS=(20,75),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '13 Prisfråga    14',                                   +        
               POS=(22,2),LTH=18,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '15 Art.info. VR 16 Art.stat',                          +        
               POS=(22,34),LTH=27,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '10 Whelp',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(23,59),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DATUM    DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TID      DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W3O30401 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W3F304,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W3I30401,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W3F304                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FELMEDD,                                                +        
               LTH=40                                                           
         MFLD  DGIA0025,                                               +        
               LTH=9                                                            
         MFLD  DGIA0026,                                               +        
               LTH=9                                                            
         MFLD  DGIA0038,                                               +        
               LTH=3                                                            
         MFLD  DGIA0039,                                               +        
               LTH=3                                                            
         MFLD  DGIA0027,                                               +        
               LTH=4                                                            
         MFLD  DGIA0028,                                               +        
               LTH=4                                                            
         MFLD  FLVALIN,                                                +        
               LTH=1                                                            
         MFLD  FLVALUT,                                                +        
               LTH=1                                                            
         MFLD  KDVALISO,                                               +        
               LTH=3                                                            
         MFLD  BENÄMN,                                                 +        
               LTH=25                                                           
         MFLD  ERSKOD,                                                 +        
               LTH=2                                                            
         MFLD  TRANSFER,                                               +        
               LTH=5                                                            
         MFLD  DGIA0033,                                               +        
               LTH=6                                                            
         MFLD  KÖPARE,                                                 +        
               LTH=27                                                           
         MFLD  PRODSLAG,                                               +        
               LTH=2                                                            
         MFLD  FKNGRP,                                                 +        
               LTH=4                                                            
         MFLD  DGIA0040,                                               +        
               LTH=6                                                            
         MFLD  DGIA0042,                                               +        
               LTH=10                                                           
         MFLD  DGIA0041,                                               +        
               LTH=10                                                           
         MFLD  SJKMANCU,                                               +        
               LTH=10                                                           
         MFLD  SJKMANLO,                                               +        
               LTH=10                                                           
         MFLD  FLSOURCE,                                               +        
               LTH=1                                                            
         MFLD  DGIA0020,                                               +        
               LTH=14                                                           
         MFLD  DGIA0023,                                               +        
               LTH=5                                                            
         MFLD  LTH=4                                                            
         MFLD  DGIA0022,                                               +        
               LTH=14                                                           
         MFLD  DGIA0021,                                               +        
               LTH=11                                                           
         MFLD  DGIA0014,                                               +        
               LTH=14                                                           
         MFLD  DGIA0018,                                               +        
               LTH=5                                                            
         MFLD  DGIA0017,                                               +        
               LTH=5                                                            
         MFLD  LTH=4                                                            
         MFLD  DGIA0016,                                               +        
               LTH=14                                                           
         MFLD  DGIA0015,                                               +        
               LTH=11                                                           
         MFLD  DGIA0019,                                               +        
               LTH=5                                                            
         MFLD  DGIA0010,                                               +        
               LTH=14                                                           
         MFLD  DGIA0013,                                               +        
               LTH=5                                                            
         MFLD  LTH=4                                                            
         MFLD  DGIA0012,                                               +        
               LTH=14                                                           
         MFLD  DGIA0011,                                               +        
               LTH=11                                                           
         MFLD  DGIA0004,                                               +        
               LTH=14                                                           
         MFLD  DGIA0008,                                               +        
               LTH=5                                                            
         MFLD  DGIA0007,                                               +        
               LTH=5                                                            
         MFLD  LTH=4                                                            
         MFLD  DGIA0006,                                               +        
               LTH=14                                                           
         MFLD  DGIA0005,                                               +        
               LTH=11                                                           
         MFLD  DGIA0009,                                               +        
               LTH=5                                                            
         MFLD  DGIA0000,                                               +        
               LTH=14                                                           
         MFLD  DGIA0003,                                               +        
               LTH=5                                                            
         MFLD  LTH=4                                                            
         MFLD  DGIA0002,                                               +        
               LTH=14                                                           
         MFLD  DGIA0001,                                               +        
               LTH=11                                                           
         MFLD  LTH=1                                                            
         MFLD  DGIA0024,                                               +        
               LTH=4                                                            
         MFLD  ARTRAB,                                                 +        
               LTH=1                                                            
         MFLD  DGIA0034,                                               +        
               LTH=10                                                           
         MFLD  DGIA0029,                                               +        
               LTH=10                                                           
         MFLD  DGIA0036,                                               +        
               LTH=5                                                            
         MFLD  DGIA0031,                                               +        
               LTH=5                                                            
         MFLD  KVPOINT,                                                +        
               LTH=7                                                            
         MFLD  NORMALKD,                                               +        
               LTH=2                                                            
         MFLD  DGIA0035,                                               +        
               LTH=10                                                           
         MFLD  DGIA0030,                                               +        
               LTH=10                                                           
         MFLD  DGIA0037,                                               +        
               LTH=5                                                            
         MFLD  DGIA0032,                                               +        
               LTH=5                                                            
         MFLD  BRUTTOPR,                                               +        
               LTH=10                                                           
         MFLD  SENUPDAT,                                               +        
               LTH=6                                                            
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATUM,                                                 +        
               DATE4)                                                           
         MFLD  (TID,                                                   +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W3I30401 MSG   TYPE=INPUT,                                             +        
               SOR=(W3F304),                                           +        
               OPT=2,                                                  +        
               NXT=W3O30401                                                     
MID      LPAGE SOR=(W3F304)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '33041',                                                +        
               LTH=5                                                            
         MFLD  (DGIA0025,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0026,                                               +        
               LTH=9,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0038,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  DGIA0039,                                               +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0027,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0028,                                               +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLVALIN,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  FLVALUT,                                                +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
