***********************************************************************         
* CREATED BY V065708   ON 02/03/22  AT 10:35                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'PRISOMRÅDE                      '                               
W3F312   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W3T312 7',                                           +        
               8='W3T312 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W3T312U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W3T311  ',                                          +        
               14='W3T312  ',                                          +        
               15='W3T313  ',                                          +        
               16='W3T314  ',                                          +        
               17='W3T315  ',                                          +        
               18='W3T316  ',                                          +        
               19='W3T317  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W3T312U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((2,13)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'PRISOMRÅDE',                                           +        
               POS=(1,10),LTH=10,                                      +        
               ATTR=(NUM,PROT)                                                  
TEMFSFEL DFLD  POS=(1,40),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Prisområde',                                           +        
               POS=(2,2),LTH=10,                                       +        
               ATTR=(PROT)                                                      
PROMRIN  DFLD  POS=(2,13),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
PROMRUT  DFLD  POS=(3,13),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
PARTNREN DFLD  POS=(5,2),LTH=9,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
PARTNRNE DFLD  POS=(5,12),LTH=9,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
PROMRSPA DFLD  POS=(5,22),LTH=3,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
         DFLD  'Tom orderklass',                                       +        
               POS=(6,2),LTH=14,                                       +        
               ATTR=(PROT)                                                      
DGIA0000 DFLD  POS=(6,17),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0001 DFLD  POS=(6,20),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'ger dagorder',                                         +        
               POS=(6,23),LTH=12,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Betalaridentitet',                                     +        
               POS=(8,2),LTH=16,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Marknadsbolag :',                                      +        
               POS=(8,32),LTH=16,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Valuta  ',                                             +        
               POS=(8,63),LTH=8,                                       +        
               ATTR=(PROT)                                                      
IDLAND1  DFLD  POS=(9,2),LTH=2,                                        +        
               ATTR=(PROT)                                                      
IDPART1  DFLD  POS=(9,5),LTH=9,                                        +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'A M1 = RENAULT & LANDROVER',                           +        
               POS=(9,32),LTH=26,                                      +        
               ATTR=(PROT)                                                      
KDVALIS1 DFLD  POS=(9,66),LTH=3,                                       +        
               ATTR=(PROT)                                                      
IDLAND2  DFLD  POS=(10,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDPART2  DFLD  POS=(10,5),LTH=9,                                       +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'B M2 = BASE & EUROPE',                                 +        
               POS=(10,32),LTH=20,                                     +        
               ATTR=(PROT)                                                      
KDVALIS2 DFLD  POS=(10,66),LTH=3,                                      +        
               ATTR=(PROT)                                                      
IDLAND3  DFLD  POS=(11,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDPART3  DFLD  POS=(11,5),LTH=9,                                       +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'C M3 = VCI',                                           +        
               POS=(11,32),LTH=10,                                     +        
               ATTR=(PROT)                                                      
KDVALIS3 DFLD  POS=(11,66),LTH=3,                                      +        
               ATTR=(PROT)                                                      
IDLAND4  DFLD  POS=(12,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDPART4  DFLD  POS=(12,5),LTH=9,                                       +        
               ATTR=(NUM,PROT)                                                  
IDLAND5  DFLD  POS=(13,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDPART5  DFLD  POS=(13,5),LTH=9,                                       +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'E M5 = VCNA',                                          +        
               POS=(12,32),LTH=11,                                     +        
               ATTR=(PROT)                                                      
KDVALIS5 DFLD  POS=(12,66),LTH=3,                                      +        
               ATTR=(PROT)                                                      
IDLAND6  DFLD  POS=(14,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDPART6  DFLD  POS=(14,5),LTH=9,                                       +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'F M0 = ASIEN',                                         +        
               POS=(13,32),LTH=12,                                     +        
               ATTR=(PROT)                                                      
KDVALIS6 DFLD  POS=(13,66),LTH=3,                                      +        
               ATTR=(PROT)                                                      
IDLAND7  DFLD  POS=(15,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDPART7  DFLD  POS=(15,5),LTH=9,                                       +        
               ATTR=(NUM,PROT)                                                  
IDLAND8  DFLD  POS=(16,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDPART8  DFLD  POS=(16,5),LTH=9,                                       +        
               ATTR=(NUM,PROT)                                                  
         DFLD  '13 Betalarreg.  14 Prisområde   15 Pris artnr   16 Art +        
               kam rab  17 Norm rabatt',                               +        
               POS=(21,2),LTH=78,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18 Tran rabatt  19 Art rabatt   20',                   +        
               POS=(22,2),LTH=34,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 Whelp',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(23,59),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W3O31201 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W3F312,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W3I31201,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT,                                             +        
               NXT=W3I31201                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  PROMRIN,                                                +        
               LTH=3                                                            
         MFLD  PROMRUT,                                                +        
               LTH=3                                                            
         MFLD  PARTNREN,                                               +        
               LTH=9                                                            
         MFLD  PARTNRNE,                                               +        
               LTH=9                                                            
         MFLD  PROMRSPA,                                               +        
               LTH=3                                                            
         MFLD  DGIA0000,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0001,                                               +        
               LTH=1                                                            
         MFLD  IDLAND1,                                                +        
               LTH=2                                                            
         MFLD  IDPART1,                                                +        
               LTH=9                                                            
         MFLD  IDLAND2,                                                +        
               LTH=2                                                            
         MFLD  IDPART2,                                                +        
               LTH=9                                                            
         MFLD  IDLAND3,                                                +        
               LTH=2                                                            
         MFLD  IDPART3,                                                +        
               LTH=9                                                            
         MFLD  IDLAND4,                                                +        
               LTH=2                                                            
         MFLD  IDPART4,                                                +        
               LTH=9                                                            
         MFLD  IDLAND5,                                                +        
               LTH=2                                                            
         MFLD  IDPART5,                                                +        
               LTH=9                                                            
         MFLD  IDLAND6,                                                +        
               LTH=2                                                            
         MFLD  IDPART6,                                                +        
               LTH=9                                                            
         MFLD  IDLAND7,                                                +        
               LTH=2                                                            
         MFLD  IDPART7,                                                +        
               LTH=9                                                            
         MFLD  IDLAND8,                                                +        
               LTH=2                                                            
         MFLD  IDPART8,                                                +        
               LTH=9                                                            
         MFLD  KDVALIS1,                                               +        
               LTH=3                                                            
         MFLD  KDVALIS2,                                               +        
               LTH=3                                                            
         MFLD  KDVALIS3,                                               +        
               LTH=3                                                            
         MFLD  KDVALIS5,                                               +        
               LTH=3                                                            
         MFLD  KDVALIS6,                                               +        
               LTH=3                                                            
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  FSYSMSG,                                                +        
               LTH=79                                                           
         MSGEND                                                                 
W3I31201 MSG   TYPE=INPUT,                                             +        
               SOR=(W3F312),                                           +        
               OPT=2,                                                  +        
               NXT=W3O31201                                                     
MID      LPAGE SOR=(FORMAT),                                           +        
               NXT=W3O31201                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  (FLD0102,                                               +        
               '3'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  (FLD0104,                                               +        
               '3'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  (FLD0106,                                               +        
               '1'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  (FLD0108,                                               +        
               '2'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '33121',                                                +        
               LTH=5                                                            
         MFLD  (PROMRIN,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  PROMRUT,                                                +        
               LTH=3                                                            
         MFLD  PARTNREN,                                               +        
               LTH=9                                                            
         MFLD  PARTNRNE,                                               +        
               LTH=9                                                            
         MFLD  PROMRSPA,                                               +        
               LTH=3                                                            
         MFLD  (DGIA0000,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0001,                                               +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
