***********************************************************************         
* CREATED BY PC59009   ON 99/01/30  AT 11:36                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'BYTES CLEARING                  '                               
W3N184   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W3T184 4',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W3T184 7',                                           +        
               8='W3T184 8',                                           +        
               9='W3T185  ',                                           +        
               10='WHELP   ',                                          +        
               11='W3T184U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W3T184U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W3N184   DPAGE CURSOR=((2,9)),                                         +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'EXCHANGE RECEIVED INVOICE',                            +        
               POS=(1,11),LTH=25,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Inv no',                                               +        
               POS=(2,2),LTH=6,                                        +        
               ATTR=(NUM,PROT)                                                  
FAKTURAI DFLD  POS=(2,9),LTH=7,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Case',                                                 +        
               POS=(2,17),LTH=4,                                       +        
               ATTR=(PROT)                                                      
CASEIN   DFLD  POS=(2,22),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Show binned lines Y/N',                                +        
               POS=(2,28),LTH=21,                                      +        
               ATTR=(PROT)                                                      
INLIIN   DFLD  POS=(2,50),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Receiving Dc',                                         +        
               POS=(2,52),LTH=12,                                      +        
               ATTR=(PROT)                                                      
DCIN     DFLD  POS=(2,65),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Printer',                                              +        
               POS=(2,68),LTH=7,                                       +        
               ATTR=(PROT)                                                      
KDPRT    DFLD  POS=(2,76),LTH=3,                                       +        
               ATTR=(NOPROT,MOD)                                                
FAKTURAU DFLD  POS=(3,9),LTH=7,                                        +        
               ATTR=(PROT,MOD)                                                  
CASEUT   DFLD  POS=(3,22),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
INLIUT   DFLD  POS=(3,50),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
DCUT     DFLD  POS=(3,65),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'S Case  Core  no Description',                         +        
               POS=(5,2),LTH=30,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Sent qty',                                             +        
               POS=(5,46),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Received qty',                                         +        
               POS=(5,60),LTH=12,                                      +        
               ATTR=(PROT)                                                      
         DO 11                                                                  
CMD      DFLD  POS=(6,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
CASE     DFLD  POS=(6,4),LTH=5,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
OBJEKT   DFLD  POS=(6,10),LTH=8,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
BEN      DFLD  POS=(6,19),LTH=25,                                      +        
               ATTR=(PROT)                                                      
SANT     DFLD  POS=(6,47),LTH=7,                                       +        
               ATTR=(PROT)                                                      
MOTT     DFLD  POS=(6,65),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
         ENDDO                                                                  
         DFLD  'Case    New core',                                     +        
               POS=(18,2),LTH=16,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Qty',                                                  +        
               POS=(18,23),LTH=3,                                      +        
               ATTR=(PROT)                                                      
CASENY   DFLD  POS=(19,2),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
OBJEKTNY DFLD  POS=(19,10),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
ANTNY    DFLD  POS=(19,23),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Case no ready',                                        +        
               POS=(20,2),LTH=13,                                      +        
               ATTR=(PROT)                                                      
CASEKLAR DFLD  POS=(20,17),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'F7=First  F8=Forward  F9=Screen 3185  F10=WHELP',      +        
               POS=(22,2),LTH=47,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'F11=Update',                                           +        
               POS=(22,58),LTH=10,                                     +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W3O184N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W3N184,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W3I184N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W3N184,                                             +        
               NXT=W3I184N1                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  FAKTURAI,                                               +        
               LTH=7                                                            
         MFLD  CASEIN,                                                 +        
               LTH=5                                                            
         MFLD  INLIIN,                                                 +        
               LTH=1                                                            
         MFLD  DCIN,                                                   +        
               LTH=2                                                            
         MFLD  KDPRT,                                                  +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FAKTURAU,                                               +        
               LTH=7                                                            
         MFLD  CASEUT,                                                 +        
               LTH=5                                                            
         MFLD  INLIUT,                                                 +        
               LTH=1                                                            
         MFLD  DCUT,                                                   +        
               LTH=2                                                            
         DO 11                                                                  
         MFLD  CMD,                                                    +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CASE,                                                   +        
               LTH=5                                                            
         MFLD  OBJEKT,                                                 +        
               LTH=8                                                            
         MFLD  BEN,                                                    +        
               LTH=25                                                           
         MFLD  SANT,                                                   +        
               LTH=7                                                            
         MFLD  MOTT,                                                   +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         ENDDO                                                                  
         MFLD  CASENY,                                                 +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OBJEKTNY,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ANTNY,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CASEKLAR,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  DATE,                                                   +        
               LTH=8                                                            
         MFLD  TIME,                                                   +        
               LTH=8                                                            
         MFLD  FSYSMSG,                                                +        
               LTH=79                                                           
         MSGEND                                                                 
W3I184N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W3N184),                                           +        
               OPT=2,                                                  +        
               NXT=W3O184N1                                                     
MID      LPAGE SOR=(W3N184)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F8'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '31842',                                                +        
               LTH=5                                                            
         MFLD  (FAKTURAI,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (CASEIN,                                                +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (INLIIN,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DCIN,                                                  +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDPRT,                                                 +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         DO 11                                                                  
         MFLD  (CMD,                                                   +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  CASE,                                                   +        
               LTH=5                                                            
         MFLD  OBJEKT,                                                 +        
               LTH=8                                                            
         MFLD  (MOTT,                                                  +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         ENDDO                                                                  
         MFLD  (CASENY,                                                +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (OBJEKTNY,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTNY,                                                 +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CASEKLAR,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
