***********************************************************************         
* CREATED BY V077376   ON 00/11/22  AT 10:04                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'Exch core leakage/surplus alarm3'                               
W3N156   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W3T156 7',                                           +        
               8='W3T156 8',                                           +        
               9='W3T156 9',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  'EXCHANGE LEAKAGE-SURPLUS 3',                           +        
               POS=(1,11),LTH=26,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Week',                                                 +        
               POS=(3,2),LTH=4,                                        +        
               ATTR=(PROT)                                                      
WEEKFUT  DFLD  POS=(3,7),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
         DFLD  '-',                                                    +        
               POS=(3,12),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
WEEKTUT  DFLD  POS=(3,14),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Dist',                                                 +        
               POS=(3,19),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
DISTUT   DFLD  POS=(3,24),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'P\n',                                                  +        
               POS=(3,29),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
ARTUT    DFLD  POS=(3,33),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
BEARTUT  DFLD  POS=(3,45),LTH=25,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'C    Dealer',                                          +        
               POS=(5,2),LTH=11,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Out',                                                  +        
               POS=(5,24),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'In   Diff qty   Diff %',                               +        
               POS=(5,35),LTH=22,                                      +        
               ATTR=(PROT)                                                      
CMD1     DFLD  POS=(6,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
DEAL1    DFLD  POS=(6,6),LTH=7,                                        +        
               ATTR=(PROT,MOD)                                                  
OUT1     DFLD  POS=(6,19),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
IN1      DFLD  POS=(6,29),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
DIFF1    DFLD  POS=(6,40),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
PROC1    DFLD  POS=(6,53),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
CMD2     DFLD  POS=(7,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
DEAL2    DFLD  POS=(7,6),LTH=7,                                        +        
               ATTR=(PROT,MOD)                                                  
OUT2     DFLD  POS=(7,19),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
IN2      DFLD  POS=(7,29),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
DIFF2    DFLD  POS=(7,40),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
PROC2    DFLD  POS=(7,53),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
CMD3     DFLD  POS=(8,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
DEAL3    DFLD  POS=(8,6),LTH=7,                                        +        
               ATTR=(PROT,MOD)                                                  
OUT3     DFLD  POS=(8,19),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
IN3      DFLD  POS=(8,29),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
DIFF3    DFLD  POS=(8,40),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
PROC3    DFLD  POS=(8,53),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
CMD4     DFLD  POS=(9,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
DEAL4    DFLD  POS=(9,6),LTH=7,                                        +        
               ATTR=(PROT,MOD)                                                  
OUT4     DFLD  POS=(9,19),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
IN4      DFLD  POS=(9,29),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
DIFF4    DFLD  POS=(9,40),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
PROC4    DFLD  POS=(9,53),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
CMD5     DFLD  POS=(10,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DEAL5    DFLD  POS=(10,6),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
OUT5     DFLD  POS=(10,19),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
IN5      DFLD  POS=(10,29),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
DIFF5    DFLD  POS=(10,40),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
PROC5    DFLD  POS=(10,53),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
CMD6     DFLD  POS=(11,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DEAL6    DFLD  POS=(11,6),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
OUT6     DFLD  POS=(11,19),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
IN6      DFLD  POS=(11,29),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
DIFF6    DFLD  POS=(11,40),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
PROC6    DFLD  POS=(11,53),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
CMD7     DFLD  POS=(12,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DEAL7    DFLD  POS=(12,6),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
OUT7     DFLD  POS=(12,19),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
IN7      DFLD  POS=(12,29),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
DIFF7    DFLD  POS=(12,40),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
PROC7    DFLD  POS=(12,53),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
CMD8     DFLD  POS=(13,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DEAL8    DFLD  POS=(13,6),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
OUT8     DFLD  POS=(13,19),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
IN8      DFLD  POS=(13,29),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
DIFF8    DFLD  POS=(13,40),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
PROC8    DFLD  POS=(13,53),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
CMD9     DFLD  POS=(14,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DEAL9    DFLD  POS=(14,6),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
OUT9     DFLD  POS=(14,19),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
IN9      DFLD  POS=(14,29),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
DIFF9    DFLD  POS=(14,40),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
PROC9    DFLD  POS=(14,53),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
CMD10    DFLD  POS=(15,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DEAL10   DFLD  POS=(15,6),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
OUT10    DFLD  POS=(15,19),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
IN10     DFLD  POS=(15,29),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
DIFF10   DFLD  POS=(15,40),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
PROC10   DFLD  POS=(15,53),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
CMD11    DFLD  POS=(16,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DEAL11   DFLD  POS=(16,6),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
OUT11    DFLD  POS=(16,19),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
IN11     DFLD  POS=(16,29),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
DIFF11   DFLD  POS=(16,40),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
PROC11   DFLD  POS=(16,53),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
CMD12    DFLD  POS=(17,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DEAL12   DFLD  POS=(17,6),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
OUT12    DFLD  POS=(17,19),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
IN12     DFLD  POS=(17,29),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
DIFF12   DFLD  POS=(17,40),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
PROC12   DFLD  POS=(17,53),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
CMD13    DFLD  POS=(18,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DEAL13   DFLD  POS=(18,6),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
OUT13    DFLD  POS=(18,19),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
IN13     DFLD  POS=(18,29),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
DIFF13   DFLD  POS=(18,40),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
PROC13   DFLD  POS=(18,53),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Total',                                                +        
               POS=(20,4),LTH=5,                                       +        
               ATTR=(PROT)                                                      
OUTTOT   DFLD  POS=(20,19),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
INTOT    DFLD  POS=(20,29),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
DIFFTOT  DFLD  POS=(20,40),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
PROCTOT  DFLD  POS=(20,53),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'F7=First  F8=Next  F9=Jump to 3155 F10=WHELP',         +        
               POS=(22,2),LTH=44,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W3O156N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W3N156,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W3I156N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  WEEKFUT,                                                +        
               LTH=4                                                            
         MFLD  WEEKTUT,                                                +        
               LTH=4                                                            
         MFLD  DISTUT,                                                 +        
               LTH=4                                                            
         MFLD  ARTUT,                                                  +        
               LTH=9                                                            
         MFLD  BEARTUT,                                                +        
               LTH=25                                                           
         MFLD  CMD1,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DEAL1,                                                  +        
               LTH=7                                                            
         MFLD  OUT1,                                                   +        
               LTH=8                                                            
         MFLD  IN1,                                                    +        
               LTH=8                                                            
         MFLD  DIFF1,                                                  +        
               LTH=8                                                            
         MFLD  PROC1,                                                  +        
               LTH=4                                                            
         MFLD  CMD2,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DEAL2,                                                  +        
               LTH=7                                                            
         MFLD  OUT2,                                                   +        
               LTH=8                                                            
         MFLD  IN2,                                                    +        
               LTH=8                                                            
         MFLD  DIFF2,                                                  +        
               LTH=8                                                            
         MFLD  PROC2,                                                  +        
               LTH=4                                                            
         MFLD  CMD3,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DEAL3,                                                  +        
               LTH=7                                                            
         MFLD  OUT3,                                                   +        
               LTH=8                                                            
         MFLD  IN3,                                                    +        
               LTH=8                                                            
         MFLD  DIFF3,                                                  +        
               LTH=8                                                            
         MFLD  PROC3,                                                  +        
               LTH=4                                                            
         MFLD  CMD4,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DEAL4,                                                  +        
               LTH=7                                                            
         MFLD  OUT4,                                                   +        
               LTH=8                                                            
         MFLD  IN4,                                                    +        
               LTH=8                                                            
         MFLD  DIFF4,                                                  +        
               LTH=8                                                            
         MFLD  PROC4,                                                  +        
               LTH=4                                                            
         MFLD  CMD5,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DEAL5,                                                  +        
               LTH=7                                                            
         MFLD  OUT5,                                                   +        
               LTH=8                                                            
         MFLD  IN5,                                                    +        
               LTH=8                                                            
         MFLD  DIFF5,                                                  +        
               LTH=8                                                            
         MFLD  PROC5,                                                  +        
               LTH=4                                                            
         MFLD  CMD6,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DEAL6,                                                  +        
               LTH=7                                                            
         MFLD  OUT6,                                                   +        
               LTH=8                                                            
         MFLD  IN6,                                                    +        
               LTH=8                                                            
         MFLD  DIFF6,                                                  +        
               LTH=8                                                            
         MFLD  PROC6,                                                  +        
               LTH=4                                                            
         MFLD  CMD7,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DEAL7,                                                  +        
               LTH=7                                                            
         MFLD  OUT7,                                                   +        
               LTH=8                                                            
         MFLD  IN7,                                                    +        
               LTH=8                                                            
         MFLD  DIFF7,                                                  +        
               LTH=8                                                            
         MFLD  PROC7,                                                  +        
               LTH=4                                                            
         MFLD  CMD8,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DEAL8,                                                  +        
               LTH=7                                                            
         MFLD  OUT8,                                                   +        
               LTH=8                                                            
         MFLD  IN8,                                                    +        
               LTH=8                                                            
         MFLD  DIFF8,                                                  +        
               LTH=8                                                            
         MFLD  PROC8,                                                  +        
               LTH=4                                                            
         MFLD  CMD9,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DEAL9,                                                  +        
               LTH=7                                                            
         MFLD  OUT9,                                                   +        
               LTH=8                                                            
         MFLD  IN9,                                                    +        
               LTH=8                                                            
         MFLD  DIFF9,                                                  +        
               LTH=8                                                            
         MFLD  PROC9,                                                  +        
               LTH=4                                                            
         MFLD  CMD10,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DEAL10,                                                 +        
               LTH=7                                                            
         MFLD  OUT10,                                                  +        
               LTH=8                                                            
         MFLD  IN10,                                                   +        
               LTH=8                                                            
         MFLD  DIFF10,                                                 +        
               LTH=8                                                            
         MFLD  PROC10,                                                 +        
               LTH=4                                                            
         MFLD  CMD11,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DEAL11,                                                 +        
               LTH=7                                                            
         MFLD  OUT11,                                                  +        
               LTH=8                                                            
         MFLD  IN11,                                                   +        
               LTH=8                                                            
         MFLD  DIFF11,                                                 +        
               LTH=8                                                            
         MFLD  PROC11,                                                 +        
               LTH=4                                                            
         MFLD  CMD12,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DEAL12,                                                 +        
               LTH=7                                                            
         MFLD  OUT12,                                                  +        
               LTH=8                                                            
         MFLD  IN12,                                                   +        
               LTH=8                                                            
         MFLD  DIFF12,                                                 +        
               LTH=8                                                            
         MFLD  PROC12,                                                 +        
               LTH=4                                                            
         MFLD  CMD13,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DEAL13,                                                 +        
               LTH=7                                                            
         MFLD  OUT13,                                                  +        
               LTH=8                                                            
         MFLD  IN13,                                                   +        
               LTH=8                                                            
         MFLD  DIFF13,                                                 +        
               LTH=8                                                            
         MFLD  PROC13,                                                 +        
               LTH=4                                                            
         MFLD  OUTTOT,                                                 +        
               LTH=8                                                            
         MFLD  INTOT,                                                  +        
               LTH=8                                                            
         MFLD  DIFFTOT,                                                +        
               LTH=8                                                            
         MFLD  PROCTOT,                                                +        
               LTH=4                                                            
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W3I156N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W3N156),                                           +        
               OPT=2,                                                  +        
               NXT=W3O156N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '31562',                                                +        
               LTH=5                                                            
         MFLD  '++++',                                                 +        
               LTH=4                                                            
         MFLD  '++++',                                                 +        
               LTH=4                                                            
         MFLD  '+++++++++',                                            +        
               LTH=9                                                            
         MFLD  '++++',                                                 +        
               LTH=4                                                            
         MFLD  (CMD1,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD2,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD3,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD4,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD5,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD6,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD7,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD8,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD9,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD10,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD11,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD12,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD13,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
