***********************************************************************         
* CREATED BY PC59009   ON 96/08/27  AT 09:25                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'PROFORMA-RETURER                '                               
W3N176   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W3T176U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W3T171  ',                                          +        
               14='W3T172  ',                                          +        
               15='W3T173  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W3T176  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W3T176U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W3N176   DPAGE CURSOR=((2,7)),                                         +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'REG OF CORE RETURN EXCHANGE',                          +        
               POS=(1,13),LTH=27,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Dist',                                                 +        
               POS=(2,2),LTH=4,                                        +        
               ATTR=(ALPHA,PROT)                                                
IDDISTIN DFLD  POS=(2,7),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Cust',                                                 +        
               POS=(2,13),LTH=4,                                       +        
               ATTR=(ALPHA,PROT)                                                
IDKUNDIN DFLD  POS=(2,18),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Inv no',                                               +        
               POS=(2,26),LTH=6,                                       +        
               ATTR=(PROT)                                                      
IDFAKTIN DFLD  POS=(2,33),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Case report',                                          +        
               POS=(2,41),LTH=11,                                      +        
               ATTR=(PROT)                                                      
IDBYTRIN DFLD  POS=(2,53),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
IDDISTUT DFLD  POS=(3,7),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
IDKUNDUT DFLD  POS=(3,18),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
IDFAKTUT DFLD  POS=(3,33),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
IDBYTRUT DFLD  POS=(3,53),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Part no    Quantity',                                  +        
               POS=(6,3),LTH=19,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Part no    Quantity',                                  +        
               POS=(6,42),LTH=19,                                      +        
               ATTR=(PROT)                                                      
IDARTNR1 DFLD  POS=(7,2),LTH=8,                                        +        
               ATTR=(NUM,NOPROT)                                                
KVRETUR1 DFLD  POS=(7,18),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
IDTABNR1 DFLD  POS=(7,29),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
IDARTNR2 DFLD  POS=(7,41),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
KVRETUR2 DFLD  POS=(7,57),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
IDTABNR2 DFLD  POS=(7,68),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
IDARTNR3 DFLD  POS=(8,2),LTH=8,                                        +        
               ATTR=(NUM,NOPROT)                                                
KVRETUR3 DFLD  POS=(8,18),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
IDTABNR3 DFLD  POS=(8,29),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
IDARTNR4 DFLD  POS=(8,41),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
KVRETUR4 DFLD  POS=(8,57),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
IDTABNR4 DFLD  POS=(8,68),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
IDARTNR5 DFLD  POS=(9,2),LTH=8,                                        +        
               ATTR=(NUM,NOPROT)                                                
KVRETUR5 DFLD  POS=(9,18),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
IDTABNR5 DFLD  POS=(9,29),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
IDARTNR6 DFLD  POS=(9,41),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
KVRETUR6 DFLD  POS=(9,57),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
IDTABNR6 DFLD  POS=(9,68),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
IDARTNR7 DFLD  POS=(10,2),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
KVRETUR7 DFLD  POS=(10,18),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
IDTABNR7 DFLD  POS=(10,29),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
IDARTNR8 DFLD  POS=(10,41),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
KVRETUR8 DFLD  POS=(10,57),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
IDTABNR8 DFLD  POS=(10,68),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
IDARTNR9 DFLD  POS=(11,2),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
KVRETUR9 DFLD  POS=(11,18),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
IDTABNR9 DFLD  POS=(11,29),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
IDARTN10 DFLD  POS=(11,41),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
KVRETU10 DFLD  POS=(11,57),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
IDTABN10 DFLD  POS=(11,68),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
IDARTN11 DFLD  POS=(12,2),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
KVRETU11 DFLD  POS=(12,18),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
IDTABN11 DFLD  POS=(12,29),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
IDARTN12 DFLD  POS=(12,41),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
KVRETU12 DFLD  POS=(12,57),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
IDTABN12 DFLD  POS=(12,68),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
IDARTN13 DFLD  POS=(13,2),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
KVRETU13 DFLD  POS=(13,18),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
IDTABN13 DFLD  POS=(13,29),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
IDARTN14 DFLD  POS=(13,41),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
KVRETU14 DFLD  POS=(13,57),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
IDTABN14 DFLD  POS=(13,68),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
IDARTN15 DFLD  POS=(14,2),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
KVRETU15 DFLD  POS=(14,18),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
IDTABN15 DFLD  POS=(14,29),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
IDARTN16 DFLD  POS=(14,41),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
KVRETU16 DFLD  POS=(14,57),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
IDTABN16 DFLD  POS=(14,68),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
IDARTN17 DFLD  POS=(15,2),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
KVRETU17 DFLD  POS=(15,18),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
IDTABN17 DFLD  POS=(15,29),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
IDARTN18 DFLD  POS=(15,41),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
KVRETU18 DFLD  POS=(15,57),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
IDTABN18 DFLD  POS=(15,68),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
IDARTN19 DFLD  POS=(16,2),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
KVRETU19 DFLD  POS=(16,18),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
IDTABN19 DFLD  POS=(16,29),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
IDARTN21 DFLD  POS=(16,41),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
KVRETU21 DFLD  POS=(16,57),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
IDTABN21 DFLD  POS=(16,68),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
IDARTN22 DFLD  POS=(17,2),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
KVRETU22 DFLD  POS=(17,18),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
IDTABN22 DFLD  POS=(17,29),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
IDARTN23 DFLD  POS=(17,41),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
KVRETU23 DFLD  POS=(17,57),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
IDTABN23 DFLD  POS=(17,68),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
IDARTN24 DFLD  POS=(18,2),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
KVRETU24 DFLD  POS=(18,18),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
IDTABN24 DFLD  POS=(18,29),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
IDARTN25 DFLD  POS=(18,41),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
KVRETU25 DFLD  POS=(18,57),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
IDTABN25 DFLD  POS=(18,68),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
IDARTN26 DFLD  POS=(19,2),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
KVRETU26 DFLD  POS=(19,18),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
IDTABN26 DFLD  POS=(19,29),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
IDARTN27 DFLD  POS=(19,41),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
KVRETU27 DFLD  POS=(19,57),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
IDTABN27 DFLD  POS=(19,68),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
IDARTN28 DFLD  POS=(20,2),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
KVRETU28 DFLD  POS=(20,18),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
IDTABN28 DFLD  POS=(20,29),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Registration completed =',                             +        
               POS=(20,41),LTH=24,                                     +        
               ATTR=(PROT)                                                      
FLKLAR   DFLD  POS=(20,66),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  '(Y)',                                                  +        
               POS=(20,68),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  '13 Status-scr   14 Approval',                          +        
               POS=(21,2),LTH=27,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '15 Identification 16              17         ',        +        
               POS=(21,34),LTH=45,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '18 Reg core ret 19',                                   +        
               POS=(22,2),LTH=18,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,52),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 Whelp',                                             +        
               POS=(22,68),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W3O176N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W3N176,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W3I176N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W3N176                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDDISTIN,                                               +        
               LTH=4                                                            
         MFLD  IDDISTUT,                                               +        
               LTH=4                                                            
         MFLD  IDKUNDIN,                                               +        
               LTH=6                                                            
         MFLD  IDKUNDUT,                                               +        
               LTH=6                                                            
         MFLD  IDFAKTIN,                                               +        
               LTH=7                                                            
         MFLD  IDFAKTUT,                                               +        
               LTH=7                                                            
         MFLD  IDBYTRIN,                                               +        
               LTH=7                                                            
         MFLD  IDBYTRUT,                                               +        
               LTH=7                                                            
         MFLD  IDARTNR1,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVRETUR1,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTABNR1,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTNR2,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVRETUR2,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTABNR2,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTNR3,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVRETUR3,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTABNR3,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTNR4,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVRETUR4,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTABNR4,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTNR5,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVRETUR5,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTABNR5,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTNR6,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVRETUR6,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTABNR6,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTNR7,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVRETUR7,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTABNR7,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTNR8,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVRETUR8,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTABNR8,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTNR9,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVRETUR9,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTABNR9,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTN10,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVRETU10,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTABN10,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTN11,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVRETU11,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTABN11,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTN12,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVRETU12,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTABN12,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTN13,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVRETU13,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTABN13,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTN14,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVRETU14,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTABN14,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTN15,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVRETU15,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTABN15,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTN16,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVRETU16,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTABN16,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTN17,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVRETU17,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTABN17,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTN18,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVRETU18,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTABN18,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTN19,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVRETU19,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTABN19,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTN21,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVRETU21,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTABN21,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTN22,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVRETU22,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTABN22,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTN23,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVRETU23,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTABN23,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTN24,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVRETU24,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTABN24,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTN25,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVRETU25,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTABN25,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTN26,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVRETU26,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTABN26,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTN27,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVRETU27,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTABN27,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTN28,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVRETU28,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTABN28,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLKLAR,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=79                                                           
         MSGEND                                                                 
W3I176N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W3N176),                                           +        
               OPT=2,                                                  +        
               NXT=W3O176N1                                                     
MID      LPAGE SOR=(W3N176)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F7'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '31762',                                                +        
               LTH=5                                                            
         MFLD  (IDDISTIN,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDDISTUT,                                               +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDKUNDIN,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDKUNDUT,                                               +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDFAKTIN,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDFAKTUT,                                               +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDBYTRIN,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDBYTRUT,                                               +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDARTNR1,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVRETUR1,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDTABNR1,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDARTNR2,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVRETUR2,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDTABNR2,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDARTNR3,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVRETUR3,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDTABNR3,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDARTNR4,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVRETUR4,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDTABNR4,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDARTNR5,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVRETUR5,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDTABNR5,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDARTNR6,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVRETUR6,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDTABNR6,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDARTNR7,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVRETUR7,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDTABNR7,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDARTNR8,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVRETUR8,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDTABNR8,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDARTNR9,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVRETUR9,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDTABNR9,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDARTN10,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVRETU10,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDTABN10,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDARTN11,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVRETU11,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDTABN11,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDARTN12,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVRETU12,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDTABN12,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDARTN13,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVRETU13,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDTABN13,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDARTN14,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVRETU14,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDTABN14,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDARTN15,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVRETU15,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDTABN15,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDARTN16,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVRETU16,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDTABN16,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDARTN17,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVRETU17,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDTABN17,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDARTN18,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVRETU18,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDTABN18,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDARTN19,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVRETU19,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDTABN19,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDARTN21,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVRETU21,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDTABN21,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDARTN22,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVRETU22,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDTABN22,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDARTN23,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVRETU23,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDTABN23,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDARTN24,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVRETU24,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDTABN24,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDARTN25,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVRETU25,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDTABN25,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDARTN26,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVRETU26,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDTABN26,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDARTN27,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVRETU27,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDTABN27,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDARTN28,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVRETU28,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDTABN28,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLKLAR,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
