***********************************************************************         
* CREATED BY PCC6483   ON 00/01/28  AT 09:31                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'RECEIVING CODES                 '                               
W3N125   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W3T125 7',                                           +        
               8='W3T125 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W3T125U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((19,3)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'EXCHANGE RECEIVING CODES',                             +        
               POS=(1,11),LTH=24,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Code  Description',                                    +        
               POS=(5,7),LTH=17,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Points',                                               +        
               POS=(5,54),LTH=6,                                       +        
               ATTR=(PROT)                                                      
CODE01   DFLD  POS=(6,7),LTH=3,                                        +        
               ATTR=(PROT)                                                      
DESC01   DFLD  POS=(6,13),LTH=40,                                      +        
               ATTR=(PROT)                                                      
POINT01  DFLD  POS=(6,54),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
CODE02   DFLD  POS=(7,7),LTH=3,                                        +        
               ATTR=(PROT)                                                      
DESC02   DFLD  POS=(7,13),LTH=40,                                      +        
               ATTR=(PROT)                                                      
POINT02  DFLD  POS=(7,54),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
CODE03   DFLD  POS=(8,7),LTH=3,                                        +        
               ATTR=(PROT)                                                      
DESC03   DFLD  POS=(8,13),LTH=40,                                      +        
               ATTR=(PROT)                                                      
POINT03  DFLD  POS=(8,54),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
CODE04   DFLD  POS=(9,7),LTH=3,                                        +        
               ATTR=(PROT)                                                      
DESC04   DFLD  POS=(9,13),LTH=40,                                      +        
               ATTR=(PROT)                                                      
POINT04  DFLD  POS=(9,54),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
CODE05   DFLD  POS=(10,7),LTH=3,                                       +        
               ATTR=(PROT)                                                      
DESC05   DFLD  POS=(10,13),LTH=40,                                     +        
               ATTR=(PROT)                                                      
POINT05  DFLD  POS=(10,54),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
CODE06   DFLD  POS=(11,7),LTH=3,                                       +        
               ATTR=(PROT)                                                      
DESC06   DFLD  POS=(11,13),LTH=40,                                     +        
               ATTR=(PROT)                                                      
POINT06  DFLD  POS=(11,54),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
CODE07   DFLD  POS=(12,7),LTH=3,                                       +        
               ATTR=(PROT)                                                      
DESC07   DFLD  POS=(12,13),LTH=40,                                     +        
               ATTR=(PROT)                                                      
POINT07  DFLD  POS=(12,54),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
CODE08   DFLD  POS=(13,7),LTH=3,                                       +        
               ATTR=(PROT)                                                      
DESC08   DFLD  POS=(13,13),LTH=40,                                     +        
               ATTR=(PROT)                                                      
POINT08  DFLD  POS=(13,54),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
CODE09   DFLD  POS=(14,7),LTH=3,                                       +        
               ATTR=(PROT)                                                      
DESC09   DFLD  POS=(14,13),LTH=40,                                     +        
               ATTR=(PROT)                                                      
POINT09  DFLD  POS=(14,54),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
CODE10   DFLD  POS=(15,7),LTH=3,                                       +        
               ATTR=(PROT)                                                      
DESC10   DFLD  POS=(15,13),LTH=40,                                     +        
               ATTR=(PROT)                                                      
POINT10  DFLD  POS=(15,54),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'C   Code  Description',                                +        
               POS=(18,3),LTH=21,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Points',                                               +        
               POS=(18,54),LTH=6,                                      +        
               ATTR=(PROT)                                                      
UPFL     DFLD  POS=(19,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
UCODE    DFLD  POS=(19,7),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
UDESC    DFLD  POS=(19,13),LTH=40,                                     +        
               ATTR=(NOPROT,MOD)                                                
UPOINT   DFLD  POS=(19,54),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'F7=First  F8=Next  F10=WHELP  F11=Update',             +        
               POS=(21,2),LTH=41,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(22,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(22,60),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(22,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(22,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(23,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W3O125N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W3N125,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W3I125N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  CODE01,                                                 +        
               LTH=3                                                            
         MFLD  DESC01,                                                 +        
               LTH=40                                                           
         MFLD  POINT01,                                                +        
               LTH=6                                                            
         MFLD  CODE02,                                                 +        
               LTH=3                                                            
         MFLD  DESC02,                                                 +        
               LTH=40                                                           
         MFLD  POINT02,                                                +        
               LTH=6                                                            
         MFLD  CODE03,                                                 +        
               LTH=3                                                            
         MFLD  DESC03,                                                 +        
               LTH=40                                                           
         MFLD  POINT03,                                                +        
               LTH=6                                                            
         MFLD  CODE04,                                                 +        
               LTH=3                                                            
         MFLD  DESC04,                                                 +        
               LTH=40                                                           
         MFLD  POINT04,                                                +        
               LTH=6                                                            
         MFLD  CODE05,                                                 +        
               LTH=3                                                            
         MFLD  DESC05,                                                 +        
               LTH=40                                                           
         MFLD  POINT05,                                                +        
               LTH=6                                                            
         MFLD  CODE06,                                                 +        
               LTH=3                                                            
         MFLD  DESC06,                                                 +        
               LTH=40                                                           
         MFLD  POINT06,                                                +        
               LTH=6                                                            
         MFLD  CODE07,                                                 +        
               LTH=3                                                            
         MFLD  DESC07,                                                 +        
               LTH=40                                                           
         MFLD  POINT07,                                                +        
               LTH=6                                                            
         MFLD  CODE08,                                                 +        
               LTH=3                                                            
         MFLD  DESC08,                                                 +        
               LTH=40                                                           
         MFLD  POINT08,                                                +        
               LTH=6                                                            
         MFLD  CODE09,                                                 +        
               LTH=3                                                            
         MFLD  DESC09,                                                 +        
               LTH=40                                                           
         MFLD  POINT09,                                                +        
               LTH=6                                                            
         MFLD  CODE10,                                                 +        
               LTH=3                                                            
         MFLD  DESC10,                                                 +        
               LTH=40                                                           
         MFLD  POINT10,                                                +        
               LTH=6                                                            
         MFLD  UPFL,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  UCODE,                                                  +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  UDESC,                                                  +        
               LTH=42,                                                 +        
               ATTR=(YES)                                                       
         MFLD  UPOINT,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W3I125N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W3N125),                                           +        
               OPT=2,                                                  +        
               NXT=W3O125N1                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '31252',                                                +        
               LTH=5                                                            
         MFLD  (UPFL,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (UCODE,                                                 +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (UDESC,                                                 +        
               '++++++++++++++++++++++++++++++++++++++++'),            +        
               LTH=40,                                                 +        
               FILL=X'40'                                                       
         MFLD  (UPOINT,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
