***********************************************************************         
* CREATED BY PC59009   ON 99/08/24  AT 17:46                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'RADIO CODES                     '                               
W3N111   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W3T111  ',                                           +        
               2='W3T112  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W3T111  ',                                          +        
               14='W3T112  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((2,13)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'RADIO CODES',                                          +        
               POS=(1,13),LTH=11,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Serial no',                                            +        
               POS=(2,2),LTH=9,                                        +        
               ATTR=(ALPHA,PROT)                                                
SERIENRI DFLD  POS=(2,13),LTH=10,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Part no',                                              +        
               POS=(2,26),LTH=7,                                       +        
               ATTR=(PROT)                                                      
IDARTIN  DFLD  POS=(2,35),LTH=10,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Radio type',                                           +        
               POS=(2,47),LTH=10,                                      +        
               ATTR=(PROT)                                                      
RADIOTYI DFLD  POS=(2,58),LTH=11,                                      +        
               ATTR=(NOPROT)                                                    
SERIENRO DFLD  POS=(3,13),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
IDARTUT  DFLD  POS=(3,35),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
RADIOTYO DFLD  POS=(3,58),LTH=11,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Radio code',                                           +        
               POS=(5,2),LTH=10,                                       +        
               ATTR=(PROT)                                                      
RADIOKOD DFLD  POS=(5,14),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Part no',                                              +        
               POS=(5,26),LTH=7,                                       +        
               ATTR=(PROT)                                                      
IDARTNR1 DFLD  POS=(5,35),LTH=10,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Radio type',                                           +        
               POS=(5,47),LTH=10,                                      +        
               ATTR=(PROT)                                                      
RADIOTY1 DFLD  POS=(5,58),LTH=11,                                      +        
               ATTR=(PROT)                                                      
RADIOKD2 DFLD  POS=(6,14),LTH=6,                                       +        
               ATTR=(PROT)                                                      
IDARTNR2 DFLD  POS=(6,35),LTH=10,                                      +        
               ATTR=(PROT)                                                      
RADIOTY2 DFLD  POS=(6,58),LTH=11,                                      +        
               ATTR=(PROT)                                                      
RADIOKD3 DFLD  POS=(7,14),LTH=6,                                       +        
               ATTR=(PROT)                                                      
IDARTNR3 DFLD  POS=(7,35),LTH=10,                                      +        
               ATTR=(PROT)                                                      
RADIOTY3 DFLD  POS=(7,58),LTH=11,                                      +        
               ATTR=(PROT)                                                      
RADIOKD4 DFLD  POS=(8,14),LTH=6,                                       +        
               ATTR=(PROT)                                                      
IDARTNR4 DFLD  POS=(8,35),LTH=10,                                      +        
               ATTR=(PROT)                                                      
RADIOTY4 DFLD  POS=(8,58),LTH=11,                                      +        
               ATTR=(PROT)                                                      
RADIOKD5 DFLD  POS=(9,14),LTH=6,                                       +        
               ATTR=(PROT)                                                      
IDARTNR5 DFLD  POS=(9,35),LTH=10,                                      +        
               ATTR=(PROT)                                                      
RADIOTY5 DFLD  POS=(9,58),LTH=11,                                      +        
               ATTR=(PROT)                                                      
RADIOKD6 DFLD  POS=(10,14),LTH=6,                                      +        
               ATTR=(PROT)                                                      
IDARTNR6 DFLD  POS=(10,35),LTH=10,                                     +        
               ATTR=(PROT)                                                      
RADIOTY6 DFLD  POS=(10,58),LTH=11,                                     +        
               ATTR=(PROT)                                                      
RADIOKD7 DFLD  POS=(11,14),LTH=6,                                      +        
               ATTR=(PROT)                                                      
IDARTNR7 DFLD  POS=(11,35),LTH=10,                                     +        
               ATTR=(PROT)                                                      
RADIOTY7 DFLD  POS=(11,58),LTH=11,                                     +        
               ATTR=(PROT)                                                      
RADIOKD8 DFLD  POS=(12,14),LTH=6,                                      +        
               ATTR=(PROT)                                                      
IDARTNR8 DFLD  POS=(12,35),LTH=10,                                     +        
               ATTR=(PROT)                                                      
RADIOTY8 DFLD  POS=(12,58),LTH=11,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Radio with grey front should have a G after Radiotyp', +        
               POS=(15,3),LTH=52,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Ex grey SC-805 write SC-805G',                         +        
               POS=(16,3),LTH=28,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '13 RADIO CODES  14 RADIO TYPES  15',                   +        
               POS=(21,2),LTH=34,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16',                                                   +        
               POS=(21,52),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,68),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,52),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,68),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W3O111N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W3N111,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W3I111N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT,                                             +        
               NXT=W3I111N1                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  SERIENRI,                                               +        
               LTH=10                                                           
         MFLD  IDARTIN,                                                +        
               LTH=10                                                           
         MFLD  RADIOTYI,                                               +        
               LTH=11                                                           
         MFLD  SERIENRO,                                               +        
               LTH=10                                                           
         MFLD  IDARTUT,                                                +        
               LTH=10                                                           
         MFLD  RADIOTYO,                                               +        
               LTH=11                                                           
         MFLD  RADIOKOD,                                               +        
               LTH=6                                                            
         MFLD  IDARTNR1,                                               +        
               LTH=10                                                           
         MFLD  RADIOTY1,                                               +        
               LTH=11                                                           
         MFLD  RADIOKD2,                                               +        
               LTH=6                                                            
         MFLD  IDARTNR2,                                               +        
               LTH=10                                                           
         MFLD  RADIOTY2,                                               +        
               LTH=11                                                           
         MFLD  RADIOKD3,                                               +        
               LTH=6                                                            
         MFLD  IDARTNR3,                                               +        
               LTH=10                                                           
         MFLD  RADIOTY3,                                               +        
               LTH=11                                                           
         MFLD  RADIOKD4,                                               +        
               LTH=6                                                            
         MFLD  IDARTNR4,                                               +        
               LTH=10                                                           
         MFLD  RADIOTY4,                                               +        
               LTH=11                                                           
         MFLD  RADIOKD5,                                               +        
               LTH=6                                                            
         MFLD  IDARTNR5,                                               +        
               LTH=10                                                           
         MFLD  RADIOTY5,                                               +        
               LTH=11                                                           
         MFLD  RADIOKD6,                                               +        
               LTH=6                                                            
         MFLD  IDARTNR6,                                               +        
               LTH=10                                                           
         MFLD  RADIOTY6,                                               +        
               LTH=11                                                           
         MFLD  RADIOKD7,                                               +        
               LTH=6                                                            
         MFLD  IDARTNR7,                                               +        
               LTH=10                                                           
         MFLD  RADIOTY7,                                               +        
               LTH=11                                                           
         MFLD  RADIOKD8,                                               +        
               LTH=6                                                            
         MFLD  IDARTNR8,                                               +        
               LTH=10                                                           
         MFLD  RADIOTY8,                                               +        
               LTH=11                                                           
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=79                                                           
         MSGEND                                                                 
W3I111N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W3N111),                                           +        
               OPT=2,                                                  +        
               NXT=W3O111N1                                                     
MID      LPAGE SOR=(FORMAT),                                           +        
               NXT=W3O111N1                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '31112',                                                +        
               LTH=5                                                            
         MFLD  (SERIENRI,                                              +        
               '++++++++++'),                                          +        
               LTH=10                                                           
         MFLD  (IDARTIN,                                               +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RADIOTYI,                                              +        
               '+++++++++++'),                                         +        
               LTH=11                                                           
         MFLD  (SERIENRO,                                              +        
               '++++++++++'),                                          +        
               LTH=10                                                           
         MFLD  (IDARTUT,                                               +        
               '++++++++++'),                                          +        
               LTH=10                                                           
         MFLD  (RADIOTYO,                                              +        
               '+++++++++++'),                                         +        
               LTH=11                                                           
         MSGEND                                                                 
         END                                                                    
