***********************************************************************         
* CREATED BY PCC6483   ON 00/06/09  AT 10:35                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'Oversea transit                 '                               
W3N164   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W3T164 7',                                           +        
               8='W3t164 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,10)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'EXCHANGE OVERSEA TRANSITS',                            +        
               POS=(1,11),LTH=25,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Part no',                                              +        
               POS=(2,2),LTH=7,                                        +        
               ATTR=(ALPHA,PROT)                                                
ARTIN    DFLD  POS=(2,10),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
ARTUT    DFLD  POS=(3,10),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Description',                                          +        
               POS=(5,2),LTH=11,                                       +        
               ATTR=(PROT)                                                      
BEART    DFLD  POS=(5,15),LTH=25,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'District   Registration date',                         +        
               POS=(7,2),LTH=28,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Qty',                                                  +        
               POS=(7,35),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'ETA   (*=Received but not approved)',                  +        
               POS=(7,44),LTH=35,                                      +        
               ATTR=(PROT)                                                      
DIST1    DFLD  POS=(8,4),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
DAREG1   DFLD  POS=(8,18),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
QTY1     DFLD  POS=(8,32),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
ETA1     DFLD  POS=(8,42),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
F1       DFLD  POS=(8,51),LTH=1,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DIST2    DFLD  POS=(9,4),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
DAREG2   DFLD  POS=(9,18),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
QTY2     DFLD  POS=(9,32),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
ETA2     DFLD  POS=(9,42),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
F2       DFLD  POS=(9,51),LTH=1,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DIST3    DFLD  POS=(10,4),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DAREG3   DFLD  POS=(10,18),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
QTY3     DFLD  POS=(10,32),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
ETA3     DFLD  POS=(10,42),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
F3       DFLD  POS=(10,51),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DIST4    DFLD  POS=(11,4),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DAREG4   DFLD  POS=(11,18),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
QTY4     DFLD  POS=(11,32),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
ETA4     DFLD  POS=(11,42),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
F4       DFLD  POS=(11,51),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DIST5    DFLD  POS=(12,4),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DAREG5   DFLD  POS=(12,18),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
QTY5     DFLD  POS=(12,32),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
ETA5     DFLD  POS=(12,42),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
F5       DFLD  POS=(12,51),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DIST6    DFLD  POS=(13,4),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DAREG6   DFLD  POS=(13,18),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
QTY6     DFLD  POS=(13,32),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
ETA6     DFLD  POS=(13,42),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
F6       DFLD  POS=(13,51),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DIST7    DFLD  POS=(14,4),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DAREG7   DFLD  POS=(14,18),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
QTY7     DFLD  POS=(14,32),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
ETA7     DFLD  POS=(14,42),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
F7       DFLD  POS=(14,51),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DIST8    DFLD  POS=(15,4),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DAREG8   DFLD  POS=(15,18),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
QTY8     DFLD  POS=(15,32),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
ETA8     DFLD  POS=(15,42),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
F8       DFLD  POS=(15,51),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DIST9    DFLD  POS=(16,4),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DAREG9   DFLD  POS=(16,18),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
QTY9     DFLD  POS=(16,32),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
ETA9     DFLD  POS=(16,42),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
F9       DFLD  POS=(16,51),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DIST10   DFLD  POS=(17,4),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DAREG10  DFLD  POS=(17,18),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
QTY10    DFLD  POS=(17,32),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
ETA10    DFLD  POS=(17,42),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
F10      DFLD  POS=(17,51),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DIST11   DFLD  POS=(18,4),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DAREG11  DFLD  POS=(18,18),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
QTY11    DFLD  POS=(18,32),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
ETA11    DFLD  POS=(18,42),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
F11      DFLD  POS=(18,51),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DIST12   DFLD  POS=(19,4),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DAREG12  DFLD  POS=(19,18),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
QTY12    DFLD  POS=(19,32),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
ETA12    DFLD  POS=(19,42),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
F12      DFLD  POS=(19,51),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DIST13   DFLD  POS=(20,4),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DAREG13  DFLD  POS=(20,18),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
QTY13    DFLD  POS=(20,32),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
ETA13    DFLD  POS=(20,42),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
F13      DFLD  POS=(20,51),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  'F7=First  F8=Next  F10=WHELP',                         +        
               POS=(22,2),LTH=28,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,58),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W3O164N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W3N164,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W3I164N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  ARTIN,                                                  +        
               LTH=2                                                            
         MFLD  ARTUT,                                                  +        
               LTH=8                                                            
         MFLD  BEART,                                                  +        
               LTH=25                                                           
         MFLD  DIST1,                                                  +        
               LTH=4                                                            
         MFLD  DAREG1,                                                 +        
               LTH=8                                                            
         MFLD  QTY1,                                                   +        
               LTH=7                                                            
         MFLD  ETA1,                                                   +        
               LTH=8                                                            
         MFLD  F1,                                                     +        
               LTH=1                                                            
         MFLD  DIST2,                                                  +        
               LTH=4                                                            
         MFLD  DAREG2,                                                 +        
               LTH=8                                                            
         MFLD  QTY2,                                                   +        
               LTH=7                                                            
         MFLD  ETA2,                                                   +        
               LTH=8                                                            
         MFLD  F2,                                                     +        
               LTH=1                                                            
         MFLD  DIST3,                                                  +        
               LTH=4                                                            
         MFLD  DAREG3,                                                 +        
               LTH=8                                                            
         MFLD  QTY3,                                                   +        
               LTH=7                                                            
         MFLD  ETA3,                                                   +        
               LTH=8                                                            
         MFLD  F3,                                                     +        
               LTH=1                                                            
         MFLD  DIST4,                                                  +        
               LTH=4                                                            
         MFLD  DAREG4,                                                 +        
               LTH=8                                                            
         MFLD  QTY4,                                                   +        
               LTH=7                                                            
         MFLD  ETA4,                                                   +        
               LTH=8                                                            
         MFLD  F4,                                                     +        
               LTH=1                                                            
         MFLD  DIST5,                                                  +        
               LTH=4                                                            
         MFLD  DAREG5,                                                 +        
               LTH=8                                                            
         MFLD  QTY5,                                                   +        
               LTH=7                                                            
         MFLD  ETA5,                                                   +        
               LTH=8                                                            
         MFLD  F5,                                                     +        
               LTH=1                                                            
         MFLD  DIST6,                                                  +        
               LTH=4                                                            
         MFLD  DAREG6,                                                 +        
               LTH=8                                                            
         MFLD  QTY6,                                                   +        
               LTH=7                                                            
         MFLD  ETA6,                                                   +        
               LTH=8                                                            
         MFLD  F6,                                                     +        
               LTH=1                                                            
         MFLD  DIST7,                                                  +        
               LTH=4                                                            
         MFLD  DAREG7,                                                 +        
               LTH=8                                                            
         MFLD  QTY7,                                                   +        
               LTH=7                                                            
         MFLD  ETA7,                                                   +        
               LTH=8                                                            
         MFLD  F7,                                                     +        
               LTH=1                                                            
         MFLD  DIST8,                                                  +        
               LTH=4                                                            
         MFLD  DAREG8,                                                 +        
               LTH=8                                                            
         MFLD  QTY8,                                                   +        
               LTH=7                                                            
         MFLD  ETA8,                                                   +        
               LTH=8                                                            
         MFLD  F8,                                                     +        
               LTH=1                                                            
         MFLD  DIST9,                                                  +        
               LTH=4                                                            
         MFLD  DAREG9,                                                 +        
               LTH=8                                                            
         MFLD  QTY9,                                                   +        
               LTH=7                                                            
         MFLD  ETA9,                                                   +        
               LTH=8                                                            
         MFLD  F9,                                                     +        
               LTH=1                                                            
         MFLD  DIST10,                                                 +        
               LTH=4                                                            
         MFLD  DAREG10,                                                +        
               LTH=8                                                            
         MFLD  QTY10,                                                  +        
               LTH=7                                                            
         MFLD  ETA10,                                                  +        
               LTH=8                                                            
         MFLD  F10,                                                    +        
               LTH=1                                                            
         MFLD  DIST11,                                                 +        
               LTH=4                                                            
         MFLD  DAREG11,                                                +        
               LTH=8                                                            
         MFLD  QTY11,                                                  +        
               LTH=7                                                            
         MFLD  ETA11,                                                  +        
               LTH=8                                                            
         MFLD  F11,                                                    +        
               LTH=1                                                            
         MFLD  DIST12,                                                 +        
               LTH=4                                                            
         MFLD  DAREG12,                                                +        
               LTH=8                                                            
         MFLD  QTY12,                                                  +        
               LTH=7                                                            
         MFLD  ETA12,                                                  +        
               LTH=8                                                            
         MFLD  F12,                                                    +        
               LTH=1                                                            
         MFLD  DIST13,                                                 +        
               LTH=4                                                            
         MFLD  DAREG13,                                                +        
               LTH=8                                                            
         MFLD  QTY13,                                                  +        
               LTH=7                                                            
         MFLD  ETA13,                                                  +        
               LTH=8                                                            
         MFLD  F13,                                                    +        
               LTH=1                                                            
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W3I164N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W3N164),                                           +        
               OPT=2,                                                  +        
               NXT=W3O164N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '31642',                                                +        
               LTH=5                                                            
         MFLD  (ARTIN,                                                 +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R                                                           
         MFLD  (ARTUT,                                                 +        
               '        '),                                            +        
               LTH=8,                                                  +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
