         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyzåäöéüÉ'                               
         TITLE 'STATUS GOODS ARRIVING/RECIEVED  '                               
W3N171   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W3T171 6',                                           +        
               7='W3T171 7',                                           +        
               8='W3T171 8',                                           +        
               9='W3T171  ',                                           +        
               10='WHELP   ',                                          +        
               11='W3T171U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W3T171  ',                                          +        
               14='W3T172  ',                                          +        
               15='W3T173  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W3T171U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W3N171   DPAGE CURSOR=((2,11)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'STATUS GOODS ARRIVING/RECEIVE',                        +        
               POS=(1,10),LTH=29,                                      +        
               ATTR=(NUM,PROT)                                                  
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'District',                                             +        
               POS=(2,2),LTH=8,                                        +        
               ATTR=(PROT)                                                      
DISTIN   DFLD  POS=(2,11),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Customer',                                             +        
               POS=(2,16),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
KUNDIN   DFLD  POS=(2,25),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Case Report',                                          +        
               POS=(2,33),LTH=11,                                      +        
               ATTR=(NUM,PROT)                                                  
RAPPIN   DFLD  POS=(2,45),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Status',                                               +        
               POS=(2,53),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
STATUSIN DFLD  POS=(2,60),LTH=1,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Iddc',                                                 +        
               POS=(2,63),LTH=4,                                       +        
               ATTR=(PROT)                                                      
IDDCIN   DFLD  POS=(2,68),LTH=2,                                       +        
               ATTR=(ALPHA,NOPROT)                                              
DISTUT   DFLD  POS=(3,11),LTH=4,                                       +        
               ATTR=(PROT)                                                      
KUNDUT   DFLD  POS=(3,25),LTH=6,                                       +        
               ATTR=(PROT)                                                      
RAPPUT   DFLD  POS=(3,45),LTH=7,                                       +        
               ATTR=(PROT)                                                      
STATUSUT DFLD  POS=(3,60),LTH=1,                                       +        
               ATTR=(PROT)                                                      
IDDCUT   DFLD  POS=(3,68),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'S Dist   Cust Invoice    Case',                        +        
               POS=(5,2),LTH=29,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Tot Reg  Stat  W  Unloading  Date    Date',            +        
               POS=(5,36),LTH=41,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'report     Qty date  rep  Y  address',                 +        
               POS=(6,25),LTH=36,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'arrival approved',                                     +        
               POS=(6,65),LTH=16,                                      +        
               ATTR=(PROT)                                                      
SELECT1  DFLD  POS=(7,2),LTH=1,                                        +        
               ATTR=(PROT)                                                      
DIST1    DFLD  POS=(7,4),LTH=4,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
KUND1    DFLD  POS=(7,9),LTH=6,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
FAKT1    DFLD  POS=(7,16),LTH=7,                                       +        
               ATTR=(PROT)                                                      
RAPP1    DFLD  POS=(7,24),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
TOTANT1  DFLD  POS=(7,32),LTH=7,                                       +        
               ATTR=(PROT)                                                      
REGDAT1  DFLD  POS=(7,40),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
STAT1    DFLD  POS=(7,48),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
BYTGAR1  DFLD  POS=(7,51),LTH=1,                                       +        
               ATTR=(PROT)                                                      
ANKPL1   DFLD  POS=(7,54),LTH=10,                                      +        
               ATTR=(PROT)                                                      
ANKDAT1  DFLD  POS=(7,65),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
GODDAT1  DFLD  POS=(7,73),LTH=6,                                       +        
               ATTR=(PROT)                                                      
SELECT2  DFLD  POS=(8,2),LTH=1,                                        +        
               ATTR=(PROT)                                                      
DIST2    DFLD  POS=(8,4),LTH=4,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
KUND2    DFLD  POS=(8,9),LTH=6,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
FAKT2    DFLD  POS=(8,16),LTH=7,                                       +        
               ATTR=(PROT)                                                      
RAPP2    DFLD  POS=(8,24),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
TOTANT2  DFLD  POS=(8,32),LTH=7,                                       +        
               ATTR=(PROT)                                                      
REGDAT2  DFLD  POS=(8,40),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
STAT2    DFLD  POS=(8,48),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
BYTGAR2  DFLD  POS=(8,51),LTH=1,                                       +        
               ATTR=(PROT)                                                      
ANKPL2   DFLD  POS=(8,54),LTH=10,                                      +        
               ATTR=(PROT)                                                      
ANKDAT2  DFLD  POS=(8,65),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
GODDAT2  DFLD  POS=(8,73),LTH=6,                                       +        
               ATTR=(PROT)                                                      
SELECT3  DFLD  POS=(9,2),LTH=1,                                        +        
               ATTR=(PROT)                                                      
DIST3    DFLD  POS=(9,4),LTH=4,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
KUND3    DFLD  POS=(9,9),LTH=6,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
FAKT3    DFLD  POS=(9,16),LTH=7,                                       +        
               ATTR=(PROT)                                                      
RAPP3    DFLD  POS=(9,24),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
TOTANT3  DFLD  POS=(9,32),LTH=7,                                       +        
               ATTR=(PROT)                                                      
REGDAT3  DFLD  POS=(9,40),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
STAT3    DFLD  POS=(9,48),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
BYTGAR3  DFLD  POS=(9,51),LTH=1,                                       +        
               ATTR=(PROT)                                                      
ANKPL3   DFLD  POS=(9,54),LTH=10,                                      +        
               ATTR=(PROT)                                                      
ANKDAT3  DFLD  POS=(9,65),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
GODDAT3  DFLD  POS=(9,73),LTH=6,                                       +        
               ATTR=(PROT)                                                      
SELECT4  DFLD  POS=(10,2),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DIST4    DFLD  POS=(10,4),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KUND4    DFLD  POS=(10,9),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
FAKT4    DFLD  POS=(10,16),LTH=7,                                      +        
               ATTR=(PROT)                                                      
RAPP4    DFLD  POS=(10,24),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
TOTANT4  DFLD  POS=(10,32),LTH=7,                                      +        
               ATTR=(PROT)                                                      
REGDAT4  DFLD  POS=(10,40),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
STAT4    DFLD  POS=(10,48),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
BYTGAR4  DFLD  POS=(10,51),LTH=1,                                      +        
               ATTR=(PROT)                                                      
ANKPL4   DFLD  POS=(10,54),LTH=10,                                     +        
               ATTR=(PROT)                                                      
ANKDAT4  DFLD  POS=(10,65),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
GODDAT4  DFLD  POS=(10,73),LTH=6,                                      +        
               ATTR=(PROT)                                                      
SELECT5  DFLD  POS=(11,2),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DIST5    DFLD  POS=(11,4),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KUND5    DFLD  POS=(11,9),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
FAKT5    DFLD  POS=(11,16),LTH=7,                                      +        
               ATTR=(PROT)                                                      
RAPP5    DFLD  POS=(11,24),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
TOTANT5  DFLD  POS=(11,32),LTH=7,                                      +        
               ATTR=(PROT)                                                      
REGDAT5  DFLD  POS=(11,40),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
STAT5    DFLD  POS=(11,48),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
BYTGAR5  DFLD  POS=(11,51),LTH=1,                                      +        
               ATTR=(PROT)                                                      
ANKPL5   DFLD  POS=(11,54),LTH=10,                                     +        
               ATTR=(PROT)                                                      
ANKDAT5  DFLD  POS=(11,65),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
GODDAT5  DFLD  POS=(11,73),LTH=6,                                      +        
               ATTR=(PROT)                                                      
SELECT6  DFLD  POS=(12,2),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DIST6    DFLD  POS=(12,4),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KUND6    DFLD  POS=(12,9),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
FAKT6    DFLD  POS=(12,16),LTH=7,                                      +        
               ATTR=(PROT)                                                      
RAPP6    DFLD  POS=(12,24),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
TOTANT6  DFLD  POS=(12,32),LTH=7,                                      +        
               ATTR=(PROT)                                                      
REGDAT6  DFLD  POS=(12,40),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
STAT6    DFLD  POS=(12,48),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
BYTGAR6  DFLD  POS=(12,51),LTH=1,                                      +        
               ATTR=(PROT)                                                      
ANKPL6   DFLD  POS=(12,54),LTH=10,                                     +        
               ATTR=(PROT)                                                      
ANKDAT6  DFLD  POS=(12,65),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
GODDAT6  DFLD  POS=(12,73),LTH=6,                                      +        
               ATTR=(PROT)                                                      
SELECT7  DFLD  POS=(13,2),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DIST7    DFLD  POS=(13,4),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KUND7    DFLD  POS=(13,9),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
FAKT7    DFLD  POS=(13,16),LTH=7,                                      +        
               ATTR=(PROT)                                                      
RAPP7    DFLD  POS=(13,24),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
TOTANT7  DFLD  POS=(13,32),LTH=7,                                      +        
               ATTR=(PROT)                                                      
REGDAT7  DFLD  POS=(13,40),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
STAT7    DFLD  POS=(13,48),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
BYTGAR7  DFLD  POS=(13,51),LTH=1,                                      +        
               ATTR=(PROT)                                                      
ANKPL7   DFLD  POS=(13,54),LTH=10,                                     +        
               ATTR=(PROT)                                                      
ANKDAT7  DFLD  POS=(13,65),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
GODDAT7  DFLD  POS=(13,73),LTH=6,                                      +        
               ATTR=(PROT)                                                      
SELECT8  DFLD  POS=(14,2),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DIST8    DFLD  POS=(14,4),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KUND8    DFLD  POS=(14,9),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
FAKT8    DFLD  POS=(14,16),LTH=7,                                      +        
               ATTR=(PROT)                                                      
RAPP8    DFLD  POS=(14,24),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
TOTANT8  DFLD  POS=(14,32),LTH=7,                                      +        
               ATTR=(PROT)                                                      
REGDAT8  DFLD  POS=(14,40),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
STAT8    DFLD  POS=(14,48),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
BYTGAR8  DFLD  POS=(14,51),LTH=1,                                      +        
               ATTR=(PROT)                                                      
ANKPL8   DFLD  POS=(14,54),LTH=10,                                     +        
               ATTR=(PROT)                                                      
ANKDAT8  DFLD  POS=(14,65),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
GODDAT8  DFLD  POS=(14,73),LTH=6,                                      +        
               ATTR=(PROT)                                                      
SELECT9  DFLD  POS=(15,2),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DIST9    DFLD  POS=(15,4),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KUND9    DFLD  POS=(15,9),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
FAKT9    DFLD  POS=(15,16),LTH=7,                                      +        
               ATTR=(PROT)                                                      
RAPP9    DFLD  POS=(15,24),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
TOTANT9  DFLD  POS=(15,32),LTH=7,                                      +        
               ATTR=(PROT)                                                      
REGDAT9  DFLD  POS=(15,40),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
STAT9    DFLD  POS=(15,48),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
BYTGAR9  DFLD  POS=(15,51),LTH=1,                                      +        
               ATTR=(PROT)                                                      
ANKPL9   DFLD  POS=(15,54),LTH=10,                                     +        
               ATTR=(PROT)                                                      
ANKDAT9  DFLD  POS=(15,65),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
GODDAT9  DFLD  POS=(15,73),LTH=6,                                      +        
               ATTR=(PROT)                                                      
SELECT10 DFLD  POS=(16,2),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DIST10   DFLD  POS=(16,4),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KUND10   DFLD  POS=(16,9),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
FAKT10   DFLD  POS=(16,16),LTH=7,                                      +        
               ATTR=(PROT)                                                      
RAPP10   DFLD  POS=(16,24),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
TOTANT10 DFLD  POS=(16,32),LTH=7,                                      +        
               ATTR=(PROT)                                                      
REGDAT10 DFLD  POS=(16,40),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
STAT10   DFLD  POS=(16,48),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
BYTGAR10 DFLD  POS=(16,51),LTH=1,                                      +        
               ATTR=(PROT)                                                      
ANKPL10  DFLD  POS=(16,54),LTH=10,                                     +        
               ATTR=(PROT)                                                      
ANKDAT10 DFLD  POS=(16,65),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
GODDAT10 DFLD  POS=(16,73),LTH=6,                                      +        
               ATTR=(PROT)                                                      
SELECT11 DFLD  POS=(17,2),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DIST11   DFLD  POS=(17,4),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KUND11   DFLD  POS=(17,9),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
FAKT11   DFLD  POS=(17,16),LTH=7,                                      +        
               ATTR=(PROT)                                                      
RAPP11   DFLD  POS=(17,24),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
TOTANT11 DFLD  POS=(17,32),LTH=7,                                      +        
               ATTR=(PROT)                                                      
REGDAT11 DFLD  POS=(17,40),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
STAT11   DFLD  POS=(17,48),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
BYTGAR11 DFLD  POS=(17,51),LTH=1,                                      +        
               ATTR=(PROT)                                                      
ANKPL11  DFLD  POS=(17,54),LTH=10,                                     +        
               ATTR=(PROT)                                                      
ANKDAT11 DFLD  POS=(17,65),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
GODDAT11 DFLD  POS=(17,73),LTH=6,                                      +        
               ATTR=(PROT)                                                      
SELECT12 DFLD  POS=(18,2),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DIST12   DFLD  POS=(18,4),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KUND12   DFLD  POS=(18,9),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
FAKT12   DFLD  POS=(18,16),LTH=7,                                      +        
               ATTR=(PROT)                                                      
RAPP12   DFLD  POS=(18,24),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
TOTANT12 DFLD  POS=(18,32),LTH=7,                                      +        
               ATTR=(PROT)                                                      
REGDAT12 DFLD  POS=(18,40),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
STAT12   DFLD  POS=(18,48),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
BYTGAR12 DFLD  POS=(18,51),LTH=1,                                      +        
               ATTR=(PROT)                                                      
ANKPL12  DFLD  POS=(18,54),LTH=10,                                     +        
               ATTR=(PROT)                                                      
ANKDAT12 DFLD  POS=(18,65),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
GODDAT12 DFLD  POS=(18,73),LTH=6,                                      +        
               ATTR=(PROT)                                                      
SELECT13 DFLD  POS=(19,2),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DIST13   DFLD  POS=(19,4),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KUND13   DFLD  POS=(19,9),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
FAKT13   DFLD  POS=(19,16),LTH=7,                                      +        
               ATTR=(PROT)                                                      
RAPP13   DFLD  POS=(19,24),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
TOTANT13 DFLD  POS=(19,32),LTH=7,                                      +        
               ATTR=(PROT)                                                      
REGDAT13 DFLD  POS=(19,40),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
STAT13   DFLD  POS=(19,48),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
BYTGAR13 DFLD  POS=(19,51),LTH=1,                                      +        
               ATTR=(PROT)                                                      
ANKPL13  DFLD  POS=(19,54),LTH=10,                                     +        
               ATTR=(PROT)                                                      
ANKDAT13 DFLD  POS=(19,65),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
GODDAT13 DFLD  POS=(19,73),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  ' 6 Back          7 First page',                        +        
               POS=(21,2),LTH=29,                                      +        
               ATTR=(PROT)                                                      
         DFLD  ' 8 Forward         9              10 WHELP   ',        +        
               POS=(21,34),LTH=45,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '13 Status-scr   14 Approval  ',                        +        
               POS=(22,2),LTH=29,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '15 Identification 16              17         ',        +        
               POS=(22,34),LTH=45,                                     +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W3O171N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W3N171,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W3I171N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W3N171                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  DISTIN,                                                 +        
               LTH=4                                                            
         MFLD  DISTUT,                                                 +        
               LTH=4                                                            
         MFLD  KUNDIN,                                                 +        
               LTH=6                                                            
         MFLD  KUNDUT,                                                 +        
               LTH=6                                                            
         MFLD  RAPPIN,                                                 +        
               LTH=7                                                            
         MFLD  RAPPUT,                                                 +        
               LTH=7                                                            
         MFLD  STATUSIN,                                               +        
               LTH=1                                                            
         MFLD  STATUSUT,                                               +        
               LTH=1                                                            
         MFLD  IDDCIN,                                                 +        
               LTH=2                                                            
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  SELECT1,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DIST1,                                                  +        
               LTH=4                                                            
         MFLD  KUND1,                                                  +        
               LTH=6                                                            
         MFLD  FAKT1,                                                  +        
               LTH=7                                                            
         MFLD  RAPP1,                                                  +        
               LTH=7                                                            
         MFLD  TOTANT1,                                                +        
               LTH=7                                                            
         MFLD  REGDAT1,                                                +        
               LTH=6                                                            
         MFLD  STAT1,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BYTGAR1,                                                +        
               LTH=1                                                            
         MFLD  ANKPL1,                                                 +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ANKDAT1,                                                +        
               LTH=6                                                            
         MFLD  GODDAT1,                                                +        
               LTH=6                                                            
         MFLD  SELECT2,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DIST2,                                                  +        
               LTH=4                                                            
         MFLD  KUND2,                                                  +        
               LTH=6                                                            
         MFLD  FAKT2,                                                  +        
               LTH=7                                                            
         MFLD  RAPP2,                                                  +        
               LTH=7                                                            
         MFLD  TOTANT2,                                                +        
               LTH=7                                                            
         MFLD  REGDAT2,                                                +        
               LTH=6                                                            
         MFLD  STAT2,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BYTGAR2,                                                +        
               LTH=1                                                            
         MFLD  ANKPL2,                                                 +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ANKDAT2,                                                +        
               LTH=6                                                            
         MFLD  GODDAT2,                                                +        
               LTH=6                                                            
         MFLD  SELECT3,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DIST3,                                                  +        
               LTH=4                                                            
         MFLD  KUND3,                                                  +        
               LTH=6                                                            
         MFLD  FAKT3,                                                  +        
               LTH=7                                                            
         MFLD  RAPP3,                                                  +        
               LTH=7                                                            
         MFLD  TOTANT3,                                                +        
               LTH=7                                                            
         MFLD  REGDAT3,                                                +        
               LTH=6                                                            
         MFLD  STAT3,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BYTGAR3,                                                +        
               LTH=1                                                            
         MFLD  ANKPL3,                                                 +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ANKDAT3,                                                +        
               LTH=6                                                            
         MFLD  GODDAT3,                                                +        
               LTH=6                                                            
         MFLD  SELECT4,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DIST4,                                                  +        
               LTH=4                                                            
         MFLD  KUND4,                                                  +        
               LTH=6                                                            
         MFLD  FAKT4,                                                  +        
               LTH=7                                                            
         MFLD  RAPP4,                                                  +        
               LTH=7                                                            
         MFLD  TOTANT4,                                                +        
               LTH=7                                                            
         MFLD  REGDAT4,                                                +        
               LTH=6                                                            
         MFLD  STAT4,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BYTGAR4,                                                +        
               LTH=1                                                            
         MFLD  ANKPL4,                                                 +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ANKDAT4,                                                +        
               LTH=6                                                            
         MFLD  GODDAT4,                                                +        
               LTH=6                                                            
         MFLD  SELECT5,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DIST5,                                                  +        
               LTH=4                                                            
         MFLD  KUND5,                                                  +        
               LTH=6                                                            
         MFLD  FAKT5,                                                  +        
               LTH=7                                                            
         MFLD  RAPP5,                                                  +        
               LTH=7                                                            
         MFLD  TOTANT5,                                                +        
               LTH=7                                                            
         MFLD  REGDAT5,                                                +        
               LTH=6                                                            
         MFLD  STAT5,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BYTGAR5,                                                +        
               LTH=1                                                            
         MFLD  ANKPL5,                                                 +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ANKDAT5,                                                +        
               LTH=6                                                            
         MFLD  GODDAT5,                                                +        
               LTH=6                                                            
         MFLD  SELECT6,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DIST6,                                                  +        
               LTH=4                                                            
         MFLD  KUND6,                                                  +        
               LTH=6                                                            
         MFLD  FAKT6,                                                  +        
               LTH=7                                                            
         MFLD  RAPP6,                                                  +        
               LTH=7                                                            
         MFLD  TOTANT6,                                                +        
               LTH=7                                                            
         MFLD  REGDAT6,                                                +        
               LTH=6                                                            
         MFLD  STAT6,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BYTGAR6,                                                +        
               LTH=1                                                            
         MFLD  ANKPL6,                                                 +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ANKDAT6,                                                +        
               LTH=6                                                            
         MFLD  GODDAT6,                                                +        
               LTH=6                                                            
         MFLD  SELECT7,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DIST7,                                                  +        
               LTH=4                                                            
         MFLD  KUND7,                                                  +        
               LTH=6                                                            
         MFLD  FAKT7,                                                  +        
               LTH=7                                                            
         MFLD  RAPP7,                                                  +        
               LTH=7                                                            
         MFLD  TOTANT7,                                                +        
               LTH=7                                                            
         MFLD  REGDAT7,                                                +        
               LTH=6                                                            
         MFLD  STAT7,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BYTGAR7,                                                +        
               LTH=1                                                            
         MFLD  ANKPL7,                                                 +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ANKDAT7,                                                +        
               LTH=6                                                            
         MFLD  GODDAT7,                                                +        
               LTH=6                                                            
         MFLD  SELECT8,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DIST8,                                                  +        
               LTH=4                                                            
         MFLD  KUND8,                                                  +        
               LTH=6                                                            
         MFLD  FAKT8,                                                  +        
               LTH=7                                                            
         MFLD  RAPP8,                                                  +        
               LTH=7                                                            
         MFLD  TOTANT8,                                                +        
               LTH=7                                                            
         MFLD  REGDAT8,                                                +        
               LTH=6                                                            
         MFLD  STAT8,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BYTGAR8,                                                +        
               LTH=1                                                            
         MFLD  ANKPL8,                                                 +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ANKDAT8,                                                +        
               LTH=6                                                            
         MFLD  GODDAT8,                                                +        
               LTH=6                                                            
         MFLD  SELECT9,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DIST9,                                                  +        
               LTH=4                                                            
         MFLD  KUND9,                                                  +        
               LTH=6                                                            
         MFLD  FAKT9,                                                  +        
               LTH=7                                                            
         MFLD  RAPP9,                                                  +        
               LTH=7                                                            
         MFLD  TOTANT9,                                                +        
               LTH=7                                                            
         MFLD  REGDAT9,                                                +        
               LTH=6                                                            
         MFLD  STAT9,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BYTGAR9,                                                +        
               LTH=1                                                            
         MFLD  ANKPL9,                                                 +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ANKDAT9,                                                +        
               LTH=6                                                            
         MFLD  GODDAT9,                                                +        
               LTH=6                                                            
         MFLD  SELECT10,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DIST10,                                                 +        
               LTH=4                                                            
         MFLD  KUND10,                                                 +        
               LTH=6                                                            
         MFLD  FAKT10,                                                 +        
               LTH=7                                                            
         MFLD  RAPP10,                                                 +        
               LTH=7                                                            
         MFLD  TOTANT10,                                               +        
               LTH=7                                                            
         MFLD  REGDAT10,                                               +        
               LTH=6                                                            
         MFLD  STAT10,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BYTGAR10,                                               +        
               LTH=1                                                            
         MFLD  ANKPL10,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ANKDAT10,                                               +        
               LTH=6                                                            
         MFLD  GODDAT10,                                               +        
               LTH=6                                                            
         MFLD  SELECT11,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DIST11,                                                 +        
               LTH=4                                                            
         MFLD  KUND11,                                                 +        
               LTH=6                                                            
         MFLD  FAKT11,                                                 +        
               LTH=7                                                            
         MFLD  RAPP11,                                                 +        
               LTH=7                                                            
         MFLD  TOTANT11,                                               +        
               LTH=7                                                            
         MFLD  REGDAT11,                                               +        
               LTH=6                                                            
         MFLD  STAT11,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BYTGAR11,                                               +        
               LTH=1                                                            
         MFLD  ANKPL11,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ANKDAT11,                                               +        
               LTH=6                                                            
         MFLD  GODDAT11,                                               +        
               LTH=6                                                            
         MFLD  SELECT12,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DIST12,                                                 +        
               LTH=4                                                            
         MFLD  KUND12,                                                 +        
               LTH=6                                                            
         MFLD  FAKT12,                                                 +        
               LTH=7                                                            
         MFLD  RAPP12,                                                 +        
               LTH=7                                                            
         MFLD  TOTANT12,                                               +        
               LTH=7                                                            
         MFLD  REGDAT12,                                               +        
               LTH=6                                                            
         MFLD  STAT12,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BYTGAR12,                                               +        
               LTH=1                                                            
         MFLD  ANKPL12,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ANKDAT12,                                               +        
               LTH=6                                                            
         MFLD  GODDAT12,                                               +        
               LTH=6                                                            
         MFLD  SELECT13,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DIST13,                                                 +        
               LTH=4                                                            
         MFLD  KUND13,                                                 +        
               LTH=6                                                            
         MFLD  FAKT13,                                                 +        
               LTH=7                                                            
         MFLD  RAPP13,                                                 +        
               LTH=7                                                            
         MFLD  TOTANT13,                                               +        
               LTH=7                                                            
         MFLD  REGDAT13,                                               +        
               LTH=6                                                            
         MFLD  STAT13,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BYTGAR13,                                               +        
               LTH=1                                                            
         MFLD  ANKPL13,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ANKDAT13,                                               +        
               LTH=6                                                            
         MFLD  GODDAT13,                                               +        
               LTH=6                                                            
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W3I171N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W3N171),                                           +        
               OPT=2,                                                  +        
               NXT=W3O171N1                                                     
MID      LPAGE SOR=(W3N171)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F7'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  ' ',                                                    +        
               LTH=2                                                            
         MFLD  '31712',                                                +        
               LTH=5                                                            
         MFLD  (DISTIN,                                                +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KUNDIN,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RAPPIN,                                                +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (STATUSIN,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDDCIN,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (SELECT1,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  DIST1,                                                  +        
               LTH=4                                                            
         MFLD  KUND1,                                                  +        
               LTH=6                                                            
         MFLD  RAPP1,                                                  +        
               LTH=7                                                            
         MFLD  (STAT1,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANKPL1,                                                +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               FILL=X'40'                                                       
         MFLD  (SELECT2,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  DIST2,                                                  +        
               LTH=4                                                            
         MFLD  KUND2,                                                  +        
               LTH=6                                                            
         MFLD  RAPP2,                                                  +        
               LTH=7                                                            
         MFLD  (STAT2,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANKPL2,                                                +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               FILL=X'40'                                                       
         MFLD  (SELECT3,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  DIST3,                                                  +        
               LTH=4                                                            
         MFLD  KUND3,                                                  +        
               LTH=6                                                            
         MFLD  RAPP3,                                                  +        
               LTH=7                                                            
         MFLD  (STAT3,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANKPL3,                                                +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               FILL=X'40'                                                       
         MFLD  (SELECT4,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  DIST4,                                                  +        
               LTH=4                                                            
         MFLD  KUND4,                                                  +        
               LTH=6                                                            
         MFLD  RAPP4,                                                  +        
               LTH=7                                                            
         MFLD  (STAT4,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANKPL4,                                                +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               FILL=X'40'                                                       
         MFLD  (SELECT5,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  DIST5,                                                  +        
               LTH=4                                                            
         MFLD  KUND5,                                                  +        
               LTH=6                                                            
         MFLD  RAPP5,                                                  +        
               LTH=7                                                            
         MFLD  (STAT5,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANKPL5,                                                +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               FILL=X'40'                                                       
         MFLD  (SELECT6,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  DIST6,                                                  +        
               LTH=4                                                            
         MFLD  KUND6,                                                  +        
               LTH=6                                                            
         MFLD  RAPP6,                                                  +        
               LTH=7                                                            
         MFLD  (STAT6,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANKPL6,                                                +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               FILL=X'40'                                                       
         MFLD  (SELECT7,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  DIST7,                                                  +        
               LTH=4                                                            
         MFLD  KUND7,                                                  +        
               LTH=6                                                            
         MFLD  RAPP7,                                                  +        
               LTH=7                                                            
         MFLD  (STAT7,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANKPL7,                                                +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               FILL=X'40'                                                       
         MFLD  (SELECT8,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  DIST8,                                                  +        
               LTH=4                                                            
         MFLD  KUND8,                                                  +        
               LTH=6                                                            
         MFLD  RAPP8,                                                  +        
               LTH=7                                                            
         MFLD  (STAT8,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANKPL8,                                                +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               FILL=X'40'                                                       
         MFLD  (SELECT9,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  DIST9,                                                  +        
               LTH=4                                                            
         MFLD  KUND9,                                                  +        
               LTH=6                                                            
         MFLD  RAPP9,                                                  +        
               LTH=7                                                            
         MFLD  (STAT9,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANKPL9,                                                +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               FILL=X'40'                                                       
         MFLD  (SELECT10,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  DIST10,                                                 +        
               LTH=4                                                            
         MFLD  KUND10,                                                 +        
               LTH=6                                                            
         MFLD  RAPP10,                                                 +        
               LTH=7                                                            
         MFLD  (STAT10,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANKPL10,                                               +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               FILL=X'40'                                                       
         MFLD  (SELECT11,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  DIST11,                                                 +        
               LTH=4                                                            
         MFLD  KUND11,                                                 +        
               LTH=6                                                            
         MFLD  RAPP11,                                                 +        
               LTH=7                                                            
         MFLD  (STAT11,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANKPL11,                                               +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               FILL=X'40'                                                       
         MFLD  (SELECT12,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  DIST12,                                                 +        
               LTH=4                                                            
         MFLD  KUND12,                                                 +        
               LTH=6                                                            
         MFLD  RAPP12,                                                 +        
               LTH=7                                                            
         MFLD  (STAT12,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANKPL12,                                               +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               FILL=X'40'                                                       
         MFLD  (SELECT13,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  DIST13,                                                 +        
               LTH=4                                                            
         MFLD  KUND13,                                                 +        
               LTH=6                                                            
         MFLD  RAPP13,                                                 +        
               LTH=7                                                            
         MFLD  (STAT13,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANKPL13,                                               +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
