***********************************************************************         
* CREATED BY PCC6483   ON 99/12/14  AT 10:28                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'Exchange point adjustment       '                               
W3N123   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W3T123 7',                                           +        
               8='W3T123 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W3T123U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'EXCHANGE POINT ADJUSTMENT',                            +        
               POS=(1,11),LTH=25,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'District',                                             +        
               POS=(2,2),LTH=8,                                        +        
               ATTR=(ALPHA,PROT)                                                
DISTIN   DFLD  POS=(2,12),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Account',                                              +        
               POS=(2,18),LTH=7,                                       +        
               ATTR=(PROT)                                                      
ACCIN    DFLD  POS=(2,27),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
DISTUT   DFLD  POS=(3,12),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
ACCUT    DFLD  POS=(3,27),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'C District Account   Description',                     +        
               POS=(5,2),LTH=32,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Points D-C',                                           +        
               POS=(5,67),LTH=10,                                      +        
               ATTR=(PROT)                                                      
CMD      DFLD  POS=(6,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
DISTUPD  DFLD  POS=(6,4),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
ACCUPD   DFLD  POS=(6,13),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
SEKVUPD  DFLD  POS=(6,17),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
DESCUPD  DFLD  POS=(6,23),LTH=40,                                      +        
               ATTR=(NOPROT)                                                    
POINTUPD DFLD  POS=(6,66),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
DECRUPD  DFLD  POS=(6,75),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'District Account   Description',                       +        
               POS=(8,4),LTH=30,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Points User',                                          +        
               POS=(8,56),LTH=11,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Reg date',                                             +        
               POS=(8,72),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DIST1    DFLD  POS=(9,4),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
ACC1     DFLD  POS=(9,13),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
SEKV1    DFLD  POS=(9,17),LTH=5,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DESC1    DFLD  POS=(9,23),LTH=30,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
POINT1   DFLD  POS=(9,54),LTH=8,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
USER1    DFLD  POS=(9,63),LTH=8,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DATE1    DFLD  POS=(9,72),LTH=8,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DIST2    DFLD  POS=(10,4),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
ACC2     DFLD  POS=(10,13),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
SEKV2    DFLD  POS=(10,17),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DESC2    DFLD  POS=(10,23),LTH=30,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
POINT2   DFLD  POS=(10,54),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
USER2    DFLD  POS=(10,63),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DATE2    DFLD  POS=(10,72),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DIST3    DFLD  POS=(11,4),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
ACC3     DFLD  POS=(11,13),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
SEKV3    DFLD  POS=(11,17),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DESC3    DFLD  POS=(11,23),LTH=30,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
POINT3   DFLD  POS=(11,54),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
USER3    DFLD  POS=(11,63),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DATE3    DFLD  POS=(11,72),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DIST4    DFLD  POS=(12,4),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
ACC4     DFLD  POS=(12,13),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
SEKV4    DFLD  POS=(12,17),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DESC4    DFLD  POS=(12,23),LTH=30,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
POINT4   DFLD  POS=(12,54),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
USER4    DFLD  POS=(12,63),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DATE4    DFLD  POS=(12,72),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DIST5    DFLD  POS=(13,4),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
ACC5     DFLD  POS=(13,13),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
SEKV5    DFLD  POS=(13,17),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DESC5    DFLD  POS=(13,23),LTH=30,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
POINT5   DFLD  POS=(13,54),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
USER5    DFLD  POS=(13,63),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DATE5    DFLD  POS=(13,72),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DIST6    DFLD  POS=(14,4),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
ACC6     DFLD  POS=(14,13),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
SEKV6    DFLD  POS=(14,17),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DESC6    DFLD  POS=(14,23),LTH=30,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
POINT6   DFLD  POS=(14,54),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
USER6    DFLD  POS=(14,63),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DATE6    DFLD  POS=(14,72),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DIST7    DFLD  POS=(15,4),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
ACC7     DFLD  POS=(15,13),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
SEKV7    DFLD  POS=(15,17),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DESC7    DFLD  POS=(15,23),LTH=30,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
POINT7   DFLD  POS=(15,54),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
USER7    DFLD  POS=(15,63),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DATE7    DFLD  POS=(15,72),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DIST8    DFLD  POS=(16,4),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
ACC8     DFLD  POS=(16,13),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
SEKV8    DFLD  POS=(16,17),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DESC8    DFLD  POS=(16,23),LTH=30,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
POINT8   DFLD  POS=(16,54),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
USER8    DFLD  POS=(16,63),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DATE8    DFLD  POS=(16,72),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DIST9    DFLD  POS=(17,4),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
ACC9     DFLD  POS=(17,13),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
SEKV9    DFLD  POS=(17,17),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DESC9    DFLD  POS=(17,23),LTH=30,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
POINT9   DFLD  POS=(17,54),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
USER9    DFLD  POS=(17,63),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DATE9    DFLD  POS=(17,72),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DIST10   DFLD  POS=(18,4),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
ACC10    DFLD  POS=(18,13),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
SEKV10   DFLD  POS=(18,17),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DESC10   DFLD  POS=(18,23),LTH=30,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
POINT10  DFLD  POS=(18,54),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
USER10   DFLD  POS=(18,63),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DATE10   DFLD  POS=(18,72),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DIST11   DFLD  POS=(19,4),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
ACC11    DFLD  POS=(19,13),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
SEKV11   DFLD  POS=(19,17),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DESC11   DFLD  POS=(19,23),LTH=30,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
POINT11  DFLD  POS=(19,54),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
USER11   DFLD  POS=(19,63),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DATE11   DFLD  POS=(19,72),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DIST12   DFLD  POS=(20,4),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
ACC12    DFLD  POS=(20,13),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
SEKV12   DFLD  POS=(20,17),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DESC12   DFLD  POS=(20,23),LTH=30,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
POINT12  DFLD  POS=(20,54),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
USER12   DFLD  POS=(20,63),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DATE12   DFLD  POS=(20,72),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  'F7=First  F8=Next  F10=WHELP  F11=Update',             +        
               POS=(22,2),LTH=40,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(23,59),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W3O123N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W3N123,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W3I123N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  DISTIN,                                                 +        
               LTH=2                                                            
         MFLD  DISTUT,                                                 +        
               LTH=4                                                            
         MFLD  ACCIN,                                                  +        
               LTH=2                                                            
         MFLD  ACCUT,                                                  +        
               LTH=3                                                            
         MFLD  CMD,                                                    +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DISTUPD,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ACCUPD,                                                 +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SEKVUPD,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DESCUPD,                                                +        
               LTH=42,                                                 +        
               ATTR=(YES)                                                       
         MFLD  POINTUPD,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DECRUPD,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DIST1,                                                  +        
               LTH=4                                                            
         MFLD  ACC1,                                                   +        
               LTH=3                                                            
         MFLD  SEKV1,                                                  +        
               LTH=5                                                            
         MFLD  DESC1,                                                  +        
               LTH=30                                                           
         MFLD  POINT1,                                                 +        
               LTH=8                                                            
         MFLD  USER1,                                                  +        
               LTH=8                                                            
         MFLD  DATE1,                                                  +        
               LTH=8                                                            
         MFLD  DIST2,                                                  +        
               LTH=4                                                            
         MFLD  ACC2,                                                   +        
               LTH=3                                                            
         MFLD  SEKV2,                                                  +        
               LTH=5                                                            
         MFLD  DESC2,                                                  +        
               LTH=30                                                           
         MFLD  POINT2,                                                 +        
               LTH=8                                                            
         MFLD  USER2,                                                  +        
               LTH=8                                                            
         MFLD  DATE2,                                                  +        
               LTH=8                                                            
         MFLD  DIST3,                                                  +        
               LTH=4                                                            
         MFLD  ACC3,                                                   +        
               LTH=3                                                            
         MFLD  SEKV3,                                                  +        
               LTH=5                                                            
         MFLD  DESC3,                                                  +        
               LTH=30                                                           
         MFLD  POINT3,                                                 +        
               LTH=8                                                            
         MFLD  USER3,                                                  +        
               LTH=8                                                            
         MFLD  DATE3,                                                  +        
               LTH=8                                                            
         MFLD  DIST4,                                                  +        
               LTH=4                                                            
         MFLD  ACC4,                                                   +        
               LTH=3                                                            
         MFLD  SEKV4,                                                  +        
               LTH=5                                                            
         MFLD  DESC4,                                                  +        
               LTH=30                                                           
         MFLD  POINT4,                                                 +        
               LTH=8                                                            
         MFLD  USER4,                                                  +        
               LTH=8                                                            
         MFLD  DATE4,                                                  +        
               LTH=8                                                            
         MFLD  DIST5,                                                  +        
               LTH=4                                                            
         MFLD  ACC5,                                                   +        
               LTH=3                                                            
         MFLD  SEKV5,                                                  +        
               LTH=5                                                            
         MFLD  DESC5,                                                  +        
               LTH=30                                                           
         MFLD  POINT5,                                                 +        
               LTH=8                                                            
         MFLD  USER5,                                                  +        
               LTH=8                                                            
         MFLD  DATE5,                                                  +        
               LTH=8                                                            
         MFLD  DIST6,                                                  +        
               LTH=4                                                            
         MFLD  ACC6,                                                   +        
               LTH=3                                                            
         MFLD  SEKV6,                                                  +        
               LTH=5                                                            
         MFLD  DESC6,                                                  +        
               LTH=30                                                           
         MFLD  POINT6,                                                 +        
               LTH=8                                                            
         MFLD  USER6,                                                  +        
               LTH=8                                                            
         MFLD  DATE6,                                                  +        
               LTH=8                                                            
         MFLD  DIST7,                                                  +        
               LTH=4                                                            
         MFLD  ACC7,                                                   +        
               LTH=3                                                            
         MFLD  SEKV7,                                                  +        
               LTH=5                                                            
         MFLD  DESC7,                                                  +        
               LTH=30                                                           
         MFLD  POINT7,                                                 +        
               LTH=8                                                            
         MFLD  USER7,                                                  +        
               LTH=8                                                            
         MFLD  DATE7,                                                  +        
               LTH=8                                                            
         MFLD  DIST8,                                                  +        
               LTH=4                                                            
         MFLD  ACC8,                                                   +        
               LTH=3                                                            
         MFLD  SEKV8,                                                  +        
               LTH=5                                                            
         MFLD  DESC8,                                                  +        
               LTH=30                                                           
         MFLD  POINT8,                                                 +        
               LTH=8                                                            
         MFLD  USER8,                                                  +        
               LTH=8                                                            
         MFLD  DATE8,                                                  +        
               LTH=8                                                            
         MFLD  DIST9,                                                  +        
               LTH=4                                                            
         MFLD  ACC9,                                                   +        
               LTH=3                                                            
         MFLD  SEKV9,                                                  +        
               LTH=5                                                            
         MFLD  DESC9,                                                  +        
               LTH=30                                                           
         MFLD  POINT9,                                                 +        
               LTH=8                                                            
         MFLD  USER9,                                                  +        
               LTH=8                                                            
         MFLD  DATE9,                                                  +        
               LTH=8                                                            
         MFLD  DIST10,                                                 +        
               LTH=4                                                            
         MFLD  ACC10,                                                  +        
               LTH=3                                                            
         MFLD  SEKV10,                                                 +        
               LTH=5                                                            
         MFLD  DESC10,                                                 +        
               LTH=30                                                           
         MFLD  POINT10,                                                +        
               LTH=8                                                            
         MFLD  USER10,                                                 +        
               LTH=8                                                            
         MFLD  DATE10,                                                 +        
               LTH=8                                                            
         MFLD  DIST11,                                                 +        
               LTH=4                                                            
         MFLD  ACC11,                                                  +        
               LTH=3                                                            
         MFLD  SEKV11,                                                 +        
               LTH=5                                                            
         MFLD  DESC11,                                                 +        
               LTH=30                                                           
         MFLD  POINT11,                                                +        
               LTH=8                                                            
         MFLD  USER11,                                                 +        
               LTH=8                                                            
         MFLD  DATE11,                                                 +        
               LTH=8                                                            
         MFLD  DIST12,                                                 +        
               LTH=4                                                            
         MFLD  ACC12,                                                  +        
               LTH=3                                                            
         MFLD  SEKV12,                                                 +        
               LTH=5                                                            
         MFLD  DESC12,                                                 +        
               LTH=30                                                           
         MFLD  POINT12,                                                +        
               LTH=8                                                            
         MFLD  USER12,                                                 +        
               LTH=8                                                            
         MFLD  DATE12,                                                 +        
               LTH=8                                                            
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W3I123N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W3N123),                                           +        
               OPT=2,                                                  +        
               NXT=W3O123N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '31232',                                                +        
               LTH=5                                                            
         MFLD  (DISTIN,                                                +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R                                                           
         MFLD  (DISTUT,                                                +        
               '    '),                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (ACCIN,                                                 +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R                                                           
         MFLD  (ACCUT,                                                 +        
               '   '),                                                 +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (CMD,                                                   +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DISTUPD,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R                                                           
         MFLD  (ACCUPD,                                                +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R                                                           
         MFLD  (SEKVUPD,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R                                                           
         MFLD  (DESCUPD,                                               +        
               '++++++++++++++++++++++++++++++++++++++++'),            +        
               LTH=40,                                                 +        
               FILL=X'40'                                                       
         MFLD  (POINTUPD,                                              +        
               '++++++++'),                                            +        
               LTH=7,                                                  +        
               JUST=R                                                           
         MFLD  (DECRUPD,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
