***********************************************************************         
* CREATED BY PC59009   ON 97/02/04  AT 12:51                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'APPROVAL                        '                               
W3N172   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W3T172 6',                                           +        
               7='W3T172 7',                                           +        
               8='W3T172 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W3T172U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W3T171  ',                                          +        
               14='W3T172  ',                                          +        
               15='W3T173  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W3T172U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W3N172   DPAGE CURSOR=((2,11)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'APPROVAL',                                             +        
               POS=(1,10),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
TEMFSFEL DFLD  POS=(1,40),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'District',                                             +        
               POS=(2,2),LTH=8,                                        +        
               ATTR=(PROT)                                                      
DGIA0002 DFLD  POS=(2,11),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Case report',                                          +        
               POS=(2,17),LTH=11,                                      +        
               ATTR=(PROT)                                                      
DGIA0006 DFLD  POS=(2,30),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Printer',                                              +        
               POS=(2,42),LTH=7,                                       +        
               ATTR=(PROT)                                                      
KDPRT    DFLD  POS=(2,50),LTH=3,                                       +        
               ATTR=(NOPROT,MOD)                                                
DGIA0003 DFLD  POS=(3,11),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0008 DFLD  POS=(3,30),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
FLAGGA   DFLD  POS=(4,14),LTH=1,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
         DFLD  'Customer',                                             +        
               POS=(5,2),LTH=8,                                        +        
               ATTR=(PROT)                                                      
IDKUNDNR DFLD  POS=(5,11),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Invoice',                                              +        
               POS=(5,19),LTH=7,                                       +        
               ATTR=(ALPHA,PROT)                                                
IDFAKTNR DFLD  POS=(5,27),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Status case report',                                   +        
               POS=(5,38),LTH=18,                                      +        
               ATTR=(PROT)                                                      
DGIA0007 DFLD  POS=(5,57),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Approver',                                             +        
               POS=(5,60),LTH=8,                                       +        
               ATTR=(PROT)                                                      
IDUSER   DFLD  POS=(5,69),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'S Core',                                               +        
               POS=(6,2),LTH=6,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'Points Qty Qty Sta  DC  Scr Description',              +        
               POS=(6,14),LTH=39,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Dealer     N',                                         +        
               POS=(6,64),LTH=12,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'org hnd',                                              +        
               POS=(7,21),LTH=7,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'code     Core',                                        +        
               POS=(7,33),LTH=13,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'remark',                                               +        
               POS=(7,64),LTH=6,                                       +        
               ATTR=(PROT)                                                      
SELECT1  DFLD  POS=(8,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
OBJNR1   DFLD  POS=(8,4),LTH=9,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
POINT1   DFLD  POS=(8,14),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
ANTALU1  DFLD  POS=(8,21),LTH=3,                                       +        
               ATTR=(PROT)                                                      
ANTALG1  DFLD  POS=(8,25),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
STATUS1  DFLD  POS=(8,30),LTH=1,                                       +        
               ATTR=(PROT)                                                      
ANMARK1  DFLD  POS=(8,34),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
FLSKRO1  DFLD  POS=(8,39),LTH=1,                                       +        
               ATTR=(PROT)                                                      
BENAM1   DFLD  POS=(8,42),LTH=15,                                      +        
               ATTR=(PROT)                                                      
BYTRAD1  DFLD  POS=(8,58),LTH=5,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
RADREF1  DFLD  POS=(8,64),LTH=10,                                      +        
               ATTR=(NUM,PROT)                                                  
FLLOKA1  DFLD  POS=(8,75),LTH=1,                                       +        
               ATTR=(PROT)                                                      
TABNR1   DFLD  POS=(8,77),LTH=3,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
SELECT2  DFLD  POS=(9,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
OBJNR2   DFLD  POS=(9,4),LTH=9,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
POINT2   DFLD  POS=(9,14),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
ANTALU2  DFLD  POS=(9,21),LTH=3,                                       +        
               ATTR=(PROT)                                                      
ANTALG2  DFLD  POS=(9,25),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
STATUS2  DFLD  POS=(9,30),LTH=1,                                       +        
               ATTR=(PROT)                                                      
ANMARK2  DFLD  POS=(9,34),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
FLSKRO2  DFLD  POS=(9,39),LTH=1,                                       +        
               ATTR=(PROT)                                                      
BENAM2   DFLD  POS=(9,42),LTH=15,                                      +        
               ATTR=(PROT)                                                      
BYTRAD2  DFLD  POS=(9,58),LTH=5,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
RADREF2  DFLD  POS=(9,64),LTH=10,                                      +        
               ATTR=(NUM,PROT)                                                  
FLLOKA2  DFLD  POS=(9,75),LTH=1,                                       +        
               ATTR=(PROT)                                                      
TABNR2   DFLD  POS=(9,77),LTH=3,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
SELECT3  DFLD  POS=(10,2),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
OBJNR3   DFLD  POS=(10,4),LTH=9,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
POINT3   DFLD  POS=(10,14),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ANTALU3  DFLD  POS=(10,21),LTH=3,                                      +        
               ATTR=(PROT)                                                      
ANTALG3  DFLD  POS=(10,25),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
STATUS3  DFLD  POS=(10,30),LTH=1,                                      +        
               ATTR=(PROT)                                                      
ANMARK3  DFLD  POS=(10,34),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
FLSKRO3  DFLD  POS=(10,39),LTH=1,                                      +        
               ATTR=(PROT)                                                      
BENAM3   DFLD  POS=(10,42),LTH=15,                                     +        
               ATTR=(PROT)                                                      
BYTRAD3  DFLD  POS=(10,58),LTH=5,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
RADREF3  DFLD  POS=(10,64),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
FLLOKA3  DFLD  POS=(10,75),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TABNR3   DFLD  POS=(10,77),LTH=3,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
SELECT4  DFLD  POS=(11,2),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
OBJNR4   DFLD  POS=(11,4),LTH=9,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
POINT4   DFLD  POS=(11,14),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ANTALU4  DFLD  POS=(11,21),LTH=3,                                      +        
               ATTR=(PROT)                                                      
ANTALG4  DFLD  POS=(11,25),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
STATUS4  DFLD  POS=(11,30),LTH=1,                                      +        
               ATTR=(PROT)                                                      
ANMARK4  DFLD  POS=(11,34),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
FLSKRO4  DFLD  POS=(11,39),LTH=1,                                      +        
               ATTR=(PROT)                                                      
BENAM4   DFLD  POS=(11,42),LTH=15,                                     +        
               ATTR=(PROT)                                                      
BYTRAD4  DFLD  POS=(11,58),LTH=5,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
RADREF4  DFLD  POS=(11,64),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
FLLOKA4  DFLD  POS=(11,75),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TABNR4   DFLD  POS=(11,77),LTH=3,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
SELECT5  DFLD  POS=(12,2),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
OBJNR5   DFLD  POS=(12,4),LTH=9,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
POINT5   DFLD  POS=(12,14),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ANTALU5  DFLD  POS=(12,21),LTH=3,                                      +        
               ATTR=(PROT)                                                      
ANTALG5  DFLD  POS=(12,25),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
STATUS5  DFLD  POS=(12,30),LTH=1,                                      +        
               ATTR=(PROT)                                                      
ANMARK5  DFLD  POS=(12,34),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
FLSKRO5  DFLD  POS=(12,39),LTH=1,                                      +        
               ATTR=(PROT)                                                      
BENAM5   DFLD  POS=(12,42),LTH=15,                                     +        
               ATTR=(PROT)                                                      
BYTRAD5  DFLD  POS=(12,58),LTH=5,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
RADREF5  DFLD  POS=(12,64),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
FLLOKA5  DFLD  POS=(12,75),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TABNR5   DFLD  POS=(12,77),LTH=3,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
SELECT6  DFLD  POS=(13,2),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
OBJNR6   DFLD  POS=(13,4),LTH=9,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
POINT6   DFLD  POS=(13,14),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ANTALU6  DFLD  POS=(13,21),LTH=3,                                      +        
               ATTR=(PROT)                                                      
ANTALG6  DFLD  POS=(13,25),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
STATUS6  DFLD  POS=(13,30),LTH=1,                                      +        
               ATTR=(PROT)                                                      
ANMARK6  DFLD  POS=(13,34),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
FLSKRO6  DFLD  POS=(13,39),LTH=1,                                      +        
               ATTR=(PROT)                                                      
BENAM6   DFLD  POS=(13,42),LTH=15,                                     +        
               ATTR=(PROT)                                                      
BYTRAD6  DFLD  POS=(13,58),LTH=5,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
RADREF6  DFLD  POS=(13,64),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
FLLOKA6  DFLD  POS=(13,75),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TABNR6   DFLD  POS=(13,77),LTH=3,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
SELECT7  DFLD  POS=(14,2),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
OBJNR7   DFLD  POS=(14,4),LTH=9,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
POINT7   DFLD  POS=(14,14),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ANTALU7  DFLD  POS=(14,21),LTH=3,                                      +        
               ATTR=(PROT)                                                      
ANTALG7  DFLD  POS=(14,25),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
STATUS7  DFLD  POS=(14,30),LTH=1,                                      +        
               ATTR=(PROT)                                                      
ANMARK7  DFLD  POS=(14,34),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
FLSKRO7  DFLD  POS=(14,39),LTH=1,                                      +        
               ATTR=(PROT)                                                      
BENAM7   DFLD  POS=(14,42),LTH=15,                                     +        
               ATTR=(PROT)                                                      
BYTRAD7  DFLD  POS=(14,58),LTH=5,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
RADREF7  DFLD  POS=(14,64),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
FLLOKA7  DFLD  POS=(14,75),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TABNR7   DFLD  POS=(14,77),LTH=3,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
SELECT8  DFLD  POS=(15,2),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
OBJNR8   DFLD  POS=(15,4),LTH=9,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
POINT8   DFLD  POS=(15,14),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ANTALU8  DFLD  POS=(15,21),LTH=3,                                      +        
               ATTR=(PROT)                                                      
ANTALG8  DFLD  POS=(15,25),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
STATUS8  DFLD  POS=(15,30),LTH=1,                                      +        
               ATTR=(PROT)                                                      
ANMARK8  DFLD  POS=(15,34),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
FLSKRO8  DFLD  POS=(15,39),LTH=1,                                      +        
               ATTR=(PROT)                                                      
BENAM8   DFLD  POS=(15,42),LTH=15,                                     +        
               ATTR=(PROT)                                                      
BYTRAD8  DFLD  POS=(15,58),LTH=5,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
RADREF8  DFLD  POS=(15,64),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
FLLOKA8  DFLD  POS=(15,75),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TABNR8   DFLD  POS=(15,77),LTH=3,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
SELECT9  DFLD  POS=(16,2),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
OBJNR9   DFLD  POS=(16,4),LTH=9,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
POINT9   DFLD  POS=(16,14),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ANTALU9  DFLD  POS=(16,21),LTH=3,                                      +        
               ATTR=(PROT)                                                      
ANTALG9  DFLD  POS=(16,25),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
STATUS9  DFLD  POS=(16,30),LTH=1,                                      +        
               ATTR=(PROT)                                                      
ANMARK9  DFLD  POS=(16,34),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
FLSKRO9  DFLD  POS=(16,39),LTH=1,                                      +        
               ATTR=(PROT)                                                      
BENAM9   DFLD  POS=(16,42),LTH=15,                                     +        
               ATTR=(PROT)                                                      
BYTRAD9  DFLD  POS=(16,58),LTH=5,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
RADREF9  DFLD  POS=(16,64),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
FLLOKA9  DFLD  POS=(16,75),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TABNR9   DFLD  POS=(16,77),LTH=3,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
         DFLD  'Total Quantity',                                       +        
               POS=(17,2),LTH=14,                                      +        
               ATTR=(PROT)                                                      
TOTANTU  DFLD  POS=(17,19),LTH=4,                                      +        
               ATTR=(PROT)                                                      
TOTANTG  DFLD  POS=(17,24),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
TEXTRAD  DFLD  POS=(17,30),LTH=30,                                     +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'New Core',                                             +        
               POS=(18,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Qty',                                                  +        
               POS=(18,19),LTH=3,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'DC code',                                              +        
               POS=(18,27),LTH=7,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Scr',                                                  +        
               POS=(18,38),LTH=3,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Approved report (yes)',                                +        
               POS=(18,57),LTH=21,                                     +        
               ATTR=(PROT)                                                      
DGIA0005 DFLD  POS=(19,2),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
BYTRAD73 DFLD  POS=(19,12),LTH=5,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0001 DFLD  POS=(19,19),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0000 DFLD  POS=(19,26),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
FLSKROT  DFLD  POS=(19,39),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0004 DFLD  POS=(19,57),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  ' 6 Back          7 First page',                        +        
               POS=(21,2),LTH=29,                                      +        
               ATTR=(PROT)                                                      
         DFLD  ' 8 Forward         9              10 WHELP   ',        +        
               POS=(21,34),LTH=45,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '13 Status-scr   14 Approval',                          +        
               POS=(22,2),LTH=27,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '15 Identification 16              17         ',        +        
               POS=(22,34),LTH=45,                                     +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W3O172N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W3N172,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W3I172N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W3N172                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  DGIA0002,                                               +        
               LTH=4                                                            
         MFLD  DGIA0003,                                               +        
               LTH=4                                                            
         MFLD  DGIA0006,                                               +        
               LTH=7                                                            
         MFLD  DGIA0008,                                               +        
               LTH=7                                                            
         MFLD  KDPRT,                                                  +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLAGGA,                                                 +        
               LTH=1                                                            
         MFLD  IDKUNDNR,                                               +        
               LTH=7                                                            
         MFLD  IDFAKTNR,                                               +        
               LTH=7                                                            
         MFLD  DGIA0007,                                               +        
               LTH=1                                                            
         MFLD  IDUSER,                                                 +        
               LTH=8                                                            
         MFLD  SELECT1,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OBJNR1,                                                 +        
               LTH=9                                                            
         MFLD  POINT1,                                                 +        
               LTH=6                                                            
         MFLD  ANTALU1,                                                +        
               LTH=3                                                            
         MFLD  ANTALG1,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  STATUS1,                                                +        
               LTH=1                                                            
         MFLD  ANMARK1,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLSKRO1,                                                +        
               LTH=1                                                            
         MFLD  BENAM1,                                                 +        
               LTH=20                                                           
         MFLD  BYTRAD1,                                                +        
               LTH=5                                                            
         MFLD  RADREF1,                                                +        
               LTH=10                                                           
         MFLD  FLLOKA1,                                                +        
               LTH=1                                                            
         MFLD  TABNR1,                                                 +        
               LTH=3                                                            
         MFLD  SELECT2,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OBJNR2,                                                 +        
               LTH=9                                                            
         MFLD  POINT2,                                                 +        
               LTH=6                                                            
         MFLD  ANTALU2,                                                +        
               LTH=3                                                            
         MFLD  ANTALG2,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  STATUS2,                                                +        
               LTH=1                                                            
         MFLD  ANMARK2,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLSKRO2,                                                +        
               LTH=1                                                            
         MFLD  BENAM2,                                                 +        
               LTH=20                                                           
         MFLD  BYTRAD2,                                                +        
               LTH=5                                                            
         MFLD  RADREF2,                                                +        
               LTH=10                                                           
         MFLD  FLLOKA2,                                                +        
               LTH=1                                                            
         MFLD  TABNR2,                                                 +        
               LTH=3                                                            
         MFLD  SELECT3,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OBJNR3,                                                 +        
               LTH=9                                                            
         MFLD  POINT3,                                                 +        
               LTH=6                                                            
         MFLD  ANTALU3,                                                +        
               LTH=3                                                            
         MFLD  ANTALG3,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  STATUS3,                                                +        
               LTH=1                                                            
         MFLD  ANMARK3,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLSKRO3,                                                +        
               LTH=1                                                            
         MFLD  BENAM3,                                                 +        
               LTH=20                                                           
         MFLD  BYTRAD3,                                                +        
               LTH=5                                                            
         MFLD  RADREF3,                                                +        
               LTH=10                                                           
         MFLD  FLLOKA3,                                                +        
               LTH=1                                                            
         MFLD  TABNR3,                                                 +        
               LTH=3                                                            
         MFLD  SELECT4,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OBJNR4,                                                 +        
               LTH=9                                                            
         MFLD  POINT4,                                                 +        
               LTH=6                                                            
         MFLD  ANTALU4,                                                +        
               LTH=3                                                            
         MFLD  ANTALG4,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  STATUS4,                                                +        
               LTH=1                                                            
         MFLD  ANMARK4,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLSKRO4,                                                +        
               LTH=1                                                            
         MFLD  BENAM4,                                                 +        
               LTH=20                                                           
         MFLD  BYTRAD4,                                                +        
               LTH=5                                                            
         MFLD  RADREF4,                                                +        
               LTH=10                                                           
         MFLD  FLLOKA4,                                                +        
               LTH=1                                                            
         MFLD  TABNR4,                                                 +        
               LTH=3                                                            
         MFLD  SELECT5,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OBJNR5,                                                 +        
               LTH=9                                                            
         MFLD  POINT5,                                                 +        
               LTH=6                                                            
         MFLD  ANTALU5,                                                +        
               LTH=3                                                            
         MFLD  ANTALG5,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  STATUS5,                                                +        
               LTH=1                                                            
         MFLD  ANMARK5,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLSKRO5,                                                +        
               LTH=1                                                            
         MFLD  BENAM5,                                                 +        
               LTH=20                                                           
         MFLD  BYTRAD5,                                                +        
               LTH=5                                                            
         MFLD  RADREF5,                                                +        
               LTH=10                                                           
         MFLD  FLLOKA5,                                                +        
               LTH=1                                                            
         MFLD  TABNR5,                                                 +        
               LTH=3                                                            
         MFLD  SELECT6,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OBJNR6,                                                 +        
               LTH=9                                                            
         MFLD  POINT6,                                                 +        
               LTH=6                                                            
         MFLD  ANTALU6,                                                +        
               LTH=3                                                            
         MFLD  ANTALG6,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  STATUS6,                                                +        
               LTH=1                                                            
         MFLD  ANMARK6,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLSKRO6,                                                +        
               LTH=1                                                            
         MFLD  BENAM6,                                                 +        
               LTH=20                                                           
         MFLD  BYTRAD6,                                                +        
               LTH=5                                                            
         MFLD  RADREF6,                                                +        
               LTH=10                                                           
         MFLD  FLLOKA6,                                                +        
               LTH=1                                                            
         MFLD  TABNR6,                                                 +        
               LTH=3                                                            
         MFLD  SELECT7,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OBJNR7,                                                 +        
               LTH=9                                                            
         MFLD  POINT7,                                                 +        
               LTH=6                                                            
         MFLD  ANTALU7,                                                +        
               LTH=3                                                            
         MFLD  ANTALG7,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  STATUS7,                                                +        
               LTH=1                                                            
         MFLD  ANMARK7,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLSKRO7,                                                +        
               LTH=1                                                            
         MFLD  BENAM7,                                                 +        
               LTH=20                                                           
         MFLD  BYTRAD7,                                                +        
               LTH=5                                                            
         MFLD  RADREF7,                                                +        
               LTH=10                                                           
         MFLD  FLLOKA7,                                                +        
               LTH=1                                                            
         MFLD  TABNR7,                                                 +        
               LTH=3                                                            
         MFLD  SELECT8,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OBJNR8,                                                 +        
               LTH=9                                                            
         MFLD  POINT8,                                                 +        
               LTH=6                                                            
         MFLD  ANTALU8,                                                +        
               LTH=3                                                            
         MFLD  ANTALG8,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  STATUS8,                                                +        
               LTH=1                                                            
         MFLD  ANMARK8,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLSKRO8,                                                +        
               LTH=1                                                            
         MFLD  BENAM8,                                                 +        
               LTH=20                                                           
         MFLD  BYTRAD8,                                                +        
               LTH=5                                                            
         MFLD  RADREF8,                                                +        
               LTH=10                                                           
         MFLD  FLLOKA8,                                                +        
               LTH=1                                                            
         MFLD  TABNR8,                                                 +        
               LTH=3                                                            
         MFLD  SELECT9,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OBJNR9,                                                 +        
               LTH=9                                                            
         MFLD  POINT9,                                                 +        
               LTH=6                                                            
         MFLD  ANTALU9,                                                +        
               LTH=3                                                            
         MFLD  ANTALG9,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  STATUS9,                                                +        
               LTH=1                                                            
         MFLD  ANMARK9,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLSKRO9,                                                +        
               LTH=1                                                            
         MFLD  BENAM9,                                                 +        
               LTH=20                                                           
         MFLD  BYTRAD9,                                                +        
               LTH=5                                                            
         MFLD  RADREF9,                                                +        
               LTH=10                                                           
         MFLD  FLLOKA9,                                                +        
               LTH=1                                                            
         MFLD  TABNR9,                                                 +        
               LTH=3                                                            
         MFLD  TOTANTU,                                                +        
               LTH=4                                                            
         MFLD  TOTANTG,                                                +        
               LTH=4                                                            
         MFLD  TEXTRAD,                                                +        
               LTH=30                                                           
         MFLD  DGIA0005,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  BYTRAD73,                                               +        
               LTH=5                                                            
         MFLD  DGIA0001,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0000,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLSKROT,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0004,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W3I172N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W3N172),                                           +        
               OPT=2,                                                  +        
               NXT=W3O172N1                                                     
MID      LPAGE SOR=(W3N172)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F7'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '31722',                                                +        
               LTH=5                                                            
         MFLD  (DGIA0002,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0003,                                               +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0006,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0008,                                               +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDPRT,                                                 +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  FLAGGA,                                                 +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDKUNDNR,                                               +        
               LTH=7                                                            
         MFLD  IDFAKTNR,                                               +        
               LTH=7                                                            
         MFLD  (SELECT1,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  OBJNR1,                                                 +        
               LTH=9                                                            
         MFLD  POINT1,                                                 +        
               LTH=6                                                            
         MFLD  (ANTALG1,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  STATUS1,                                                +        
               LTH=1                                                            
         MFLD  (ANMARK1,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  FLSKRO1,                                                +        
               LTH=1                                                            
         MFLD  BYTRAD1,                                                +        
               LTH=5                                                            
         MFLD  TABNR1,                                                 +        
               LTH=3                                                            
         MFLD  (SELECT2,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  OBJNR2,                                                 +        
               LTH=9                                                            
         MFLD  POINT2,                                                 +        
               LTH=6                                                            
         MFLD  (ANTALG2,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  STATUS2,                                                +        
               LTH=1                                                            
         MFLD  (ANMARK2,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  FLSKRO2,                                                +        
               LTH=1                                                            
         MFLD  BYTRAD2,                                                +        
               LTH=5                                                            
         MFLD  TABNR2,                                                 +        
               LTH=3                                                            
         MFLD  (SELECT3,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  OBJNR3,                                                 +        
               LTH=9                                                            
         MFLD  POINT3,                                                 +        
               LTH=6                                                            
         MFLD  (ANTALG3,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  STATUS3,                                                +        
               LTH=1                                                            
         MFLD  (ANMARK3,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  FLSKRO3,                                                +        
               LTH=1                                                            
         MFLD  BYTRAD3,                                                +        
               LTH=5                                                            
         MFLD  TABNR3,                                                 +        
               LTH=3                                                            
         MFLD  (SELECT4,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  OBJNR4,                                                 +        
               LTH=9                                                            
         MFLD  POINT4,                                                 +        
               LTH=6                                                            
         MFLD  (ANTALG4,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  STATUS4,                                                +        
               LTH=1                                                            
         MFLD  (ANMARK4,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  FLSKRO4,                                                +        
               LTH=1                                                            
         MFLD  BYTRAD4,                                                +        
               LTH=5                                                            
         MFLD  TABNR4,                                                 +        
               LTH=3                                                            
         MFLD  (SELECT5,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  OBJNR5,                                                 +        
               LTH=9                                                            
         MFLD  POINT5,                                                 +        
               LTH=6                                                            
         MFLD  (ANTALG5,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  STATUS5,                                                +        
               LTH=1                                                            
         MFLD  (ANMARK5,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  FLSKRO5,                                                +        
               LTH=1                                                            
         MFLD  BYTRAD5,                                                +        
               LTH=5                                                            
         MFLD  TABNR5,                                                 +        
               LTH=3                                                            
         MFLD  (SELECT6,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  OBJNR6,                                                 +        
               LTH=9                                                            
         MFLD  POINT6,                                                 +        
               LTH=6                                                            
         MFLD  (ANTALG6,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  STATUS6,                                                +        
               LTH=1                                                            
         MFLD  (ANMARK6,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  FLSKRO6,                                                +        
               LTH=1                                                            
         MFLD  BYTRAD6,                                                +        
               LTH=5                                                            
         MFLD  TABNR6,                                                 +        
               LTH=3                                                            
         MFLD  (SELECT7,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  OBJNR7,                                                 +        
               LTH=9                                                            
         MFLD  POINT7,                                                 +        
               LTH=6                                                            
         MFLD  (ANTALG7,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  STATUS7,                                                +        
               LTH=1                                                            
         MFLD  (ANMARK7,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  FLSKRO7,                                                +        
               LTH=1                                                            
         MFLD  BYTRAD7,                                                +        
               LTH=5                                                            
         MFLD  TABNR7,                                                 +        
               LTH=3                                                            
         MFLD  (SELECT8,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  OBJNR8,                                                 +        
               LTH=9                                                            
         MFLD  POINT8,                                                 +        
               LTH=6                                                            
         MFLD  (ANTALG8,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  STATUS8,                                                +        
               LTH=1                                                            
         MFLD  (ANMARK8,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  FLSKRO8,                                                +        
               LTH=1                                                            
         MFLD  BYTRAD8,                                                +        
               LTH=5                                                            
         MFLD  TABNR8,                                                 +        
               LTH=3                                                            
         MFLD  (SELECT9,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  OBJNR9,                                                 +        
               LTH=9                                                            
         MFLD  POINT9,                                                 +        
               LTH=6                                                            
         MFLD  (ANTALG9,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  STATUS9,                                                +        
               LTH=1                                                            
         MFLD  (ANMARK9,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  FLSKRO9,                                                +        
               LTH=1                                                            
         MFLD  BYTRAD9,                                                +        
               LTH=5                                                            
         MFLD  TABNR9,                                                 +        
               LTH=3                                                            
         MFLD  (DGIA0005,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  BYTRAD73,                                               +        
               LTH=5                                                            
         MFLD  (DGIA0001,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0000,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLSKROT,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0004,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
