***********************************************************************         
* CREATED BY PCC6483   ON 99/12/07  AT 16:33                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'Exchange extended lead-time     '                               
W3N124   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W3T124 7',                                           +        
               8='W3T124 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W3T124U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,11)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'EXCHANGE EXTENDED LEAD-TIME',                          +        
               POS=(1,11),LTH=27,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Part no',                                              +        
               POS=(2,2),LTH=7,                                        +        
               ATTR=(ALPHA,PROT)                                                
ARTIN    DFLD  POS=(2,11),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
ARTUT    DFLD  POS=(3,11),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'C Part no   Ext lead-time(weeks)',                     +        
               POS=(5,2),LTH=32,                                       +        
               ATTR=(PROT)                                                      
CMD      DFLD  POS=(6,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
ARTUPD   DFLD  POS=(6,4),LTH=8,                                        +        
               ATTR=(NUM,NOPROT)                                                
WEEKUPD  DFLD  POS=(6,14),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Part no',                                              +        
               POS=(8,4),LTH=7,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'Ext lead-time(weeks)   User   Reg date',               +        
               POS=(8,42),LTH=38,                                      +        
               ATTR=(PROT)                                                      
ART1     DFLD  POS=(9,4),LTH=8,                                        +        
               ATTR=(PROT,MOD)                                                  
BEART1   DFLD  POS=(9,14),LTH=25,                                      +        
               ATTR=(PROT,MOD)                                                  
WEEK1    DFLD  POS=(9,42),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
USER1    DFLD  POS=(9,63),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
DATE1    DFLD  POS=(9,72),LTH=8,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
ART2     DFLD  POS=(10,4),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
BEART2   DFLD  POS=(10,14),LTH=25,                                     +        
               ATTR=(PROT,MOD)                                                  
WEEK2    DFLD  POS=(10,42),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
USER2    DFLD  POS=(10,63),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
DATE2    DFLD  POS=(10,72),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ART3     DFLD  POS=(11,4),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
BEART3   DFLD  POS=(11,14),LTH=25,                                     +        
               ATTR=(PROT,MOD)                                                  
WEEK3    DFLD  POS=(11,42),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
USER3    DFLD  POS=(11,63),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
DATE3    DFLD  POS=(11,72),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ART4     DFLD  POS=(12,4),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
BEART4   DFLD  POS=(12,14),LTH=25,                                     +        
               ATTR=(PROT,MOD)                                                  
WEEK4    DFLD  POS=(12,42),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
USER4    DFLD  POS=(12,63),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
DATE4    DFLD  POS=(12,72),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ART5     DFLD  POS=(13,4),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
BEART5   DFLD  POS=(13,14),LTH=25,                                     +        
               ATTR=(PROT,MOD)                                                  
WEEK5    DFLD  POS=(13,42),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
USER5    DFLD  POS=(13,63),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
DATE5    DFLD  POS=(13,72),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ART6     DFLD  POS=(14,4),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
BEART6   DFLD  POS=(14,14),LTH=25,                                     +        
               ATTR=(PROT,MOD)                                                  
WEEK6    DFLD  POS=(14,42),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
USER6    DFLD  POS=(14,63),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
DATE6    DFLD  POS=(14,72),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ART7     DFLD  POS=(15,4),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
BEART7   DFLD  POS=(15,14),LTH=25,                                     +        
               ATTR=(PROT,MOD)                                                  
WEEK7    DFLD  POS=(15,42),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
USER7    DFLD  POS=(15,63),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
DATE7    DFLD  POS=(15,72),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ART8     DFLD  POS=(16,4),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
BEART8   DFLD  POS=(16,14),LTH=25,                                     +        
               ATTR=(PROT,MOD)                                                  
WEEK8    DFLD  POS=(16,42),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
USER8    DFLD  POS=(16,63),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
DATE8    DFLD  POS=(16,72),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ART9     DFLD  POS=(17,4),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
BEART9   DFLD  POS=(17,14),LTH=25,                                     +        
               ATTR=(PROT,MOD)                                                  
WEEK9    DFLD  POS=(17,42),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
USER9    DFLD  POS=(17,63),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
DATE9    DFLD  POS=(17,72),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ART10    DFLD  POS=(18,4),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
BEART10  DFLD  POS=(18,14),LTH=25,                                     +        
               ATTR=(PROT,MOD)                                                  
WEEK10   DFLD  POS=(18,42),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
USER10   DFLD  POS=(18,63),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
DATE10   DFLD  POS=(18,72),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ART11    DFLD  POS=(19,4),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
BEART11  DFLD  POS=(19,14),LTH=25,                                     +        
               ATTR=(PROT,MOD)                                                  
WEEK11   DFLD  POS=(19,42),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
USER11   DFLD  POS=(19,63),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
DATE11   DFLD  POS=(19,72),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ART12    DFLD  POS=(20,4),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
BEART12  DFLD  POS=(20,14),LTH=25,                                     +        
               ATTR=(PROT,MOD)                                                  
WEEK12   DFLD  POS=(20,42),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
USER12   DFLD  POS=(20,63),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
DATE12   DFLD  POS=(20,72),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  'F7=First  F8=Next  F10=WHELP  F11=Update',             +        
               POS=(22,2),LTH=40,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(23,59),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W3O124N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W3N124,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W3I124N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  ARTIN,                                                  +        
               LTH=2                                                            
         MFLD  ARTUT,                                                  +        
               LTH=8                                                            
         MFLD  CMD,                                                    +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ARTUPD,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  WEEKUPD,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ART1,                                                   +        
               LTH=8                                                            
         MFLD  BEART1,                                                 +        
               LTH=25                                                           
         MFLD  WEEK1,                                                  +        
               LTH=2                                                            
         MFLD  USER1,                                                  +        
               LTH=8                                                            
         MFLD  DATE1,                                                  +        
               LTH=8                                                            
         MFLD  ART2,                                                   +        
               LTH=8                                                            
         MFLD  BEART2,                                                 +        
               LTH=25                                                           
         MFLD  WEEK2,                                                  +        
               LTH=2                                                            
         MFLD  USER2,                                                  +        
               LTH=8                                                            
         MFLD  DATE2,                                                  +        
               LTH=8                                                            
         MFLD  ART3,                                                   +        
               LTH=8                                                            
         MFLD  BEART3,                                                 +        
               LTH=25                                                           
         MFLD  WEEK3,                                                  +        
               LTH=2                                                            
         MFLD  USER3,                                                  +        
               LTH=8                                                            
         MFLD  DATE3,                                                  +        
               LTH=8                                                            
         MFLD  ART4,                                                   +        
               LTH=8                                                            
         MFLD  BEART4,                                                 +        
               LTH=25                                                           
         MFLD  WEEK4,                                                  +        
               LTH=2                                                            
         MFLD  USER4,                                                  +        
               LTH=8                                                            
         MFLD  DATE4,                                                  +        
               LTH=8                                                            
         MFLD  ART5,                                                   +        
               LTH=8                                                            
         MFLD  BEART5,                                                 +        
               LTH=25                                                           
         MFLD  WEEK5,                                                  +        
               LTH=2                                                            
         MFLD  USER5,                                                  +        
               LTH=8                                                            
         MFLD  DATE5,                                                  +        
               LTH=8                                                            
         MFLD  ART6,                                                   +        
               LTH=8                                                            
         MFLD  BEART6,                                                 +        
               LTH=25                                                           
         MFLD  WEEK6,                                                  +        
               LTH=2                                                            
         MFLD  USER6,                                                  +        
               LTH=8                                                            
         MFLD  DATE6,                                                  +        
               LTH=8                                                            
         MFLD  ART7,                                                   +        
               LTH=8                                                            
         MFLD  BEART7,                                                 +        
               LTH=25                                                           
         MFLD  WEEK7,                                                  +        
               LTH=2                                                            
         MFLD  USER7,                                                  +        
               LTH=8                                                            
         MFLD  DATE7,                                                  +        
               LTH=8                                                            
         MFLD  ART8,                                                   +        
               LTH=8                                                            
         MFLD  BEART8,                                                 +        
               LTH=25                                                           
         MFLD  WEEK8,                                                  +        
               LTH=2                                                            
         MFLD  USER8,                                                  +        
               LTH=8                                                            
         MFLD  DATE8,                                                  +        
               LTH=8                                                            
         MFLD  ART9,                                                   +        
               LTH=8                                                            
         MFLD  BEART9,                                                 +        
               LTH=25                                                           
         MFLD  WEEK9,                                                  +        
               LTH=2                                                            
         MFLD  USER9,                                                  +        
               LTH=8                                                            
         MFLD  DATE9,                                                  +        
               LTH=8                                                            
         MFLD  ART10,                                                  +        
               LTH=8                                                            
         MFLD  BEART10,                                                +        
               LTH=25                                                           
         MFLD  WEEK10,                                                 +        
               LTH=2                                                            
         MFLD  USER10,                                                 +        
               LTH=8                                                            
         MFLD  DATE10,                                                 +        
               LTH=8                                                            
         MFLD  ART11,                                                  +        
               LTH=8                                                            
         MFLD  BEART11,                                                +        
               LTH=25                                                           
         MFLD  WEEK11,                                                 +        
               LTH=2                                                            
         MFLD  USER11,                                                 +        
               LTH=8                                                            
         MFLD  DATE11,                                                 +        
               LTH=8                                                            
         MFLD  ART12,                                                  +        
               LTH=8                                                            
         MFLD  BEART12,                                                +        
               LTH=25                                                           
         MFLD  WEEK12,                                                 +        
               LTH=2                                                            
         MFLD  USER12,                                                 +        
               LTH=8                                                            
         MFLD  DATE12,                                                 +        
               LTH=8                                                            
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W3I124N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W3N124),                                           +        
               OPT=2,                                                  +        
               NXT=W3O124N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '31242',                                                +        
               LTH=5                                                            
         MFLD  (ARTIN,                                                 +        
               '++++++++++'),                                          +        
               LTH=8,                                                  +        
               JUST=R                                                           
         MFLD  (CMD,                                                   +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (ARTUPD,                                                +        
               '++++++++++'),                                          +        
               LTH=8,                                                  +        
               JUST=R                                                           
         MFLD  (WEEKUPD,                                               +        
               '++++++'),                                              +        
               LTH=2,                                                  +        
               JUST=R                                                           
         MSGEND                                                                 
         END                                                                    
