***********************************************************************         
* CREATED BY V068246   ON 00/01/21  AT 18:10                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'RECEIVING CODES                 '                               
W3N127   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W3T127 7',                                           +        
               8='W3T127 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'EXCHANGE PENDING INV\CRED',                            +        
               POS=(1,11),LTH=25,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'District:',                                            +        
               POS=(2,2),LTH=9,                                        +        
               ATTR=(NUM,PROT)                                                  
DISTIN   DFLD  POS=(2,12),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'PartNo:',                                              +        
               POS=(2,17),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
PARTIN   DFLD  POS=(2,25),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Inv-Cre:',                                             +        
               POS=(2,38),LTH=8,                                       +        
               ATTR=(PROT)                                                      
TYPIN    DFLD  POS=(2,47),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  '(Fak:Kre)',                                            +        
               POS=(2,51),LTH=9,                                       +        
               ATTR=(NUM,PROT)                                                  
DISTUT   DFLD  POS=(3,12),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
PARTUT   DFLD  POS=(3,25),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
TYPUT    DFLD  POS=(3,47),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Type   Cust    Partno    Description',                 +        
               POS=(5,2),LTH=36,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Quant   DC Date',                                      +        
               POS=(5,53),LTH=15,                                      +        
               ATTR=(PROT)                                                      
PTYP01   DFLD  POS=(6,2),LTH=3,                                        +        
               ATTR=(PROT)                                                      
CUST01   DFLD  POS=(6,9),LTH=7,                                        +        
               ATTR=(PROT)                                                      
PART01   DFLD  POS=(6,17),LTH=9,                                       +        
               ATTR=(NUM,PROT)                                                  
DESC01   DFLD  POS=(6,27),LTH=25,                                      +        
               ATTR=(NUM,PROT)                                                  
QNTY01   DFLD  POS=(6,53),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
DC0001   DFLD  POS=(6,61),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DATE01   DFLD  POS=(6,64),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
PTYP02   DFLD  POS=(7,2),LTH=3,                                        +        
               ATTR=(PROT)                                                      
CUST02   DFLD  POS=(7,9),LTH=7,                                        +        
               ATTR=(PROT)                                                      
PART02   DFLD  POS=(7,17),LTH=9,                                       +        
               ATTR=(NUM,PROT)                                                  
DESC02   DFLD  POS=(7,27),LTH=25,                                      +        
               ATTR=(NUM,PROT)                                                  
QNTY02   DFLD  POS=(7,53),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
DC0002   DFLD  POS=(7,61),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DATE02   DFLD  POS=(7,64),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
PTYP03   DFLD  POS=(8,2),LTH=3,                                        +        
               ATTR=(PROT)                                                      
CUST03   DFLD  POS=(8,9),LTH=7,                                        +        
               ATTR=(PROT)                                                      
PART03   DFLD  POS=(8,17),LTH=9,                                       +        
               ATTR=(NUM,PROT)                                                  
DESC03   DFLD  POS=(8,27),LTH=25,                                      +        
               ATTR=(NUM,PROT)                                                  
QNTY03   DFLD  POS=(8,53),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
DC0003   DFLD  POS=(8,61),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DATE03   DFLD  POS=(8,64),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
PTYP04   DFLD  POS=(9,2),LTH=3,                                        +        
               ATTR=(PROT)                                                      
CUST04   DFLD  POS=(9,9),LTH=7,                                        +        
               ATTR=(PROT)                                                      
PART04   DFLD  POS=(9,17),LTH=9,                                       +        
               ATTR=(NUM,PROT)                                                  
DESC04   DFLD  POS=(9,27),LTH=25,                                      +        
               ATTR=(NUM,PROT)                                                  
QNTY04   DFLD  POS=(9,53),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
DC0004   DFLD  POS=(9,61),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DATE04   DFLD  POS=(9,64),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
PTYP05   DFLD  POS=(10,2),LTH=3,                                       +        
               ATTR=(PROT)                                                      
CUST05   DFLD  POS=(10,9),LTH=7,                                       +        
               ATTR=(PROT)                                                      
PART05   DFLD  POS=(10,17),LTH=9,                                      +        
               ATTR=(NUM,PROT)                                                  
DESC05   DFLD  POS=(10,27),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
QNTY05   DFLD  POS=(10,53),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DC0005   DFLD  POS=(10,61),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DATE05   DFLD  POS=(10,64),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
PTYP06   DFLD  POS=(11,2),LTH=3,                                       +        
               ATTR=(PROT)                                                      
CUST06   DFLD  POS=(11,9),LTH=7,                                       +        
               ATTR=(PROT)                                                      
PART06   DFLD  POS=(11,17),LTH=9,                                      +        
               ATTR=(NUM,PROT)                                                  
DESC06   DFLD  POS=(11,27),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
QNTY06   DFLD  POS=(11,53),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DC0006   DFLD  POS=(11,61),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DATE06   DFLD  POS=(11,64),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
PTYP07   DFLD  POS=(12,2),LTH=3,                                       +        
               ATTR=(PROT)                                                      
CUST07   DFLD  POS=(12,9),LTH=7,                                       +        
               ATTR=(PROT)                                                      
PART07   DFLD  POS=(12,17),LTH=9,                                      +        
               ATTR=(NUM,PROT)                                                  
DESC07   DFLD  POS=(12,27),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
QNTY07   DFLD  POS=(12,53),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DC0007   DFLD  POS=(12,61),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DATE07   DFLD  POS=(12,64),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
PTYP08   DFLD  POS=(13,2),LTH=3,                                       +        
               ATTR=(PROT)                                                      
CUST08   DFLD  POS=(13,9),LTH=7,                                       +        
               ATTR=(PROT)                                                      
PART08   DFLD  POS=(13,17),LTH=9,                                      +        
               ATTR=(NUM,PROT)                                                  
DESC08   DFLD  POS=(13,27),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
QNTY08   DFLD  POS=(13,53),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DC0008   DFLD  POS=(13,61),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DATE08   DFLD  POS=(13,64),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
PTYP09   DFLD  POS=(14,2),LTH=3,                                       +        
               ATTR=(PROT)                                                      
CUST09   DFLD  POS=(14,9),LTH=7,                                       +        
               ATTR=(PROT)                                                      
PART09   DFLD  POS=(14,17),LTH=9,                                      +        
               ATTR=(NUM,PROT)                                                  
DESC09   DFLD  POS=(14,27),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
QNTY09   DFLD  POS=(14,53),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DC0009   DFLD  POS=(14,61),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DATE09   DFLD  POS=(14,64),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
PTYP10   DFLD  POS=(15,2),LTH=3,                                       +        
               ATTR=(PROT)                                                      
CUST10   DFLD  POS=(15,9),LTH=7,                                       +        
               ATTR=(PROT)                                                      
PART10   DFLD  POS=(15,17),LTH=9,                                      +        
               ATTR=(NUM,PROT)                                                  
DESC10   DFLD  POS=(15,27),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
QNTY10   DFLD  POS=(15,53),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DC0010   DFLD  POS=(15,61),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DATE10   DFLD  POS=(15,64),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
PTYP11   DFLD  POS=(16,2),LTH=3,                                       +        
               ATTR=(PROT)                                                      
CUST11   DFLD  POS=(16,9),LTH=7,                                       +        
               ATTR=(PROT)                                                      
PART11   DFLD  POS=(16,17),LTH=9,                                      +        
               ATTR=(NUM,PROT)                                                  
DESC11   DFLD  POS=(16,27),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
QNTY11   DFLD  POS=(16,53),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DC0011   DFLD  POS=(16,61),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DATE11   DFLD  POS=(16,64),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
PTYP12   DFLD  POS=(17,2),LTH=3,                                       +        
               ATTR=(PROT)                                                      
CUST12   DFLD  POS=(17,9),LTH=7,                                       +        
               ATTR=(PROT)                                                      
PART12   DFLD  POS=(17,17),LTH=9,                                      +        
               ATTR=(NUM,PROT)                                                  
DESC12   DFLD  POS=(17,27),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
QNTY12   DFLD  POS=(17,53),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DC0012   DFLD  POS=(17,61),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DATE12   DFLD  POS=(17,64),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
PTYP13   DFLD  POS=(18,2),LTH=3,                                       +        
               ATTR=(PROT)                                                      
CUST13   DFLD  POS=(18,9),LTH=7,                                       +        
               ATTR=(PROT)                                                      
PART13   DFLD  POS=(18,17),LTH=9,                                      +        
               ATTR=(NUM,PROT)                                                  
DESC13   DFLD  POS=(18,27),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
QNTY13   DFLD  POS=(18,53),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DC0013   DFLD  POS=(18,61),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DATE13   DFLD  POS=(18,64),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
PTYP14   DFLD  POS=(19,2),LTH=3,                                       +        
               ATTR=(PROT)                                                      
CUST14   DFLD  POS=(19,9),LTH=7,                                       +        
               ATTR=(PROT)                                                      
PART14   DFLD  POS=(19,17),LTH=9,                                      +        
               ATTR=(NUM,PROT)                                                  
DESC14   DFLD  POS=(19,27),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
QNTY14   DFLD  POS=(19,53),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DC0014   DFLD  POS=(19,61),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DATE14   DFLD  POS=(19,64),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'F7=First F8=Forward F10=WHELP',                        +        
               POS=(21,2),LTH=29,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(22,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(22,60),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(22,64),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD2373  DFLD  POS=(22,73),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FSYSMSG  DFLD  POS=(23,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W3O127N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W3N127,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W3I127N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  DISTIN,                                                 +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DISTUT,                                                 +        
               LTH=4                                                            
         MFLD  PARTIN,                                                 +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  PARTUT,                                                 +        
               LTH=9                                                            
         MFLD  TYPIN,                                                  +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TYPUT,                                                  +        
               LTH=3                                                            
         MFLD  PTYP01,                                                 +        
               LTH=3                                                            
         MFLD  CUST01,                                                 +        
               LTH=7                                                            
         MFLD  PART01,                                                 +        
               LTH=9                                                            
         MFLD  DESC01,                                                 +        
               LTH=25                                                           
         MFLD  QNTY01,                                                 +        
               LTH=7                                                            
         MFLD  DC0001,                                                 +        
               LTH=2                                                            
         MFLD  DATE01,                                                 +        
               LTH=8                                                            
         MFLD  PTYP02,                                                 +        
               LTH=3                                                            
         MFLD  CUST02,                                                 +        
               LTH=7                                                            
         MFLD  PART02,                                                 +        
               LTH=9                                                            
         MFLD  DESC02,                                                 +        
               LTH=25                                                           
         MFLD  QNTY02,                                                 +        
               LTH=7                                                            
         MFLD  DC0002,                                                 +        
               LTH=2                                                            
         MFLD  DATE02,                                                 +        
               LTH=8                                                            
         MFLD  PTYP03,                                                 +        
               LTH=3                                                            
         MFLD  CUST03,                                                 +        
               LTH=7                                                            
         MFLD  PART03,                                                 +        
               LTH=9                                                            
         MFLD  DESC03,                                                 +        
               LTH=25                                                           
         MFLD  QNTY03,                                                 +        
               LTH=7                                                            
         MFLD  DC0003,                                                 +        
               LTH=2                                                            
         MFLD  DATE03,                                                 +        
               LTH=8                                                            
         MFLD  PTYP04,                                                 +        
               LTH=3                                                            
         MFLD  CUST04,                                                 +        
               LTH=7                                                            
         MFLD  PART04,                                                 +        
               LTH=9                                                            
         MFLD  DESC04,                                                 +        
               LTH=25                                                           
         MFLD  QNTY04,                                                 +        
               LTH=7                                                            
         MFLD  DC0004,                                                 +        
               LTH=2                                                            
         MFLD  DATE04,                                                 +        
               LTH=8                                                            
         MFLD  PTYP05,                                                 +        
               LTH=3                                                            
         MFLD  CUST05,                                                 +        
               LTH=7                                                            
         MFLD  PART05,                                                 +        
               LTH=9                                                            
         MFLD  DESC05,                                                 +        
               LTH=25                                                           
         MFLD  QNTY05,                                                 +        
               LTH=7                                                            
         MFLD  DC0005,                                                 +        
               LTH=2                                                            
         MFLD  DATE05,                                                 +        
               LTH=8                                                            
         MFLD  PTYP06,                                                 +        
               LTH=3                                                            
         MFLD  CUST06,                                                 +        
               LTH=7                                                            
         MFLD  PART06,                                                 +        
               LTH=9                                                            
         MFLD  DESC06,                                                 +        
               LTH=25                                                           
         MFLD  QNTY06,                                                 +        
               LTH=7                                                            
         MFLD  DC0006,                                                 +        
               LTH=2                                                            
         MFLD  DATE06,                                                 +        
               LTH=8                                                            
         MFLD  PTYP07,                                                 +        
               LTH=3                                                            
         MFLD  CUST07,                                                 +        
               LTH=7                                                            
         MFLD  PART07,                                                 +        
               LTH=9                                                            
         MFLD  DESC07,                                                 +        
               LTH=25                                                           
         MFLD  QNTY07,                                                 +        
               LTH=7                                                            
         MFLD  DC0007,                                                 +        
               LTH=2                                                            
         MFLD  DATE07,                                                 +        
               LTH=8                                                            
         MFLD  PTYP08,                                                 +        
               LTH=3                                                            
         MFLD  CUST08,                                                 +        
               LTH=7                                                            
         MFLD  PART08,                                                 +        
               LTH=9                                                            
         MFLD  DESC08,                                                 +        
               LTH=25                                                           
         MFLD  QNTY08,                                                 +        
               LTH=7                                                            
         MFLD  DC0008,                                                 +        
               LTH=2                                                            
         MFLD  DATE08,                                                 +        
               LTH=8                                                            
         MFLD  PTYP09,                                                 +        
               LTH=3                                                            
         MFLD  CUST09,                                                 +        
               LTH=7                                                            
         MFLD  PART09,                                                 +        
               LTH=9                                                            
         MFLD  DESC09,                                                 +        
               LTH=25                                                           
         MFLD  QNTY09,                                                 +        
               LTH=7                                                            
         MFLD  DC0009,                                                 +        
               LTH=2                                                            
         MFLD  DATE09,                                                 +        
               LTH=8                                                            
         MFLD  PTYP10,                                                 +        
               LTH=3                                                            
         MFLD  CUST10,                                                 +        
               LTH=7                                                            
         MFLD  PART10,                                                 +        
               LTH=9                                                            
         MFLD  DESC10,                                                 +        
               LTH=25                                                           
         MFLD  QNTY10,                                                 +        
               LTH=7                                                            
         MFLD  DC0010,                                                 +        
               LTH=2                                                            
         MFLD  DATE10,                                                 +        
               LTH=8                                                            
         MFLD  PTYP11,                                                 +        
               LTH=3                                                            
         MFLD  CUST11,                                                 +        
               LTH=7                                                            
         MFLD  PART11,                                                 +        
               LTH=9                                                            
         MFLD  DESC11,                                                 +        
               LTH=25                                                           
         MFLD  QNTY11,                                                 +        
               LTH=7                                                            
         MFLD  DC0011,                                                 +        
               LTH=2                                                            
         MFLD  DATE11,                                                 +        
               LTH=8                                                            
         MFLD  PTYP12,                                                 +        
               LTH=3                                                            
         MFLD  CUST12,                                                 +        
               LTH=7                                                            
         MFLD  PART12,                                                 +        
               LTH=9                                                            
         MFLD  DESC12,                                                 +        
               LTH=25                                                           
         MFLD  QNTY12,                                                 +        
               LTH=7                                                            
         MFLD  DC0012,                                                 +        
               LTH=2                                                            
         MFLD  DATE12,                                                 +        
               LTH=8                                                            
         MFLD  PTYP13,                                                 +        
               LTH=3                                                            
         MFLD  CUST13,                                                 +        
               LTH=7                                                            
         MFLD  PART13,                                                 +        
               LTH=9                                                            
         MFLD  DESC13,                                                 +        
               LTH=25                                                           
         MFLD  QNTY13,                                                 +        
               LTH=7                                                            
         MFLD  DC0013,                                                 +        
               LTH=2                                                            
         MFLD  DATE13,                                                 +        
               LTH=8                                                            
         MFLD  PTYP14,                                                 +        
               LTH=3                                                            
         MFLD  CUST14,                                                 +        
               LTH=7                                                            
         MFLD  PART14,                                                 +        
               LTH=9                                                            
         MFLD  DESC14,                                                 +        
               LTH=25                                                           
         MFLD  QNTY14,                                                 +        
               LTH=7                                                            
         MFLD  DC0014,                                                 +        
               LTH=2                                                            
         MFLD  DATE14,                                                 +        
               LTH=8                                                            
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W3I127N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W3N127),                                           +        
               OPT=2,                                                  +        
               NXT=W3O127N1                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F7'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '31272',                                                +        
               LTH=5                                                            
         MFLD  (DISTIN,                                                +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  DISTUT,                                                 +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PARTIN,                                                +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  PARTUT,                                                 +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TYPIN,                                                 +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  TYPUT,                                                  +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
