***********************************************************************         
* CREATED BY PCC6483   ON 00/05/10  AT 14:59                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'POINT PRM MAINTENANCE           '                               
W3N126   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0t501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W3T126U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((7,42)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'EXCHANGE POINT PARAMETERS',                            +        
               POS=(1,11),LTH=25,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Userid',                                               +        
               POS=(2,2),LTH=6,                                        +        
               ATTR=(NUM,PROT)                                                  
USERIN   DFLD  POS=(2,9),LTH=8,                                        +        
               ATTR=(PROT)                                                      
USERUT   DFLD  POS=(3,9),LTH=8,                                        +        
               ATTR=(PROT,MOD)                                                  
         DFLD  '1. Exchange-Point-Report to be printed:',              +        
               POS=(7,2),LTH=39,                                       +        
               ATTR=(PROT)                                                      
FLREP    DFLD  POS=(7,42),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  '(Y or N)',                                             +        
               POS=(7,46),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '2. Update-Block on existing parts',                    +        
               POS=(8,2),LTH=33,                                       +        
               ATTR=(PROT)                                                      
         DFLD  ':',                                                    +        
               POS=(8,40),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLBLOCK  DFLD  POS=(8,42),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  '(Y or N)',                                             +        
               POS=(8,46),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '3. Gross-Price-Units Per Point',                       +        
               POS=(10,2),LTH=30,                                      +        
               ATTR=(PROT)                                                      
         DFLD  ':',                                                    +        
               POS=(10,40),LTH=1,                                      +        
               ATTR=(PROT)                                                      
REPOINT  DFLD  POS=(10,42),LTH=10,                                     +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '4. Invoicing weeks',                                   +        
               POS=(12,2),LTH=18,                                      +        
               ATTR=(PROT)                                                      
         DFLD  ':',                                                    +        
               POS=(12,40),LTH=1,                                      +        
               ATTR=(PROT)                                                      
WEEK1    DFLD  POS=(12,42),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
WEEK2    DFLD  POS=(13,42),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
WEEK3    DFLD  POS=(14,42),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
WEEK4    DFLD  POS=(15,42),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '5. memo/e-mail:',                                      +        
               POS=(18,2),LTH=15,                                      +        
               ATTR=(PROT)                                                      
IDMAIL   DFLD  POS=(18,18),LTH=60,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'F10=WHELP  F11=Update',                                +        
               POS=(21,2),LTH=21,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(22,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(22,60),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(22,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(22,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(23,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W3O126N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W3N126,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W3I126N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  USERIN,                                                 +        
               LTH=8                                                            
         MFLD  USERUT,                                                 +        
               LTH=8                                                            
         MFLD  FLREP,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLBLOCK,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  REPOINT,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  WEEK1,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  WEEK2,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  WEEK3,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  WEEK4,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDMAIL,                                                 +        
               LTH=62,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W3I126N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W3N126),                                           +        
               OPT=2,                                                  +        
               NXT=W3O126N1                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '31262',                                                +        
               LTH=5                                                            
         MFLD  (USERIN,                                                +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (USERUT,                                                +        
               '        '),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLREP,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLBLOCK,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (REPOINT,                                               +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (WEEK1,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (WEEK2,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (WEEK3,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (WEEK4,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDMAIL,                                                +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++'),                                                +        
               LTH=60,                                                 +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
