*          DATA SET W3N162FII0 AT LEVEL 003 AS OF 89/09/18                      
         PRINT NOGEN                                                            
W3N162   FMT                                                                    
         DEV   TYPE=(3270,2),                                          *        
               FEAT=IGNORE,                                            *        
               PFK=(FLDPFK,'W0T501  ','W0T501  ','W0T501  ','W0T501  ',*        
               'W0T501  ','W0T501  ','W3T162 7','W3T162 8','W0T501  ', *        
               'WHELP   ','W0T501  ','/RCL.   ','W3T161  ','W3T162  ', *        
               'W0T501  ','W0T501  ','W0T501  ','W0T501  ','W0T501  ', *        
               'W0T501  ','W0T501  ','WHELP   ','W0T501  ','/RCL.   '),*        
               DSCA=X'0080',SYSMSG=FSYSMSG                                      
         DIV   TYPE=INOUT                                                       
         DPAGE CURSOR=((02,23)),                                       *        
               FILL=NONE                                                        
         ALPHA 'abcdefghijklmnopqrstuvxyzåäö'                                   
FLD0102  DFLD  POS=(01,02),LTH=0001,ATTR=(ALPHA,NOPROT,MOD)                     
FLD0104  DFLD  POS=(01,04),LTH=0001,ATTR=(NUM)                                  
FLD0106  DFLD  POS=(01,06),LTH=0001,ATTR=(NUM)                                  
FLD0108  DFLD  POS=(01,08),LTH=0001,ATTR=(NUM)                                  
         DFLD  'SEARCH EXCH FOREIGN DESIGNATN',                        *        
               POS=(01,11),LTH=0029,ATTR=(NUM,PROT)                             
FLD0141  DFLD  POS=(01,41),LTH=0040,ATTR=(NUM,PROT,HI)                          
         DFLD  'Foreign designation:',                                 *        
               POS=(02,02),LTH=0020,ATTR=(NUM,PROT)                             
FLD0223  DFLD  POS=(02,23),LTH=0018,ATTR=(ALPHA)                                
FLD0323  DFLD  POS=(03,23),LTH=0017,ATTR=(NUM,PROT,MOD)                         
FLD0402  DFLD  POS=(04,02),LTH=0030,ATTR=(NUM,PROT,MOD,NODISP)                  
FLD0433  DFLD  POS=(04,33),LTH=0030,ATTR=(NUM,PROT,MOD,NODISP)                  
         DFLD  'Foreign designation                Article term     ', *        
               POS=(05,02),LTH=0052,ATTR=(NUM,PROT)                             
         DO    14,SUF=06                                                        
COL02    DFLD  POS=(06,02),LTH=0070,ATTR=(NUM,PROT)                             
         ENDDO                                                                  
         DFLD  '13 Foreign desi 14 Srch foreign 15              16     *        
                        17              18              19             *        
                20              21               9           ',        *        
               POS=(21,02),LTH=0157,ATTR=(NUM,PROT)                             
FLD2302  DFLD  POS=(23,02),LTH=0055,ATTR=(NUM,PROT,HI)                          
         DFLD  ' VCP ',POS=(23,58)                                              
FLD2364  DFLD  POS=(23,64),LTH=0008,ATTR=(NUM,PROT)                             
FLD2373  DFLD  POS=(23,73),LTH=0008,ATTR=(NUM,PROT)                             
FSYSMSG  DFLD  POS=(24,02),LTH=0079,ATTR=(NUM,PROT,HI)                          
         FMTEND                                                                 
         EJECT                                                                  
W3O162N1 MSG   TYPE=OUTPUT,                                            *        
               SOR=(W3N162,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W3I162N1,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  FLD0102,LTH=0001                                                 
         MFLD  FLD0104,LTH=0001                                                 
         MFLD  FLD0106,LTH=0001                                                 
         MFLD  FLD0108,LTH=0001                                                 
         MFLD  FLD0141,LTH=0040                                                 
         MFLD  FLD0223,LTH=0002                                                 
         MFLD  FLD0323,LTH=0030                                                 
         MFLD  FLD0402,LTH=0030                                                 
         MFLD  FLD0433,LTH=0030                                                 
         DO    14,SUF=06                                                        
         MFLD  COL02,LTH=0070                                                   
         ENDDO                                                                  
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W3I162N1 MSG   TYPE=INPUT,                                             *        
               SOR=W3N162,                                             *        
               OPT=2,                                                  *        
               NXT=W3O162N1                                                     
         SEG                                                                    
         MFLD  FLDPFK,LTH=008,FILL=NULL                                         
         MFLD  'W',LTH=001                                                      
         MFLD  FLD0102,LTH=0001,FILL=C'3'                                       
         MFLD  'T',LTH=001                                                      
         MFLD  FLD0104,LTH=0001,FILL=C'1'                                       
         MFLD  FLD0106,LTH=0001,FILL=C'6'                                       
         MFLD  FLD0108,LTH=0001,FILL=C'2'                                       
         MFLD  '  ',LTH=002                                                     
         MFLD  '31622',LTH=0005                                                 
         MFLD  (FLD0223,'++++++++++++++++++++++++++++++++++++++++'),   *        
               LTH=0030,FILL=C'%',JUST=L                                        
         MFLD  FLD0323,LTH=0030,FILL=C' ',JUST=L                                
         MFLD  FLD0402,LTH=0030,FILL=C' ',JUST=L                                
         MFLD  FLD0433,LTH=0030,FILL=C' ',JUST=L                                
         MSGEND                                                                 
         EJECT                                                                  
         END                                                                    
