***********************************************************************         
* CREATED BY V068246   ON 01/05/23  AT 14:39                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'HISTORY OF GOODS RECIEVED       '                               
W3N177   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W3T177 7',                                           +        
               8='W3T177 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W3N177   DPAGE CURSOR=((2,10)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Exchange History',                                     +        
               POS=(1,10),LTH=16,                                      +        
               ATTR=(NUM,PROT)                                                  
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Core no',                                              +        
               POS=(2,2),LTH=7,                                        +        
               ATTR=(NUM,PROT)                                                  
ARTIN    DFLD  POS=(2,10),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Dist',                                                 +        
               POS=(2,20),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
DISTIN   DFLD  POS=(2,25),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Cust',                                                 +        
               POS=(2,30),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
KUNDIN   DFLD  POS=(2,35),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Report',                                               +        
               POS=(2,42),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
RAPPIN   DFLD  POS=(2,49),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Status',                                               +        
               POS=(2,57),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
STATUSIN DFLD  POS=(2,64),LTH=1,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Iddc',                                                 +        
               POS=(2,67),LTH=4,                                       +        
               ATTR=(PROT)                                                      
IDDCIN   DFLD  POS=(2,72),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
ARTUT    DFLD  POS=(3,10),LTH=9,                                       +        
               ATTR=(PROT)                                                      
DISTUT   DFLD  POS=(3,25),LTH=4,                                       +        
               ATTR=(PROT)                                                      
KUNDUT   DFLD  POS=(3,35),LTH=6,                                       +        
               ATTR=(PROT)                                                      
RAPPUT   DFLD  POS=(3,49),LTH=7,                                       +        
               ATTR=(PROT)                                                      
STATUSUT DFLD  POS=(3,64),LTH=1,                                       +        
               ATTR=(PROT)                                                      
IDDCUT   DFLD  POS=(3,72),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'S Dist   Cust   Report    Reg    Arr   Appr S W',      +        
               POS=(5,2),LTH=47,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Qty',                                                  +        
               POS=(5,54),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Qty Code',                                             +        
               POS=(5,62),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'date   date   date',                                   +        
               POS=(6,27),LTH=18,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'org    hand',                                          +        
               POS=(6,54),LTH=11,                                      +        
               ATTR=(PROT)                                                      
SELECT1  DFLD  POS=(7,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
DIST1    DFLD  POS=(7,4),LTH=4,                                        +        
               ATTR=(NUM,PROT)                                                  
KUND1    DFLD  POS=(7,9),LTH=6,                                        +        
               ATTR=(NUM,PROT)                                                  
REP1     DFLD  POS=(7,17),LTH=7,                                       +        
               ATTR=(PROT)                                                      
REG1     DFLD  POS=(7,25),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
ARR1     DFLD  POS=(7,32),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
APR1     DFLD  POS=(7,39),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
STA1     DFLD  POS=(7,46),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
GAR1     DFLD  POS=(7,48),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
QO1      DFLD  POS=(7,50),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
QH1      DFLD  POS=(7,58),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
K1       DFLD  POS=(7,66),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
SELECT2  DFLD  POS=(8,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
DIST2    DFLD  POS=(8,4),LTH=4,                                        +        
               ATTR=(NUM,PROT)                                                  
KUND2    DFLD  POS=(8,9),LTH=6,                                        +        
               ATTR=(NUM,PROT)                                                  
REP2     DFLD  POS=(8,17),LTH=7,                                       +        
               ATTR=(PROT)                                                      
REG2     DFLD  POS=(8,25),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
ARR2     DFLD  POS=(8,32),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
APR2     DFLD  POS=(8,39),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
STA2     DFLD  POS=(8,46),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
GAR2     DFLD  POS=(8,48),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
QO2      DFLD  POS=(8,50),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
QH2      DFLD  POS=(8,58),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
K2       DFLD  POS=(8,66),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
SELECT3  DFLD  POS=(9,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
DIST3    DFLD  POS=(9,4),LTH=4,                                        +        
               ATTR=(NUM,PROT)                                                  
KUND3    DFLD  POS=(9,9),LTH=6,                                        +        
               ATTR=(NUM,PROT)                                                  
REP3     DFLD  POS=(9,17),LTH=7,                                       +        
               ATTR=(PROT)                                                      
REG3     DFLD  POS=(9,25),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
ARR3     DFLD  POS=(9,32),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
APR3     DFLD  POS=(9,39),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
STA3     DFLD  POS=(9,46),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
GAR3     DFLD  POS=(9,48),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
QO3      DFLD  POS=(9,50),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
QH3      DFLD  POS=(9,58),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
K3       DFLD  POS=(9,66),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
SELECT4  DFLD  POS=(10,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DIST4    DFLD  POS=(10,4),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
KUND4    DFLD  POS=(10,9),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
REP4     DFLD  POS=(10,17),LTH=7,                                      +        
               ATTR=(PROT)                                                      
REG4     DFLD  POS=(10,25),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
ARR4     DFLD  POS=(10,32),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
APR4     DFLD  POS=(10,39),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
STA4     DFLD  POS=(10,46),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
GAR4     DFLD  POS=(10,48),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
QO4      DFLD  POS=(10,50),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
QH4      DFLD  POS=(10,58),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
K4       DFLD  POS=(10,66),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
SELECT5  DFLD  POS=(11,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DIST5    DFLD  POS=(11,4),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
KUND5    DFLD  POS=(11,9),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
REP5     DFLD  POS=(11,17),LTH=7,                                      +        
               ATTR=(PROT)                                                      
REG5     DFLD  POS=(11,25),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
ARR5     DFLD  POS=(11,32),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
APR5     DFLD  POS=(11,39),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
STA5     DFLD  POS=(11,46),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
GAR5     DFLD  POS=(11,48),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
QO5      DFLD  POS=(11,50),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
QH5      DFLD  POS=(11,58),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
K5       DFLD  POS=(11,66),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
SELECT6  DFLD  POS=(12,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DIST6    DFLD  POS=(12,4),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
KUND6    DFLD  POS=(12,9),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
REP6     DFLD  POS=(12,17),LTH=7,                                      +        
               ATTR=(PROT)                                                      
REG6     DFLD  POS=(12,25),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
ARR6     DFLD  POS=(12,32),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
APR6     DFLD  POS=(12,39),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
STA6     DFLD  POS=(12,46),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
GAR6     DFLD  POS=(12,48),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
QO6      DFLD  POS=(12,50),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
QH6      DFLD  POS=(12,58),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
K6       DFLD  POS=(12,66),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
SELECT7  DFLD  POS=(13,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DIST7    DFLD  POS=(13,4),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
KUND7    DFLD  POS=(13,9),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
REP7     DFLD  POS=(13,17),LTH=7,                                      +        
               ATTR=(PROT)                                                      
REG7     DFLD  POS=(13,25),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
ARR7     DFLD  POS=(13,32),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
APR7     DFLD  POS=(13,39),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
STA7     DFLD  POS=(13,46),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
GAR7     DFLD  POS=(13,48),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
QO7      DFLD  POS=(13,50),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
QH7      DFLD  POS=(13,58),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
K7       DFLD  POS=(13,66),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
SELECT8  DFLD  POS=(14,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DIST8    DFLD  POS=(14,4),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
KUND8    DFLD  POS=(14,9),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
REP8     DFLD  POS=(14,17),LTH=7,                                      +        
               ATTR=(PROT)                                                      
REG8     DFLD  POS=(14,25),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
ARR8     DFLD  POS=(14,32),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
APR8     DFLD  POS=(14,39),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
STA8     DFLD  POS=(14,46),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
GAR8     DFLD  POS=(14,48),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
QO8      DFLD  POS=(14,50),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
QH8      DFLD  POS=(14,58),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
K8       DFLD  POS=(14,66),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
SELECT9  DFLD  POS=(15,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DIST9    DFLD  POS=(15,4),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
KUND9    DFLD  POS=(15,9),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
REP9     DFLD  POS=(15,17),LTH=7,                                      +        
               ATTR=(PROT)                                                      
REG9     DFLD  POS=(15,25),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
ARR9     DFLD  POS=(15,32),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
APR9     DFLD  POS=(15,39),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
STA9     DFLD  POS=(15,46),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
GAR9     DFLD  POS=(15,48),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
QO9      DFLD  POS=(15,50),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
QH9      DFLD  POS=(15,58),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
K9       DFLD  POS=(15,66),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
SELECT10 DFLD  POS=(16,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DIST10   DFLD  POS=(16,4),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
KUND10   DFLD  POS=(16,9),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
REP10    DFLD  POS=(16,17),LTH=7,                                      +        
               ATTR=(PROT)                                                      
REG10    DFLD  POS=(16,25),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
ARR10    DFLD  POS=(16,32),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
APR10    DFLD  POS=(16,39),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
STA10    DFLD  POS=(16,46),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
GAR10    DFLD  POS=(16,48),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
QO10     DFLD  POS=(16,50),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
QH10     DFLD  POS=(16,58),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
K10      DFLD  POS=(16,66),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
SELECT11 DFLD  POS=(17,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DIST11   DFLD  POS=(17,4),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
KUND11   DFLD  POS=(17,9),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
REP11    DFLD  POS=(17,17),LTH=7,                                      +        
               ATTR=(PROT)                                                      
REG11    DFLD  POS=(17,25),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
ARR11    DFLD  POS=(17,32),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
APR11    DFLD  POS=(17,39),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
STA11    DFLD  POS=(17,46),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
GAR11    DFLD  POS=(17,48),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
QO11     DFLD  POS=(17,50),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
QH11     DFLD  POS=(17,58),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
K11      DFLD  POS=(17,66),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
SELECT12 DFLD  POS=(18,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DIST12   DFLD  POS=(18,4),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
KUND12   DFLD  POS=(18,9),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
REP12    DFLD  POS=(18,17),LTH=7,                                      +        
               ATTR=(PROT)                                                      
REG12    DFLD  POS=(18,25),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
ARR12    DFLD  POS=(18,32),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
APR12    DFLD  POS=(18,39),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
STA12    DFLD  POS=(18,46),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
GAR12    DFLD  POS=(18,48),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
QO12     DFLD  POS=(18,50),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
QH12     DFLD  POS=(18,58),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
K12      DFLD  POS=(18,66),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
SELECT13 DFLD  POS=(19,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DIST13   DFLD  POS=(19,4),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
KUND13   DFLD  POS=(19,9),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
REP13    DFLD  POS=(19,17),LTH=7,                                      +        
               ATTR=(PROT)                                                      
REG13    DFLD  POS=(19,25),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
ARR13    DFLD  POS=(19,32),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
APR13    DFLD  POS=(19,39),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
STA13    DFLD  POS=(19,46),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
GAR13    DFLD  POS=(19,48),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
QO13     DFLD  POS=(19,50),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
QH13     DFLD  POS=(19,58),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
K13      DFLD  POS=(19,66),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  '13',                                                   +        
               POS=(21,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '14',                                                   +        
               POS=(21,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '15',                                                   +        
               POS=(21,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16',                                                   +        
               POS=(21,52),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,68),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,52),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 Whelp',                                             +        
               POS=(22,68),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W3O177N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W3N177,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W3I177N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W3N177                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  ARTIN,                                                  +        
               LTH=9                                                            
         MFLD  DISTIN,                                                 +        
               LTH=4                                                            
         MFLD  KUNDIN,                                                 +        
               LTH=6                                                            
         MFLD  RAPPIN,                                                 +        
               LTH=7                                                            
         MFLD  STATUSIN,                                               +        
               LTH=1                                                            
         MFLD  IDDCIN,                                                 +        
               LTH=2                                                            
         MFLD  ARTUT,                                                  +        
               LTH=9                                                            
         MFLD  DISTUT,                                                 +        
               LTH=4                                                            
         MFLD  KUNDUT,                                                 +        
               LTH=6                                                            
         MFLD  RAPPUT,                                                 +        
               LTH=7                                                            
         MFLD  STATUSUT,                                               +        
               LTH=1                                                            
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  SELECT1,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DIST1,                                                  +        
               LTH=4                                                            
         MFLD  KUND1,                                                  +        
               LTH=6                                                            
         MFLD  REP1,                                                   +        
               LTH=7                                                            
         MFLD  REG1,                                                   +        
               LTH=6                                                            
         MFLD  ARR1,                                                   +        
               LTH=6                                                            
         MFLD  APR1,                                                   +        
               LTH=6                                                            
         MFLD  STA1,                                                   +        
               LTH=1                                                            
         MFLD  GAR1,                                                   +        
               LTH=1                                                            
         MFLD  QO1,                                                    +        
               LTH=7                                                            
         MFLD  QH1,                                                    +        
               LTH=7                                                            
         MFLD  K1,                                                     +        
               LTH=3                                                            
         MFLD  SELECT2,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DIST2,                                                  +        
               LTH=4                                                            
         MFLD  KUND2,                                                  +        
               LTH=6                                                            
         MFLD  REP2,                                                   +        
               LTH=7                                                            
         MFLD  REG2,                                                   +        
               LTH=6                                                            
         MFLD  ARR2,                                                   +        
               LTH=6                                                            
         MFLD  APR2,                                                   +        
               LTH=6                                                            
         MFLD  STA2,                                                   +        
               LTH=1                                                            
         MFLD  GAR2,                                                   +        
               LTH=1                                                            
         MFLD  QO2,                                                    +        
               LTH=7                                                            
         MFLD  QH2,                                                    +        
               LTH=7                                                            
         MFLD  K2,                                                     +        
               LTH=3                                                            
         MFLD  SELECT3,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DIST3,                                                  +        
               LTH=4                                                            
         MFLD  KUND3,                                                  +        
               LTH=6                                                            
         MFLD  REP3,                                                   +        
               LTH=7                                                            
         MFLD  REG3,                                                   +        
               LTH=6                                                            
         MFLD  ARR3,                                                   +        
               LTH=6                                                            
         MFLD  APR3,                                                   +        
               LTH=6                                                            
         MFLD  STA3,                                                   +        
               LTH=1                                                            
         MFLD  GAR3,                                                   +        
               LTH=1                                                            
         MFLD  QO3,                                                    +        
               LTH=7                                                            
         MFLD  QH3,                                                    +        
               LTH=7                                                            
         MFLD  K3,                                                     +        
               LTH=3                                                            
         MFLD  SELECT4,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DIST4,                                                  +        
               LTH=4                                                            
         MFLD  KUND4,                                                  +        
               LTH=6                                                            
         MFLD  REP4,                                                   +        
               LTH=7                                                            
         MFLD  REG4,                                                   +        
               LTH=6                                                            
         MFLD  ARR4,                                                   +        
               LTH=6                                                            
         MFLD  APR4,                                                   +        
               LTH=6                                                            
         MFLD  STA4,                                                   +        
               LTH=1                                                            
         MFLD  GAR4,                                                   +        
               LTH=1                                                            
         MFLD  QO4,                                                    +        
               LTH=7                                                            
         MFLD  QH4,                                                    +        
               LTH=7                                                            
         MFLD  K4,                                                     +        
               LTH=3                                                            
         MFLD  SELECT5,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DIST5,                                                  +        
               LTH=4                                                            
         MFLD  KUND5,                                                  +        
               LTH=6                                                            
         MFLD  REP5,                                                   +        
               LTH=7                                                            
         MFLD  REG5,                                                   +        
               LTH=6                                                            
         MFLD  ARR5,                                                   +        
               LTH=6                                                            
         MFLD  APR5,                                                   +        
               LTH=6                                                            
         MFLD  STA5,                                                   +        
               LTH=1                                                            
         MFLD  GAR5,                                                   +        
               LTH=1                                                            
         MFLD  QO5,                                                    +        
               LTH=7                                                            
         MFLD  QH5,                                                    +        
               LTH=7                                                            
         MFLD  K5,                                                     +        
               LTH=3                                                            
         MFLD  SELECT6,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DIST6,                                                  +        
               LTH=4                                                            
         MFLD  KUND6,                                                  +        
               LTH=6                                                            
         MFLD  REP6,                                                   +        
               LTH=7                                                            
         MFLD  REG6,                                                   +        
               LTH=6                                                            
         MFLD  ARR6,                                                   +        
               LTH=6                                                            
         MFLD  APR6,                                                   +        
               LTH=6                                                            
         MFLD  STA6,                                                   +        
               LTH=1                                                            
         MFLD  GAR6,                                                   +        
               LTH=1                                                            
         MFLD  QO6,                                                    +        
               LTH=7                                                            
         MFLD  QH6,                                                    +        
               LTH=7                                                            
         MFLD  K6,                                                     +        
               LTH=3                                                            
         MFLD  SELECT7,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DIST7,                                                  +        
               LTH=4                                                            
         MFLD  KUND7,                                                  +        
               LTH=6                                                            
         MFLD  REP7,                                                   +        
               LTH=7                                                            
         MFLD  REG7,                                                   +        
               LTH=6                                                            
         MFLD  ARR7,                                                   +        
               LTH=6                                                            
         MFLD  APR7,                                                   +        
               LTH=6                                                            
         MFLD  STA7,                                                   +        
               LTH=1                                                            
         MFLD  GAR7,                                                   +        
               LTH=1                                                            
         MFLD  QO7,                                                    +        
               LTH=7                                                            
         MFLD  QH7,                                                    +        
               LTH=7                                                            
         MFLD  K7,                                                     +        
               LTH=3                                                            
         MFLD  SELECT8,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DIST8,                                                  +        
               LTH=4                                                            
         MFLD  KUND8,                                                  +        
               LTH=6                                                            
         MFLD  REP8,                                                   +        
               LTH=7                                                            
         MFLD  REG8,                                                   +        
               LTH=6                                                            
         MFLD  ARR8,                                                   +        
               LTH=6                                                            
         MFLD  APR8,                                                   +        
               LTH=6                                                            
         MFLD  STA8,                                                   +        
               LTH=1                                                            
         MFLD  GAR8,                                                   +        
               LTH=1                                                            
         MFLD  QO8,                                                    +        
               LTH=7                                                            
         MFLD  QH8,                                                    +        
               LTH=7                                                            
         MFLD  K8,                                                     +        
               LTH=3                                                            
         MFLD  SELECT9,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DIST9,                                                  +        
               LTH=4                                                            
         MFLD  KUND9,                                                  +        
               LTH=6                                                            
         MFLD  REP9,                                                   +        
               LTH=7                                                            
         MFLD  REG9,                                                   +        
               LTH=6                                                            
         MFLD  ARR9,                                                   +        
               LTH=6                                                            
         MFLD  APR9,                                                   +        
               LTH=6                                                            
         MFLD  STA9,                                                   +        
               LTH=1                                                            
         MFLD  GAR9,                                                   +        
               LTH=1                                                            
         MFLD  QO9,                                                    +        
               LTH=7                                                            
         MFLD  QH9,                                                    +        
               LTH=7                                                            
         MFLD  K9,                                                     +        
               LTH=3                                                            
         MFLD  SELECT10,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DIST10,                                                 +        
               LTH=4                                                            
         MFLD  KUND10,                                                 +        
               LTH=6                                                            
         MFLD  REP10,                                                  +        
               LTH=7                                                            
         MFLD  REG10,                                                  +        
               LTH=6                                                            
         MFLD  ARR10,                                                  +        
               LTH=6                                                            
         MFLD  APR10,                                                  +        
               LTH=6                                                            
         MFLD  STA10,                                                  +        
               LTH=1                                                            
         MFLD  GAR10,                                                  +        
               LTH=1                                                            
         MFLD  QO10,                                                   +        
               LTH=7                                                            
         MFLD  QH10,                                                   +        
               LTH=7                                                            
         MFLD  K10,                                                    +        
               LTH=3                                                            
         MFLD  SELECT11,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DIST11,                                                 +        
               LTH=4                                                            
         MFLD  KUND11,                                                 +        
               LTH=6                                                            
         MFLD  REP11,                                                  +        
               LTH=7                                                            
         MFLD  REG11,                                                  +        
               LTH=6                                                            
         MFLD  ARR11,                                                  +        
               LTH=6                                                            
         MFLD  APR11,                                                  +        
               LTH=6                                                            
         MFLD  STA11,                                                  +        
               LTH=1                                                            
         MFLD  GAR11,                                                  +        
               LTH=1                                                            
         MFLD  QO11,                                                   +        
               LTH=7                                                            
         MFLD  QH11,                                                   +        
               LTH=7                                                            
         MFLD  K11,                                                    +        
               LTH=3                                                            
         MFLD  SELECT12,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DIST12,                                                 +        
               LTH=4                                                            
         MFLD  KUND12,                                                 +        
               LTH=6                                                            
         MFLD  REP12,                                                  +        
               LTH=7                                                            
         MFLD  REG12,                                                  +        
               LTH=6                                                            
         MFLD  ARR12,                                                  +        
               LTH=6                                                            
         MFLD  APR12,                                                  +        
               LTH=6                                                            
         MFLD  STA12,                                                  +        
               LTH=1                                                            
         MFLD  GAR12,                                                  +        
               LTH=1                                                            
         MFLD  QO12,                                                   +        
               LTH=7                                                            
         MFLD  QH12,                                                   +        
               LTH=7                                                            
         MFLD  K12,                                                    +        
               LTH=3                                                            
         MFLD  SELECT13,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DIST13,                                                 +        
               LTH=4                                                            
         MFLD  KUND13,                                                 +        
               LTH=6                                                            
         MFLD  REP13,                                                  +        
               LTH=7                                                            
         MFLD  REG13,                                                  +        
               LTH=6                                                            
         MFLD  ARR13,                                                  +        
               LTH=6                                                            
         MFLD  APR13,                                                  +        
               LTH=6                                                            
         MFLD  STA13,                                                  +        
               LTH=1                                                            
         MFLD  GAR13,                                                  +        
               LTH=1                                                            
         MFLD  QO13,                                                   +        
               LTH=7                                                            
         MFLD  QH13,                                                   +        
               LTH=7                                                            
         MFLD  K13,                                                    +        
               LTH=3                                                            
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W3I177N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W3N177),                                           +        
               OPT=2,                                                  +        
               NXT=W3O177N1                                                     
MID      LPAGE SOR=(W3N177)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F7'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F7'                                                       
         MFLD  ' ',                                                    +        
               LTH=2                                                            
         MFLD  '31772',                                                +        
               LTH=5                                                            
         MFLD  (ARTIN,                                                 +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DISTIN,                                                +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KUNDIN,                                                +        
               '+++++++'),                                             +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RAPPIN,                                                +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (STATUSIN,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDDCIN,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (SELECT1,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (SELECT2,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (SELECT3,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (SELECT4,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (SELECT5,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (SELECT6,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (SELECT7,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (SELECT8,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (SELECT9,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (SELECT10,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (SELECT11,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (SELECT12,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (SELECT13,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
