***********************************************************************         
* CREATED BY PC59009   ON 98/11/26  AT 09:05                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'EXCHANGE FOREIGN DESIGNATION    '                               
W3N161   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W3T161 7',                                           +        
               8='W3T161 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W3T161  ',                                          +        
               14='W3T162  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W3N161   DPAGE CURSOR=((2,18)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'EXCHANGE FOREIGN DESIGNATIN',                          +        
               POS=(1,11),LTH=27,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Foreign desig',                                        +        
               POS=(2,2),LTH=13,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0218  DFLD  POS=(2,18),LTH=30,                                      +        
               ATTR=(NOPROT)                                                    
FLD0318  DFLD  POS=(3,18),LTH=30,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD0402  DFLD  POS=(4,2),LTH=9,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0412  DFLD  POS=(4,12),LTH=9,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
         DFLD  'Exch art',                                             +        
               POS=(5,2),LTH=8,                                        +        
               ATTR=(PROT)                                                      
FLD0511  DFLD  POS=(5,11),LTH=9,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Term',                                                 +        
               POS=(6,2),LTH=4,                                        +        
               ATTR=(PROT)                                                      
FLD0613  DFLD  POS=(6,13),LTH=25,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Note',                                                 +        
               POS=(7,2),LTH=4,                                        +        
               ATTR=(PROT)                                                      
COL4107  DFLD  POS=(7,8),LTH=30,                                       +        
               ATTR=(PROT)                                                      
COL4108  DFLD  POS=(7,40),LTH=30,                                      +        
               ATTR=(PROT)                                                      
COL4109  DFLD  POS=(8,8),LTH=30,                                       +        
               ATTR=(PROT)                                                      
COL4110  DFLD  POS=(8,40),LTH=30,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Alternative',                                          +        
               POS=(11,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
FLD1118  DFLD  POS=(11,18),LTH=30,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'Articles',                                             +        
               POS=(12,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
COL1312  DFLD  POS=(12,13),LTH=9,                                      +        
               ATTR=(PROT)                                                      
COL2412  DFLD  POS=(12,24),LTH=9,                                      +        
               ATTR=(PROT)                                                      
COL3512  DFLD  POS=(12,35),LTH=9,                                      +        
               ATTR=(PROT)                                                      
COL4612  DFLD  POS=(12,46),LTH=9,                                      +        
               ATTR=(PROT)                                                      
COL5712  DFLD  POS=(12,57),LTH=9,                                      +        
               ATTR=(PROT)                                                      
COL6812  DFLD  POS=(12,68),LTH=9,                                      +        
               ATTR=(PROT)                                                      
COL1313  DFLD  POS=(13,13),LTH=9,                                      +        
               ATTR=(PROT)                                                      
COL2413  DFLD  POS=(13,24),LTH=9,                                      +        
               ATTR=(PROT)                                                      
COL3513  DFLD  POS=(13,35),LTH=9,                                      +        
               ATTR=(PROT)                                                      
COL4613  DFLD  POS=(13,46),LTH=9,                                      +        
               ATTR=(PROT)                                                      
COL5713  DFLD  POS=(13,57),LTH=9,                                      +        
               ATTR=(PROT)                                                      
COL6813  DFLD  POS=(13,68),LTH=9,                                      +        
               ATTR=(PROT)                                                      
COL1314  DFLD  POS=(14,13),LTH=9,                                      +        
               ATTR=(PROT)                                                      
COL2414  DFLD  POS=(14,24),LTH=9,                                      +        
               ATTR=(PROT)                                                      
COL3514  DFLD  POS=(14,35),LTH=9,                                      +        
               ATTR=(PROT)                                                      
COL4614  DFLD  POS=(14,46),LTH=9,                                      +        
               ATTR=(PROT)                                                      
COL5714  DFLD  POS=(14,57),LTH=9,                                      +        
               ATTR=(PROT)                                                      
COL6814  DFLD  POS=(14,68),LTH=9,                                      +        
               ATTR=(PROT)                                                      
COL1315  DFLD  POS=(15,13),LTH=9,                                      +        
               ATTR=(PROT)                                                      
COL2415  DFLD  POS=(15,24),LTH=9,                                      +        
               ATTR=(PROT)                                                      
COL3515  DFLD  POS=(15,35),LTH=9,                                      +        
               ATTR=(PROT)                                                      
COL4615  DFLD  POS=(15,46),LTH=9,                                      +        
               ATTR=(PROT)                                                      
COL5715  DFLD  POS=(15,57),LTH=9,                                      +        
               ATTR=(PROT)                                                      
COL6815  DFLD  POS=(15,68),LTH=9,                                      +        
               ATTR=(PROT)                                                      
COL1316  DFLD  POS=(16,13),LTH=9,                                      +        
               ATTR=(PROT)                                                      
COL2416  DFLD  POS=(16,24),LTH=9,                                      +        
               ATTR=(PROT)                                                      
COL3516  DFLD  POS=(16,35),LTH=9,                                      +        
               ATTR=(PROT)                                                      
COL4616  DFLD  POS=(16,46),LTH=9,                                      +        
               ATTR=(PROT)                                                      
COL5716  DFLD  POS=(16,57),LTH=9,                                      +        
               ATTR=(PROT)                                                      
COL6816  DFLD  POS=(16,68),LTH=9,                                      +        
               ATTR=(PROT)                                                      
COL1317  DFLD  POS=(17,13),LTH=9,                                      +        
               ATTR=(PROT)                                                      
COL2417  DFLD  POS=(17,24),LTH=9,                                      +        
               ATTR=(PROT)                                                      
COL3517  DFLD  POS=(17,35),LTH=9,                                      +        
               ATTR=(PROT)                                                      
COL4617  DFLD  POS=(17,46),LTH=9,                                      +        
               ATTR=(PROT)                                                      
COL5717  DFLD  POS=(17,57),LTH=9,                                      +        
               ATTR=(PROT)                                                      
COL6817  DFLD  POS=(17,68),LTH=9,                                      +        
               ATTR=(PROT)                                                      
COL1318  DFLD  POS=(18,13),LTH=9,                                      +        
               ATTR=(PROT)                                                      
COL2418  DFLD  POS=(18,24),LTH=9,                                      +        
               ATTR=(PROT)                                                      
COL3518  DFLD  POS=(18,35),LTH=9,                                      +        
               ATTR=(PROT)                                                      
COL4618  DFLD  POS=(18,46),LTH=9,                                      +        
               ATTR=(PROT)                                                      
COL5718  DFLD  POS=(18,57),LTH=9,                                      +        
               ATTR=(PROT)                                                      
COL6818  DFLD  POS=(18,68),LTH=9,                                      +        
               ATTR=(PROT)                                                      
COL1319  DFLD  POS=(19,13),LTH=9,                                      +        
               ATTR=(PROT)                                                      
COL2419  DFLD  POS=(19,24),LTH=9,                                      +        
               ATTR=(PROT)                                                      
COL3519  DFLD  POS=(19,35),LTH=9,                                      +        
               ATTR=(PROT)                                                      
COL4619  DFLD  POS=(19,46),LTH=9,                                      +        
               ATTR=(PROT)                                                      
COL5719  DFLD  POS=(19,57),LTH=9,                                      +        
               ATTR=(PROT)                                                      
COL6819  DFLD  POS=(19,68),LTH=9,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '13 Foreign desi 14 Srch foreign 15',                   +        
               POS=(21,2),LTH=34,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16',                                                   +        
               POS=(21,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '9',                                                    +        
               POS=(22,67),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W3O161N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W3N161,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W3I161N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W3N161                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  FLD0218,                                                +        
               LTH=2                                                            
         MFLD  FLD0318,                                                +        
               LTH=30                                                           
         MFLD  FLD0402,                                                +        
               LTH=9                                                            
         MFLD  FLD0412,                                                +        
               LTH=9                                                            
         MFLD  FLD0511,                                                +        
               LTH=9                                                            
         MFLD  FLD0613,                                                +        
               LTH=25                                                           
         MFLD  COL4107,                                                +        
               LTH=30                                                           
         MFLD  COL4108,                                                +        
               LTH=30                                                           
         MFLD  COL4109,                                                +        
               LTH=30                                                           
         MFLD  COL4110,                                                +        
               LTH=30                                                           
         MFLD  FLD1118,                                                +        
               LTH=30                                                           
         MFLD  COL1312,                                                +        
               LTH=8                                                            
         MFLD  COL2412,                                                +        
               LTH=8                                                            
         MFLD  COL3512,                                                +        
               LTH=8                                                            
         MFLD  COL4612,                                                +        
               LTH=8                                                            
         MFLD  COL5712,                                                +        
               LTH=8                                                            
         MFLD  COL6812,                                                +        
               LTH=8                                                            
         MFLD  COL1313,                                                +        
               LTH=8                                                            
         MFLD  COL2413,                                                +        
               LTH=8                                                            
         MFLD  COL3513,                                                +        
               LTH=8                                                            
         MFLD  COL4613,                                                +        
               LTH=8                                                            
         MFLD  COL5713,                                                +        
               LTH=8                                                            
         MFLD  COL6813,                                                +        
               LTH=8                                                            
         MFLD  COL1314,                                                +        
               LTH=8                                                            
         MFLD  COL2414,                                                +        
               LTH=8                                                            
         MFLD  COL3514,                                                +        
               LTH=8                                                            
         MFLD  COL4614,                                                +        
               LTH=8                                                            
         MFLD  COL5714,                                                +        
               LTH=8                                                            
         MFLD  COL6814,                                                +        
               LTH=8                                                            
         MFLD  COL1315,                                                +        
               LTH=8                                                            
         MFLD  COL2415,                                                +        
               LTH=8                                                            
         MFLD  COL3515,                                                +        
               LTH=8                                                            
         MFLD  COL4615,                                                +        
               LTH=8                                                            
         MFLD  COL5715,                                                +        
               LTH=8                                                            
         MFLD  COL6815,                                                +        
               LTH=8                                                            
         MFLD  COL1316,                                                +        
               LTH=8                                                            
         MFLD  COL2416,                                                +        
               LTH=8                                                            
         MFLD  COL3516,                                                +        
               LTH=8                                                            
         MFLD  COL4616,                                                +        
               LTH=8                                                            
         MFLD  COL5716,                                                +        
               LTH=8                                                            
         MFLD  COL6816,                                                +        
               LTH=8                                                            
         MFLD  COL1317,                                                +        
               LTH=8                                                            
         MFLD  COL2417,                                                +        
               LTH=8                                                            
         MFLD  COL3517,                                                +        
               LTH=8                                                            
         MFLD  COL4617,                                                +        
               LTH=8                                                            
         MFLD  COL5717,                                                +        
               LTH=8                                                            
         MFLD  COL6817,                                                +        
               LTH=8                                                            
         MFLD  COL1318,                                                +        
               LTH=8                                                            
         MFLD  COL2418,                                                +        
               LTH=8                                                            
         MFLD  COL3518,                                                +        
               LTH=8                                                            
         MFLD  COL4618,                                                +        
               LTH=8                                                            
         MFLD  COL5718,                                                +        
               LTH=8                                                            
         MFLD  COL6818,                                                +        
               LTH=8                                                            
         MFLD  COL1319,                                                +        
               LTH=8                                                            
         MFLD  COL2419,                                                +        
               LTH=8                                                            
         MFLD  COL3519,                                                +        
               LTH=8                                                            
         MFLD  COL4619,                                                +        
               LTH=8                                                            
         MFLD  COL5719,                                                +        
               LTH=8                                                            
         MFLD  COL6819,                                                +        
               LTH=8                                                            
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W3I161N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W3N161),                                           +        
               OPT=2,                                                  +        
               NXT=W3O161N1                                                     
MID      LPAGE SOR=(W3N161)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '31612',                                                +        
               LTH=5                                                            
         MFLD  (FLD0218,                                               +        
               '++++++++++++++++++++++++++++++'),                      +        
               LTH=30,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  FLD0318,                                                +        
               LTH=30,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  FLD0402,                                                +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0412,                                                +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
