***********************************************************************         
* CREATED BY V040073   ON 00/10/04  AT 14:23                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'Total core balance 1            '                               
W3N165   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W3T165U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'EXCHANGE TOTAL CORE BALANCE 1',                        +        
               POS=(1,11),LTH=29,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Part no',                                              +        
               POS=(2,2),LTH=7,                                        +        
               ATTR=(ALPHA,PROT)                                                
ARTIN    DFLD  POS=(2,12),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
ARTUT    DFLD  POS=(3,12),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Core part',                                            +        
               POS=(5,2),LTH=9,                                        +        
               ATTR=(PROT)                                                      
CORENR   DFLD  POS=(5,18),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
COREBE   DFLD  POS=(5,27),LTH=25,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  'Remanufactured part',                                  +        
               POS=(6,2),LTH=15,                                       +        
               ATTR=(PROT)                                                      
REMANNR  DFLD  POS=(6,18),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
REMANBE  DFLD  POS=(6,27),LTH=25,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  'Procurer',                                             +        
               POS=(8,2),LTH=8,                                        +        
               ATTR=(PROT)                                                      
ANSK     DFLD  POS=(8,40),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Core alarm factor',                                    +        
               POS=(9,44),LTH=17,                                      +        
               ATTR=(PROT)                                                      
LARMFAC  DFLD  POS=(9,71),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Point value',                                          +        
               POS=(10,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
POINT    DFLD  POS=(10,37),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Core return rate',                                     +        
               POS=(10,44),LTH=16,                                     +        
               ATTR=(PROT)                                                      
RETUR    DFLD  POS=(10,71),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '%',                                                    +        
               POS=(10,74),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Core reuse rate',                                      +        
               POS=(11,44),LTH=15,                                     +        
               ATTR=(PROT)                                                      
REUSE    DFLD  POS=(11,71),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '%',                                                    +        
               POS=(11,74),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Deviation alarm',                                      +        
               POS=(12,44),LTH=15,                                     +        
               ATTR=(PROT)                                                      
LARMPER  DFLD  POS=(12,71),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '%',                                                    +        
               POS=(12,74),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Total Remanufactured part balance',                    +        
               POS=(13,2),LTH=33,                                      +        
               ATTR=(PROT)                                                      
REMANLS  DFLD  POS=(13,36),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Total Core balance',                                   +        
               POS=(14,2),LTH=18,                                      +        
               ATTR=(PROT)                                                      
CORELS   DFLD  POS=(14,36),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Sales 12 months',                                      +        
               POS=(15,2),LTH=15,                                      +        
               ATTR=(PROT)                                                      
SALES12  DFLD  POS=(15,32),LTH=11,                                     +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Activate alarm Y/N',                                   +        
               POS=(15,44),LTH=18,                                     +        
               ATTR=(PROT)                                                      
ACTLARM  DFLD  POS=(15,74),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'F10=WHELP  F11=UPDATE',                                +        
               POS=(22,2),LTH=21,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,58),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W3O165N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W3N165,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W3I165N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  ARTIN,                                                  +        
               LTH=2                                                            
         MFLD  ARTUT,                                                  +        
               LTH=8                                                            
         MFLD  CORENR,                                                 +        
               LTH=8                                                            
         MFLD  COREBE,                                                 +        
               LTH=25                                                           
         MFLD  REMANNR,                                                +        
               LTH=8                                                            
         MFLD  REMANBE,                                                +        
               LTH=25                                                           
         MFLD  ANSK,                                                   +        
               LTH=3                                                            
         MFLD  LARMFAC,                                                +        
               LTH=4                                                            
         MFLD  POINT,                                                  +        
               LTH=6                                                            
         MFLD  RETUR,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  REUSE,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LARMPER,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  REMANLS,                                                +        
               LTH=7                                                            
         MFLD  CORELS,                                                 +        
               LTH=7                                                            
         MFLD  SALES12,                                                +        
               LTH=11                                                           
         MFLD  ACTLARM,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W3I165N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W3N165),                                           +        
               OPT=2,                                                  +        
               NXT=W3O165N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '31652',                                                +        
               LTH=5                                                            
         MFLD  (ARTIN,                                                 +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R                                                           
         MFLD  (ARTUT,                                                 +        
               '        '),                                            +        
               LTH=8,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (RETUR,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R                                                           
         MFLD  (REUSE,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R                                                           
         MFLD  (LARMPER,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R                                                           
         MFLD  (ACTLARM,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
