***********************************************************************         
* CREATED BY PC59009   ON 97/05/23  AT 13:55                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'ART.STAT SELECTION FUNCTIONGROUP'                               
W3N202   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W3T202 7',                                           +        
               8='W3T202 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W3T202U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W3T201  ',                                          +        
               14='W3T202  ',                                          +        
               15='W3T203  ',                                          +        
               16='W3T204  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W3T202U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W3N202   DPAGE CURSOR=((5,38)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'ART.STAT SELECT FUNCTIONGROUP',                        +        
               POS=(1,10),LTH=29,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD0140  DFLD  POS=(1,40),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Selection',                                            +        
               POS=(2,6),LTH=9,                                        +        
               ATTR=(PROT)                                                      
DGIA0058 DFLD  POS=(2,16),LTH=8,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Userid',                                               +        
               POS=(2,27),LTH=6,                                       +        
               ATTR=(PROT)                                                      
DGIA0060 DFLD  POS=(2,34),LTH=8,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0059 DFLD  POS=(3,16),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0061 DFLD  POS=(3,34),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0402  DFLD  POS=(4,2),LTH=4,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0407  DFLD  POS=(4,7),LTH=4,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0412  DFLD  POS=(4,12),LTH=4,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0417  DFLD  POS=(4,17),LTH=4,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0422  DFLD  POS=(4,22),LTH=8,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0429  DFLD  POS=(4,31),LTH=6,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'Start week',                                           +        
               POS=(5,2),LTH=10,                                       +        
               ATTR=(PROT)                                                      
DGIA0040 DFLD  POS=(5,21),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'To be saved',                                          +        
               POS=(5,26),LTH=11,                                      +        
               ATTR=(NUM,PROT)                                                  
FSGURV   DFLD  POS=(5,38),LTH=8,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Remove',                                               +        
               POS=(5,50),LTH=6,                                       +        
               ATTR=(PROT)                                                      
KDBORT   DFLD  POS=(5,57),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Listtype',                                             +        
               POS=(5,69),LTH=8,                                       +        
               ATTR=(PROT)                                                      
IDPTYP   DFLD  POS=(5,78),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'End   week',                                           +        
               POS=(6,2),LTH=10,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0041 DFLD  POS=(6,21),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Pricetype',                                            +        
               POS=(6,69),LTH=9,                                       +        
               ATTR=(PROT)                                                      
PRTYPG   DFLD  POS=(6,80),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Volumevalueclass',                                     +        
               POS=(7,2),LTH=16,                                       +        
               ATTR=(NUM,PROT)                                                  
KDVVKL1  DFLD  POS=(7,24),LTH=1,                                       +        
               ATTR=(NUM,NOPROT)                                                
KDVVKL2  DFLD  POS=(7,32),LTH=1,                                       +        
               ATTR=(NUM,NOPROT)                                                
KDVVKL3  DFLD  POS=(7,40),LTH=1,                                       +        
               ATTR=(NUM,NOPROT)                                                
KDVVKL4  DFLD  POS=(7,48),LTH=1,                                       +        
               ATTR=(NUM,NOPROT)                                                
KDVVKL5  DFLD  POS=(7,56),LTH=1,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Level',                                                +        
               POS=(7,69),LTH=5,                                       +        
               ATTR=(PROT)                                                      
KDNIVA   DFLD  POS=(7,79),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Productgroup',                                         +        
               POS=(8,2),LTH=12,                                       +        
               ATTR=(NUM,PROT)                                                  
PRODSL1  DFLD  POS=(8,20),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
PRODSL2  DFLD  POS=(8,25),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
PRODSL3  DFLD  POS=(8,30),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
PRODSL4  DFLD  POS=(8,35),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
PRODSL5  DFLD  POS=(8,40),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
PRODSL6  DFLD  POS=(8,45),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
PRODSL7  DFLD  POS=(8,50),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Merger of Pg Y/N',                                     +        
               POS=(8,63),LTH=16,                                      +        
               ATTR=(PROT)                                                      
KDSVAR   DFLD  POS=(8,80),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
KONCERN1 DFLD  POS=(9,22),LTH=3,                                       +        
               ATTR=(PROT)                                                      
KONCERN2 DFLD  POS=(9,30),LTH=3,                                       +        
               ATTR=(PROT)                                                      
KONCERN3 DFLD  POS=(9,38),LTH=3,                                       +        
               ATTR=(PROT)                                                      
KONCERN4 DFLD  POS=(9,46),LTH=3,                                       +        
               ATTR=(PROT)                                                      
KONCERN5 DFLD  POS=(9,54),LTH=3,                                       +        
               ATTR=(PROT)                                                      
KONCERN6 DFLD  POS=(9,62),LTH=3,                                       +        
               ATTR=(PROT)                                                      
KONCERN7 DFLD  POS=(9,70),LTH=3,                                       +        
               ATTR=(PROT)                                                      
KONCERN8 DFLD  POS=(9,78),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Supplier',                                             +        
               POS=(10,2),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
LEVNR1   DFLD  POS=(10,20),LTH=5,                                      +        
               ATTR=(NOPROT)                                                    
LEVNR2   DFLD  POS=(10,28),LTH=5,                                      +        
               ATTR=(NOPROT)                                                    
LEVNR3   DFLD  POS=(10,36),LTH=5,                                      +        
               ATTR=(NOPROT)                                                    
LEVNR4   DFLD  POS=(10,44),LTH=5,                                      +        
               ATTR=(NOPROT)                                                    
LEVNR5   DFLD  POS=(10,52),LTH=5,                                      +        
               ATTR=(NOPROT)                                                    
LEVNR6   DFLD  POS=(10,60),LTH=5,                                      +        
               ATTR=(NOPROT)                                                    
LEVNR7   DFLD  POS=(10,68),LTH=5,                                      +        
               ATTR=(NOPROT)                                                    
LEVNR8   DFLD  POS=(10,76),LTH=5,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Stock Account',                                        +        
               POS=(11,2),LTH=13,                                      +        
               ATTR=(NUM,PROT)                                                  
LKTO1    DFLD  POS=(11,18),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
LKTO2    DFLD  POS=(11,26),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
LKTO3    DFLD  POS=(11,34),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
LKTO4    DFLD  POS=(11,42),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
LKTO5    DFLD  POS=(11,50),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
LKTO6    DFLD  POS=(11,58),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
LKTO7    DFLD  POS=(11,66),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
LKTO8    DFLD  POS=(11,74),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'From  -   To    From  -   To    From  -   To    From  -+        
                  To',                                                 +        
               POS=(12,21),LTH=60,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Market',                                               +        
               POS=(13,2),LTH=6,                                       +        
               ATTR=(PROT)                                                      
DGIA0042 DFLD  POS=(13,22),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(13,27),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0050 DFLD  POS=(13,30),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0043 DFLD  POS=(13,38),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(13,43),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0051 DFLD  POS=(13,46),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0044 DFLD  POS=(13,54),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(13,59),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0052 DFLD  POS=(13,62),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0045 DFLD  POS=(13,70),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(13,75),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0053 DFLD  POS=(13,78),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0046 DFLD  POS=(14,22),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(14,27),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0054 DFLD  POS=(14,30),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0047 DFLD  POS=(14,38),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(14,43),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0055 DFLD  POS=(14,46),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0048 DFLD  POS=(14,54),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(14,59),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0056 DFLD  POS=(14,62),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0049 DFLD  POS=(14,70),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(14,75),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0057 DFLD  POS=(14,78),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'District',                                             +        
               POS=(15,2),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0020 DFLD  POS=(15,21),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(15,27),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0016 DFLD  POS=(15,29),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0021 DFLD  POS=(15,37),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(15,43),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0017 DFLD  POS=(15,45),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0022 DFLD  POS=(15,53),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(15,59),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0018 DFLD  POS=(15,61),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0023 DFLD  POS=(15,69),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(15,75),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0019 DFLD  POS=(15,77),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Purchaseplanning',                                     +        
               POS=(16,2),LTH=16,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0000 DFLD  POS=(16,22),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(16,27),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0004 DFLD  POS=(16,30),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0001 DFLD  POS=(16,38),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(16,43),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0005 DFLD  POS=(16,46),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0002 DFLD  POS=(16,54),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(16,59),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0006 DFLD  POS=(16,62),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0003 DFLD  POS=(16,70),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(16,75),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0007 DFLD  POS=(16,78),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Function group',                                       +        
               POS=(17,2),LTH=14,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0024 DFLD  POS=(17,21),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(17,27),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0032 DFLD  POS=(17,29),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0025 DFLD  POS=(17,37),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(17,43),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0033 DFLD  POS=(17,45),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0026 DFLD  POS=(17,53),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(17,59),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0034 DFLD  POS=(17,61),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0027 DFLD  POS=(17,69),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(17,75),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0035 DFLD  POS=(17,77),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0028 DFLD  POS=(18,21),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(18,27),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0036 DFLD  POS=(18,29),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0029 DFLD  POS=(18,37),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(18,43),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0037 DFLD  POS=(18,45),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0030 DFLD  POS=(18,53),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(18,59),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0038 DFLD  POS=(18,61),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0031 DFLD  POS=(18,69),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(18,75),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0039 DFLD  POS=(18,77),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Remove Fkngrp',                                        +        
               POS=(19,2),LTH=13,                                      +        
               ATTR=(NUM,PROT)                                                  
KDCMD    DFLD  POS=(19,18),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0008 DFLD  POS=(19,21),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(19,27),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0012 DFLD  POS=(19,29),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0009 DFLD  POS=(19,37),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(19,43),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0013 DFLD  POS=(19,45),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0010 DFLD  POS=(19,53),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(19,59),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0014 DFLD  POS=(19,61),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0011 DFLD  POS=(19,69),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(19,75),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0015 DFLD  POS=(19,77),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '13 Catal-screen 14 Sel.-Fkngrp  15 Sel. Article 16 Best+        
               seller   17',                                           +        
               POS=(21,2),LTH=66,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 Whelp',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W3O202N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W3N202,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W3I202N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W3N202                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0140,                                                +        
               LTH=40                                                           
         MFLD  DGIA0058,                                               +        
               LTH=2                                                            
         MFLD  DGIA0060,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0059,                                               +        
               LTH=8                                                            
         MFLD  DGIA0061,                                               +        
               LTH=8                                                            
         MFLD  FLD0402,                                                +        
               LTH=4                                                            
         MFLD  FLD0407,                                                +        
               LTH=4                                                            
         MFLD  FLD0412,                                                +        
               LTH=4                                                            
         MFLD  FLD0417,                                                +        
               LTH=4                                                            
         MFLD  FLD0422,                                                +        
               LTH=8                                                            
         MFLD  FLD0429,                                                +        
               LTH=6                                                            
         MFLD  DGIA0040,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FSGURV,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDBORT,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDPTYP,                                                 +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0041,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRTYPG,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDVVKL1,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDVVKL2,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDVVKL3,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDVVKL4,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDVVKL5,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDNIVA,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRODSL1,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRODSL2,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRODSL3,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRODSL4,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRODSL5,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRODSL6,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRODSL7,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDSVAR,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KONCERN1,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KONCERN2,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KONCERN3,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KONCERN4,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KONCERN5,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KONCERN6,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KONCERN7,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KONCERN8,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEVNR1,                                                 +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEVNR2,                                                 +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEVNR3,                                                 +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEVNR4,                                                 +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEVNR5,                                                 +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEVNR6,                                                 +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEVNR7,                                                 +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEVNR8,                                                 +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LKTO1,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LKTO2,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LKTO3,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LKTO4,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LKTO5,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LKTO6,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LKTO7,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LKTO8,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0042,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0050,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0043,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0051,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0044,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0052,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0045,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0053,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0046,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0054,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0047,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0055,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0048,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0056,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0049,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0057,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0020,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0016,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0021,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0017,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0022,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0018,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0023,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0019,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0000,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0004,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0001,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0005,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0002,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0006,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0003,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0007,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0024,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0032,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0025,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0033,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0026,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0034,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0027,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0035,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0028,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0036,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0029,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0037,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0030,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0038,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0031,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0039,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDCMD,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0008,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0012,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0009,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0013,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0010,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0014,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0011,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0015,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W3I202N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W3N202),                                           +        
               OPT=2,                                                  +        
               NXT=W3O202N1                                                     
MID      LPAGE SOR=(W3N202)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '32022',                                                +        
               LTH=5                                                            
         MFLD  (DGIA0058,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0060,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  DGIA0059,                                               +        
               LTH=8,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  DGIA0061,                                               +        
               LTH=8,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  FLD0402,                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0407,                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0412,                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0417,                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0422,                                                +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0429,                                                +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0040,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FSGURV,                                                +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KDBORT,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDPTYP,                                                +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0041,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PRTYPG,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KDVVKL1,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDVVKL2,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDVVKL3,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDVVKL4,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDVVKL5,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDNIVA,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PRODSL1,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PRODSL2,                                               +        
               '++'),                                                  +        
               LTH=2                                                            
         MFLD  (PRODSL3,                                               +        
               '++'),                                                  +        
               LTH=2                                                            
         MFLD  (PRODSL4,                                               +        
               '++'),                                                  +        
               LTH=2                                                            
         MFLD  (PRODSL5,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PRODSL6,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PRODSL7,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDSVAR,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KONCERN1,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KONCERN2,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KONCERN3,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KONCERN4,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KONCERN5,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KONCERN6,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KONCERN7,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KONCERN8,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (LEVNR1,                                                +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (LEVNR2,                                                +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (LEVNR3,                                                +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (LEVNR4,                                                +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (LEVNR5,                                                +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (LEVNR6,                                                +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (LEVNR7,                                                +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (LEVNR8,                                                +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (LKTO1,                                                 +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (LKTO2,                                                 +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (LKTO3,                                                 +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (LKTO4,                                                 +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (LKTO5,                                                 +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (LKTO6,                                                 +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (LKTO7,                                                 +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (LKTO8,                                                 +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0042,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0050,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0043,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0051,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0044,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0052,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0045,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0053,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0046,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0054,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0047,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0055,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0048,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0056,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0049,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0057,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0020,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0016,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0021,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0017,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0022,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0018,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0023,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0019,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0000,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0004,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0001,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0005,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0002,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0006,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0003,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0007,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0024,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0032,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0025,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0033,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0026,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0034,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0027,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0035,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0028,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0036,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0029,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0037,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0030,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0038,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0031,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0039,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDCMD,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0008,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0012,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0009,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0013,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0010,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0014,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0011,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0015,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
