***********************************************************************         
* CREATED BY PC59009   ON 97/04/10  AT 15:24                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'ART.STAT  SELECTION TABLE       '                               
W3N201   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W3T201 7',                                           +        
               8='W3T201 8',                                           +        
               9='W3T201 9',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W3T201  ',                                          +        
               14='W3T202  ',                                          +        
               15='W3T203  ',                                          +        
               16='W3T204  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((2,16)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'ART.STAT  SELECTION TABLE',                            +        
               POS=(1,10),LTH=25,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD0140  DFLD  POS=(1,40),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Selection',                                            +        
               POS=(2,6),LTH=9,                                        +        
               ATTR=(PROT)                                                      
FLD0216  DFLD  POS=(2,16),LTH=8,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Userid',                                               +        
               POS=(2,27),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0234  DFLD  POS=(2,34),LTH=8,                                       +        
               ATTR=(NOPROT)                                                    
FLD0316  DFLD  POS=(3,16),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0334  DFLD  POS=(3,34),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0402  DFLD  POS=(4,2),LTH=4,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0407  DFLD  POS=(4,7),LTH=4,                                        +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
FLD0412  DFLD  POS=(4,12),LTH=8,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
FLD0419  DFLD  POS=(4,21),LTH=8,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
FLD0426  DFLD  POS=(4,30),LTH=6,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
FLD0433  DFLD  POS=(4,43),LTH=6,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
FLD0440  DFLD  POS=(4,50),LTH=8,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
FLD0450  DFLD  POS=(4,60),LTH=8,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'S  Name',                                              +        
               POS=(5,2),LTH=7,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'Date    Time',                                         +        
               POS=(5,14),LTH=12,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Screen S  Name',                                       +        
               POS=(5,33),LTH=14,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Date    Time',                                         +        
               POS=(5,52),LTH=12,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Screen',                                               +        
               POS=(5,71),LTH=6,                                       +        
               ATTR=(PROT)                                                      
COL0206  DFLD  POS=(6,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
COL0506  DFLD  POS=(6,5),LTH=8,                                        +        
               ATTR=(PROT,MOD)                                                  
COL1406  DFLD  POS=(6,14),LTH=8,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL2206  DFLD  POS=(6,23),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
COL3406  DFLD  POS=(6,34),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
COL4006  DFLD  POS=(6,40),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
COL4306  DFLD  POS=(6,43),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
COL5206  DFLD  POS=(6,52),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL6006  DFLD  POS=(6,60),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
COL6906  DFLD  POS=(6,72),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
COL0207  DFLD  POS=(7,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
COL0507  DFLD  POS=(7,5),LTH=8,                                        +        
               ATTR=(PROT,MOD)                                                  
COL1407  DFLD  POS=(7,14),LTH=8,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL2207  DFLD  POS=(7,23),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
COL3407  DFLD  POS=(7,34),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
COL4007  DFLD  POS=(7,40),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
COL4307  DFLD  POS=(7,43),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
COL5207  DFLD  POS=(7,52),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL6007  DFLD  POS=(7,60),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
COL6907  DFLD  POS=(7,72),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
COL0208  DFLD  POS=(8,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
COL0508  DFLD  POS=(8,5),LTH=8,                                        +        
               ATTR=(PROT,MOD)                                                  
COL1408  DFLD  POS=(8,14),LTH=8,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL2208  DFLD  POS=(8,23),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
COL3408  DFLD  POS=(8,34),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
COL4008  DFLD  POS=(8,40),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
COL4308  DFLD  POS=(8,43),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
COL5208  DFLD  POS=(8,52),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL6008  DFLD  POS=(8,60),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
COL6908  DFLD  POS=(8,72),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
COL0209  DFLD  POS=(9,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
COL0509  DFLD  POS=(9,5),LTH=8,                                        +        
               ATTR=(PROT,MOD)                                                  
COL1409  DFLD  POS=(9,14),LTH=8,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL2209  DFLD  POS=(9,23),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
COL3409  DFLD  POS=(9,34),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
COL4009  DFLD  POS=(9,40),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
COL4309  DFLD  POS=(9,43),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
COL5209  DFLD  POS=(9,52),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL6009  DFLD  POS=(9,60),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
COL6909  DFLD  POS=(9,72),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
COL0210  DFLD  POS=(10,2),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
COL0510  DFLD  POS=(10,5),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1410  DFLD  POS=(10,14),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2210  DFLD  POS=(10,23),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL3410  DFLD  POS=(10,34),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
COL4010  DFLD  POS=(10,40),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
COL4310  DFLD  POS=(10,43),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
COL5210  DFLD  POS=(10,52),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL6010  DFLD  POS=(10,60),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL6910  DFLD  POS=(10,72),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
COL0211  DFLD  POS=(11,2),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
COL0511  DFLD  POS=(11,5),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1411  DFLD  POS=(11,14),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2211  DFLD  POS=(11,23),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL3411  DFLD  POS=(11,34),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
COL4011  DFLD  POS=(11,40),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
COL4311  DFLD  POS=(11,43),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
COL5211  DFLD  POS=(11,52),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL6011  DFLD  POS=(11,60),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL6911  DFLD  POS=(11,72),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
COL0212  DFLD  POS=(12,2),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
COL0512  DFLD  POS=(12,5),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1412  DFLD  POS=(12,14),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2212  DFLD  POS=(12,23),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL3412  DFLD  POS=(12,34),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
COL4012  DFLD  POS=(12,40),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
COL4312  DFLD  POS=(12,43),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
COL5212  DFLD  POS=(12,52),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL6012  DFLD  POS=(12,60),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL6912  DFLD  POS=(12,72),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
COL0213  DFLD  POS=(13,2),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
COL0513  DFLD  POS=(13,5),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1413  DFLD  POS=(13,14),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2213  DFLD  POS=(13,23),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL3413  DFLD  POS=(13,34),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
COL4013  DFLD  POS=(13,40),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
COL4313  DFLD  POS=(13,43),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
COL5213  DFLD  POS=(13,52),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL6013  DFLD  POS=(13,60),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL6913  DFLD  POS=(13,72),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
COL0214  DFLD  POS=(14,2),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
COL0514  DFLD  POS=(14,5),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1414  DFLD  POS=(14,14),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2214  DFLD  POS=(14,23),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL3414  DFLD  POS=(14,34),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
COL4014  DFLD  POS=(14,40),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
COL4314  DFLD  POS=(14,43),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
COL5214  DFLD  POS=(14,52),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL6014  DFLD  POS=(14,60),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL6914  DFLD  POS=(14,72),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
COL0215  DFLD  POS=(15,2),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
COL0515  DFLD  POS=(15,5),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1415  DFLD  POS=(15,14),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2215  DFLD  POS=(15,23),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL3415  DFLD  POS=(15,34),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
COL4015  DFLD  POS=(15,40),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
COL4315  DFLD  POS=(15,43),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
COL5215  DFLD  POS=(15,52),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL6015  DFLD  POS=(15,60),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL6915  DFLD  POS=(15,72),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
COL0216  DFLD  POS=(16,2),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
COL0516  DFLD  POS=(16,5),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1416  DFLD  POS=(16,14),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2216  DFLD  POS=(16,23),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL3416  DFLD  POS=(16,34),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
COL4016  DFLD  POS=(16,40),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
COL4316  DFLD  POS=(16,43),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
COL5216  DFLD  POS=(16,52),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL6016  DFLD  POS=(16,60),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL6916  DFLD  POS=(16,72),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
COL0217  DFLD  POS=(17,2),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
COL0517  DFLD  POS=(17,5),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1417  DFLD  POS=(17,14),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2217  DFLD  POS=(17,23),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL3417  DFLD  POS=(17,34),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
COL4017  DFLD  POS=(17,40),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
COL4317  DFLD  POS=(17,43),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
COL5217  DFLD  POS=(17,52),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL6017  DFLD  POS=(17,60),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL6917  DFLD  POS=(17,72),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
COL0218  DFLD  POS=(18,2),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
COL0518  DFLD  POS=(18,5),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1418  DFLD  POS=(18,14),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2218  DFLD  POS=(18,23),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL3418  DFLD  POS=(18,34),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
COL4018  DFLD  POS=(18,40),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
COL4318  DFLD  POS=(18,43),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
COL5218  DFLD  POS=(18,52),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL6018  DFLD  POS=(18,60),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL6918  DFLD  POS=(18,72),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
COL0219  DFLD  POS=(19,2),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
COL0519  DFLD  POS=(19,5),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1419  DFLD  POS=(19,14),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2219  DFLD  POS=(19,23),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL3419  DFLD  POS=(19,34),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
COL4019  DFLD  POS=(19,40),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
COL4319  DFLD  POS=(19,43),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
COL5219  DFLD  POS=(19,52),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL6019  DFLD  POS=(19,60),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL6919  DFLD  POS=(19,72),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  '13 Catalog.-pic 14 Sel. Fkngrp  15 Article sel. 16 Best+        
                seller  17',                                           +        
               POS=(21,2),LTH=66,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 Whelp',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W3O201N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W3N201,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W3I201N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0140,                                                +        
               LTH=40                                                           
         MFLD  FLD0216,                                                +        
               LTH=2                                                            
         MFLD  FLD0234,                                                +        
               LTH=2                                                            
         MFLD  FLD0316,                                                +        
               LTH=8                                                            
         MFLD  FLD0334,                                                +        
               LTH=8                                                            
         MFLD  FLD0402,                                                +        
               LTH=4                                                            
         MFLD  FLD0407,                                                +        
               LTH=4                                                            
         MFLD  FLD0412,                                                +        
               LTH=8                                                            
         MFLD  FLD0419,                                                +        
               LTH=8                                                            
         MFLD  FLD0426,                                                +        
               LTH=6                                                            
         MFLD  FLD0433,                                                +        
               LTH=6                                                            
         MFLD  FLD0440,                                                +        
               LTH=8                                                            
         MFLD  FLD0450,                                                +        
               LTH=8                                                            
         MFLD  COL0206,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0506,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL1406,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL2206,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3406,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0207,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0507,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL1407,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL2207,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3407,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0208,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0508,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL1408,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL2208,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3408,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0209,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0509,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL1409,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL2209,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3409,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0210,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0510,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL1410,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL2210,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3410,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0211,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0511,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL1411,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL2211,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3411,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0212,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0512,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL1412,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL2212,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3412,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0213,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0513,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL1413,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL2213,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3413,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0214,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0514,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL1414,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL2214,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3414,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0215,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0515,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL1415,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL2215,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3415,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0216,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0516,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL1416,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL2216,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3416,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0217,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0517,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL1417,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL2217,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3417,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0218,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0518,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL1418,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL2218,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3418,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0219,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0519,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL1419,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL2219,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3419,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4006,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4306,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL5206,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL6006,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL6906,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4007,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4307,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL5207,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL6007,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL6907,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4008,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4308,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL5208,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL6008,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL6908,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4009,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4309,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL5209,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL6009,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL6909,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4010,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4310,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL5210,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL6010,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL6910,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4011,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4311,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL5211,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL6011,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL6911,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4012,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4312,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL5212,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL6012,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL6912,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4013,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4313,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL5213,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL6013,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL6913,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4014,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4314,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL5214,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL6014,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL6914,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4015,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4315,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL5215,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL6015,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL6915,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4016,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4316,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL5216,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL6016,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL6916,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4017,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4317,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL5217,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL6017,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL6917,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4018,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4318,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL5218,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL6018,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL6918,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4019,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4319,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL5219,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL6019,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL6919,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W3I201N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W3N201),                                           +        
               OPT=2,                                                  +        
               NXT=W3O201N1                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '32012',                                                +        
               LTH=5                                                            
         MFLD  (FLD0216,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLD0234,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  FLD0316,                                                +        
               LTH=8,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  FLD0334,                                                +        
               LTH=8,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  FLD0402,                                                +        
               LTH=4,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  FLD0407,                                                +        
               LTH=4,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  FLD0412,                                                +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0419,                                                +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0426,                                                +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0433,                                                +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0440,                                                +        
               LTH=8,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  FLD0450,                                                +        
               LTH=8,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (COL0206,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  COL0506,                                                +        
               LTH=8,                                                  +        
               JUST=L                                                           
         MFLD  COL1406,                                                +        
               LTH=8,                                                  +        
               JUST=R                                                           
         MFLD  COL2206,                                                +        
               LTH=6,                                                  +        
               JUST=R                                                           
         MFLD  COL3406,                                                +        
               LTH=4,                                                  +        
               JUST=L                                                           
         MFLD  (COL0207,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  COL0507,                                                +        
               LTH=8,                                                  +        
               JUST=L                                                           
         MFLD  COL1407,                                                +        
               LTH=8,                                                  +        
               JUST=R                                                           
         MFLD  COL2207,                                                +        
               LTH=6,                                                  +        
               JUST=R                                                           
         MFLD  COL3407,                                                +        
               LTH=4,                                                  +        
               JUST=L                                                           
         MFLD  (COL0208,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  COL0508,                                                +        
               LTH=8,                                                  +        
               JUST=L                                                           
         MFLD  COL1408,                                                +        
               LTH=8,                                                  +        
               JUST=R                                                           
         MFLD  COL2208,                                                +        
               LTH=6,                                                  +        
               JUST=R                                                           
         MFLD  COL3408,                                                +        
               LTH=4,                                                  +        
               JUST=L                                                           
         MFLD  (COL0209,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  COL0509,                                                +        
               LTH=8,                                                  +        
               JUST=L                                                           
         MFLD  COL1409,                                                +        
               LTH=8,                                                  +        
               JUST=R                                                           
         MFLD  COL2209,                                                +        
               LTH=6,                                                  +        
               JUST=R                                                           
         MFLD  COL3409,                                                +        
               LTH=4,                                                  +        
               JUST=L                                                           
         MFLD  (COL0210,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  COL0510,                                                +        
               LTH=8,                                                  +        
               JUST=L                                                           
         MFLD  COL1410,                                                +        
               LTH=8,                                                  +        
               JUST=R                                                           
         MFLD  COL2210,                                                +        
               LTH=6,                                                  +        
               JUST=R                                                           
         MFLD  COL3410,                                                +        
               LTH=4,                                                  +        
               JUST=L                                                           
         MFLD  (COL0211,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  COL0511,                                                +        
               LTH=8,                                                  +        
               JUST=L                                                           
         MFLD  COL1411,                                                +        
               LTH=8,                                                  +        
               JUST=R                                                           
         MFLD  COL2211,                                                +        
               LTH=6,                                                  +        
               JUST=R                                                           
         MFLD  COL3411,                                                +        
               LTH=4,                                                  +        
               JUST=L                                                           
         MFLD  (COL0212,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  COL0512,                                                +        
               LTH=8,                                                  +        
               JUST=L                                                           
         MFLD  COL1412,                                                +        
               LTH=8,                                                  +        
               JUST=R                                                           
         MFLD  COL2212,                                                +        
               LTH=6,                                                  +        
               JUST=R                                                           
         MFLD  COL3412,                                                +        
               LTH=4,                                                  +        
               JUST=L                                                           
         MFLD  (COL0213,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  COL0513,                                                +        
               LTH=8,                                                  +        
               JUST=L                                                           
         MFLD  COL1413,                                                +        
               LTH=8,                                                  +        
               JUST=R                                                           
         MFLD  COL2213,                                                +        
               LTH=6,                                                  +        
               JUST=R                                                           
         MFLD  COL3413,                                                +        
               LTH=4,                                                  +        
               JUST=L                                                           
         MFLD  (COL0214,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  COL0514,                                                +        
               LTH=8,                                                  +        
               JUST=L                                                           
         MFLD  COL1414,                                                +        
               LTH=8,                                                  +        
               JUST=R                                                           
         MFLD  COL2214,                                                +        
               LTH=6,                                                  +        
               JUST=R                                                           
         MFLD  COL3414,                                                +        
               LTH=4,                                                  +        
               JUST=L                                                           
         MFLD  (COL0215,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  COL0515,                                                +        
               LTH=8,                                                  +        
               JUST=L                                                           
         MFLD  COL1415,                                                +        
               LTH=8,                                                  +        
               JUST=R                                                           
         MFLD  COL2215,                                                +        
               LTH=6,                                                  +        
               JUST=R                                                           
         MFLD  COL3415,                                                +        
               LTH=4,                                                  +        
               JUST=L                                                           
         MFLD  (COL0216,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  COL0516,                                                +        
               LTH=8,                                                  +        
               JUST=L                                                           
         MFLD  COL1416,                                                +        
               LTH=8,                                                  +        
               JUST=R                                                           
         MFLD  COL2216,                                                +        
               LTH=6,                                                  +        
               JUST=R                                                           
         MFLD  COL3416,                                                +        
               LTH=4,                                                  +        
               JUST=L                                                           
         MFLD  (COL0217,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  COL0517,                                                +        
               LTH=8,                                                  +        
               JUST=L                                                           
         MFLD  COL1417,                                                +        
               LTH=8,                                                  +        
               JUST=R                                                           
         MFLD  COL2217,                                                +        
               LTH=6,                                                  +        
               JUST=R                                                           
         MFLD  COL3417,                                                +        
               LTH=4,                                                  +        
               JUST=L                                                           
         MFLD  (COL0218,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  COL0518,                                                +        
               LTH=8,                                                  +        
               JUST=L                                                           
         MFLD  COL1418,                                                +        
               LTH=8,                                                  +        
               JUST=R                                                           
         MFLD  COL2218,                                                +        
               LTH=6,                                                  +        
               JUST=R                                                           
         MFLD  COL3418,                                                +        
               LTH=4,                                                  +        
               JUST=L                                                           
         MFLD  (COL0219,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  COL0519,                                                +        
               LTH=8,                                                  +        
               JUST=L                                                           
         MFLD  COL1419,                                                +        
               LTH=8,                                                  +        
               JUST=R                                                           
         MFLD  COL2219,                                                +        
               LTH=6,                                                  +        
               JUST=R                                                           
         MFLD  COL3419,                                                +        
               LTH=4,                                                  +        
               JUST=L                                                           
         MFLD  (COL4006,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  COL4306,                                                +        
               LTH=8,                                                  +        
               JUST=L                                                           
         MFLD  COL5206,                                                +        
               LTH=10,                                                 +        
               JUST=R                                                           
         MFLD  COL6006,                                                +        
               LTH=6,                                                  +        
               JUST=R                                                           
         MFLD  COL6906,                                                +        
               LTH=4,                                                  +        
               JUST=L                                                           
         MFLD  (COL4007,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  COL4307,                                                +        
               LTH=8,                                                  +        
               JUST=L                                                           
         MFLD  COL5207,                                                +        
               LTH=10,                                                 +        
               JUST=R                                                           
         MFLD  COL6007,                                                +        
               LTH=6,                                                  +        
               JUST=R                                                           
         MFLD  COL6907,                                                +        
               LTH=4,                                                  +        
               JUST=L                                                           
         MFLD  (COL4008,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  COL4308,                                                +        
               LTH=8,                                                  +        
               JUST=L                                                           
         MFLD  COL5208,                                                +        
               LTH=10,                                                 +        
               JUST=R                                                           
         MFLD  COL6008,                                                +        
               LTH=6,                                                  +        
               JUST=R                                                           
         MFLD  COL6908,                                                +        
               LTH=4,                                                  +        
               JUST=L                                                           
         MFLD  (COL4009,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  COL4309,                                                +        
               LTH=8,                                                  +        
               JUST=L                                                           
         MFLD  COL5209,                                                +        
               LTH=10,                                                 +        
               JUST=R                                                           
         MFLD  COL6009,                                                +        
               LTH=6,                                                  +        
               JUST=R                                                           
         MFLD  COL6909,                                                +        
               LTH=4,                                                  +        
               JUST=L                                                           
         MFLD  (COL4010,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  COL4310,                                                +        
               LTH=8,                                                  +        
               JUST=L                                                           
         MFLD  COL5210,                                                +        
               LTH=10,                                                 +        
               JUST=R                                                           
         MFLD  COL6010,                                                +        
               LTH=6,                                                  +        
               JUST=R                                                           
         MFLD  COL6910,                                                +        
               LTH=4,                                                  +        
               JUST=L                                                           
         MFLD  (COL4011,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  COL4311,                                                +        
               LTH=8,                                                  +        
               JUST=L                                                           
         MFLD  COL5211,                                                +        
               LTH=10,                                                 +        
               JUST=R                                                           
         MFLD  COL6011,                                                +        
               LTH=6,                                                  +        
               JUST=R                                                           
         MFLD  COL6911,                                                +        
               LTH=4,                                                  +        
               JUST=L                                                           
         MFLD  (COL4012,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  COL4312,                                                +        
               LTH=8,                                                  +        
               JUST=L                                                           
         MFLD  COL5212,                                                +        
               LTH=10,                                                 +        
               JUST=R                                                           
         MFLD  COL6012,                                                +        
               LTH=6,                                                  +        
               JUST=R                                                           
         MFLD  COL6912,                                                +        
               LTH=4,                                                  +        
               JUST=L                                                           
         MFLD  (COL4013,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  COL4313,                                                +        
               LTH=8,                                                  +        
               JUST=L                                                           
         MFLD  COL5213,                                                +        
               LTH=10,                                                 +        
               JUST=R                                                           
         MFLD  COL6013,                                                +        
               LTH=6,                                                  +        
               JUST=R                                                           
         MFLD  COL6913,                                                +        
               LTH=4,                                                  +        
               JUST=L                                                           
         MFLD  (COL4014,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  COL4314,                                                +        
               LTH=8,                                                  +        
               JUST=L                                                           
         MFLD  COL5214,                                                +        
               LTH=10,                                                 +        
               JUST=R                                                           
         MFLD  COL6014,                                                +        
               LTH=6,                                                  +        
               JUST=R                                                           
         MFLD  COL6914,                                                +        
               LTH=4,                                                  +        
               JUST=L                                                           
         MFLD  (COL4015,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  COL4315,                                                +        
               LTH=8,                                                  +        
               JUST=L                                                           
         MFLD  COL5215,                                                +        
               LTH=10,                                                 +        
               JUST=R                                                           
         MFLD  COL6015,                                                +        
               LTH=6,                                                  +        
               JUST=R                                                           
         MFLD  COL6915,                                                +        
               LTH=4,                                                  +        
               JUST=L                                                           
         MFLD  (COL4016,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  COL4316,                                                +        
               LTH=8,                                                  +        
               JUST=L                                                           
         MFLD  COL5216,                                                +        
               LTH=10,                                                 +        
               JUST=R                                                           
         MFLD  COL6016,                                                +        
               LTH=6,                                                  +        
               JUST=R                                                           
         MFLD  COL6916,                                                +        
               LTH=4,                                                  +        
               JUST=L                                                           
         MFLD  (COL4017,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  COL4317,                                                +        
               LTH=8,                                                  +        
               JUST=L                                                           
         MFLD  COL5217,                                                +        
               LTH=10,                                                 +        
               JUST=R                                                           
         MFLD  COL6017,                                                +        
               LTH=6,                                                  +        
               JUST=R                                                           
         MFLD  COL6917,                                                +        
               LTH=4,                                                  +        
               JUST=L                                                           
         MFLD  (COL4018,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  COL4318,                                                +        
               LTH=8,                                                  +        
               JUST=L                                                           
         MFLD  COL5218,                                                +        
               LTH=10,                                                 +        
               JUST=R                                                           
         MFLD  COL6018,                                                +        
               LTH=6,                                                  +        
               JUST=R                                                           
         MFLD  COL6918,                                                +        
               LTH=4,                                                  +        
               JUST=L                                                           
         MFLD  (COL4019,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  COL4319,                                                +        
               LTH=8,                                                  +        
               JUST=L                                                           
         MFLD  COL5219,                                                +        
               LTH=10,                                                 +        
               JUST=R                                                           
         MFLD  COL6019,                                                +        
               LTH=6,                                                  +        
               JUST=R                                                           
         MFLD  COL6919,                                                +        
               LTH=4,                                                  +        
               JUST=L                                                           
         MSGEND                                                                 
         END                                                                    
