***********************************************************************         
* CREATED BY PC59009   ON 97/04/15  AT 13:08                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'ART.STAT  PARTBALANCE           '                               
W3N212   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W3T212 7',                                           +        
               8='W3T212 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W3T212U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W3T211  ',                                          +        
               14='W3T213  ',                                          +        
               15='W3T212  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((19,2)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'ART.STAT  PARTBALANCE',                                +        
               POS=(1,11),LTH=21,                                      +        
               ATTR=(PROT)                                                      
FLD0140  DFLD  POS=(1,40),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
FLD0410  DFLD  POS=(4,10),LTH=3,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0415  DFLD  POS=(4,15),LTH=2,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0420  DFLD  POS=(4,20),LTH=4,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0430  DFLD  POS=(4,30),LTH=3,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0435  DFLD  POS=(4,35),LTH=2,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0440  DFLD  POS=(4,40),LTH=4,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'Mcc  Pg  Fgrp Sumsale-b',                              +        
               POS=(5,2),LTH=23,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Sea-ind',                                              +        
               POS=(5,30),LTH=7,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Mkd  Pg  Fgrp Sumsale-b   Sea-ind',                    +        
               POS=(5,47),LTH=33,                                      +        
               ATTR=(PROT)                                                      
COL0207  DFLD  POS=(7,2),LTH=3,                                        +        
               ATTR=(PROT)                                                      
COL0707  DFLD  POS=(7,7),LTH=2,                                        +        
               ATTR=(PROT)                                                      
COL1107  DFLD  POS=(7,11),LTH=4,                                       +        
               ATTR=(PROT)                                                      
COL1707  DFLD  POS=(7,17),LTH=8,                                       +        
               ATTR=(PROT)                                                      
COL3407  DFLD  POS=(7,34),LTH=2,                                       +        
               ATTR=(PROT)                                                      
COL4707  DFLD  POS=(7,47),LTH=3,                                       +        
               ATTR=(PROT)                                                      
COL5207  DFLD  POS=(7,52),LTH=2,                                       +        
               ATTR=(PROT)                                                      
COL5607  DFLD  POS=(7,56),LTH=4,                                       +        
               ATTR=(PROT)                                                      
COL6207  DFLD  POS=(7,62),LTH=8,                                       +        
               ATTR=(PROT)                                                      
COL7707  DFLD  POS=(7,77),LTH=2,                                       +        
               ATTR=(PROT)                                                      
COL0208  DFLD  POS=(8,2),LTH=3,                                        +        
               ATTR=(PROT)                                                      
COL0708  DFLD  POS=(8,7),LTH=2,                                        +        
               ATTR=(PROT)                                                      
COL1108  DFLD  POS=(8,11),LTH=4,                                       +        
               ATTR=(PROT)                                                      
COL1708  DFLD  POS=(8,17),LTH=8,                                       +        
               ATTR=(PROT)                                                      
COL3408  DFLD  POS=(8,34),LTH=2,                                       +        
               ATTR=(PROT)                                                      
COL4708  DFLD  POS=(8,47),LTH=3,                                       +        
               ATTR=(PROT)                                                      
COL5208  DFLD  POS=(8,52),LTH=2,                                       +        
               ATTR=(PROT)                                                      
COL5608  DFLD  POS=(8,56),LTH=4,                                       +        
               ATTR=(PROT)                                                      
COL6208  DFLD  POS=(8,62),LTH=8,                                       +        
               ATTR=(PROT)                                                      
COL7708  DFLD  POS=(8,77),LTH=2,                                       +        
               ATTR=(PROT)                                                      
COL0209  DFLD  POS=(9,2),LTH=3,                                        +        
               ATTR=(PROT)                                                      
COL0709  DFLD  POS=(9,7),LTH=2,                                        +        
               ATTR=(PROT)                                                      
COL1109  DFLD  POS=(9,11),LTH=4,                                       +        
               ATTR=(PROT)                                                      
COL1709  DFLD  POS=(9,17),LTH=8,                                       +        
               ATTR=(PROT)                                                      
COL3409  DFLD  POS=(9,34),LTH=2,                                       +        
               ATTR=(PROT)                                                      
COL4709  DFLD  POS=(9,47),LTH=3,                                       +        
               ATTR=(PROT)                                                      
COL5209  DFLD  POS=(9,52),LTH=2,                                       +        
               ATTR=(PROT)                                                      
COL5609  DFLD  POS=(9,56),LTH=4,                                       +        
               ATTR=(PROT)                                                      
COL6209  DFLD  POS=(9,62),LTH=8,                                       +        
               ATTR=(PROT)                                                      
COL7709  DFLD  POS=(9,77),LTH=2,                                       +        
               ATTR=(PROT)                                                      
COL0210  DFLD  POS=(10,2),LTH=3,                                       +        
               ATTR=(PROT)                                                      
COL0710  DFLD  POS=(10,7),LTH=2,                                       +        
               ATTR=(PROT)                                                      
COL1110  DFLD  POS=(10,11),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL1710  DFLD  POS=(10,17),LTH=8,                                      +        
               ATTR=(PROT)                                                      
COL3410  DFLD  POS=(10,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
COL4710  DFLD  POS=(10,47),LTH=3,                                      +        
               ATTR=(PROT)                                                      
COL5210  DFLD  POS=(10,52),LTH=2,                                      +        
               ATTR=(PROT)                                                      
COL5610  DFLD  POS=(10,56),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL6210  DFLD  POS=(10,62),LTH=8,                                      +        
               ATTR=(PROT)                                                      
COL7710  DFLD  POS=(10,77),LTH=2,                                      +        
               ATTR=(PROT)                                                      
COL0211  DFLD  POS=(11,2),LTH=3,                                       +        
               ATTR=(PROT)                                                      
COL0711  DFLD  POS=(11,7),LTH=2,                                       +        
               ATTR=(PROT)                                                      
COL1111  DFLD  POS=(11,11),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL1711  DFLD  POS=(11,17),LTH=8,                                      +        
               ATTR=(PROT)                                                      
COL3411  DFLD  POS=(11,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
COL4711  DFLD  POS=(11,47),LTH=3,                                      +        
               ATTR=(PROT)                                                      
COL5211  DFLD  POS=(11,52),LTH=2,                                      +        
               ATTR=(PROT)                                                      
COL5611  DFLD  POS=(11,56),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL6211  DFLD  POS=(11,62),LTH=8,                                      +        
               ATTR=(PROT)                                                      
COL7711  DFLD  POS=(11,77),LTH=2,                                      +        
               ATTR=(PROT)                                                      
COL0212  DFLD  POS=(12,2),LTH=3,                                       +        
               ATTR=(PROT)                                                      
COL0712  DFLD  POS=(12,7),LTH=2,                                       +        
               ATTR=(PROT)                                                      
COL1112  DFLD  POS=(12,11),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL1712  DFLD  POS=(12,17),LTH=8,                                      +        
               ATTR=(PROT)                                                      
COL3412  DFLD  POS=(12,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
COL4712  DFLD  POS=(12,47),LTH=3,                                      +        
               ATTR=(PROT)                                                      
COL5212  DFLD  POS=(12,52),LTH=2,                                      +        
               ATTR=(PROT)                                                      
COL5612  DFLD  POS=(12,56),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL6212  DFLD  POS=(12,62),LTH=8,                                      +        
               ATTR=(PROT)                                                      
COL7712  DFLD  POS=(12,77),LTH=2,                                      +        
               ATTR=(PROT)                                                      
COL0213  DFLD  POS=(13,2),LTH=3,                                       +        
               ATTR=(PROT)                                                      
COL0713  DFLD  POS=(13,7),LTH=2,                                       +        
               ATTR=(PROT)                                                      
COL1113  DFLD  POS=(13,11),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL1713  DFLD  POS=(13,17),LTH=8,                                      +        
               ATTR=(PROT)                                                      
COL3413  DFLD  POS=(13,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
COL4713  DFLD  POS=(13,47),LTH=3,                                      +        
               ATTR=(PROT)                                                      
COL5213  DFLD  POS=(13,52),LTH=2,                                      +        
               ATTR=(PROT)                                                      
COL5613  DFLD  POS=(13,56),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL6213  DFLD  POS=(13,62),LTH=8,                                      +        
               ATTR=(PROT)                                                      
COL7713  DFLD  POS=(13,77),LTH=2,                                      +        
               ATTR=(PROT)                                                      
COL0214  DFLD  POS=(14,2),LTH=3,                                       +        
               ATTR=(PROT)                                                      
COL0714  DFLD  POS=(14,7),LTH=2,                                       +        
               ATTR=(PROT)                                                      
COL1114  DFLD  POS=(14,11),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL1714  DFLD  POS=(14,17),LTH=8,                                      +        
               ATTR=(PROT)                                                      
COL3414  DFLD  POS=(14,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
COL4714  DFLD  POS=(14,47),LTH=3,                                      +        
               ATTR=(PROT)                                                      
COL5214  DFLD  POS=(14,52),LTH=2,                                      +        
               ATTR=(PROT)                                                      
COL5614  DFLD  POS=(14,56),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL6214  DFLD  POS=(14,62),LTH=8,                                      +        
               ATTR=(PROT)                                                      
COL7714  DFLD  POS=(14,77),LTH=2,                                      +        
               ATTR=(PROT)                                                      
COL0215  DFLD  POS=(15,2),LTH=3,                                       +        
               ATTR=(PROT)                                                      
COL0715  DFLD  POS=(15,7),LTH=2,                                       +        
               ATTR=(PROT)                                                      
COL1115  DFLD  POS=(15,11),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL1715  DFLD  POS=(15,17),LTH=8,                                      +        
               ATTR=(PROT)                                                      
COL3415  DFLD  POS=(15,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
COL4715  DFLD  POS=(15,47),LTH=3,                                      +        
               ATTR=(PROT)                                                      
COL5215  DFLD  POS=(15,52),LTH=2,                                      +        
               ATTR=(PROT)                                                      
COL5615  DFLD  POS=(15,56),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL6215  DFLD  POS=(15,62),LTH=8,                                      +        
               ATTR=(PROT)                                                      
COL7715  DFLD  POS=(15,77),LTH=2,                                      +        
               ATTR=(PROT)                                                      
COL0216  DFLD  POS=(16,2),LTH=3,                                       +        
               ATTR=(PROT)                                                      
COL0716  DFLD  POS=(16,7),LTH=2,                                       +        
               ATTR=(PROT)                                                      
COL1116  DFLD  POS=(16,11),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL1716  DFLD  POS=(16,17),LTH=8,                                      +        
               ATTR=(PROT)                                                      
COL3416  DFLD  POS=(16,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
COL4716  DFLD  POS=(16,47),LTH=3,                                      +        
               ATTR=(PROT)                                                      
COL5216  DFLD  POS=(16,52),LTH=2,                                      +        
               ATTR=(PROT)                                                      
COL5616  DFLD  POS=(16,56),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL6216  DFLD  POS=(16,62),LTH=8,                                      +        
               ATTR=(PROT)                                                      
COL7716  DFLD  POS=(16,77),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Mcc  Pg  Fgrp Sumsale-b',                              +        
               POS=(18,2),LTH=23,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Sea-ind',                                              +        
               POS=(18,30),LTH=7,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Ccmd',                                                 +        
               POS=(18,47),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD1902  DFLD  POS=(19,2),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
FLD1907  DFLD  POS=(19,7),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
FLD1911  DFLD  POS=(19,11),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
FLD1917  DFLD  POS=(19,17),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
FLD1934  DFLD  POS=(19,34),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
FLD1949  DFLD  POS=(19,49),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  '13 Adjustment   14 Seasoncurve  15 Partblance   16',   +        
               POS=(21,2),LTH=50,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 Whelp',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W3O212N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W3N212,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W3I212N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0140,                                                +        
               LTH=40                                                           
         MFLD  FLD0410,                                                +        
               LTH=3                                                            
         MFLD  FLD0415,                                                +        
               LTH=2                                                            
         MFLD  FLD0420,                                                +        
               LTH=4                                                            
         MFLD  FLD0430,                                                +        
               LTH=3                                                            
         MFLD  FLD0435,                                                +        
               LTH=2                                                            
         MFLD  FLD0440,                                                +        
               LTH=4                                                            
         MFLD  COL0207,                                                +        
               LTH=3                                                            
         MFLD  COL0707,                                                +        
               LTH=2                                                            
         MFLD  COL1107,                                                +        
               LTH=4                                                            
         MFLD  COL1707,                                                +        
               LTH=8                                                            
         MFLD  FILLER07,                                               +        
               LTH=6                                                            
         MFLD  COL3407,                                                +        
               LTH=2                                                            
         MFLD  COL0208,                                                +        
               LTH=3                                                            
         MFLD  COL0708,                                                +        
               LTH=2                                                            
         MFLD  COL1108,                                                +        
               LTH=4                                                            
         MFLD  COL1708,                                                +        
               LTH=8                                                            
         MFLD  FILLER08,                                               +        
               LTH=6                                                            
         MFLD  COL3408,                                                +        
               LTH=2                                                            
         MFLD  COL0209,                                                +        
               LTH=3                                                            
         MFLD  COL0709,                                                +        
               LTH=2                                                            
         MFLD  COL1109,                                                +        
               LTH=4                                                            
         MFLD  COL1709,                                                +        
               LTH=8                                                            
         MFLD  FILLER09,                                               +        
               LTH=6                                                            
         MFLD  COL3409,                                                +        
               LTH=2                                                            
         MFLD  COL0210,                                                +        
               LTH=3                                                            
         MFLD  COL0710,                                                +        
               LTH=2                                                            
         MFLD  COL1110,                                                +        
               LTH=4                                                            
         MFLD  COL1710,                                                +        
               LTH=8                                                            
         MFLD  FILLER10,                                               +        
               LTH=6                                                            
         MFLD  COL3410,                                                +        
               LTH=2                                                            
         MFLD  COL0211,                                                +        
               LTH=3                                                            
         MFLD  COL0711,                                                +        
               LTH=2                                                            
         MFLD  COL1111,                                                +        
               LTH=4                                                            
         MFLD  COL1711,                                                +        
               LTH=8                                                            
         MFLD  FILLER11,                                               +        
               LTH=6                                                            
         MFLD  COL3411,                                                +        
               LTH=2                                                            
         MFLD  COL0212,                                                +        
               LTH=3                                                            
         MFLD  COL0712,                                                +        
               LTH=2                                                            
         MFLD  COL1112,                                                +        
               LTH=4                                                            
         MFLD  COL1712,                                                +        
               LTH=8                                                            
         MFLD  FILLER12,                                               +        
               LTH=6                                                            
         MFLD  COL3412,                                                +        
               LTH=2                                                            
         MFLD  COL0213,                                                +        
               LTH=3                                                            
         MFLD  COL0713,                                                +        
               LTH=2                                                            
         MFLD  COL1113,                                                +        
               LTH=4                                                            
         MFLD  COL1713,                                                +        
               LTH=8                                                            
         MFLD  FILLER13,                                               +        
               LTH=6                                                            
         MFLD  COL3413,                                                +        
               LTH=2                                                            
         MFLD  COL0214,                                                +        
               LTH=3                                                            
         MFLD  COL0714,                                                +        
               LTH=2                                                            
         MFLD  COL1114,                                                +        
               LTH=4                                                            
         MFLD  COL1714,                                                +        
               LTH=8                                                            
         MFLD  FILLER14,                                               +        
               LTH=6                                                            
         MFLD  COL3414,                                                +        
               LTH=2                                                            
         MFLD  COL0215,                                                +        
               LTH=3                                                            
         MFLD  COL0715,                                                +        
               LTH=2                                                            
         MFLD  COL1115,                                                +        
               LTH=4                                                            
         MFLD  COL1715,                                                +        
               LTH=8                                                            
         MFLD  FILLER15,                                               +        
               LTH=6                                                            
         MFLD  COL3415,                                                +        
               LTH=2                                                            
         MFLD  COL0216,                                                +        
               LTH=3                                                            
         MFLD  COL0716,                                                +        
               LTH=2                                                            
         MFLD  COL1116,                                                +        
               LTH=4                                                            
         MFLD  COL1716,                                                +        
               LTH=8                                                            
         MFLD  FILLER16,                                               +        
               LTH=6                                                            
         MFLD  COL3416,                                                +        
               LTH=2                                                            
         MFLD  COL4707,                                                +        
               LTH=3                                                            
         MFLD  COL5207,                                                +        
               LTH=2                                                            
         MFLD  COL5607,                                                +        
               LTH=4                                                            
         MFLD  COL6207,                                                +        
               LTH=8                                                            
         MFLD  FALT07,                                                 +        
               LTH=6                                                            
         MFLD  COL7707,                                                +        
               LTH=2                                                            
         MFLD  COL4708,                                                +        
               LTH=3                                                            
         MFLD  COL5208,                                                +        
               LTH=2                                                            
         MFLD  COL5608,                                                +        
               LTH=4                                                            
         MFLD  COL6208,                                                +        
               LTH=8                                                            
         MFLD  FALT08,                                                 +        
               LTH=6                                                            
         MFLD  COL7708,                                                +        
               LTH=2                                                            
         MFLD  COL4709,                                                +        
               LTH=3                                                            
         MFLD  COL5209,                                                +        
               LTH=2                                                            
         MFLD  COL5609,                                                +        
               LTH=4                                                            
         MFLD  COL6209,                                                +        
               LTH=8                                                            
         MFLD  FALT09,                                                 +        
               LTH=6                                                            
         MFLD  COL7709,                                                +        
               LTH=2                                                            
         MFLD  COL4710,                                                +        
               LTH=3                                                            
         MFLD  COL5210,                                                +        
               LTH=2                                                            
         MFLD  COL5610,                                                +        
               LTH=4                                                            
         MFLD  COL6210,                                                +        
               LTH=8                                                            
         MFLD  FALT10,                                                 +        
               LTH=6                                                            
         MFLD  COL7710,                                                +        
               LTH=2                                                            
         MFLD  COL4711,                                                +        
               LTH=3                                                            
         MFLD  COL5211,                                                +        
               LTH=2                                                            
         MFLD  COL5611,                                                +        
               LTH=4                                                            
         MFLD  COL6211,                                                +        
               LTH=8                                                            
         MFLD  FALT11,                                                 +        
               LTH=6                                                            
         MFLD  COL7711,                                                +        
               LTH=2                                                            
         MFLD  COL4712,                                                +        
               LTH=3                                                            
         MFLD  COL5212,                                                +        
               LTH=2                                                            
         MFLD  COL5612,                                                +        
               LTH=4                                                            
         MFLD  COL6212,                                                +        
               LTH=8                                                            
         MFLD  FALT12,                                                 +        
               LTH=6                                                            
         MFLD  COL7712,                                                +        
               LTH=2                                                            
         MFLD  COL4713,                                                +        
               LTH=3                                                            
         MFLD  COL5213,                                                +        
               LTH=2                                                            
         MFLD  COL5613,                                                +        
               LTH=4                                                            
         MFLD  COL6213,                                                +        
               LTH=8                                                            
         MFLD  FALT13,                                                 +        
               LTH=6                                                            
         MFLD  COL7713,                                                +        
               LTH=2                                                            
         MFLD  COL4714,                                                +        
               LTH=3                                                            
         MFLD  COL5214,                                                +        
               LTH=2                                                            
         MFLD  COL5614,                                                +        
               LTH=4                                                            
         MFLD  COL6214,                                                +        
               LTH=8                                                            
         MFLD  FALT14,                                                 +        
               LTH=6                                                            
         MFLD  COL7714,                                                +        
               LTH=2                                                            
         MFLD  COL4715,                                                +        
               LTH=3                                                            
         MFLD  COL5215,                                                +        
               LTH=2                                                            
         MFLD  COL5615,                                                +        
               LTH=4                                                            
         MFLD  COL6215,                                                +        
               LTH=8                                                            
         MFLD  FALT15,                                                 +        
               LTH=6                                                            
         MFLD  COL7715,                                                +        
               LTH=2                                                            
         MFLD  COL4716,                                                +        
               LTH=3                                                            
         MFLD  COL5216,                                                +        
               LTH=2                                                            
         MFLD  COL5616,                                                +        
               LTH=4                                                            
         MFLD  COL6216,                                                +        
               LTH=8                                                            
         MFLD  FALT16,                                                 +        
               LTH=6                                                            
         MFLD  COL7716,                                                +        
               LTH=2                                                            
         MFLD  FLD1902,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1907,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1911,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1917,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FILLER,                                                 +        
               LTH=6                                                            
         MFLD  FLD1934,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1949,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W3I212N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W3N212),                                           +        
               OPT=2,                                                  +        
               NXT=W3O212N1                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '32122',                                                +        
               LTH=5                                                            
         MFLD  FLD0410,                                                +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0415,                                                +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0420,                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0430,                                                +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0435,                                                +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0440,                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1902,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1907,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1911,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1917,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  '000.00',                                               +        
               LTH=6                                                            
         MFLD  (FLD1934,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1949,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
