***********************************************************************         
* CREATED BY PC65797   ON 98/04/06  AT 15:39                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'PRICEBOOK ONLINE                '                               
W3N322   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W3T322 7',                                           +        
               8='W3T322 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W3N322   DPAGE CURSOR=((2,17)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Pricebook',                                            +        
               POS=(1,11),LTH=9,                                       +        
               ATTR=(PROT)                                                      
FELMEDD  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Function group',                                       +        
               POS=(2,2),LTH=14,                                       +        
               ATTR=(ALPHA,PROT)                                                
FKNGRPIN DFLD  POS=(2,17),LTH=4,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Product item',                                         +        
               POS=(2,23),LTH=12,                                      +        
               ATTR=(PROT)                                                      
PRODSLIN DFLD  POS=(2,36),LTH=2,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Supplier No.',                                         +        
               POS=(2,40),LTH=12,                                      +        
               ATTR=(PROT)                                                      
LEVNRIN  DFLD  POS=(2,53),LTH=5,                                       +        
               ATTR=(NOPROT,MOD)                                                
FKNGRPUT DFLD  POS=(3,17),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
PRODSLUT DFLD  POS=(3,36),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
LEVNRUT  DFLD  POS=(3,53),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  ' Part No. Description Supplier No.',                   +        
               POS=(5,2),LTH=34,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'AF2 Piece    Gram Sub   Cost of AF2/   Exp.',          +        
               POS=(5,37),LTH=44,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Sales GP',                                             +        
               POS=(6,63),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Date',                                                 +        
               POS=(6,76),LTH=4,                                       +        
               ATTR=(PROT)                                                      
ARTNR1   DFLD  POS=(7,2),LTH=9,                                        +        
               ATTR=(PROT,MOD)                                                  
BEART1   DFLD  POS=(7,12),LTH=18,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
LEVNR1   DFLD  POS=(7,31),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
AF2ST1   DFLD  POS=(7,37),LTH=9,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
GRAM1    DFLD  POS=(7,47),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
ERS1     DFLD  POS=(7,55),LTH=2,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
ARTSJK1  DFLD  POS=(7,58),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
AF2TG1   DFLD  POS=(7,69),LTH=5,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
URPROD1  DFLD  POS=(7,76),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
ARTNR2   DFLD  POS=(8,2),LTH=9,                                        +        
               ATTR=(PROT,MOD)                                                  
BEART2   DFLD  POS=(8,12),LTH=18,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
LEVNR2   DFLD  POS=(8,31),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
AF2ST2   DFLD  POS=(8,37),LTH=9,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
GRAM2    DFLD  POS=(8,47),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
ERS2     DFLD  POS=(8,55),LTH=2,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
ARTSJK2  DFLD  POS=(8,58),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
AF2TG2   DFLD  POS=(8,69),LTH=5,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
URPROD2  DFLD  POS=(8,76),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
ARTNR3   DFLD  POS=(9,2),LTH=9,                                        +        
               ATTR=(PROT,MOD)                                                  
BEART3   DFLD  POS=(9,12),LTH=18,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
LEVNR3   DFLD  POS=(9,31),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
AF2ST3   DFLD  POS=(9,37),LTH=9,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
GRAM3    DFLD  POS=(9,47),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
ERS3     DFLD  POS=(9,55),LTH=2,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
ARTSJK3  DFLD  POS=(9,58),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
AF2TG3   DFLD  POS=(9,69),LTH=5,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
URPROD3  DFLD  POS=(9,76),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
ARTNR4   DFLD  POS=(10,2),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
BEART4   DFLD  POS=(10,12),LTH=18,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
LEVNR4   DFLD  POS=(10,31),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
AF2ST4   DFLD  POS=(10,37),LTH=9,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
GRAM4    DFLD  POS=(10,47),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ERS4     DFLD  POS=(10,55),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ARTSJK4  DFLD  POS=(10,58),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
AF2TG4   DFLD  POS=(10,69),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
URPROD4  DFLD  POS=(10,76),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ARTNR5   DFLD  POS=(11,2),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
BEART5   DFLD  POS=(11,12),LTH=18,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
LEVNR5   DFLD  POS=(11,31),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
AF2ST5   DFLD  POS=(11,37),LTH=9,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
GRAM5    DFLD  POS=(11,47),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ERS5     DFLD  POS=(11,55),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ARTSJK5  DFLD  POS=(11,58),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
AF2TG5   DFLD  POS=(11,69),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
URPROD5  DFLD  POS=(11,76),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ARTNR6   DFLD  POS=(12,2),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
BEART6   DFLD  POS=(12,12),LTH=18,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
LEVNR6   DFLD  POS=(12,31),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
AF2ST6   DFLD  POS=(12,37),LTH=9,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
GRAM6    DFLD  POS=(12,47),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ERS6     DFLD  POS=(12,55),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ARTSJK6  DFLD  POS=(12,58),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
AF2TG6   DFLD  POS=(12,69),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
URPROD6  DFLD  POS=(12,76),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ARTNR7   DFLD  POS=(13,2),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
BEART7   DFLD  POS=(13,12),LTH=18,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
LEVNR7   DFLD  POS=(13,31),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
AF2ST7   DFLD  POS=(13,37),LTH=9,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
GRAM7    DFLD  POS=(13,47),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ERS7     DFLD  POS=(13,55),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ARTSJK7  DFLD  POS=(13,58),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
AF2TG7   DFLD  POS=(13,69),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
URPROD7  DFLD  POS=(13,76),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ARTNR8   DFLD  POS=(14,2),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
BEART8   DFLD  POS=(14,12),LTH=18,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
LEVNR8   DFLD  POS=(14,31),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
AF2ST8   DFLD  POS=(14,37),LTH=9,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
GRAM8    DFLD  POS=(14,47),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ERS8     DFLD  POS=(14,55),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ARTSJK8  DFLD  POS=(14,58),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
AF2TG8   DFLD  POS=(14,69),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
URPROD8  DFLD  POS=(14,76),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ARTNR9   DFLD  POS=(15,2),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
BEART9   DFLD  POS=(15,12),LTH=18,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
LEVNR9   DFLD  POS=(15,31),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
AF2ST9   DFLD  POS=(15,37),LTH=9,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
GRAM9    DFLD  POS=(15,47),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ERS9     DFLD  POS=(15,55),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ARTSJK9  DFLD  POS=(15,58),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
AF2TG9   DFLD  POS=(15,69),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
URPROD9  DFLD  POS=(15,76),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ARTNR10  DFLD  POS=(16,2),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
BEART10  DFLD  POS=(16,12),LTH=18,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
LEVNR10  DFLD  POS=(16,31),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
AF2ST10  DFLD  POS=(16,37),LTH=9,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
GRAM10   DFLD  POS=(16,47),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ERS10    DFLD  POS=(16,55),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ARTSJK10 DFLD  POS=(16,58),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
AF2TG10  DFLD  POS=(16,69),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
URPROD10 DFLD  POS=(16,76),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ARTNR11  DFLD  POS=(17,2),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
BEART11  DFLD  POS=(17,12),LTH=18,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
LEVNR11  DFLD  POS=(17,31),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
AF2ST11  DFLD  POS=(17,37),LTH=9,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
GRAM11   DFLD  POS=(17,47),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ERS11    DFLD  POS=(17,55),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ARTSJK11 DFLD  POS=(17,58),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
AF2TG11  DFLD  POS=(17,69),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
URPROD11 DFLD  POS=(17,76),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ARTNR12  DFLD  POS=(18,2),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
BEART12  DFLD  POS=(18,12),LTH=18,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
LEVNR12  DFLD  POS=(18,31),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
AF2ST12  DFLD  POS=(18,37),LTH=9,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
GRAM12   DFLD  POS=(18,47),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ERS12    DFLD  POS=(18,55),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ARTSJK12 DFLD  POS=(18,58),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
AF2TG12  DFLD  POS=(18,69),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
URPROD12 DFLD  POS=(18,76),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  '13',                                                   +        
               POS=(19,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '14',                                                   +        
               POS=(19,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '15',                                                   +        
               POS=(19,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16',                                                   +        
               POS=(19,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(19,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(20,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(20,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(20,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(20,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(20,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(21,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(21,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATUM    DFLD  POS=(21,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TID      DFLD  POS=(21,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(22,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W3O322N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W3N322,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W3I322N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W3N322                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FELMEDD,                                                +        
               LTH=40                                                           
         MFLD  FKNGRPIN,                                               +        
               LTH=4                                                            
         MFLD  FKNGRPUT,                                               +        
               LTH=4                                                            
         MFLD  PRODSLIN,                                               +        
               LTH=2                                                            
         MFLD  PRODSLUT,                                               +        
               LTH=2                                                            
         MFLD  LEVNRIN,                                                +        
               LTH=5                                                            
         MFLD  LEVNRUT,                                                +        
               LTH=5                                                            
         MFLD  ARTNR1,                                                 +        
               LTH=9                                                            
         MFLD  BEART1,                                                 +        
               LTH=18                                                           
         MFLD  LEVNR1,                                                 +        
               LTH=5                                                            
         MFLD  AF2ST1,                                                 +        
               LTH=9                                                            
         MFLD  GRAM1,                                                  +        
               LTH=7                                                            
         MFLD  ERS1,                                                   +        
               LTH=2                                                            
         MFLD  ARTSJK1,                                                +        
               LTH=10                                                           
         MFLD  AF2TG1,                                                 +        
               LTH=5                                                            
         MFLD  URPROD1,                                                +        
               LTH=4                                                            
         MFLD  ARTNR2,                                                 +        
               LTH=9                                                            
         MFLD  BEART2,                                                 +        
               LTH=18                                                           
         MFLD  LEVNR2,                                                 +        
               LTH=5                                                            
         MFLD  AF2ST2,                                                 +        
               LTH=9                                                            
         MFLD  GRAM2,                                                  +        
               LTH=7                                                            
         MFLD  ERS2,                                                   +        
               LTH=2                                                            
         MFLD  ARTSJK2,                                                +        
               LTH=10                                                           
         MFLD  AF2TG2,                                                 +        
               LTH=5                                                            
         MFLD  URPROD2,                                                +        
               LTH=4                                                            
         MFLD  ARTNR3,                                                 +        
               LTH=9                                                            
         MFLD  BEART3,                                                 +        
               LTH=18                                                           
         MFLD  LEVNR3,                                                 +        
               LTH=5                                                            
         MFLD  AF2ST3,                                                 +        
               LTH=9                                                            
         MFLD  GRAM3,                                                  +        
               LTH=7                                                            
         MFLD  ERS3,                                                   +        
               LTH=2                                                            
         MFLD  ARTSJK3,                                                +        
               LTH=10                                                           
         MFLD  AF2TG3,                                                 +        
               LTH=5                                                            
         MFLD  URPROD3,                                                +        
               LTH=4                                                            
         MFLD  ARTNR4,                                                 +        
               LTH=9                                                            
         MFLD  BEART4,                                                 +        
               LTH=18                                                           
         MFLD  LEVNR4,                                                 +        
               LTH=5                                                            
         MFLD  AF2ST4,                                                 +        
               LTH=9                                                            
         MFLD  GRAM4,                                                  +        
               LTH=7                                                            
         MFLD  ERS4,                                                   +        
               LTH=2                                                            
         MFLD  ARTSJK4,                                                +        
               LTH=10                                                           
         MFLD  AF2TG4,                                                 +        
               LTH=5                                                            
         MFLD  URPROD4,                                                +        
               LTH=4                                                            
         MFLD  ARTNR5,                                                 +        
               LTH=9                                                            
         MFLD  BEART5,                                                 +        
               LTH=18                                                           
         MFLD  LEVNR5,                                                 +        
               LTH=5                                                            
         MFLD  AF2ST5,                                                 +        
               LTH=9                                                            
         MFLD  GRAM5,                                                  +        
               LTH=7                                                            
         MFLD  ERS5,                                                   +        
               LTH=2                                                            
         MFLD  ARTSJK5,                                                +        
               LTH=10                                                           
         MFLD  AF2TG5,                                                 +        
               LTH=5                                                            
         MFLD  URPROD5,                                                +        
               LTH=4                                                            
         MFLD  ARTNR6,                                                 +        
               LTH=9                                                            
         MFLD  BEART6,                                                 +        
               LTH=18                                                           
         MFLD  LEVNR6,                                                 +        
               LTH=5                                                            
         MFLD  AF2ST6,                                                 +        
               LTH=9                                                            
         MFLD  GRAM6,                                                  +        
               LTH=7                                                            
         MFLD  ERS6,                                                   +        
               LTH=2                                                            
         MFLD  ARTSJK6,                                                +        
               LTH=10                                                           
         MFLD  AF2TG6,                                                 +        
               LTH=5                                                            
         MFLD  URPROD6,                                                +        
               LTH=4                                                            
         MFLD  ARTNR7,                                                 +        
               LTH=9                                                            
         MFLD  BEART7,                                                 +        
               LTH=18                                                           
         MFLD  LEVNR7,                                                 +        
               LTH=5                                                            
         MFLD  AF2ST7,                                                 +        
               LTH=9                                                            
         MFLD  GRAM7,                                                  +        
               LTH=7                                                            
         MFLD  ERS7,                                                   +        
               LTH=2                                                            
         MFLD  ARTSJK7,                                                +        
               LTH=10                                                           
         MFLD  AF2TG7,                                                 +        
               LTH=5                                                            
         MFLD  URPROD7,                                                +        
               LTH=4                                                            
         MFLD  ARTNR8,                                                 +        
               LTH=9                                                            
         MFLD  BEART8,                                                 +        
               LTH=18                                                           
         MFLD  LEVNR8,                                                 +        
               LTH=5                                                            
         MFLD  AF2ST8,                                                 +        
               LTH=9                                                            
         MFLD  GRAM8,                                                  +        
               LTH=7                                                            
         MFLD  ERS8,                                                   +        
               LTH=2                                                            
         MFLD  ARTSJK8,                                                +        
               LTH=10                                                           
         MFLD  AF2TG8,                                                 +        
               LTH=5                                                            
         MFLD  URPROD8,                                                +        
               LTH=4                                                            
         MFLD  ARTNR9,                                                 +        
               LTH=9                                                            
         MFLD  BEART9,                                                 +        
               LTH=18                                                           
         MFLD  LEVNR9,                                                 +        
               LTH=5                                                            
         MFLD  AF2ST9,                                                 +        
               LTH=9                                                            
         MFLD  GRAM9,                                                  +        
               LTH=7                                                            
         MFLD  ERS9,                                                   +        
               LTH=2                                                            
         MFLD  ARTSJK9,                                                +        
               LTH=10                                                           
         MFLD  AF2TG9,                                                 +        
               LTH=5                                                            
         MFLD  URPROD9,                                                +        
               LTH=4                                                            
         MFLD  ARTNR10,                                                +        
               LTH=9                                                            
         MFLD  BEART10,                                                +        
               LTH=18                                                           
         MFLD  LEVNR10,                                                +        
               LTH=5                                                            
         MFLD  AF2ST10,                                                +        
               LTH=9                                                            
         MFLD  GRAM10,                                                 +        
               LTH=7                                                            
         MFLD  ERS10,                                                  +        
               LTH=2                                                            
         MFLD  ARTSJK10,                                               +        
               LTH=10                                                           
         MFLD  AF2TG10,                                                +        
               LTH=5                                                            
         MFLD  URPROD10,                                               +        
               LTH=4                                                            
         MFLD  ARTNR11,                                                +        
               LTH=9                                                            
         MFLD  BEART11,                                                +        
               LTH=18                                                           
         MFLD  LEVNR11,                                                +        
               LTH=5                                                            
         MFLD  AF2ST11,                                                +        
               LTH=9                                                            
         MFLD  GRAM11,                                                 +        
               LTH=7                                                            
         MFLD  ERS11,                                                  +        
               LTH=2                                                            
         MFLD  ARTSJK11,                                               +        
               LTH=10                                                           
         MFLD  AF2TG11,                                                +        
               LTH=5                                                            
         MFLD  URPROD11,                                               +        
               LTH=4                                                            
         MFLD  ARTNR12,                                                +        
               LTH=9                                                            
         MFLD  BEART12,                                                +        
               LTH=18                                                           
         MFLD  LEVNR12,                                                +        
               LTH=5                                                            
         MFLD  AF2ST12,                                                +        
               LTH=9                                                            
         MFLD  GRAM12,                                                 +        
               LTH=7                                                            
         MFLD  ERS12,                                                  +        
               LTH=2                                                            
         MFLD  ARTSJK12,                                               +        
               LTH=10                                                           
         MFLD  AF2TG12,                                                +        
               LTH=5                                                            
         MFLD  URPROD12,                                               +        
               LTH=4                                                            
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATUM,                                                 +        
               DATE4)                                                           
         MFLD  (TID,                                                   +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W3I322N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W3N322),                                           +        
               OPT=2,                                                  +        
               NXT=W3O322N1                                                     
MID      LPAGE SOR=(W3N322)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '33222',                                                +        
               LTH=5                                                            
         MFLD  (FKNGRPIN,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FKNGRPUT,                                               +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (PRODSLIN,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  PRODSLUT,                                               +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (LEVNRIN,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  LEVNRUT,                                                +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
