***********************************************************************         
* CREATED BY PC59009   ON 97/03/21  AT 12:39                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'SJK-/STD-PRICE PERCENTINCREASE  '                               
W3N318   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W3T318 7',                                           +        
               8='W3T318 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W3T318U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W3T311  ',                                          +        
               14='W3T312  ',                                          +        
               15='W3T313  ',                                          +        
               16='W3T314  ',                                          +        
               17='W3T315  ',                                          +        
               18='W3T316  ',                                          +        
               19='W3T317  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W3T318U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W3N318   DPAGE CURSOR=((2,14)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'SJK-STD-PRICE PERC INCREASE',                          +        
               POS=(1,11),LTH=27,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Pricearea ',                                           +        
               POS=(2,2),LTH=10,                                       +        
               ATTR=(ALPHA,PROT)                                                
IDPROMRI DFLD  POS=(2,14),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
IDPROMRU DFLD  POS=(3,14),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
TEXT1    DFLD  POS=(3,20),LTH=12,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Percent Increase',                                     +        
               POS=(5,10),LTH=16,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Valid for',                                            +        
               POS=(5,38),LTH=9,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'On SJK STD',                                           +        
               POS=(6,16),LTH=10,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'date ',                                                +        
               POS=(6,38),LTH=5,                                       +        
               ATTR=(PROT)                                                      
REARTRAB DFLD  POS=(7,24),LTH=2,                                       +        
               ATTR=(PROT)                                                      
TISTADAT DFLD  POS=(7,38),LTH=6,                                       +        
               ATTR=(PROT)                                                      
DGIA0000 DFLD  POS=(8,24),LTH=2,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  '13 Payer record 14 Pricearea    15 Price artno  16 Art +        
               kam disc 17 Norm        ',                              +        
               POS=(21,2),LTH=79,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18 Tran discoun 19 Art discoun  20',                   +        
               POS=(22,2),LTH=34,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 Whelp',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W3O318N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W3N318,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W3I318N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W3N318                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDPROMRI,                                               +        
               LTH=3                                                            
         MFLD  IDPROMRU,                                               +        
               LTH=3                                                            
         MFLD  TEXT1,                                                  +        
               LTH=12                                                           
         MFLD  REARTRAB,                                               +        
               LTH=2                                                            
         MFLD  TISTADAT,                                               +        
               LTH=6                                                            
         MFLD  DGIA0000,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W3I318N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W3N318),                                           +        
               OPT=2,                                                  +        
               NXT=W3O318N1                                                     
MID      LPAGE SOR=(W3N318)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F8'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '33182',                                                +        
               LTH=5                                                            
         MFLD  (IDPROMRI,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (IDPROMRU,                                              +        
               '   '),                                                 +        
               LTH=3                                                            
         MFLD  (DGIA0000,                                              +        
               '+++++'),                                               +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
