***********************************************************************         
* CREATED BY PC30179   ON 96/12/02  AT 10:00                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'PAYER REGISTER                  '                               
W3N311   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W3T311 7',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W3T311U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W3T311  ',                                          +        
               14='W3T312  ',                                          +        
               15='W3T313  ',                                          +        
               16='W3T314  ',                                          +        
               17='W3T315  ',                                          +        
               18='W3T316  ',                                          +        
               19='W3T317  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W3T311U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'PAYER REGISTER',                                       +        
               POS=(1,10),LTH=14,                                      +        
               ATTR=(NUM,PROT)                                                  
TEMFSFEL DFLD  POS=(1,40),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'PayerID',                                              +        
               POS=(2,2),LTH=7,                                        +        
               ATTR=(PROT)                                                      
DGIA0006 DFLD  POS=(2,12),LTH=9,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'CC',                                                   +        
               POS=(2,26),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDFTG001 DFLD  POS=(2,32),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'District',                                             +        
               POS=(2,38),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DGIA0017 DFLD  POS=(2,50),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0007 DFLD  POS=(3,12),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
IDFTG002 DFLD  POS=(3,32),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0018 DFLD  POS=(3,50),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0008 DFLD  POS=(4,2),LTH=9,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0016 DFLD  POS=(4,14),LTH=4,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
         DFLD  'Name',                                                 +        
               POS=(6,2),LTH=4,                                        +        
               ATTR=(PROT)                                                      
DGIA0003 DFLD  POS=(6,11),LTH=35,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Payer identity',                                       +        
               POS=(6,48),LTH=14,                                      +        
               ATTR=(PROT)                                                      
DGIA0019 DFLD  POS=(6,64),LTH=9,                                       +        
               ATTR=(PROT)                                                      
DGIA0004 DFLD  POS=(7,11),LTH=35,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Adress',                                               +        
               POS=(9,2),LTH=6,                                        +        
               ATTR=(PROT)                                                      
DGIA0001 DFLD  POS=(9,11),LTH=35,                                      +        
               ATTR=(PROT)                                                      
DGIA0002 DFLD  POS=(10,11),LTH=35,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Currency',                                             +        
               POS=(10,63),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Market company',                                       +        
               POS=(12,2),LTH=14,                                      +        
               ATTR=(PROT)                                                      
DGIA0012 DFLD  POS=(12,17),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0013 DFLD  POS=(12,20),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Market company :',                                     +        
               POS=(12,29),LTH=16,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'A M1 = RENAULT & LANDROVER',                           +        
               POS=(13,29),LTH=26,                                     +        
               ATTR=(PROT)                                                      
KDVALIS1 DFLD  POS=(13,66),LTH=3,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Price area',                                           +        
               POS=(14,2),LTH=10,                                      +        
               ATTR=(PROT)                                                      
DGIA0014 DFLD  POS=(14,16),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0015 DFLD  POS=(14,21),LTH=3,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'B M2 = BASE & EUROPE',                                 +        
               POS=(14,29),LTH=20,                                     +        
               ATTR=(PROT)                                                      
KDVALIS2 DFLD  POS=(14,66),LTH=3,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'C M3 = VCI ',                                          +        
               POS=(15,29),LTH=11,                                     +        
               ATTR=(PROT)                                                      
KDVALIS3 DFLD  POS=(15,66),LTH=3,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Alt disc code',                                        +        
               POS=(16,2),LTH=13,                                      +        
               ATTR=(PROT)                                                      
DGIA0020 DFLD  POS=(16,16),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0021 DFLD  POS=(16,19),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'E M5 = VCNA',                                          +        
               POS=(16,29),LTH=11,                                     +        
               ATTR=(PROT)                                                      
KDVALIS5 DFLD  POS=(16,66),LTH=3,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'F M0 = ASIA   ',                                       +        
               POS=(17,29),LTH=14,                                     +        
               ATTR=(PROT)                                                      
KDVALIS6 DFLD  POS=(17,66),LTH=3,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '13 Payer reg    14 Price area   15 Price partno 16 Part+        
                tran    17 Norm disc',                                 +        
               POS=(21,2),LTH=76,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18 Tran disc    19 Part disc    20',                   +        
               POS=(22,2),LTH=34,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 Whelp',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W3O311N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W3N311,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W3I311N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT,                                             +        
               NXT=W3I311N1                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  DGIA0006,                                               +        
               LTH=9                                                            
         MFLD  DGIA0007,                                               +        
               LTH=9                                                            
         MFLD  IDFTG001,                                               +        
               LTH=2                                                            
         MFLD  IDFTG002,                                               +        
               LTH=2                                                            
         MFLD  DGIA0017,                                               +        
               LTH=4                                                            
         MFLD  DGIA0018,                                               +        
               LTH=4                                                            
         MFLD  DGIA0008,                                               +        
               LTH=9                                                            
         MFLD  DGIA0016,                                               +        
               LTH=4                                                            
         MFLD  DGIA0003,                                               +        
               LTH=35                                                           
         MFLD  DGIA0004,                                               +        
               LTH=35                                                           
         MFLD  DGIA0019,                                               +        
               LTH=9                                                            
         MFLD  DGIA0001,                                               +        
               LTH=35                                                           
         MFLD  DGIA0002,                                               +        
               LTH=35                                                           
         MFLD  DGIA0012,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0013,                                               +        
               LTH=1                                                            
         MFLD  DGIA0014,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0015,                                               +        
               LTH=3                                                            
         MFLD  DGIA0020,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0021,                                               +        
               LTH=1                                                            
         MFLD  KDVALIS1,                                               +        
               LTH=3                                                            
         MFLD  KDVALIS2,                                               +        
               LTH=3                                                            
         MFLD  KDVALIS3,                                               +        
               LTH=3                                                            
         MFLD  KDVALIS5,                                               +        
               LTH=3                                                            
         MFLD  KDVALIS6,                                               +        
               LTH=3                                                            
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W3I311N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W3N311),                                           +        
               OPT=2,                                                  +        
               NXT=W3O311N1                                                     
MID      LPAGE SOR=(FORMAT),                                           +        
               NXT=W3O311N1                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  (FLD0102,                                               +        
               '3'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  (FLD0104,                                               +        
               '3'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  (FLD0106,                                               +        
               '1'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  (FLD0108,                                               +        
               '1'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '33112',                                                +        
               LTH=5                                                            
         MFLD  (DGIA0006,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               FILL=X'40'                                                       
         MFLD  DGIA0007,                                               +        
               LTH=9                                                            
         MFLD  (IDFTG001,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDFTG002,                                               +        
               LTH=2                                                            
         MFLD  (DGIA0017,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0018,                                               +        
               LTH=4                                                            
         MFLD  DGIA0008,                                               +        
               LTH=9                                                            
         MFLD  DGIA0016,                                               +        
               LTH=4                                                            
         MFLD  (DGIA0012,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0014,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0020,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
