***********************************************************************         
* CREATED BY V0C2425   ON 02/04/03  AT 16:52                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'Update of Dealer Prices         '                               
W3N306   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W3T306 7',                                           +        
               8='W3T306 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W3T306U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W3N306   DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Update of Dealer Prices',                              +        
               POS=(1,11),LTH=23,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'District',                                             +        
               POS=(2,2),LTH=8,                                        +        
               ATTR=(NUM,PROT)                                                  
DISTIN   DFLD  POS=(2,12),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Customer',                                             +        
               POS=(2,19),LTH=8,                                       +        
               ATTR=(PROT)                                                      
CUSTIN   DFLD  POS=(2,29),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Status price question',                                +        
               POS=(2,38),LTH=21,                                      +        
               ATTR=(PROT)                                                      
KDPIN    DFLD  POS=(2,60),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DISTUT   DFLD  POS=(3,12),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
CUSTUT   DFLD  POS=(3,29),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
KDPUT    DFLD  POS=(3,60),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Cmd Dist Customer PR   Part no  Order no  Cur cd   Loca+        
               l ret   Net Price  Disc',                               +        
               POS=(5,2),LTH=78,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'sta',                                                  +        
               POS=(6,20),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'ISO',                                                  +        
               POS=(6,44),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'sales pr    loc cur',                                  +        
               POS=(6,53),LTH=20,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'cd',                                                   +        
               POS=(6,76),LTH=2,                                       +        
               ATTR=(PROT)                                                      
KDCMD1   DFLD  POS=(8,2),LTH=1,                                        +        
               ATTR=(PROT,MOD)                                                  
DIST1    DFLD  POS=(8,6),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
CUST1    DFLD  POS=(8,11),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KDP1     DFLD  POS=(8,20),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
ART1     DFLD  POS=(8,23),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
IDORD1   DFLD  POS=(8,34),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
CURCD1   DFLD  POS=(8,45),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
LOCGR1   DFLD  POS=(8,52),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
NETPR1   DFLD  POS=(8,64),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
DISCCD1  DFLD  POS=(8,76),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
KDCMD2   DFLD  POS=(9,2),LTH=1,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
DIST2    DFLD  POS=(9,6),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
CUST2    DFLD  POS=(9,11),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KDP2     DFLD  POS=(9,20),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
ART2     DFLD  POS=(9,23),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
IDORD2   DFLD  POS=(9,34),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
CURCD2   DFLD  POS=(9,45),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
LOCGR2   DFLD  POS=(9,52),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
NETPR2   DFLD  POS=(9,64),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
DISCCD2  DFLD  POS=(9,76),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
KDCMD3   DFLD  POS=(10,2),LTH=1,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DIST3    DFLD  POS=(10,6),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
CUST3    DFLD  POS=(10,11),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KDP3     DFLD  POS=(10,20),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
ART3     DFLD  POS=(10,23),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
IDORD3   DFLD  POS=(10,34),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
CURCD3   DFLD  POS=(10,45),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
LOCGR3   DFLD  POS=(10,52),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
NETPR3   DFLD  POS=(10,64),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
DISCCD3  DFLD  POS=(10,76),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
KDCMD4   DFLD  POS=(11,2),LTH=1,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DIST4    DFLD  POS=(11,6),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
CUST4    DFLD  POS=(11,11),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KDP4     DFLD  POS=(11,20),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
ART4     DFLD  POS=(11,23),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
IDORD4   DFLD  POS=(11,34),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
CURCD4   DFLD  POS=(11,45),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
LOCGR4   DFLD  POS=(11,52),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
NETPR4   DFLD  POS=(11,64),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
DISCCD4  DFLD  POS=(11,76),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
KDCMD5   DFLD  POS=(12,2),LTH=1,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DIST5    DFLD  POS=(12,6),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
CUST5    DFLD  POS=(12,11),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KDP5     DFLD  POS=(12,20),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
ART5     DFLD  POS=(12,23),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
IDORD5   DFLD  POS=(12,34),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
CURCD5   DFLD  POS=(12,45),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
LOCGR5   DFLD  POS=(12,52),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
NETPR5   DFLD  POS=(12,64),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
DISCCD5  DFLD  POS=(12,76),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
KDCMD6   DFLD  POS=(13,2),LTH=1,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DIST6    DFLD  POS=(13,6),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
CUST6    DFLD  POS=(13,11),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KDP6     DFLD  POS=(13,20),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
ART6     DFLD  POS=(13,23),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
IDORD6   DFLD  POS=(13,34),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
CURCD6   DFLD  POS=(13,45),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
LOCGR6   DFLD  POS=(13,52),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
NETPR6   DFLD  POS=(13,64),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
DISCCD6  DFLD  POS=(13,76),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
KDCMD7   DFLD  POS=(14,2),LTH=1,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DIST7    DFLD  POS=(14,6),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
CUST7    DFLD  POS=(14,11),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KDP7     DFLD  POS=(14,20),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
ART7     DFLD  POS=(14,23),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
IDORD7   DFLD  POS=(14,34),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
CURCD7   DFLD  POS=(14,45),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
LOCGR7   DFLD  POS=(14,52),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
NETPR7   DFLD  POS=(14,64),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
DISCCD7  DFLD  POS=(14,76),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
KDCMD8   DFLD  POS=(15,2),LTH=1,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DIST8    DFLD  POS=(15,6),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
CUST8    DFLD  POS=(15,11),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KDP8     DFLD  POS=(15,20),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
ART8     DFLD  POS=(15,23),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
IDORD8   DFLD  POS=(15,34),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
CURCD8   DFLD  POS=(15,45),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
LOCGR8   DFLD  POS=(15,52),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
NETPR8   DFLD  POS=(15,64),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
DISCCD8  DFLD  POS=(15,76),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
KDCMD9   DFLD  POS=(16,2),LTH=1,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DIST9    DFLD  POS=(16,6),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
CUST9    DFLD  POS=(16,11),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KDP9     DFLD  POS=(16,20),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
ART9     DFLD  POS=(16,23),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
IDORD9   DFLD  POS=(16,34),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
CURCD9   DFLD  POS=(16,45),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
LOCGR9   DFLD  POS=(16,52),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
NETPR9   DFLD  POS=(16,64),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
DISCCD9  DFLD  POS=(16,76),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
KDCMD10  DFLD  POS=(17,2),LTH=1,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DIST10   DFLD  POS=(17,6),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
CUST10   DFLD  POS=(17,11),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KDP10    DFLD  POS=(17,20),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
ART10    DFLD  POS=(17,23),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
IDORD10  DFLD  POS=(17,34),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
CURCD10  DFLD  POS=(17,45),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
LOCGR10  DFLD  POS=(17,52),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
NETPR10  DFLD  POS=(17,64),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
DISCCD10 DFLD  POS=(17,76),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
KDCMD11  DFLD  POS=(18,2),LTH=1,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DIST11   DFLD  POS=(18,6),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
CUST11   DFLD  POS=(18,11),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KDP11    DFLD  POS=(18,20),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
ART11    DFLD  POS=(18,23),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
IDORD11  DFLD  POS=(18,34),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
CURCD11  DFLD  POS=(18,45),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
LOCGR11  DFLD  POS=(18,52),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
NETPR11  DFLD  POS=(18,64),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
DISCCD11 DFLD  POS=(18,76),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
KDCMD12  DFLD  POS=(19,2),LTH=1,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DIST12   DFLD  POS=(19,6),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
CUST12   DFLD  POS=(19,11),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KDP12    DFLD  POS=(19,20),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
ART12    DFLD  POS=(19,23),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
IDORD12  DFLD  POS=(19,34),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
CURCD12  DFLD  POS=(19,45),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
LOCGR12  DFLD  POS=(19,52),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
NETPR12  DFLD  POS=(19,64),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
DISCCD12 DFLD  POS=(19,76),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
KDCMD13  DFLD  POS=(20,2),LTH=1,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DIST13   DFLD  POS=(20,6),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
CUST13   DFLD  POS=(20,11),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KDP13    DFLD  POS=(20,20),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
ART13    DFLD  POS=(20,23),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
IDORD13  DFLD  POS=(20,34),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
CURCD13  DFLD  POS=(20,45),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
LOCGR13  DFLD  POS=(20,52),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
NETPR13  DFLD  POS=(20,64),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
DISCCD13 DFLD  POS=(20,76),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'F7=First   F8=Next',                                   +        
               POS=(22,2),LTH=18,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'F10=WHELP   F11=UPDATE',                               +        
               POS=(22,43),LTH=22,                                     +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(23,60),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W3O306N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W3N306,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W3I306N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W3N306                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  DISTIN,                                                 +        
               LTH=4                                                            
         MFLD  CUSTIN,                                                 +        
               LTH=6                                                            
         MFLD  KDPIN,                                                  +        
               LTH=1                                                            
         MFLD  DISTUT,                                                 +        
               LTH=4                                                            
         MFLD  CUSTUT,                                                 +        
               LTH=6                                                            
         MFLD  KDPUT,                                                  +        
               LTH=1                                                            
         MFLD  KDCMD1,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DIST1,                                                  +        
               LTH=4                                                            
         MFLD  CUST1,                                                  +        
               LTH=6                                                            
         MFLD  KDP1,                                                   +        
               LTH=1                                                            
         MFLD  ART1,                                                   +        
               LTH=9                                                            
         MFLD  IDORD1,                                                 +        
               LTH=7                                                            
         MFLD  CURCD1,                                                 +        
               LTH=3                                                            
         MFLD  LOCGR1,                                                 +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  NETPR1,                                                 +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DISCCD1,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDCMD2,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DIST2,                                                  +        
               LTH=4                                                            
         MFLD  CUST2,                                                  +        
               LTH=6                                                            
         MFLD  KDP2,                                                   +        
               LTH=1                                                            
         MFLD  ART2,                                                   +        
               LTH=9                                                            
         MFLD  IDORD2,                                                 +        
               LTH=7                                                            
         MFLD  CURCD2,                                                 +        
               LTH=3                                                            
         MFLD  LOCGR2,                                                 +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  NETPR2,                                                 +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DISCCD2,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDCMD3,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DIST3,                                                  +        
               LTH=4                                                            
         MFLD  CUST3,                                                  +        
               LTH=6                                                            
         MFLD  KDP3,                                                   +        
               LTH=1                                                            
         MFLD  ART3,                                                   +        
               LTH=9                                                            
         MFLD  IDORD3,                                                 +        
               LTH=7                                                            
         MFLD  CURCD3,                                                 +        
               LTH=3                                                            
         MFLD  LOCGR3,                                                 +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  NETPR3,                                                 +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DISCCD3,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDCMD4,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DIST4,                                                  +        
               LTH=4                                                            
         MFLD  CUST4,                                                  +        
               LTH=6                                                            
         MFLD  KDP4,                                                   +        
               LTH=1                                                            
         MFLD  ART4,                                                   +        
               LTH=9                                                            
         MFLD  IDORD4,                                                 +        
               LTH=7                                                            
         MFLD  CURCD4,                                                 +        
               LTH=3                                                            
         MFLD  LOCGR4,                                                 +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  NETPR4,                                                 +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DISCCD4,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDCMD5,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DIST5,                                                  +        
               LTH=4                                                            
         MFLD  CUST5,                                                  +        
               LTH=6                                                            
         MFLD  KDP5,                                                   +        
               LTH=1                                                            
         MFLD  ART5,                                                   +        
               LTH=9                                                            
         MFLD  IDORD5,                                                 +        
               LTH=7                                                            
         MFLD  CURCD5,                                                 +        
               LTH=3                                                            
         MFLD  LOCGR5,                                                 +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  NETPR5,                                                 +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DISCCD5,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDCMD6,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DIST6,                                                  +        
               LTH=4                                                            
         MFLD  CUST6,                                                  +        
               LTH=6                                                            
         MFLD  KDP6,                                                   +        
               LTH=1                                                            
         MFLD  ART6,                                                   +        
               LTH=9                                                            
         MFLD  IDORD6,                                                 +        
               LTH=7                                                            
         MFLD  CURCD6,                                                 +        
               LTH=3                                                            
         MFLD  LOCGR6,                                                 +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  NETPR6,                                                 +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DISCCD6,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDCMD7,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DIST7,                                                  +        
               LTH=4                                                            
         MFLD  CUST7,                                                  +        
               LTH=6                                                            
         MFLD  KDP7,                                                   +        
               LTH=1                                                            
         MFLD  ART7,                                                   +        
               LTH=9                                                            
         MFLD  IDORD7,                                                 +        
               LTH=7                                                            
         MFLD  CURCD7,                                                 +        
               LTH=3                                                            
         MFLD  LOCGR7,                                                 +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  NETPR7,                                                 +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DISCCD7,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDCMD8,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DIST8,                                                  +        
               LTH=4                                                            
         MFLD  CUST8,                                                  +        
               LTH=6                                                            
         MFLD  KDP8,                                                   +        
               LTH=1                                                            
         MFLD  ART8,                                                   +        
               LTH=9                                                            
         MFLD  IDORD8,                                                 +        
               LTH=7                                                            
         MFLD  CURCD8,                                                 +        
               LTH=3                                                            
         MFLD  LOCGR8,                                                 +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  NETPR8,                                                 +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DISCCD8,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDCMD9,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DIST9,                                                  +        
               LTH=4                                                            
         MFLD  CUST9,                                                  +        
               LTH=6                                                            
         MFLD  KDP9,                                                   +        
               LTH=1                                                            
         MFLD  ART9,                                                   +        
               LTH=9                                                            
         MFLD  IDORD9,                                                 +        
               LTH=7                                                            
         MFLD  CURCD9,                                                 +        
               LTH=3                                                            
         MFLD  LOCGR9,                                                 +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  NETPR9,                                                 +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DISCCD9,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDCMD10,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DIST10,                                                 +        
               LTH=4                                                            
         MFLD  CUST10,                                                 +        
               LTH=6                                                            
         MFLD  KDP10,                                                  +        
               LTH=1                                                            
         MFLD  ART10,                                                  +        
               LTH=9                                                            
         MFLD  IDORD10,                                                +        
               LTH=7                                                            
         MFLD  CURCD10,                                                +        
               LTH=3                                                            
         MFLD  LOCGR10,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  NETPR10,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DISCCD10,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDCMD11,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DIST11,                                                 +        
               LTH=4                                                            
         MFLD  CUST11,                                                 +        
               LTH=6                                                            
         MFLD  KDP11,                                                  +        
               LTH=1                                                            
         MFLD  ART11,                                                  +        
               LTH=9                                                            
         MFLD  IDORD11,                                                +        
               LTH=7                                                            
         MFLD  CURCD11,                                                +        
               LTH=3                                                            
         MFLD  LOCGR11,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  NETPR11,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DISCCD11,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDCMD12,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DIST12,                                                 +        
               LTH=4                                                            
         MFLD  CUST12,                                                 +        
               LTH=6                                                            
         MFLD  KDP12,                                                  +        
               LTH=1                                                            
         MFLD  ART12,                                                  +        
               LTH=9                                                            
         MFLD  IDORD12,                                                +        
               LTH=7                                                            
         MFLD  CURCD12,                                                +        
               LTH=3                                                            
         MFLD  LOCGR12,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  NETPR12,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DISCCD12,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDCMD13,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DIST13,                                                 +        
               LTH=4                                                            
         MFLD  CUST13,                                                 +        
               LTH=6                                                            
         MFLD  KDP13,                                                  +        
               LTH=1                                                            
         MFLD  ART13,                                                  +        
               LTH=9                                                            
         MFLD  IDORD13,                                                +        
               LTH=7                                                            
         MFLD  CURCD13,                                                +        
               LTH=3                                                            
         MFLD  LOCGR13,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  NETPR13,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DISCCD13,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W3I306N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W3N306),                                           +        
               OPT=2,                                                  +        
               NXT=W3O306N1                                                     
MID      LPAGE SOR=(W3N306)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '33062',                                                +        
               LTH=5                                                            
         MFLD  (DISTIN,                                                +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CUSTIN,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDPIN,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDCMD1,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  DIST1,                                                  +        
               LTH=4                                                            
         MFLD  CUST1,                                                  +        
               LTH=6                                                            
         MFLD  KDP1,                                                   +        
               LTH=1                                                            
         MFLD  ART1,                                                   +        
               LTH=9                                                            
         MFLD  IDORD1,                                                 +        
               LTH=7                                                            
         MFLD  CURCD1,                                                 +        
               LTH=3                                                            
         MFLD  LOCGR1,                                                 +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  NETPR1,                                                 +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DISCCD1,                                                +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KDCMD2,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  DIST2,                                                  +        
               LTH=4                                                            
         MFLD  CUST2,                                                  +        
               LTH=6                                                            
         MFLD  KDP2,                                                   +        
               LTH=1                                                            
         MFLD  ART2,                                                   +        
               LTH=9                                                            
         MFLD  IDORD2,                                                 +        
               LTH=7                                                            
         MFLD  CURCD2,                                                 +        
               LTH=3                                                            
         MFLD  LOCGR2,                                                 +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  NETPR2,                                                 +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DISCCD2,                                                +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KDCMD3,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  DIST3,                                                  +        
               LTH=4                                                            
         MFLD  CUST3,                                                  +        
               LTH=6                                                            
         MFLD  KDP3,                                                   +        
               LTH=1                                                            
         MFLD  ART3,                                                   +        
               LTH=9                                                            
         MFLD  IDORD3,                                                 +        
               LTH=7                                                            
         MFLD  CURCD3,                                                 +        
               LTH=3                                                            
         MFLD  LOCGR3,                                                 +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  NETPR3,                                                 +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DISCCD3,                                                +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KDCMD4,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  DIST4,                                                  +        
               LTH=4                                                            
         MFLD  CUST4,                                                  +        
               LTH=6                                                            
         MFLD  KDP4,                                                   +        
               LTH=1                                                            
         MFLD  ART4,                                                   +        
               LTH=9                                                            
         MFLD  IDORD4,                                                 +        
               LTH=7                                                            
         MFLD  CURCD4,                                                 +        
               LTH=3                                                            
         MFLD  LOCGR4,                                                 +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  NETPR4,                                                 +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DISCCD4,                                                +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KDCMD5,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  DIST5,                                                  +        
               LTH=4                                                            
         MFLD  CUST5,                                                  +        
               LTH=6                                                            
         MFLD  KDP5,                                                   +        
               LTH=1                                                            
         MFLD  ART5,                                                   +        
               LTH=9                                                            
         MFLD  IDORD5,                                                 +        
               LTH=7                                                            
         MFLD  CURCD5,                                                 +        
               LTH=3                                                            
         MFLD  LOCGR5,                                                 +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  NETPR5,                                                 +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DISCCD5,                                                +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KDCMD6,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  DIST6,                                                  +        
               LTH=4                                                            
         MFLD  CUST6,                                                  +        
               LTH=6                                                            
         MFLD  KDP6,                                                   +        
               LTH=1                                                            
         MFLD  ART6,                                                   +        
               LTH=9                                                            
         MFLD  IDORD6,                                                 +        
               LTH=7                                                            
         MFLD  CURCD6,                                                 +        
               LTH=3                                                            
         MFLD  LOCGR6,                                                 +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  NETPR6,                                                 +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DISCCD6,                                                +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KDCMD7,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  DIST7,                                                  +        
               LTH=4                                                            
         MFLD  CUST7,                                                  +        
               LTH=6                                                            
         MFLD  KDP7,                                                   +        
               LTH=1                                                            
         MFLD  ART7,                                                   +        
               LTH=9                                                            
         MFLD  IDORD7,                                                 +        
               LTH=7                                                            
         MFLD  CURCD7,                                                 +        
               LTH=3                                                            
         MFLD  LOCGR7,                                                 +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  NETPR7,                                                 +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DISCCD7,                                                +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KDCMD8,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  DIST8,                                                  +        
               LTH=4                                                            
         MFLD  CUST8,                                                  +        
               LTH=6                                                            
         MFLD  KDP8,                                                   +        
               LTH=1                                                            
         MFLD  ART8,                                                   +        
               LTH=9                                                            
         MFLD  IDORD8,                                                 +        
               LTH=7                                                            
         MFLD  CURCD8,                                                 +        
               LTH=3                                                            
         MFLD  LOCGR8,                                                 +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  NETPR8,                                                 +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DISCCD8,                                                +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KDCMD9,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  DIST9,                                                  +        
               LTH=4                                                            
         MFLD  CUST9,                                                  +        
               LTH=6                                                            
         MFLD  KDP9,                                                   +        
               LTH=1                                                            
         MFLD  ART9,                                                   +        
               LTH=9                                                            
         MFLD  IDORD9,                                                 +        
               LTH=7                                                            
         MFLD  CURCD9,                                                 +        
               LTH=3                                                            
         MFLD  LOCGR9,                                                 +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  NETPR9,                                                 +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DISCCD9,                                                +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KDCMD10,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  DIST10,                                                 +        
               LTH=4                                                            
         MFLD  CUST10,                                                 +        
               LTH=6                                                            
         MFLD  KDP10,                                                  +        
               LTH=1                                                            
         MFLD  ART10,                                                  +        
               LTH=9                                                            
         MFLD  IDORD10,                                                +        
               LTH=7                                                            
         MFLD  CURCD10,                                                +        
               LTH=3                                                            
         MFLD  LOCGR10,                                                +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  NETPR10,                                                +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DISCCD10,                                               +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KDCMD11,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  DIST11,                                                 +        
               LTH=4                                                            
         MFLD  CUST11,                                                 +        
               LTH=6                                                            
         MFLD  KDP11,                                                  +        
               LTH=1                                                            
         MFLD  ART11,                                                  +        
               LTH=9                                                            
         MFLD  IDORD11,                                                +        
               LTH=7                                                            
         MFLD  CURCD11,                                                +        
               LTH=3                                                            
         MFLD  LOCGR11,                                                +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  NETPR11,                                                +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DISCCD11,                                               +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KDCMD12,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  DIST12,                                                 +        
               LTH=4                                                            
         MFLD  CUST12,                                                 +        
               LTH=6                                                            
         MFLD  KDP12,                                                  +        
               LTH=1                                                            
         MFLD  ART12,                                                  +        
               LTH=9                                                            
         MFLD  IDORD12,                                                +        
               LTH=7                                                            
         MFLD  CURCD12,                                                +        
               LTH=3                                                            
         MFLD  LOCGR12,                                                +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  NETPR12,                                                +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DISCCD12,                                               +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KDCMD13,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  DIST13,                                                 +        
               LTH=4                                                            
         MFLD  CUST13,                                                 +        
               LTH=6                                                            
         MFLD  KDP13,                                                  +        
               LTH=1                                                            
         MFLD  ART13,                                                  +        
               LTH=9                                                            
         MFLD  IDORD13,                                                +        
               LTH=7                                                            
         MFLD  CURCD13,                                                +        
               LTH=3                                                            
         MFLD  LOCGR13,                                                +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  NETPR13,                                                +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DISCCD13,                                               +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
