***********************************************************************         
* CREATED BY PC30179   ON 96/01/25  AT 15:39                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'PRICE PARTNUMBER                '                               
W3N313   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W3T313 7',                                           +        
               8='W3T313 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W3T311  ',                                          +        
               14='W3T312  ',                                          +        
               15='W3T313  ',                                          +        
               16='W3T314  ',                                          +        
               17='W3T315  ',                                          +        
               18='W3T316  ',                                          +        
               19='W3T317  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W3N313   DPAGE CURSOR=((2,28)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'PRICE  PARTNUMBER',                                    +        
               POS=(1,11),LTH=17,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Price area',                                           +        
               POS=(2,2),LTH=10,                                       +        
               ATTR=(ALPHA,PROT)                                                
DGIA0005 DFLD  POS=(2,13),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Partnumber',                                           +        
               POS=(2,17),LTH=10,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0003 DFLD  POS=(2,28),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'District',                                             +        
               POS=(2,38),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
IDDISTR1 DFLD  POS=(2,47),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'MC-curr Y/N',                                          +        
               POS=(2,66),LTH=11,                                      +        
               ATTR=(PROT)                                                      
FLVALIN  DFLD  POS=(2,78),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
DGIA0006 DFLD  POS=(3,13),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0004 DFLD  POS=(3,28),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
IDDISTR2 DFLD  POS=(3,47),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
FLVALUT  DFLD  POS=(3,78),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Description',                                          +        
               POS=(6,2),LTH=11,                                       +        
               ATTR=(PROT)                                                      
DGIA0001 DFLD  POS=(6,15),LTH=25,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Func group',                                           +        
               POS=(6,41),LTH=10,                                      +        
               ATTR=(ALPHA,PROT)                                                
IDFKNGRP DFLD  POS=(6,52),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Product group',                                        +        
               POS=(6,57),LTH=13,                                      +        
               ATTR=(PROT)                                                      
KDPRODSL DFLD  POS=(6,71),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Curren.',                                              +        
               POS=(6,74),LTH=7,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Retail price',                                         +        
               POS=(8,2),LTH=12,                                       +        
               ATTR=(PROT)                                                      
DGIA0011 DFLD  POS=(8,15),LTH=10,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Standard price',                                       +        
               POS=(8,37),LTH=14,                                      +        
               ATTR=(PROT)                                                      
PRARTSTD DFLD  POS=(8,52),LTH=10,                                      +        
               ATTR=(PROT)                                                      
KDVALISO DFLD  POS=(8,78),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Special  discount',                                    +        
               POS=(10,2),LTH=17,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Transfer Partno',                                      +        
               POS=(11,2),LTH=15,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'SO-price',                                             +        
               POS=(11,25),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'DO-price',                                             +        
               POS=(11,38),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'SO-%',                                                 +        
               POS=(11,51),LTH=4,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'DO-%',                                                 +        
               POS=(11,60),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KDARTKAM DFLD  POS=(12,4),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DGIA0000 DFLD  POS=(12,12),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0007 DFLD  POS=(12,23),LTH=10,                                     +        
               ATTR=(PROT)                                                      
DGIA0002 DFLD  POS=(12,36),LTH=10,                                     +        
               ATTR=(PROT)                                                      
MORAB    DFLD  POS=(12,50),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DORAB    DFLD  POS=(12,59),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Disc',                                                 +        
               POS=(15,5),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'code',                                                 +        
               POS=(16,5),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0010 DFLD  POS=(17,7),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DGIA0009 DFLD  POS=(17,23),LTH=10,                                     +        
               ATTR=(PROT)                                                      
DGIA0008 DFLD  POS=(17,36),LTH=10,                                     +        
               ATTR=(PROT)                                                      
NMORAB   DFLD  POS=(17,50),LTH=5,                                      +        
               ATTR=(PROT)                                                      
NDORAB   DFLD  POS=(17,59),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '13 Payer reg    14 Price area   15 Price partno 16 Part+        
                tran    17 Norm disc',                                 +        
               POS=(21,2),LTH=76,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18 Tran disc    19 Part disc    20',                   +        
               POS=(22,2),LTH=34,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '22 Whelp',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W3O313N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W3N313,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W3I313N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W3N313                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  DGIA0005,                                               +        
               LTH=3                                                            
         MFLD  DGIA0006,                                               +        
               LTH=3                                                            
         MFLD  DGIA0003,                                               +        
               LTH=9                                                            
         MFLD  DGIA0004,                                               +        
               LTH=9                                                            
         MFLD  IDDISTR1,                                               +        
               LTH=4                                                            
         MFLD  IDDISTR2,                                               +        
               LTH=4                                                            
         MFLD  FLVALIN,                                                +        
               LTH=1                                                            
         MFLD  FLVALUT,                                                +        
               LTH=1                                                            
         MFLD  DGIA0001,                                               +        
               LTH=25                                                           
         MFLD  IDFKNGRP,                                               +        
               LTH=4                                                            
         MFLD  KDPRODSL,                                               +        
               LTH=2                                                            
         MFLD  DGIA0011,                                               +        
               LTH=10                                                           
         MFLD  PRARTSTD,                                               +        
               LTH=10                                                           
         MFLD  KDVALISO,                                               +        
               LTH=3                                                            
         MFLD  KDARTKAM,                                               +        
               LTH=5                                                            
         MFLD  DGIA0000,                                               +        
               LTH=3                                                            
         MFLD  DGIA0007,                                               +        
               LTH=10                                                           
         MFLD  DGIA0002,                                               +        
               LTH=10                                                           
         MFLD  MORAB,                                                  +        
               LTH=5                                                            
         MFLD  DORAB,                                                  +        
               LTH=5                                                            
         MFLD  DGIA0010,                                               +        
               LTH=2                                                            
         MFLD  DGIA0009,                                               +        
               LTH=10                                                           
         MFLD  DGIA0008,                                               +        
               LTH=10                                                           
         MFLD  NMORAB,                                                 +        
               LTH=5                                                            
         MFLD  NDORAB,                                                 +        
               LTH=5                                                            
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W3I313N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W3N313),                                           +        
               OPT=2,                                                  +        
               NXT=W3O313N1                                                     
MID      LPAGE SOR=(W3N313)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  (FLD0102,                                               +        
               '3'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  (FLD0104,                                               +        
               '3'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  (FLD0106,                                               +        
               '1'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  (FLD0108,                                               +        
               '3'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  ' ',                                                    +        
               LTH=2                                                            
         MFLD  '33132',                                                +        
               LTH=5                                                            
         MFLD  (DGIA0005,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  DGIA0006,                                               +        
               LTH=3                                                            
         MFLD  (DGIA0003,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0004,                                               +        
               LTH=9                                                            
         MFLD  (IDDISTR1,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDDISTR2,                                               +        
               LTH=4                                                            
         MFLD  (FLVALIN,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  FLVALUT,                                                +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
