***********************************************************************         
* CREATED BY PC28439   ON 95/02/08  AT 13:45                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'KVALITET LAGERINDELNING         '                               
W4F121   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W4T121 7',                                           +        
               8='W4T121 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T121U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T121  ',                                          +        
               14='W4T122  ',                                          +        
               15='W4T123  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'KVALITET  LAGERINDELNING',                             +        
               POS=(1,12),LTH=24,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'K-område:',                                            +        
               POS=(2,2),LTH=9,                                        +        
               ATTR=(ALPHA,PROT)                                                
KVAOMRIN DFLD  POS=(2,12),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Torg:',                                                +        
               POS=(2,14),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
KVATRGIN DFLD  POS=(2,20),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'K-grupp:',                                             +        
               POS=(2,24),LTH=8,                                       +        
               ATTR=(PROT)                                                      
KVAGRPIN DFLD  POS=(2,33),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DC',                                                   +        
               POS=(2,38),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDDCIN   DFLD  POS=(2,41),LTH=2,                                       +        
               ATTR=(ALPHA,NOPROT)                                              
KVAOMRUT DFLD  POS=(3,12),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
KVATRGUT DFLD  POS=(3,20),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
KVAGRPUT DFLD  POS=(3,33),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
IDDCUT   DFLD  POS=(3,41),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
KVAOMREN DFLD  POS=(4,2),LTH=1,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
KVATRGEN DFLD  POS=(4,4),LTH=2,                                        +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KVAGRPEN DFLD  POS=(4,7),LTH=3,                                        +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
LAGOMREN DFLD  POS=(4,11),LTH=2,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
GANGEN   DFLD  POS=(4,14),LTH=2,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
PLATSEN  DFLD  POS=(4,17),LTH=5,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KVAOMRNX DFLD  POS=(4,24),LTH=1,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
KVATRGNX DFLD  POS=(4,26),LTH=2,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KVAGRPNX DFLD  POS=(4,29),LTH=3,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
LAGOMRNX DFLD  POS=(4,33),LTH=2,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
GANGNX   DFLD  POS=(4,36),LTH=2,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
PLATSNX  DFLD  POS=(4,39),LTH=5,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
         DFLD  'Kontr.',                                               +        
               POS=(5,2),LTH=6,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'Kontr.    Lagerplats f.o.m.',                          +        
               POS=(5,15),LTH=27,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Lagerplats t.o.m.',                                    +        
               POS=(5,47),LTH=17,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'område Torg  grupp',                                   +        
               POS=(6,2),LTH=18,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Område Gång Plats',                                    +        
               POS=(6,25),LTH=17,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Område Gång Plats',                                    +        
               POS=(6,47),LTH=17,                                      +        
               ATTR=(PROT)                                                      
KVAOMR1  DFLD  POS=(7,4),LTH=1,                                        +        
               ATTR=(PROT)                                                      
KVATRG1  DFLD  POS=(7,10),LTH=2,                                       +        
               ATTR=(PROT)                                                      
KVAGRP1  DFLD  POS=(7,16),LTH=3,                                       +        
               ATTR=(PROT)                                                      
LAGOMR1F DFLD  POS=(7,25),LTH=2,                                       +        
               ATTR=(PROT)                                                      
GANG1F   DFLD  POS=(7,32),LTH=2,                                       +        
               ATTR=(PROT)                                                      
PLATS1F  DFLD  POS=(7,37),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '-',                                                    +        
               POS=(7,44),LTH=1,                                       +        
               ATTR=(PROT)                                                      
LAGOMR1T DFLD  POS=(7,47),LTH=2,                                       +        
               ATTR=(PROT)                                                      
GANG1T   DFLD  POS=(7,54),LTH=2,                                       +        
               ATTR=(PROT)                                                      
PLATS1T  DFLD  POS=(7,59),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DGIA0064 DFLD  POS=(8,4),LTH=1,                                        +        
               ATTR=(PROT)                                                      
KVATRG02 DFLD  POS=(8,10),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DGIA0055 DFLD  POS=(8,16),LTH=3,                                       +        
               ATTR=(PROT)                                                      
DGIA0018 DFLD  POS=(8,25),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DGIA0000 DFLD  POS=(8,32),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DGIA0036 DFLD  POS=(8,37),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '-',                                                    +        
               POS=(8,44),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DGIA0027 DFLD  POS=(8,47),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DGIA0009 DFLD  POS=(8,54),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DGIA0045 DFLD  POS=(8,59),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DGIA0065 DFLD  POS=(9,4),LTH=1,                                        +        
               ATTR=(PROT)                                                      
KVATRG03 DFLD  POS=(9,10),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DGIA0056 DFLD  POS=(9,16),LTH=3,                                       +        
               ATTR=(PROT)                                                      
DGIA0019 DFLD  POS=(9,25),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DGIA0001 DFLD  POS=(9,32),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DGIA0037 DFLD  POS=(9,37),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '-',                                                    +        
               POS=(9,44),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DGIA0028 DFLD  POS=(9,47),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DGIA0010 DFLD  POS=(9,54),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DGIA0046 DFLD  POS=(9,59),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DGIA0066 DFLD  POS=(10,4),LTH=1,                                       +        
               ATTR=(PROT)                                                      
KVATRG04 DFLD  POS=(10,10),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0057 DFLD  POS=(10,16),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0020 DFLD  POS=(10,25),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0002 DFLD  POS=(10,32),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0038 DFLD  POS=(10,37),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '-',                                                    +        
               POS=(10,44),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0029 DFLD  POS=(10,47),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0011 DFLD  POS=(10,54),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0047 DFLD  POS=(10,59),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0067 DFLD  POS=(11,4),LTH=1,                                       +        
               ATTR=(PROT)                                                      
KVATRG05 DFLD  POS=(11,10),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0058 DFLD  POS=(11,16),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0021 DFLD  POS=(11,25),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0003 DFLD  POS=(11,32),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0039 DFLD  POS=(11,37),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '-',                                                    +        
               POS=(11,44),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0030 DFLD  POS=(11,47),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0012 DFLD  POS=(11,54),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0048 DFLD  POS=(11,59),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0068 DFLD  POS=(12,4),LTH=1,                                       +        
               ATTR=(PROT)                                                      
KVATRG06 DFLD  POS=(12,10),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0059 DFLD  POS=(12,16),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0022 DFLD  POS=(12,25),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0004 DFLD  POS=(12,32),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0040 DFLD  POS=(12,37),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '-',                                                    +        
               POS=(12,44),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0031 DFLD  POS=(12,47),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0013 DFLD  POS=(12,54),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0049 DFLD  POS=(12,59),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0069 DFLD  POS=(13,4),LTH=1,                                       +        
               ATTR=(PROT)                                                      
KVATRG07 DFLD  POS=(13,10),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0060 DFLD  POS=(13,16),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0023 DFLD  POS=(13,25),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0005 DFLD  POS=(13,32),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0041 DFLD  POS=(13,37),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '-',                                                    +        
               POS=(13,44),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0032 DFLD  POS=(13,47),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0014 DFLD  POS=(13,54),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0050 DFLD  POS=(13,59),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0070 DFLD  POS=(14,4),LTH=1,                                       +        
               ATTR=(PROT)                                                      
KVATRG08 DFLD  POS=(14,10),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0061 DFLD  POS=(14,16),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0024 DFLD  POS=(14,25),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0006 DFLD  POS=(14,32),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0042 DFLD  POS=(14,37),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '-',                                                    +        
               POS=(14,44),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0033 DFLD  POS=(14,47),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0015 DFLD  POS=(14,54),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0051 DFLD  POS=(14,59),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0071 DFLD  POS=(15,4),LTH=1,                                       +        
               ATTR=(PROT)                                                      
KVATRG09 DFLD  POS=(15,10),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0062 DFLD  POS=(15,16),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0025 DFLD  POS=(15,25),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0007 DFLD  POS=(15,32),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0043 DFLD  POS=(15,37),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '-',                                                    +        
               POS=(15,44),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0034 DFLD  POS=(15,47),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0016 DFLD  POS=(15,54),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0052 DFLD  POS=(15,59),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0063 DFLD  POS=(16,4),LTH=1,                                       +        
               ATTR=(PROT)                                                      
KVATRG10 DFLD  POS=(16,10),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0054 DFLD  POS=(16,16),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0026 DFLD  POS=(16,25),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0008 DFLD  POS=(16,32),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0044 DFLD  POS=(16,37),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '-',                                                    +        
               POS=(16,44),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0035 DFLD  POS=(16,47),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0017 DFLD  POS=(16,54),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0053 DFLD  POS=(16,59),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Uppdatering:',                                         +        
               POS=(18,2),LTH=12,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Uppdaterings-',                                        +        
               POS=(18,67),LTH=13,                                     +        
               ATTR=(PROT)                                                      
KVAOMRU  DFLD  POS=(19,4),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
KVATRGU  DFLD  POS=(19,10),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
KVAGRPU  DFLD  POS=(19,16),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
LAGOMRUF DFLD  POS=(19,25),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
GANGUF   DFLD  POS=(19,32),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
PLATSUF  DFLD  POS=(19,37),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(19,44),LTH=1,                                      +        
               ATTR=(PROT)                                                      
LAGOMRUT DFLD  POS=(19,47),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
GANGUT   DFLD  POS=(19,54),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
PLATSUT  DFLD  POS=(19,59),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'kod:',                                                 +        
               POS=(19,67),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KDCMD    DFLD  POS=(19,74),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  '13 Lagerindel. 14 Lager kontr.  15 Felakt.art. 16',    +        
               POS=(21,2),LTH=49,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,17),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,49),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4I12101 MSG   TYPE=INPUT,                                             +        
               SOR=(W4F121),                                           +        
               OPT=2,                                                  +        
               NXT=W4O12101                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '41211',                                                +        
               LTH=5                                                            
         MFLD  (KVAOMRIN,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KVATRGIN,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVAGRPIN,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDDCIN,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  KVAOMRUT,                                               +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  KVATRGUT,                                               +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KVAGRPUT,                                               +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDDCUT,                                                 +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  KVAOMREN,                                               +        
               LTH=1                                                            
         MFLD  KVATRGEN,                                               +        
               LTH=2                                                            
         MFLD  KVAGRPEN,                                               +        
               LTH=3                                                            
         MFLD  LAGOMREN,                                               +        
               LTH=2                                                            
         MFLD  GANGEN,                                                 +        
               LTH=2                                                            
         MFLD  PLATSEN,                                                +        
               LTH=5                                                            
         MFLD  KVAOMRNX,                                               +        
               LTH=1                                                            
         MFLD  KVATRGNX,                                               +        
               LTH=2                                                            
         MFLD  KVAGRPNX,                                               +        
               LTH=3                                                            
         MFLD  LAGOMRNX,                                               +        
               LTH=2                                                            
         MFLD  GANGNX,                                                 +        
               LTH=2                                                            
         MFLD  PLATSNX,                                                +        
               LTH=5                                                            
         MFLD  (KVAOMRU,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KVATRGU,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVAGRPU,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (LAGOMRUF,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (GANGUF,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PLATSUF,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (LAGOMRUT,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (GANGUT,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PLATSUT,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDCMD,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
W4O12101 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4F121,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I12101,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  KVAOMRIN,                                               +        
               LTH=2                                                            
         MFLD  KVATRGIN,                                               +        
               LTH=2                                                            
         MFLD  KVAGRPIN,                                               +        
               LTH=3                                                            
         MFLD  IDDCIN,                                                 +        
               LTH=2                                                            
         MFLD  KVAOMRUT,                                               +        
               LTH=1                                                            
         MFLD  KVATRGUT,                                               +        
               LTH=2                                                            
         MFLD  KVAGRPUT,                                               +        
               LTH=3                                                            
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  KVAOMREN,                                               +        
               LTH=1                                                            
         MFLD  KVATRGEN,                                               +        
               LTH=2                                                            
         MFLD  KVAGRPEN,                                               +        
               LTH=3                                                            
         MFLD  LAGOMREN,                                               +        
               LTH=2                                                            
         MFLD  GANGEN,                                                 +        
               LTH=2                                                            
         MFLD  PLATSEN,                                                +        
               LTH=5                                                            
         MFLD  KVAOMRNX,                                               +        
               LTH=1                                                            
         MFLD  KVATRGNX,                                               +        
               LTH=2                                                            
         MFLD  KVAGRPNX,                                               +        
               LTH=3                                                            
         MFLD  LAGOMRNX,                                               +        
               LTH=2                                                            
         MFLD  GANGNX,                                                 +        
               LTH=2                                                            
         MFLD  PLATSNX,                                                +        
               LTH=5                                                            
         MFLD  KVAOMR1,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVATRG1,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVAGRP1,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LAGOMR1F,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  GANG1F,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PLATS1F,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LAGOMR1T,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  GANG1T,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PLATS1T,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0064,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVATRG02,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0055,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0018,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0000,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0036,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0027,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0009,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0045,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0065,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVATRG03,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0056,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0019,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0001,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0037,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0028,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0010,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0046,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0066,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVATRG04,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0057,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0020,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0002,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0038,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0029,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0011,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0047,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0067,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVATRG05,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0058,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0021,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0003,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0039,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0030,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0012,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0048,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0068,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVATRG06,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0059,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0022,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0004,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0040,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0031,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0013,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0049,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0069,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVATRG07,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0060,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0023,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0005,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0041,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0032,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0014,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0050,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0070,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVATRG08,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0061,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0024,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0006,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0042,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0033,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0015,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0051,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0071,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVATRG09,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0062,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0025,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0007,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0043,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0034,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0016,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0052,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0063,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVATRG10,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0054,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0026,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0008,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0044,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0035,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0017,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0053,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVAOMRU,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVATRGU,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVAGRPU,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LAGOMRUF,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  GANGUF,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PLATSUF,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LAGOMRUT,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  GANGUT,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PLATSUT,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDCMD,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  FLD2364,                                                +        
               LTH=8                                                            
         MFLD  FLD2373,                                                +        
               LTH=8                                                            
         MFLD  FSYSMSG,                                                +        
               LTH=79                                                           
         MSGEND                                                                 
         END                                                                    
