***********************************************************************         
* CREATED BY PC63442   ON 98/03/09  AT 18:03                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'FELKOD KONTROLLRAPPOERT         '                               
W4F116   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W4T116 7',                                           +        
               8='W4T116 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T116U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T115  ',                                          +        
               14='W4T116  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((2,10)),                                        +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'FELKOD KONTROLLRAPPORT',                               +        
               POS=(1,12),LTH=22,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Felkod:',                                              +        
               POS=(2,2),LTH=7,                                        +        
               ATTR=(ALPHA,PROT)                                                
IDKRFELI DFLD  POS=(2,10),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
IDKRFELU DFLD  POS=(3,10),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0001 DFLD  POS=(4,2),LTH=2,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0000 DFLD  POS=(4,5),LTH=2,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'Fel',                                                  +        
               POS=(5,2),LTH=3,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'kod  Fel-beskrivning',                                 +        
               POS=(6,2),LTH=20,                                       +        
               ATTR=(PROT)                                                      
FELKOD1  DFLD  POS=(7,2),LTH=2,                                        +        
               ATTR=(PROT)                                                      
FELTEXT1 DFLD  POS=(7,7),LTH=63,                                       +        
               ATTR=(PROT)                                                      
FELKOD2  DFLD  POS=(8,2),LTH=2,                                        +        
               ATTR=(PROT)                                                      
FELTEXT2 DFLD  POS=(8,7),LTH=63,                                       +        
               ATTR=(PROT)                                                      
FELKOD3  DFLD  POS=(9,2),LTH=2,                                        +        
               ATTR=(PROT)                                                      
FELTEXT3 DFLD  POS=(9,7),LTH=63,                                       +        
               ATTR=(PROT)                                                      
FELKOD4  DFLD  POS=(10,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FELTEXT4 DFLD  POS=(10,7),LTH=63,                                      +        
               ATTR=(PROT)                                                      
FELKOD5  DFLD  POS=(11,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FELTEXT5 DFLD  POS=(11,7),LTH=63,                                      +        
               ATTR=(PROT)                                                      
FELKOD6  DFLD  POS=(12,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FELTEXT6 DFLD  POS=(12,7),LTH=63,                                      +        
               ATTR=(PROT)                                                      
FELKOD7  DFLD  POS=(13,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FELTEXT7 DFLD  POS=(13,7),LTH=63,                                      +        
               ATTR=(PROT)                                                      
FELKOD8  DFLD  POS=(14,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FELTEXT8 DFLD  POS=(14,7),LTH=63,                                      +        
               ATTR=(PROT)                                                      
FELKOD9  DFLD  POS=(15,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FELTEXT9 DFLD  POS=(15,7),LTH=63,                                      +        
               ATTR=(PROT)                                                      
FELKOD10 DFLD  POS=(16,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FELTXT10 DFLD  POS=(16,7),LTH=63,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Nyupplägg/Ändring:',                                   +        
               POS=(18,2),LTH=18,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'B',                                                    +        
               POS=(18,80),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FKODUPD  DFLD  POS=(19,2),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  ' ',                                                    +        
               POS=(19,5),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
FTEXTUPF DFLD  POS=(19,7),LTH=63,                                      +        
               ATTR=(NOPROT)                                                    
RENSA    DFLD  POS=(19,80),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  '13 Felkod lager14 Felkod KR',                          +        
               POS=(21,2),LTH=27,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '15',                                                   +        
               POS=(21,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16',                                                   +        
               POS=(21,49),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,17),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,49),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4I11601 MSG   TYPE=INPUT,                                             +        
               SOR=(W4F116),                                           +        
               OPT=2,                                                  +        
               NXT=W4O11601                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '41161',                                                +        
               LTH=5                                                            
         MFLD  (IDKRFELI,                                              +        
               '++'),                                                  +        
               LTH=2                                                            
         MFLD  IDKRFELU,                                               +        
               LTH=2                                                            
         MFLD  DGIA0001,                                               +        
               LTH=2                                                            
         MFLD  DGIA0000,                                               +        
               LTH=2                                                            
         MFLD  (FKODUPD,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FTEXTUPF,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               ++++++++'),                                             +        
               LTH=63,                                                 +        
               FILL=X'40'                                                       
         MFLD  (RENSA,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
W4O11601 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4F116,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I11601,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDKRFELI,                                               +        
               LTH=2                                                            
         MFLD  IDKRFELU,                                               +        
               LTH=2                                                            
         MFLD  DGIA0001,                                               +        
               LTH=2                                                            
         MFLD  DGIA0000,                                               +        
               LTH=2                                                            
         MFLD  FELKOD1,                                                +        
               LTH=2                                                            
         MFLD  FELTEXT1,                                               +        
               LTH=63                                                           
         MFLD  FELKOD2,                                                +        
               LTH=2                                                            
         MFLD  FELTEXT2,                                               +        
               LTH=63                                                           
         MFLD  FELKOD3,                                                +        
               LTH=2                                                            
         MFLD  FELTEXT3,                                               +        
               LTH=63                                                           
         MFLD  FELKOD4,                                                +        
               LTH=2                                                            
         MFLD  FELTEXT4,                                               +        
               LTH=63                                                           
         MFLD  FELKOD5,                                                +        
               LTH=2                                                            
         MFLD  FELTEXT5,                                               +        
               LTH=63                                                           
         MFLD  FELKOD6,                                                +        
               LTH=2                                                            
         MFLD  FELTEXT6,                                               +        
               LTH=63                                                           
         MFLD  FELKOD7,                                                +        
               LTH=2                                                            
         MFLD  FELTEXT7,                                               +        
               LTH=63                                                           
         MFLD  FELKOD8,                                                +        
               LTH=2                                                            
         MFLD  FELTEXT8,                                               +        
               LTH=63                                                           
         MFLD  FELKOD9,                                                +        
               LTH=2                                                            
         MFLD  FELTEXT9,                                               +        
               LTH=63                                                           
         MFLD  FELKOD10,                                               +        
               LTH=2                                                            
         MFLD  FELTXT10,                                               +        
               LTH=63                                                           
         MFLD  FKODUPD,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FTEXTUPF,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RENSA,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=79                                                           
         MSGEND                                                                 
         END                                                                    
