***********************************************************************         
* CREATED BY PC36147   ON 98/08/27  AT 12:18                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'REGISTRERING PROFORMARADER      '                               
W4F262   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T261  ',                                          +        
               14='W4T262  ',                                          +        
               15='W4T264  ',                                          +        
               16='W4T265  ',                                          +        
               17='W4T266  ',                                          +        
               18='W4T267  ',                                          +        
               19='W4T268  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W4T262U  ',                                         +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W4F262   DPAGE CURSOR=((2,8)),                                         +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'PROFORMARAD REGISTRERING',                             +        
               POS=(1,11),LTH=24,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Distr',                                                +        
               POS=(2,2),LTH=5,                                        +        
               ATTR=(ALPHA,PROT)                                                
IDDISTRI DFLD  POS=(2,8),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Kundnr',                                               +        
               POS=(2,13),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
IDKUNDIN DFLD  POS=(2,20),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Order',                                                +        
               POS=(2,27),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
IDORDERI DFLD  POS=(2,33),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '* Artnr',                                              +        
               POS=(2,41),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
IDARTNRI DFLD  POS=(2,49),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
IDDISTRU DFLD  POS=(3,8),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
IDKUNDNU DFLD  POS=(3,20),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
IDORDNRU DFLD  POS=(3,33),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Kl',                                                   +        
               POS=(3,42),LTH=2,                                       +        
               ATTR=(PROT)                                                      
KDORDKLU DFLD  POS=(3,45),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Fk',                                                   +        
               POS=(3,48),LTH=2,                                       +        
               ATTR=(PROT)                                                      
KDFRAKTU DFLD  POS=(3,51),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Typ',                                                  +        
               POS=(3,55),LTH=3,                                       +        
               ATTR=(PROT)                                                      
PROTYPUT DFLD  POS=(3,59),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
TEDDI    DFLD  POS=(4,70),LTH=11,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Artnr',                                                +        
               POS=(5,2),LTH=5,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'Antal  Radreferens Stpris',                            +        
               POS=(5,14),LTH=25,                                      +        
               ATTR=(PROT)                                                      
KDVALISO DFLD  POS=(5,40),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Q  B',                                                 +        
               POS=(5,44),LTH=4,                                       +        
               ATTR=(PROT)                                                      
IDARTN01 DFLD  POS=(6,2),LTH=11,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
KVBEAR01 DFLD  POS=(6,14),LTH=6,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
R1       DFLD  POS=(6,21),LTH=10,                                      +        
               ATTR=(NOPROT,MOD)                                                
STPRIS01 DFLD  POS=(6,33),LTH=10,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
KDBRYT01 DFLD  POS=(6,44),LTH=1,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
FLINVE01 DFLD  POS=(6,47),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  ' ',                                                    +        
               POS=(6,49),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
IDARTN02 DFLD  POS=(7,2),LTH=11,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
KVBEAR02 DFLD  POS=(7,14),LTH=6,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
R2       DFLD  POS=(7,21),LTH=10,                                      +        
               ATTR=(NOPROT,MOD)                                                
STPRIS02 DFLD  POS=(7,33),LTH=10,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
KDBRYT02 DFLD  POS=(7,44),LTH=1,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
FLINVE02 DFLD  POS=(7,47),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  ' ',                                                    +        
               POS=(7,49),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
IDARTN03 DFLD  POS=(8,2),LTH=11,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
KVBEAR03 DFLD  POS=(8,14),LTH=6,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
R3       DFLD  POS=(8,21),LTH=10,                                      +        
               ATTR=(NOPROT,MOD)                                                
STPRIS03 DFLD  POS=(8,33),LTH=10,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
KDBRYT03 DFLD  POS=(8,44),LTH=1,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
FLINVE03 DFLD  POS=(8,47),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  ' ',                                                    +        
               POS=(8,49),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
IDARTN04 DFLD  POS=(9,2),LTH=11,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
KVBEAR04 DFLD  POS=(9,14),LTH=6,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
R4       DFLD  POS=(9,21),LTH=10,                                      +        
               ATTR=(NOPROT,MOD)                                                
STPRIS04 DFLD  POS=(9,33),LTH=10,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
KDBRYT04 DFLD  POS=(9,44),LTH=1,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
FLINVE04 DFLD  POS=(9,47),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  ' ',                                                    +        
               POS=(9,49),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
IDARTN05 DFLD  POS=(10,2),LTH=11,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
KVBEAR05 DFLD  POS=(10,14),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
R5       DFLD  POS=(10,21),LTH=10,                                     +        
               ATTR=(NOPROT,MOD)                                                
STPRIS05 DFLD  POS=(10,33),LTH=10,                                     +        
               ATTR=(NUM,NOPROT,MOD)                                            
KDBRYT05 DFLD  POS=(10,44),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FLINVE05 DFLD  POS=(10,47),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  ' ',                                                    +        
               POS=(10,49),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
IDARTN06 DFLD  POS=(11,2),LTH=11,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
KVBEAR06 DFLD  POS=(11,14),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
R6       DFLD  POS=(11,21),LTH=10,                                     +        
               ATTR=(NOPROT,MOD)                                                
STPRIS06 DFLD  POS=(11,33),LTH=10,                                     +        
               ATTR=(NUM,NOPROT,MOD)                                            
KDBRYT06 DFLD  POS=(11,44),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FLINVE06 DFLD  POS=(11,47),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  ' ',                                                    +        
               POS=(11,49),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
IDARTN07 DFLD  POS=(12,2),LTH=11,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
KVBEAR07 DFLD  POS=(12,14),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
R7       DFLD  POS=(12,21),LTH=10,                                     +        
               ATTR=(NOPROT,MOD)                                                
STPRIS07 DFLD  POS=(12,33),LTH=10,                                     +        
               ATTR=(NUM,NOPROT,MOD)                                            
KDBRYT07 DFLD  POS=(12,44),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FLINVE07 DFLD  POS=(12,47),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  ' ',                                                    +        
               POS=(12,49),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
IDARTN08 DFLD  POS=(13,2),LTH=11,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
KVBEAR08 DFLD  POS=(13,14),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
R8       DFLD  POS=(13,21),LTH=10,                                     +        
               ATTR=(NOPROT,MOD)                                                
STPRIS08 DFLD  POS=(13,33),LTH=10,                                     +        
               ATTR=(NUM,NOPROT,MOD)                                            
KDBRYT08 DFLD  POS=(13,44),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FLINVE08 DFLD  POS=(13,47),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  ' ',                                                    +        
               POS=(13,49),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
IDARTN09 DFLD  POS=(14,2),LTH=11,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
KVBEAR09 DFLD  POS=(14,14),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
R9       DFLD  POS=(14,21),LTH=10,                                     +        
               ATTR=(NOPROT,MOD)                                                
STPRIS09 DFLD  POS=(14,33),LTH=10,                                     +        
               ATTR=(NUM,NOPROT,MOD)                                            
KDBRYT09 DFLD  POS=(14,44),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FLINVE09 DFLD  POS=(14,47),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  ' ',                                                    +        
               POS=(14,49),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
IDARTN10 DFLD  POS=(15,2),LTH=11,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
KVBEAR10 DFLD  POS=(15,14),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
R10      DFLD  POS=(15,21),LTH=10,                                     +        
               ATTR=(NOPROT,MOD)                                                
STPRIS10 DFLD  POS=(15,33),LTH=10,                                     +        
               ATTR=(NUM,NOPROT,MOD)                                            
KDBRYT10 DFLD  POS=(15,44),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FLINVE10 DFLD  POS=(15,47),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  ' ',                                                    +        
               POS=(15,49),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
IDARTN11 DFLD  POS=(16,2),LTH=11,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
KVBEAR11 DFLD  POS=(16,14),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
R11      DFLD  POS=(16,21),LTH=10,                                     +        
               ATTR=(NOPROT,MOD)                                                
STPRIS11 DFLD  POS=(16,33),LTH=10,                                     +        
               ATTR=(NUM,NOPROT,MOD)                                            
KDBRYT11 DFLD  POS=(16,44),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FLINVE11 DFLD  POS=(16,47),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  ' ',                                                    +        
               POS=(16,49),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
IDARTN12 DFLD  POS=(17,2),LTH=11,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
KVBEAR12 DFLD  POS=(17,14),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
R12      DFLD  POS=(17,21),LTH=10,                                     +        
               ATTR=(NOPROT,MOD)                                                
STPRIS12 DFLD  POS=(17,33),LTH=10,                                     +        
               ATTR=(NUM,NOPROT,MOD)                                            
KDBRYT12 DFLD  POS=(17,44),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FLINVE12 DFLD  POS=(17,47),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  ' ',                                                    +        
               POS=(17,49),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
IDARTN13 DFLD  POS=(18,2),LTH=11,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
KVBEAR13 DFLD  POS=(18,14),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
R13      DFLD  POS=(18,21),LTH=10,                                     +        
               ATTR=(NOPROT,MOD)                                                
STPRIS13 DFLD  POS=(18,33),LTH=10,                                     +        
               ATTR=(NUM,NOPROT,MOD)                                            
KDBRYT13 DFLD  POS=(18,44),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FLINVE13 DFLD  POS=(18,47),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  ' ',                                                    +        
               POS=(18,49),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
IDARTN14 DFLD  POS=(19,2),LTH=11,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
KVBEAR14 DFLD  POS=(19,14),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
R14      DFLD  POS=(19,21),LTH=10,                                     +        
               ATTR=(NOPROT,MOD)                                                
STPRIS14 DFLD  POS=(19,33),LTH=10,                                     +        
               ATTR=(NUM,NOPROT,MOD)                                            
KDBRYT14 DFLD  POS=(19,44),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FLINVE14 DFLD  POS=(19,47),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  ' ',                                                    +        
               POS=(19,49),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
STOP     DFLD  POS=(20,2),LTH=1,                                       +        
               ATTR=(NUM,NOPROT,HI,MOD)                                         
         DFLD  ' ',                                                    +        
               POS=(20,4),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
         DFLD  '13 Nyupp huv  14 Nyupp rad    15 Ändr/Bort huv 16 Ändr/+        
               Bort rad 17 Komplett 1',                                +        
               POS=(21,2),LTH=77,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18 Komplett 2 19 Komplett 3   20',                     +        
               POS=(22,2),LTH=32,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,49),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4I26201 MSG   TYPE=INPUT,                                             +        
               SOR=(W4F262),                                           +        
               OPT=2,                                                  +        
               NXT=W4O26201                                                     
MID      LPAGE SOR=(W4F262),                                           +        
               NXT=W4O26201                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  (IDTRANS1,                                              +        
               '4'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  (IDTRANS2,                                              +        
               '2'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  (IDTRANS3,                                              +        
               '6'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  (IDTRANS4,                                              +        
               '2'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '42621',                                                +        
               LTH=5                                                            
         MFLD  (IDDISTRI,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDKUNDIN,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDORDERI,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDARTNRI,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDDISTRU,                                              +        
               '    '),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDKUNDNU,                                              +        
               '      '),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDORDNRU,                                              +        
               '       '),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDORDKLU,                                              +        
               ' '),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDFRAKTU,                                              +        
               '  '),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PROTYPUT,                                              +        
               ' '),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLSLUT,                                                +        
               ' '),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDTRTYP,                                               +        
               ' '),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDARTN01,                                              +        
               '+++++++++++'),                                         +        
               LTH=11,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVBEAR01,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (R1,                                                    +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (STPRIS01,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDBRYT01,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLINVE01,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDARTN02,                                              +        
               '+++++++++++'),                                         +        
               LTH=11,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVBEAR02,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (R2,                                                    +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (STPRIS02,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDBRYT02,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLINVE02,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDARTN03,                                              +        
               '+++++++++++'),                                         +        
               LTH=11,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVBEAR03,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (R3,                                                    +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (STPRIS03,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDBRYT03,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLINVE03,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDARTN04,                                              +        
               '+++++++++++'),                                         +        
               LTH=11,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVBEAR04,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (R4,                                                    +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (STPRIS04,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDBRYT04,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLINVE04,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDARTN05,                                              +        
               '+++++++++++'),                                         +        
               LTH=11,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVBEAR05,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (R5,                                                    +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (STPRIS05,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDBRYT05,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLINVE05,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDARTN06,                                              +        
               '+++++++++++'),                                         +        
               LTH=11,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVBEAR06,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (R6,                                                    +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (STPRIS06,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDBRYT06,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLINVE06,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDARTN07,                                              +        
               '+++++++++++'),                                         +        
               LTH=11,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVBEAR07,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (R7,                                                    +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (STPRIS07,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDBRYT07,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLINVE07,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDARTN08,                                              +        
               '+++++++++++'),                                         +        
               LTH=11,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVBEAR08,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (R8,                                                    +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (STPRIS08,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDBRYT08,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLINVE08,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDARTN09,                                              +        
               '+++++++++++'),                                         +        
               LTH=11,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVBEAR09,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (R9,                                                    +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (STPRIS09,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDBRYT09,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLINVE09,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDARTN10,                                              +        
               '+++++++++++'),                                         +        
               LTH=11,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVBEAR10,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (R10,                                                   +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (STPRIS10,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDBRYT10,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLINVE10,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDARTN11,                                              +        
               '+++++++++++'),                                         +        
               LTH=11,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVBEAR11,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (R11,                                                   +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (STPRIS11,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDBRYT11,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLINVE11,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDARTN12,                                              +        
               '+++++++++++'),                                         +        
               LTH=11,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVBEAR12,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (R12,                                                   +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (STPRIS12,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDBRYT12,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLINVE12,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDARTN13,                                              +        
               '+++++++++++'),                                         +        
               LTH=11,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVBEAR13,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (R13,                                                   +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (STPRIS13,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDBRYT13,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLINVE13,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDARTN14,                                              +        
               '+++++++++++'),                                         +        
               LTH=11,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVBEAR14,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (R14,                                                   +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (STPRIS14,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDBRYT14,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLINVE14,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
W4O26201 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4F262,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I26201,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W4F262,                                             +        
               NXT=W4I26201                                                     
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDDISTRI,                                               +        
               LTH=4                                                            
         MFLD  IDKUNDIN,                                               +        
               LTH=6                                                            
         MFLD  IDORDERI,                                               +        
               LTH=7                                                            
         MFLD  IDARTNRI,                                               +        
               LTH=9                                                            
         MFLD  IDDISTRU,                                               +        
               LTH=4                                                            
         MFLD  IDKUNDNU,                                               +        
               LTH=6                                                            
         MFLD  IDORDNRU,                                               +        
               LTH=7                                                            
         MFLD  KDORDKLU,                                               +        
               LTH=1                                                            
         MFLD  KDFRAKTU,                                               +        
               LTH=2                                                            
         MFLD  PROTYPUT,                                               +        
               LTH=1                                                            
         MFLD  TEDDI,                                                  +        
               LTH=11                                                           
         MFLD  KDVALISO,                                               +        
               LTH=3                                                            
         MFLD  IDARTN01,                                               +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVBEAR01,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  R1,                                                     +        
               LTH=10                                                           
         MFLD  STPRIS01,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDBRYT01,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLINVE01,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTN02,                                               +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVBEAR02,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  R2,                                                     +        
               LTH=10                                                           
         MFLD  STPRIS02,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDBRYT02,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLINVE02,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTN03,                                               +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVBEAR03,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  R3,                                                     +        
               LTH=10                                                           
         MFLD  STPRIS03,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDBRYT03,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLINVE03,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTN04,                                               +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVBEAR04,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  R4,                                                     +        
               LTH=10                                                           
         MFLD  STPRIS04,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDBRYT04,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLINVE04,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTN05,                                               +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVBEAR05,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  R5,                                                     +        
               LTH=10                                                           
         MFLD  STPRIS05,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDBRYT05,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLINVE05,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTN06,                                               +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVBEAR06,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  R6,                                                     +        
               LTH=10                                                           
         MFLD  STPRIS06,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDBRYT06,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLINVE06,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTN07,                                               +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVBEAR07,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  R7,                                                     +        
               LTH=10                                                           
         MFLD  STPRIS07,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDBRYT07,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLINVE07,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTN08,                                               +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVBEAR08,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  R8,                                                     +        
               LTH=10                                                           
         MFLD  STPRIS08,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDBRYT08,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLINVE08,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTN09,                                               +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVBEAR09,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  R9,                                                     +        
               LTH=10                                                           
         MFLD  STPRIS09,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDBRYT09,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLINVE09,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTN10,                                               +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVBEAR10,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  R10,                                                    +        
               LTH=10                                                           
         MFLD  STPRIS10,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDBRYT10,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLINVE10,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTN11,                                               +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVBEAR11,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  R11,                                                    +        
               LTH=10                                                           
         MFLD  STPRIS11,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDBRYT11,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLINVE11,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTN12,                                               +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVBEAR12,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  R12,                                                    +        
               LTH=10                                                           
         MFLD  STPRIS12,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDBRYT12,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLINVE12,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTN13,                                               +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVBEAR13,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  R13,                                                    +        
               LTH=10                                                           
         MFLD  STPRIS13,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDBRYT13,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLINVE13,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTN14,                                               +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVBEAR14,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  R14,                                                    +        
               LTH=10                                                           
         MFLD  STPRIS14,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDBRYT14,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLINVE14,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  STOP,                                                   +        
               LTH=1                                                            
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
