***********************************************************************         
* CREATED BY V077376   ON 02/02/18  AT 12:39                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'TIDSSÄTTNING ORDER              '                               
W4F205   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W4T205 7',                                           +        
               8='W4T205 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T205U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((2,14)),                                        +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'TIDSSÄTTNING ORDER',                                   +        
               POS=(1,12),LTH=18,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'DC',                                                   +        
               POS=(2,2),LTH=2,                                        +        
               ATTR=(ALPHA,PROT)                                                
IDDCI    DFLD  POS=(2,5),LTH=2,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'TrpId',                                                +        
               POS=(2,8),LTH=5,                                        +        
               ATTR=(NUM,PROT)                                                  
IDTRPX   DFLD  POS=(2,14),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Avgtid',                                               +        
               POS=(2,20),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
TATI     DFLD  POS=(2,27),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Distr',                                                +        
               POS=(2,35),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
IDDISTRI DFLD  POS=(2,41),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Kund',                                                 +        
               POS=(2,46),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
IDKUNDNI DFLD  POS=(2,51),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Fk',                                                   +        
               POS=(2,58),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
KDFRAKTI DFLD  POS=(2,61),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Order',                                                +        
               POS=(2,64),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
IDORDNRI DFLD  POS=(2,70),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
IDDCU    DFLD  POS=(3,5),LTH=2,                                        +        
               ATTR=(PROT,MOD)                                                  
IDTRPU   DFLD  POS=(3,14),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
TATU     DFLD  POS=(3,27),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
IDDISTRU DFLD  POS=(3,41),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
IDKUNDNU DFLD  POS=(3,51),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
KDFRAKTU DFLD  POS=(3,61),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
IDORDNRU DFLD  POS=(3,70),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
TATE     DFLD  POS=(4,2),LTH=10,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
TATN     DFLD  POS=(4,13),LTH=10,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
IDORDERE DFLD  POS=(4,24),LTH=7,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
IDORDERN DFLD  POS=(4,32),LTH=7,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
IDKUNDE  DFLD  POS=(4,40),LTH=7,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
IDKUNDN  DFLD  POS=(4,48),LTH=7,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
IDORDNRE DFLD  POS=(4,56),LTH=7,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
IDORDNRN DFLD  POS=(4,64),LTH=7,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
TEDDI    DFLD  POS=(4,72),LTH=9,                                       +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'CMD Distr  Kund   Order Fk Kl K   Volym',              +        
               POS=(5,2),LTH=39,                                       +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Vikt   Ordervärde   TRPID Avgtid',                     +        
               POS=(5,46),LTH=32,                                      +        
               ATTR=(PROT)                                                      
VAL6     DFLD  POS=(6,3),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
IDDIST6  DFLD  POS=(6,6),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
IDKUND6  DFLD  POS=(6,11),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
IDORDE6  DFLD  POS=(6,18),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KDFRAK6  DFLD  POS=(6,26),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
KDORDK6  DFLD  POS=(6,29),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
KAT6     DFLD  POS=(6,32),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
VOLYM6   DFLD  POS=(6,34),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
VIKT6    DFLD  POS=(6,43),LTH=7,                                       +        
               ATTR=(PROT)                                                      
VARDE6   DFLD  POS=(6,51),LTH=12,                                      +        
               ATTR=(NUM,PROT)                                                  
AST06    DFLD  POS=(6,64),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
TRPID6   DFLD  POS=(6,66),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
AVGID6   DFLD  POS=(6,72),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
VAL7     DFLD  POS=(7,3),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
IDDIST7  DFLD  POS=(7,6),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
IDKUND7  DFLD  POS=(7,11),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
IDORDE7  DFLD  POS=(7,18),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KDFRAK7  DFLD  POS=(7,26),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
KDORDK7  DFLD  POS=(7,29),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
KAT7     DFLD  POS=(7,32),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
VOLYM7   DFLD  POS=(7,34),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
VIKT7    DFLD  POS=(7,43),LTH=7,                                       +        
               ATTR=(PROT)                                                      
VARDE7   DFLD  POS=(7,51),LTH=12,                                      +        
               ATTR=(NUM,PROT)                                                  
AST07    DFLD  POS=(7,64),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
TRPID7   DFLD  POS=(7,66),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
AVGID7   DFLD  POS=(7,72),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
VAL8     DFLD  POS=(8,3),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
IDDIST8  DFLD  POS=(8,6),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
IDKUND8  DFLD  POS=(8,11),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
IDORDE8  DFLD  POS=(8,18),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KDFRAK8  DFLD  POS=(8,26),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
KDORDK8  DFLD  POS=(8,29),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
KAT8     DFLD  POS=(8,32),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
VOLYM8   DFLD  POS=(8,34),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
VIKT8    DFLD  POS=(8,43),LTH=7,                                       +        
               ATTR=(PROT)                                                      
VARDE8   DFLD  POS=(8,51),LTH=12,                                      +        
               ATTR=(NUM,PROT)                                                  
AST08    DFLD  POS=(8,64),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
TRPID8   DFLD  POS=(8,66),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
AVGID8   DFLD  POS=(8,72),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
VAL9     DFLD  POS=(9,3),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
IDDIST9  DFLD  POS=(9,6),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
IDKUND9  DFLD  POS=(9,11),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
IDORDE9  DFLD  POS=(9,18),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KDFRAK9  DFLD  POS=(9,26),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
KDORDK9  DFLD  POS=(9,29),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
KAT9     DFLD  POS=(9,32),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
VOLYM9   DFLD  POS=(9,34),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
VIKT9    DFLD  POS=(9,43),LTH=7,                                       +        
               ATTR=(PROT)                                                      
VARDE9   DFLD  POS=(9,51),LTH=12,                                      +        
               ATTR=(NUM,PROT)                                                  
AST09    DFLD  POS=(9,64),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
TRPID9   DFLD  POS=(9,66),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
AVGID9   DFLD  POS=(9,72),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
VAL10    DFLD  POS=(10,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
IDDIST10 DFLD  POS=(10,6),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
IDKUND10 DFLD  POS=(10,11),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
IDORDE10 DFLD  POS=(10,18),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KDFRAK10 DFLD  POS=(10,26),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
KDORDK10 DFLD  POS=(10,29),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
KAT10    DFLD  POS=(10,32),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
VOLYM10  DFLD  POS=(10,34),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
VIKT10   DFLD  POS=(10,43),LTH=7,                                      +        
               ATTR=(PROT)                                                      
VARDE10  DFLD  POS=(10,51),LTH=12,                                     +        
               ATTR=(NUM,PROT)                                                  
AST10    DFLD  POS=(10,64),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
TRPID10  DFLD  POS=(10,66),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
AVGID10  DFLD  POS=(10,72),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
VAL11    DFLD  POS=(11,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
IDDIST11 DFLD  POS=(11,6),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
IDKUND11 DFLD  POS=(11,11),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
IDORDE11 DFLD  POS=(11,18),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KDFRAK11 DFLD  POS=(11,26),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
KDORDK11 DFLD  POS=(11,29),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
KAT11    DFLD  POS=(11,32),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
VOLYM11  DFLD  POS=(11,34),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
VIKT11   DFLD  POS=(11,43),LTH=7,                                      +        
               ATTR=(PROT)                                                      
VARDE11  DFLD  POS=(11,51),LTH=12,                                     +        
               ATTR=(NUM,PROT)                                                  
AST11    DFLD  POS=(11,64),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
TRPID11  DFLD  POS=(11,66),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
AVGID11  DFLD  POS=(11,72),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
VAL12    DFLD  POS=(12,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
IDDIST12 DFLD  POS=(12,6),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
IDKUND12 DFLD  POS=(12,11),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
IDORDE12 DFLD  POS=(12,18),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KDFRAK12 DFLD  POS=(12,26),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
KDORDK12 DFLD  POS=(12,29),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
KAT12    DFLD  POS=(12,32),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
VOLYM12  DFLD  POS=(12,34),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
VIKT12   DFLD  POS=(12,43),LTH=7,                                      +        
               ATTR=(PROT)                                                      
VARDE12  DFLD  POS=(12,51),LTH=12,                                     +        
               ATTR=(NUM,PROT)                                                  
AST12    DFLD  POS=(12,64),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
TRPID12  DFLD  POS=(12,66),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
AVGID12  DFLD  POS=(12,72),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
VAL13    DFLD  POS=(13,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
IDDIST13 DFLD  POS=(13,6),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
IDKUND13 DFLD  POS=(13,11),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
IDORDE13 DFLD  POS=(13,18),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KDFRAK13 DFLD  POS=(13,26),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
KDORDK13 DFLD  POS=(13,29),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
KAT13    DFLD  POS=(13,32),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
VOLYM13  DFLD  POS=(13,34),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
VIKT13   DFLD  POS=(13,43),LTH=7,                                      +        
               ATTR=(PROT)                                                      
VARDE13  DFLD  POS=(13,51),LTH=12,                                     +        
               ATTR=(NUM,PROT)                                                  
AST13    DFLD  POS=(13,64),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
TRPID13  DFLD  POS=(13,66),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
AVGID13  DFLD  POS=(13,72),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
VAL14    DFLD  POS=(14,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
IDDIST14 DFLD  POS=(14,6),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
IDKUND14 DFLD  POS=(14,11),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
IDORDE14 DFLD  POS=(14,18),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KDFRAK14 DFLD  POS=(14,26),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
KDORDK14 DFLD  POS=(14,29),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
KAT14    DFLD  POS=(14,32),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
VOLYM14  DFLD  POS=(14,34),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
VIKT14   DFLD  POS=(14,43),LTH=7,                                      +        
               ATTR=(PROT)                                                      
VARDE14  DFLD  POS=(14,51),LTH=12,                                     +        
               ATTR=(NUM,PROT)                                                  
AST14    DFLD  POS=(14,64),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
TRPID14  DFLD  POS=(14,66),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
AVGID14  DFLD  POS=(14,72),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
VAL15    DFLD  POS=(15,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
IDDIST15 DFLD  POS=(15,6),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
IDKUND15 DFLD  POS=(15,11),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
IDORDE15 DFLD  POS=(15,18),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KDFRAK15 DFLD  POS=(15,26),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
KDORDK15 DFLD  POS=(15,29),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
KAT15    DFLD  POS=(15,32),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
VOLYM15  DFLD  POS=(15,34),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
VIKT15   DFLD  POS=(15,43),LTH=7,                                      +        
               ATTR=(PROT)                                                      
VARDE15  DFLD  POS=(15,51),LTH=12,                                     +        
               ATTR=(NUM,PROT)                                                  
AST15    DFLD  POS=(15,64),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
TRPID15  DFLD  POS=(15,66),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
AVGID15  DFLD  POS=(15,72),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
VAL16    DFLD  POS=(16,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
IDDIST16 DFLD  POS=(16,6),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
IDKUND16 DFLD  POS=(16,11),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
IDORDE16 DFLD  POS=(16,18),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KDFRAK16 DFLD  POS=(16,26),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
KDORDK16 DFLD  POS=(16,29),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
KAT16    DFLD  POS=(16,32),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
VOLYM16  DFLD  POS=(16,34),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
VIKT16   DFLD  POS=(16,43),LTH=7,                                      +        
               ATTR=(PROT)                                                      
VARDE16  DFLD  POS=(16,51),LTH=12,                                     +        
               ATTR=(NUM,PROT)                                                  
AST16    DFLD  POS=(16,64),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
TRPID16  DFLD  POS=(16,66),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
AVGID16  DFLD  POS=(16,72),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  'total',                                                +        
               POS=(17,27),LTH=5,                                      +        
               ATTR=(PROT)                                                      
SUVOLYM  DFLD  POS=(17,33),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
SUVIKT   DFLD  POS=(17,42),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
SUVARDE  DFLD  POS=(17,51),LTH=12,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
ASTTOT   DFLD  POS=(17,64),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  'vvdttmm',                                              +        
               POS=(18,13),LTH=7,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'vvdttmm',                                              +        
               POS=(18,27),LTH=7,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Avgångstid',                                           +        
               POS=(19,2),LTH=10,                                      +        
               ATTR=(PROT)                                                      
TIAVG    DFLD  POS=(19,13),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'RFS',                                                  +        
               POS=(19,22),LTH=3,                                      +        
               ATTR=(PROT)                                                      
TIBPT    DFLD  POS=(19,27),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
IDPRODE  DFLD  POS=(20,2),LTH=7,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
IDPRODN  DFLD  POS=(20,10),LTH=7,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
IDPLKE   DFLD  POS=(20,18),LTH=3,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
IDPLKN   DFLD  POS=(20,22),LTH=3,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
         DFLD  '13',                                                   +        
               POS=(21,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '14',                                                   +        
               POS=(21,17),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '15',                                                   +        
               POS=(21,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16',                                                   +        
               POS=(21,49),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,17),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,49),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(23,59),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4I20501 MSG   TYPE=INPUT,                                             +        
               SOR=(W4F205),                                           +        
               OPT=2,                                                  +        
               NXT=W4O20501                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '42051',                                                +        
               LTH=5                                                            
         MFLD  (IDDCI,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDDCU,                                                  +        
               LTH=2                                                            
         MFLD  (IDTRPX,                                                +        
               '+++++'),                                               +        
               LTH=5                                                            
         MFLD  IDTRPU,                                                 +        
               LTH=5                                                            
         MFLD  (TATI,                                                  +        
               '+++++++'),                                             +        
               LTH=7                                                            
         MFLD  TATU,                                                   +        
               LTH=7                                                            
         MFLD  (IDDISTRI,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDDISTRU,                                               +        
               LTH=4                                                            
         MFLD  (IDKUNDNI,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDKUNDNU,                                               +        
               LTH=6                                                            
         MFLD  (KDFRAKTI,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KDFRAKTU,                                               +        
               LTH=2                                                            
         MFLD  (IDORDNRI,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDORDNRU,                                               +        
               LTH=7                                                            
         MFLD  TATE,                                                   +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  TATN,                                                   +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDORDERE,                                               +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDORDERN,                                               +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDKUNDE,                                                +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDKUNDN,                                                +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDORDNRE,                                               +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDORDNRN,                                               +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (VAL6,                                                  +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (IDDIST6,                                               +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (IDKUND6,                                               +        
               '++++++'),                                              +        
               LTH=6                                                            
         MFLD  (IDORDE6,                                               +        
               '+++++++'),                                             +        
               LTH=7                                                            
         MFLD  (KAT6,                                                  +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (AVGID6,                                                +        
               '+++++++'),                                             +        
               LTH=7                                                            
         MFLD  (VAL7,                                                  +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (IDDIST7,                                               +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (IDKUND7,                                               +        
               '++++++'),                                              +        
               LTH=6                                                            
         MFLD  (IDORDE7,                                               +        
               '+++++++'),                                             +        
               LTH=7                                                            
         MFLD  (KAT7,                                                  +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (AVGID7,                                                +        
               '+++++++'),                                             +        
               LTH=7                                                            
         MFLD  (VAL8,                                                  +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (IDDIST8,                                               +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (IDKUND8,                                               +        
               '++++++'),                                              +        
               LTH=6                                                            
         MFLD  (IDORDE8,                                               +        
               '+++++++'),                                             +        
               LTH=7                                                            
         MFLD  (KAT8,                                                  +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (AVGID8,                                                +        
               '+++++++'),                                             +        
               LTH=7                                                            
         MFLD  (VAL9,                                                  +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (IDDIST9,                                               +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (IDKUND9,                                               +        
               '++++++'),                                              +        
               LTH=6                                                            
         MFLD  (IDORDE9,                                               +        
               '+++++++'),                                             +        
               LTH=7                                                            
         MFLD  (KAT9,                                                  +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (AVGID9,                                                +        
               '+++++++'),                                             +        
               LTH=7                                                            
         MFLD  (VAL10,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (IDDIST10,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (IDKUND10,                                              +        
               '++++++'),                                              +        
               LTH=6                                                            
         MFLD  (IDORDE10,                                              +        
               '+++++++'),                                             +        
               LTH=7                                                            
         MFLD  (KAT10,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (AVGID10,                                               +        
               '+++++++'),                                             +        
               LTH=7                                                            
         MFLD  (VAL11,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (IDDIST11,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (IDKUND11,                                              +        
               '++++++'),                                              +        
               LTH=6                                                            
         MFLD  (IDORDE11,                                              +        
               '+++++++'),                                             +        
               LTH=7                                                            
         MFLD  (KAT11,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (AVGID11,                                               +        
               '+++++++'),                                             +        
               LTH=7                                                            
         MFLD  (VAL12,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (IDDIST12,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (IDKUND12,                                              +        
               '++++++'),                                              +        
               LTH=6                                                            
         MFLD  (IDORDE12,                                              +        
               '+++++++'),                                             +        
               LTH=7                                                            
         MFLD  (KAT12,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (AVGID12,                                               +        
               '+++++++'),                                             +        
               LTH=7                                                            
         MFLD  (VAL13,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (IDDIST13,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (IDKUND13,                                              +        
               '++++++'),                                              +        
               LTH=6                                                            
         MFLD  (IDORDE13,                                              +        
               '+++++++'),                                             +        
               LTH=7                                                            
         MFLD  (KAT13,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (AVGID13,                                               +        
               '+++++++'),                                             +        
               LTH=7                                                            
         MFLD  (VAL14,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (IDDIST14,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (IDKUND14,                                              +        
               '++++++'),                                              +        
               LTH=6                                                            
         MFLD  (IDORDE14,                                              +        
               '+++++++'),                                             +        
               LTH=7                                                            
         MFLD  (KAT14,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (AVGID14,                                               +        
               '+++++++'),                                             +        
               LTH=7                                                            
         MFLD  (VAL15,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (IDDIST15,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (IDKUND15,                                              +        
               '++++++'),                                              +        
               LTH=6                                                            
         MFLD  (IDORDE15,                                              +        
               '+++++++'),                                             +        
               LTH=7                                                            
         MFLD  (KAT15,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (AVGID15,                                               +        
               '+++++++'),                                             +        
               LTH=7                                                            
         MFLD  (VAL16,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (IDDIST16,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (IDKUND16,                                              +        
               '++++++'),                                              +        
               LTH=6                                                            
         MFLD  (IDORDE16,                                              +        
               '+++++++'),                                             +        
               LTH=7                                                            
         MFLD  (KAT16,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (AVGID16,                                               +        
               '+++++++'),                                             +        
               LTH=7                                                            
         MFLD  (SUVOLYM,                                               +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (SUVIKT,                                                +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (SUVARDE,                                               +        
               '++++++++++++'),                                        +        
               LTH=12                                                           
         MFLD  (ASTTOT,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (TIAVG,                                                 +        
               '+++++++'),                                             +        
               LTH=7                                                            
         MFLD  (TIBPT,                                                 +        
               '+++++++'),                                             +        
               LTH=7                                                            
         MFLD  IDPRODE,                                                +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDPRODN,                                                +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDPLKE,                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDPLKN,                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
W4O20501 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4F205,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I20501,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDDCI,                                                  +        
               LTH=2                                                            
         MFLD  IDTRPX,                                                 +        
               LTH=5                                                            
         MFLD  TATI,                                                   +        
               LTH=7                                                            
         MFLD  IDDISTRI,                                               +        
               LTH=4                                                            
         MFLD  IDKUNDNI,                                               +        
               LTH=6                                                            
         MFLD  KDFRAKTI,                                               +        
               LTH=2                                                            
         MFLD  IDORDNRI,                                               +        
               LTH=7                                                            
         MFLD  IDDCU,                                                  +        
               LTH=2                                                            
         MFLD  IDTRPU,                                                 +        
               LTH=5                                                            
         MFLD  TATU,                                                   +        
               LTH=7                                                            
         MFLD  IDDISTRU,                                               +        
               LTH=4                                                            
         MFLD  IDKUNDNU,                                               +        
               LTH=6                                                            
         MFLD  KDFRAKTU,                                               +        
               LTH=2                                                            
         MFLD  IDORDNRU,                                               +        
               LTH=7                                                            
         MFLD  TATE,                                                   +        
               LTH=10                                                           
         MFLD  TATN,                                                   +        
               LTH=10                                                           
         MFLD  IDORDERE,                                               +        
               LTH=7                                                            
         MFLD  IDORDERN,                                               +        
               LTH=7                                                            
         MFLD  IDKUNDE,                                                +        
               LTH=7                                                            
         MFLD  IDKUNDN,                                                +        
               LTH=7                                                            
         MFLD  IDORDNRE,                                               +        
               LTH=7                                                            
         MFLD  IDORDNRN,                                               +        
               LTH=7                                                            
         MFLD  TEDDI,                                                  +        
               LTH=9                                                            
         MFLD  VAL6,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDDIST6,                                                +        
               LTH=4                                                            
         MFLD  IDKUND6,                                                +        
               LTH=6                                                            
         MFLD  IDORDE6,                                                +        
               LTH=7                                                            
         MFLD  KDFRAK6,                                                +        
               LTH=2                                                            
         MFLD  KDORDK6,                                                +        
               LTH=1                                                            
         MFLD  KAT6,                                                   +        
               LTH=1                                                            
         MFLD  VOLYM6,                                                 +        
               LTH=7                                                            
         MFLD  VIKT6,                                                  +        
               LTH=7                                                            
         MFLD  VARDE6,                                                 +        
               LTH=12                                                           
         MFLD  AST06,                                                  +        
               LTH=1                                                            
         MFLD  TRPID6,                                                 +        
               LTH=5                                                            
         MFLD  AVGID6,                                                 +        
               LTH=7                                                            
         MFLD  VAL7,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDDIST7,                                                +        
               LTH=4                                                            
         MFLD  IDKUND7,                                                +        
               LTH=6                                                            
         MFLD  IDORDE7,                                                +        
               LTH=7                                                            
         MFLD  KDFRAK7,                                                +        
               LTH=2                                                            
         MFLD  KDORDK7,                                                +        
               LTH=1                                                            
         MFLD  KAT7,                                                   +        
               LTH=1                                                            
         MFLD  VOLYM7,                                                 +        
               LTH=7                                                            
         MFLD  VIKT7,                                                  +        
               LTH=7                                                            
         MFLD  VARDE7,                                                 +        
               LTH=12                                                           
         MFLD  AST07,                                                  +        
               LTH=1                                                            
         MFLD  TRPID7,                                                 +        
               LTH=5                                                            
         MFLD  AVGID7,                                                 +        
               LTH=7                                                            
         MFLD  VAL8,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDDIST8,                                                +        
               LTH=4                                                            
         MFLD  IDKUND8,                                                +        
               LTH=6                                                            
         MFLD  IDORDE8,                                                +        
               LTH=7                                                            
         MFLD  KDFRAK8,                                                +        
               LTH=2                                                            
         MFLD  KDORDK8,                                                +        
               LTH=1                                                            
         MFLD  KAT8,                                                   +        
               LTH=1                                                            
         MFLD  VOLYM8,                                                 +        
               LTH=7                                                            
         MFLD  VIKT8,                                                  +        
               LTH=7                                                            
         MFLD  VARDE8,                                                 +        
               LTH=12                                                           
         MFLD  AST08,                                                  +        
               LTH=1                                                            
         MFLD  TRPID8,                                                 +        
               LTH=5                                                            
         MFLD  AVGID8,                                                 +        
               LTH=7                                                            
         MFLD  VAL9,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDDIST9,                                                +        
               LTH=4                                                            
         MFLD  IDKUND9,                                                +        
               LTH=6                                                            
         MFLD  IDORDE9,                                                +        
               LTH=7                                                            
         MFLD  KDFRAK9,                                                +        
               LTH=2                                                            
         MFLD  KDORDK9,                                                +        
               LTH=1                                                            
         MFLD  KAT9,                                                   +        
               LTH=1                                                            
         MFLD  VOLYM9,                                                 +        
               LTH=7                                                            
         MFLD  VIKT9,                                                  +        
               LTH=7                                                            
         MFLD  VARDE9,                                                 +        
               LTH=12                                                           
         MFLD  AST09,                                                  +        
               LTH=1                                                            
         MFLD  TRPID9,                                                 +        
               LTH=5                                                            
         MFLD  AVGID9,                                                 +        
               LTH=7                                                            
         MFLD  VAL10,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDDIST10,                                               +        
               LTH=4                                                            
         MFLD  IDKUND10,                                               +        
               LTH=6                                                            
         MFLD  IDORDE10,                                               +        
               LTH=7                                                            
         MFLD  KDFRAK10,                                               +        
               LTH=2                                                            
         MFLD  KDORDK10,                                               +        
               LTH=1                                                            
         MFLD  KAT10,                                                  +        
               LTH=1                                                            
         MFLD  VOLYM10,                                                +        
               LTH=7                                                            
         MFLD  VIKT10,                                                 +        
               LTH=7                                                            
         MFLD  VARDE10,                                                +        
               LTH=12                                                           
         MFLD  AST10,                                                  +        
               LTH=1                                                            
         MFLD  TRPID10,                                                +        
               LTH=5                                                            
         MFLD  AVGID10,                                                +        
               LTH=7                                                            
         MFLD  VAL11,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDDIST11,                                               +        
               LTH=4                                                            
         MFLD  IDKUND11,                                               +        
               LTH=6                                                            
         MFLD  IDORDE11,                                               +        
               LTH=7                                                            
         MFLD  KDFRAK11,                                               +        
               LTH=2                                                            
         MFLD  KDORDK11,                                               +        
               LTH=1                                                            
         MFLD  KAT11,                                                  +        
               LTH=1                                                            
         MFLD  VOLYM11,                                                +        
               LTH=7                                                            
         MFLD  VIKT11,                                                 +        
               LTH=7                                                            
         MFLD  VARDE11,                                                +        
               LTH=12                                                           
         MFLD  AST11,                                                  +        
               LTH=1                                                            
         MFLD  TRPID11,                                                +        
               LTH=5                                                            
         MFLD  AVGID11,                                                +        
               LTH=7                                                            
         MFLD  VAL12,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDDIST12,                                               +        
               LTH=4                                                            
         MFLD  IDKUND12,                                               +        
               LTH=6                                                            
         MFLD  IDORDE12,                                               +        
               LTH=7                                                            
         MFLD  KDFRAK12,                                               +        
               LTH=2                                                            
         MFLD  KDORDK12,                                               +        
               LTH=1                                                            
         MFLD  KAT12,                                                  +        
               LTH=1                                                            
         MFLD  VOLYM12,                                                +        
               LTH=7                                                            
         MFLD  VIKT12,                                                 +        
               LTH=7                                                            
         MFLD  VARDE12,                                                +        
               LTH=12                                                           
         MFLD  AST12,                                                  +        
               LTH=1                                                            
         MFLD  TRPID12,                                                +        
               LTH=5                                                            
         MFLD  AVGID12,                                                +        
               LTH=7                                                            
         MFLD  VAL13,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDDIST13,                                               +        
               LTH=4                                                            
         MFLD  IDKUND13,                                               +        
               LTH=6                                                            
         MFLD  IDORDE13,                                               +        
               LTH=7                                                            
         MFLD  KDFRAK13,                                               +        
               LTH=2                                                            
         MFLD  KDORDK13,                                               +        
               LTH=1                                                            
         MFLD  KAT13,                                                  +        
               LTH=1                                                            
         MFLD  VOLYM13,                                                +        
               LTH=7                                                            
         MFLD  VIKT13,                                                 +        
               LTH=7                                                            
         MFLD  VARDE13,                                                +        
               LTH=12                                                           
         MFLD  AST13,                                                  +        
               LTH=1                                                            
         MFLD  TRPID13,                                                +        
               LTH=5                                                            
         MFLD  AVGID13,                                                +        
               LTH=7                                                            
         MFLD  VAL14,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDDIST14,                                               +        
               LTH=4                                                            
         MFLD  IDKUND14,                                               +        
               LTH=6                                                            
         MFLD  IDORDE14,                                               +        
               LTH=7                                                            
         MFLD  KDFRAK14,                                               +        
               LTH=2                                                            
         MFLD  KDORDK14,                                               +        
               LTH=1                                                            
         MFLD  KAT14,                                                  +        
               LTH=1                                                            
         MFLD  VOLYM14,                                                +        
               LTH=7                                                            
         MFLD  VIKT14,                                                 +        
               LTH=7                                                            
         MFLD  VARDE14,                                                +        
               LTH=12                                                           
         MFLD  AST14,                                                  +        
               LTH=1                                                            
         MFLD  TRPID14,                                                +        
               LTH=5                                                            
         MFLD  AVGID14,                                                +        
               LTH=7                                                            
         MFLD  VAL15,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDDIST15,                                               +        
               LTH=4                                                            
         MFLD  IDKUND15,                                               +        
               LTH=6                                                            
         MFLD  IDORDE15,                                               +        
               LTH=7                                                            
         MFLD  KDFRAK15,                                               +        
               LTH=2                                                            
         MFLD  KDORDK15,                                               +        
               LTH=1                                                            
         MFLD  KAT15,                                                  +        
               LTH=1                                                            
         MFLD  VOLYM15,                                                +        
               LTH=7                                                            
         MFLD  VIKT15,                                                 +        
               LTH=7                                                            
         MFLD  VARDE15,                                                +        
               LTH=12                                                           
         MFLD  AST15,                                                  +        
               LTH=1                                                            
         MFLD  TRPID15,                                                +        
               LTH=5                                                            
         MFLD  AVGID15,                                                +        
               LTH=7                                                            
         MFLD  VAL16,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDDIST16,                                               +        
               LTH=4                                                            
         MFLD  IDKUND16,                                               +        
               LTH=6                                                            
         MFLD  IDORDE16,                                               +        
               LTH=7                                                            
         MFLD  KDFRAK16,                                               +        
               LTH=2                                                            
         MFLD  KDORDK16,                                               +        
               LTH=1                                                            
         MFLD  KAT16,                                                  +        
               LTH=1                                                            
         MFLD  VOLYM16,                                                +        
               LTH=7                                                            
         MFLD  VIKT16,                                                 +        
               LTH=7                                                            
         MFLD  VARDE16,                                                +        
               LTH=12                                                           
         MFLD  AST16,                                                  +        
               LTH=1                                                            
         MFLD  TRPID16,                                                +        
               LTH=5                                                            
         MFLD  AVGID16,                                                +        
               LTH=7                                                            
         MFLD  SUVOLYM,                                                +        
               LTH=8                                                            
         MFLD  SUVIKT,                                                 +        
               LTH=8                                                            
         MFLD  SUVARDE,                                                +        
               LTH=12                                                           
         MFLD  ASTTOT,                                                 +        
               LTH=1                                                            
         MFLD  TIAVG,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TIBPT,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDPRODE,                                                +        
               LTH=7                                                            
         MFLD  IDPRODN,                                                +        
               LTH=7                                                            
         MFLD  IDPLKE,                                                 +        
               LTH=3                                                            
         MFLD  IDPLKN,                                                 +        
               LTH=3                                                            
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
