***********************************************************************         
* CREATED BY R030174   ON 92/02/17  AT 10:25                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'ORDERHUVUD-2                    '                               
W4F214   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T214  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W4F214   DPAGE CURSOR=((2,8)),                                         +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'ORDERHUVUD 2',                                         +        
               POS=(1,12),LTH=12,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         DFLD  'Distr',                                                +        
               POS=(2,2),LTH=5,                                        +        
               ATTR=(ALPHA,PROT)                                                
IDDISTRI DFLD  POS=(2,8),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Kund',                                                 +        
               POS=(2,14),LTH=4,                                       +        
               ATTR=(PROT)                                                      
IDKUNDNI DFLD  POS=(2,19),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Order',                                                +        
               POS=(2,26),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
IDORDNRI DFLD  POS=(2,32),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
IDDISTRU DFLD  POS=(3,8),LTH=4,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
IDKUNDNU DFLD  POS=(3,19),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
IDORDNRU DFLD  POS=(3,32),LTH=5,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  'DC',                                                   +        
               POS=(3,40),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDDCU    DFLD  POS=(3,43),LTH=2,                                       +        
               ATTR=(ALPHA,PROT,MOD)                                            
TEDDI    DFLD  POS=(4,70),LTH=11,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Betansv namn',                                         +        
               POS=(5,2),LTH=12,                                       +        
               ATTR=(PROT)                                                      
BEBETAL1 DFLD  POS=(5,18),LTH=35,                                      +        
               ATTR=(NOPROT,MOD)                                                
BEBETAL2 DFLD  POS=(6,18),LTH=35,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Betansv adress',                                       +        
               POS=(7,2),LTH=14,                                       +        
               ATTR=(PROT)                                                      
ADBETAL1 DFLD  POS=(7,18),LTH=35,                                      +        
               ATTR=(NOPROT,MOD)                                                
ADBETAL2 DFLD  POS=(8,18),LTH=35,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Språk',                                                +        
               POS=(11,2),LTH=5,                                       +        
               ATTR=(PROT)                                                      
IDSKYLT  DFLD  POS=(11,8),LTH=3,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'RFS',                                                  +        
               POS=(13,2),LTH=3,                                       +        
               ATTR=(PROT)                                                      
BEGPACK  DFLD  POS=(13,6),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  'Tid',                                                  +        
               POS=(13,13),LTH=3,                                      +        
               ATTR=(ALPHA,PROT)                                                
TID      DFLD  POS=(13,17),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  'ÖTPO',                                                 +        
               POS=(13,24),LTH=4,                                      +        
               ATTR=(PROT)                                                      
TITPO    DFLD  POS=(13,29),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  'Tullfakt',                                             +        
               POS=(15,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
KDTULLVE DFLD  POS=(15,11),LTH=1,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'VR-DSP-påv',                                           +        
               POS=(17,2),LTH=10,                                      +        
               ATTR=(PROT)                                                      
KDVRINFO DFLD  POS=(17,13),LTH=1,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  '13',                                                   +        
               POS=(21,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '14',                                                   +        
               POS=(21,17),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '15',                                                   +        
               POS=(21,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16',                                                   +        
               POS=(21,49),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,17),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,49),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         DFLD  ' VCP ',POS=(23,58)                                              
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4I21401 MSG   TYPE=INPUT,                                             +        
               SOR=(W4F214),                                           +        
               OPT=2,                                                  +        
               NXT=W4O21401                                                     
MID      LPAGE SOR=(W4F214)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '42141',                                                +        
               LTH=5                                                            
         MFLD  (IDDISTRI,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDKUNDNI,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDORDNRI,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDDISTRU,                                               +        
               LTH=4                                                            
         MFLD  IDKUNDNU,                                               +        
               LTH=6                                                            
         MFLD  IDORDNRU,                                               +        
               LTH=5                                                            
         MFLD  (BEBETAL1,                                              +        
               '+++++++++++++++++++++++++++++++++++'),                 +        
               LTH=35,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (BEBETAL2,                                              +        
               '+++++++++++++++++++++++++++++++++++'),                 +        
               LTH=35,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (ADBETAL1,                                              +        
               '+++++++++++++++++++++++++++++++++++'),                 +        
               LTH=35,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (ADBETAL2,                                              +        
               '+++++++++++++++++++++++++++++++++++'),                 +        
               LTH=35,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDSKYLT,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KDTULLVE,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (KDVRINFO,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
W4O21401 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4F214,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I21401,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W4F214                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDDISTRI,                                               +        
               LTH=4                                                            
         MFLD  IDKUNDNI,                                               +        
               LTH=6                                                            
         MFLD  IDORDNRI,                                               +        
               LTH=5                                                            
         MFLD  IDDISTRU,                                               +        
               LTH=4                                                            
         MFLD  IDKUNDNU,                                               +        
               LTH=6                                                            
         MFLD  IDORDNRU,                                               +        
               LTH=5                                                            
         MFLD  IDDCU,                                                  +        
               LTH=2                                                            
         MFLD  TEDDI,                                                  +        
               LTH=11                                                           
         MFLD  BEBETAL1,                                               +        
               LTH=35                                                           
         MFLD  BEBETAL2,                                               +        
               LTH=35                                                           
         MFLD  ADBETAL1,                                               +        
               LTH=35                                                           
         MFLD  ADBETAL2,                                               +        
               LTH=35                                                           
         MFLD  IDSKYLT,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BEGPACK,                                                +        
               LTH=6                                                            
         MFLD  TID,                                                    +        
               LTH=4                                                            
         MFLD  TITPO,                                                  +        
               LTH=6                                                            
         MFLD  KDTULLVE,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDVRINFO,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
