***********************************************************************         
* CREATED BY V086939   ON 03-04-09  AT 13:49                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'Divergence VOR SC               '                               
W4F226   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W4T226 7',                                           +        
               8='W4T226 8',                                           +        
               9='W4T226 9',                                           +        
               10='WHELP   ',                                          +        
               11='W4T226U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((2,8)),                                         +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'VOR Deviations SC       ',                             +        
               POS=(1,12),LTH=24,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Distr',                                                +        
               POS=(2,2),LTH=5,                                        +        
               ATTR=(NUM,PROT)                                                  
IDDISTR  DFLD  POS=(2,8),LTH=4,                                        +        
               ATTR=(NOPROT)                                                    
         DFLD  'Cust',                                                 +        
               POS=(2,13),LTH=5,                                       +        
               ATTR=(PROT)                                                      
IDKUNDNR DFLD  POS=(2,19),LTH=6,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Part No',                                              +        
               POS=(2,27),LTH=7,                                       +        
               ATTR=(PROT)                                                      
ARTIN    DFLD  POS=(2,35),LTH=9,                                       +        
               ATTR=(NOPROT)                                                    
IDDISTUT DFLD  POS=(3,8),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
IDKUNDUT DFLD  POS=(3,19),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
ARTUT    DFLD  POS=(3,35),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'CMD   Date  M SM Distr   Cust   Order',                +        
               POS=(5,2),LTH=37,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Part No     Qty    Diff Code DC V S D  ',              +        
               POS=(5,42),LTH=39,                                      +        
               ATTR=(PROT)                                                      
CMDIN2   DFLD  POS=(7,2),LTH=3,                                        +        
               ATTR=(NOPROT,MOD)                                                
DATUT2   DFLD  POS=(7,6),LTH=6,                                        +        
               ATTR=(NUM,PROT)                                                  
KODUT2   DFLD  POS=(7,13),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
SKODUT2  DFLD  POS=(7,16),LTH=2,                                       +        
               ATTR=(NOPROT,MOD)                                                
DISTRU2  DFLD  POS=(7,19),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KUNDU2   DFLD  POS=(7,24),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
ORDERU2  DFLD  POS=(7,31),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
ARTNR2   DFLD  POS=(7,40),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
KVANT2   DFLD  POS=(7,50),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
DIFF2    DFLD  POS=(7,58),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
ORDBEK2  DFLD  POS=(7,68),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DC2      DFLD  POS=(7,71),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
VTEXT2   DFLD  POS=(7,74),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
STEXT2   DFLD  POS=(7,76),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
DTEXT2   DFLD  POS=(7,78),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
CMDIN3   DFLD  POS=(8,2),LTH=3,                                        +        
               ATTR=(NOPROT,MOD)                                                
DATUT3   DFLD  POS=(8,6),LTH=6,                                        +        
               ATTR=(NUM,PROT)                                                  
KODUT3   DFLD  POS=(8,13),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
SKODUT3  DFLD  POS=(8,16),LTH=2,                                       +        
               ATTR=(NOPROT,MOD)                                                
DISTRU3  DFLD  POS=(8,19),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KUNDU3   DFLD  POS=(8,24),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
ORDERU3  DFLD  POS=(8,31),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
ARTNR3   DFLD  POS=(8,40),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
KVANT3   DFLD  POS=(8,50),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
DIFF3    DFLD  POS=(8,58),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
ORDBEK3  DFLD  POS=(8,68),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DC3      DFLD  POS=(8,71),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
VTEXT3   DFLD  POS=(8,74),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
STEXT3   DFLD  POS=(8,76),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
DTEXT3   DFLD  POS=(8,78),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
CMDIN4   DFLD  POS=(9,2),LTH=3,                                        +        
               ATTR=(NOPROT,MOD)                                                
DATUT4   DFLD  POS=(9,6),LTH=6,                                        +        
               ATTR=(NUM,PROT)                                                  
KODUT4   DFLD  POS=(9,13),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
SKODUT4  DFLD  POS=(9,16),LTH=2,                                       +        
               ATTR=(NOPROT,MOD)                                                
DISTRU4  DFLD  POS=(9,19),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KUNDU4   DFLD  POS=(9,24),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
ORDERU4  DFLD  POS=(9,31),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
ARTNR4   DFLD  POS=(9,40),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
KVANT4   DFLD  POS=(9,50),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
DIFF4    DFLD  POS=(9,58),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
ORDBEK4  DFLD  POS=(9,68),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DC4      DFLD  POS=(9,71),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
VTEXT4   DFLD  POS=(9,74),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
STEXT4   DFLD  POS=(9,76),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
DTEXT4   DFLD  POS=(9,78),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
CMDIN5   DFLD  POS=(10,2),LTH=3,                                       +        
               ATTR=(NOPROT,MOD)                                                
DATUT5   DFLD  POS=(10,6),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
KODUT5   DFLD  POS=(10,13),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
SKODUT5  DFLD  POS=(10,16),LTH=2,                                      +        
               ATTR=(NOPROT,MOD)                                                
DISTRU5  DFLD  POS=(10,19),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KUNDU5   DFLD  POS=(10,24),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ORDERU5  DFLD  POS=(10,31),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ARTNR5   DFLD  POS=(10,40),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
KVANT5   DFLD  POS=(10,50),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DIFF5    DFLD  POS=(10,58),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
ORDBEK5  DFLD  POS=(10,68),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DC5      DFLD  POS=(10,71),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
VTEXT5   DFLD  POS=(10,74),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
STEXT5   DFLD  POS=(10,76),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
DTEXT5   DFLD  POS=(10,78),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
CMDIN6   DFLD  POS=(11,2),LTH=3,                                       +        
               ATTR=(NOPROT,MOD)                                                
DATUT6   DFLD  POS=(11,6),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
KODUT6   DFLD  POS=(11,13),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
SKODUT6  DFLD  POS=(11,16),LTH=2,                                      +        
               ATTR=(NOPROT,MOD)                                                
DISTRU6  DFLD  POS=(11,19),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KUNDU6   DFLD  POS=(11,24),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ORDERU6  DFLD  POS=(11,31),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ARTNR6   DFLD  POS=(11,40),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
KVANT6   DFLD  POS=(11,50),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DIFF6    DFLD  POS=(11,58),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
ORDBEK6  DFLD  POS=(11,68),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DC6      DFLD  POS=(11,71),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
VTEXT6   DFLD  POS=(11,74),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
STEXT6   DFLD  POS=(11,76),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
DTEXT6   DFLD  POS=(11,78),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
CMDIN7   DFLD  POS=(12,2),LTH=3,                                       +        
               ATTR=(NOPROT,MOD)                                                
DATUT7   DFLD  POS=(12,6),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
KODUT7   DFLD  POS=(12,13),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
SKODUT7  DFLD  POS=(12,16),LTH=2,                                      +        
               ATTR=(NOPROT,MOD)                                                
DISTRU7  DFLD  POS=(12,19),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KUNDU7   DFLD  POS=(12,24),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ORDERU7  DFLD  POS=(12,31),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ARTNR7   DFLD  POS=(12,40),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
KVANT7   DFLD  POS=(12,50),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DIFF7    DFLD  POS=(12,58),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
ORDBEK7  DFLD  POS=(12,68),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DC7      DFLD  POS=(12,71),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
VTEXT7   DFLD  POS=(12,74),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
STEXT7   DFLD  POS=(12,76),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
DTEXT7   DFLD  POS=(12,78),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
CMDIN8   DFLD  POS=(13,2),LTH=3,                                       +        
               ATTR=(NOPROT,MOD)                                                
DATUT8   DFLD  POS=(13,6),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
KODUT8   DFLD  POS=(13,13),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
SKODUT8  DFLD  POS=(13,16),LTH=2,                                      +        
               ATTR=(NOPROT,MOD)                                                
DISTRU8  DFLD  POS=(13,19),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KUNDU8   DFLD  POS=(13,24),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ORDERU8  DFLD  POS=(13,31),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ARTNR8   DFLD  POS=(13,40),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
KVANT8   DFLD  POS=(13,50),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DIFF8    DFLD  POS=(13,58),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
ORDBEK8  DFLD  POS=(13,68),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DC8      DFLD  POS=(13,71),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
VTEXT8   DFLD  POS=(13,74),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
STEXT8   DFLD  POS=(13,76),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
DTEXT8   DFLD  POS=(13,78),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
CMDIN9   DFLD  POS=(14,2),LTH=3,                                       +        
               ATTR=(NOPROT,MOD)                                                
DATUT9   DFLD  POS=(14,6),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
KODUT9   DFLD  POS=(14,13),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
SKODUT9  DFLD  POS=(14,16),LTH=2,                                      +        
               ATTR=(NOPROT,MOD)                                                
DISTRU9  DFLD  POS=(14,19),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KUNDU9   DFLD  POS=(14,24),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ORDERU9  DFLD  POS=(14,31),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ARTNR9   DFLD  POS=(14,40),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
KVANT9   DFLD  POS=(14,50),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DIFF9    DFLD  POS=(14,58),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
ORDBEK9  DFLD  POS=(14,68),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DC9      DFLD  POS=(14,71),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
VTEXT9   DFLD  POS=(14,74),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
STEXT9   DFLD  POS=(14,76),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
DTEXT9   DFLD  POS=(14,78),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
CMDIN10  DFLD  POS=(15,2),LTH=3,                                       +        
               ATTR=(NOPROT,MOD)                                                
DATUT10  DFLD  POS=(15,6),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
KODUT10  DFLD  POS=(15,13),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
SKODUT10 DFLD  POS=(15,16),LTH=2,                                      +        
               ATTR=(NOPROT,MOD)                                                
DISTRU10 DFLD  POS=(15,19),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KUNDU10  DFLD  POS=(15,24),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ORDERU10 DFLD  POS=(15,31),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ARTNR10  DFLD  POS=(15,40),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
KVANT10  DFLD  POS=(15,50),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DIFF10   DFLD  POS=(15,58),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
ORDBEK10 DFLD  POS=(15,68),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DC10     DFLD  POS=(15,71),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
VTEXT10  DFLD  POS=(15,74),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
STEXT10  DFLD  POS=(15,76),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
DTEXT10  DFLD  POS=(15,78),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
CMDIN11  DFLD  POS=(16,2),LTH=3,                                       +        
               ATTR=(NOPROT,MOD)                                                
DATUT11  DFLD  POS=(16,6),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
KODUT11  DFLD  POS=(16,13),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
SKODUT11 DFLD  POS=(16,16),LTH=2,                                      +        
               ATTR=(NOPROT,MOD)                                                
DISTRU11 DFLD  POS=(16,19),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KUNDU11  DFLD  POS=(16,24),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ORDERU11 DFLD  POS=(16,31),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ARTNR11  DFLD  POS=(16,40),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
KVANT11  DFLD  POS=(16,50),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DIFF11   DFLD  POS=(16,58),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
ORDBEK11 DFLD  POS=(16,68),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DC11     DFLD  POS=(16,71),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
VTEXT11  DFLD  POS=(16,74),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
STEXT11  DFLD  POS=(16,76),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
DTEXT11  DFLD  POS=(16,78),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
CMDIN12  DFLD  POS=(17,2),LTH=3,                                       +        
               ATTR=(NOPROT,MOD)                                                
DATUT12  DFLD  POS=(17,6),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
KODUT12  DFLD  POS=(17,13),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
SKODUT12 DFLD  POS=(17,16),LTH=2,                                      +        
               ATTR=(NOPROT,MOD)                                                
DISTRU12 DFLD  POS=(17,19),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KUNDU12  DFLD  POS=(17,24),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ORDERU12 DFLD  POS=(17,31),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ARTNR12  DFLD  POS=(17,40),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
KVANT12  DFLD  POS=(17,50),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DIFF12   DFLD  POS=(17,58),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
ORDBEK12 DFLD  POS=(17,68),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DC12     DFLD  POS=(17,71),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
VTEXT12  DFLD  POS=(17,74),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
STEXT12  DFLD  POS=(17,76),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
DTEXT12  DFLD  POS=(17,78),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
CMDIN13  DFLD  POS=(18,2),LTH=3,                                       +        
               ATTR=(NOPROT,MOD)                                                
DATUT13  DFLD  POS=(18,6),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
KODUT13  DFLD  POS=(18,13),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
SKODUT13 DFLD  POS=(18,16),LTH=2,                                      +        
               ATTR=(NOPROT,MOD)                                                
DISTRU13 DFLD  POS=(18,19),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KUNDU13  DFLD  POS=(18,24),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ORDERU13 DFLD  POS=(18,31),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ARTNR13  DFLD  POS=(18,40),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
KVANT13  DFLD  POS=(18,50),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DIFF13   DFLD  POS=(18,58),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
ORDBEK13 DFLD  POS=(18,68),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DC13     DFLD  POS=(18,71),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
VTEXT13  DFLD  POS=(18,74),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
STEXT13  DFLD  POS=(18,76),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
DTEXT13  DFLD  POS=(18,78),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
CMDIN14  DFLD  POS=(19,2),LTH=3,                                       +        
               ATTR=(NOPROT,MOD)                                                
DATUT14  DFLD  POS=(19,6),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
KODUT14  DFLD  POS=(19,13),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
SKODUT14 DFLD  POS=(19,16),LTH=2,                                      +        
               ATTR=(NOPROT,MOD)                                                
DISTRU14 DFLD  POS=(19,19),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KUNDU14  DFLD  POS=(19,24),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ORDERU14 DFLD  POS=(19,31),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ARTNR14  DFLD  POS=(19,40),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
KVANT14  DFLD  POS=(19,50),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DIFF14   DFLD  POS=(19,58),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
ORDBEK14 DFLD  POS=(19,68),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DC14     DFLD  POS=(19,71),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
VTEXT14  DFLD  POS=(19,74),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
STEXT14  DFLD  POS=(19,76),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
DTEXT14  DFLD  POS=(19,78),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
CMDIN15  DFLD  POS=(20,2),LTH=3,                                       +        
               ATTR=(NOPROT,MOD)                                                
DATUT15  DFLD  POS=(20,6),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
KODUT15  DFLD  POS=(20,13),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
SKODUT15 DFLD  POS=(20,16),LTH=2,                                      +        
               ATTR=(NOPROT,MOD)                                                
DISTRU15 DFLD  POS=(20,19),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KUNDU15  DFLD  POS=(20,24),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ORDERU15 DFLD  POS=(20,31),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ARTNR15  DFLD  POS=(20,40),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
KVANT15  DFLD  POS=(20,50),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DIFF15   DFLD  POS=(20,58),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
ORDBEK15 DFLD  POS=(20,68),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DC16     DFLD  POS=(20,71),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
VTEXT16  DFLD  POS=(20,74),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
STEXT16  DFLD  POS=(20,76),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
DTEXT16  DFLD  POS=(20,78),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'F7=First  F8=Next  F9=JUMP TO 4276  Ff10=WHELP   ',    +        
               POS=(22,2),LTH=49,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,MOD)                                                  
         FMTEND                                                                 
W4I22601 MSG   TYPE=INPUT,                                             +        
               SOR=(W4F226),                                           +        
               OPT=2,                                                  +        
               NXT=W4O22601                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  (IDTRANS1,                                              +        
               '4'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  (IDTRANS2,                                              +        
               '2'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  (IDTRANS3,                                              +        
               '2'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  (IDTRANS4,                                              +        
               '6'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '42261',                                                +        
               LTH=5                                                            
         MFLD  (IDDISTR,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDDISTUT,                                              +        
               '    '),                                                +        
               LTH=4,                                                  +        
               FILL=X'40'                                                       
         MFLD  (IDKUNDNR,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDKUNDUT,                                              +        
               '     '),                                               +        
               LTH=6,                                                  +        
               FILL=X'40'                                                       
         MFLD  (ARTIN,                                                 +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTUT,                                                 +        
               '         '),                                           +        
               LTH=9,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMDIN2,                                                +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMDIN3,                                                +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMDIN4,                                                +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMDIN5,                                                +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMDIN6,                                                +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMDIN7,                                                +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMDIN8,                                                +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMDIN9,                                                +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMDIN10,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMDIN11,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMDIN12,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMDIN13,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMDIN14,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMDIN15,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (SKODUT2,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (SKODUT3,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (SKODUT4,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (SKODUT5,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (SKODUT6,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (SKODUT7,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (SKODUT8,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (SKODUT9,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (SKODUT10,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (SKODUT11,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (SKODUT12,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (SKODUT13,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (SKODUT14,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (SKODUT15,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  DISTRU2,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  KUNDU2,                                                 +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  ORDERU2,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  ARTNR2,                                                 +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  DISTRU3,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  KUNDU3,                                                 +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  ORDERU3,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  ARTNR3,                                                 +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  DISTRU4,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  KUNDU4,                                                 +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  ORDERU4,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  ARTNR4,                                                 +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  DISTRU5,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  KUNDU5,                                                 +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  ORDERU5,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  ARTNR5,                                                 +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  DISTRU6,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  KUNDU6,                                                 +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  ORDERU6,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  ARTNR6,                                                 +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  DISTRU7,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  KUNDU7,                                                 +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  ORDERU7,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  ARTNR7,                                                 +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  DISTRU8,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  KUNDU8,                                                 +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  ORDERU8,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  ARTNR8,                                                 +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  DISTRU9,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  KUNDU9,                                                 +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  ORDERU9,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  ARTNR9,                                                 +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  DISTRU10,                                               +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  KUNDU10,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  ORDERU10,                                               +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  ARTNR10,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  DISTRU11,                                               +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  KUNDU11,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  ORDERU11,                                               +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  ARTNR11,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  DISTRU12,                                               +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  KUNDU12,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  ORDERU12,                                               +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  ARTNR12,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  DISTRU13,                                               +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  KUNDU13,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  ORDERU13,                                               +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  ARTNR13,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  DISTRU14,                                               +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  KUNDU14,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  ORDERU14,                                               +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  ARTNR14,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  DISTRU15,                                               +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  KUNDU15,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  ORDERU15,                                               +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  ARTNR15,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
W4O22601 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4F226,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I22601,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDDISTR,                                                +        
               LTH=4                                                            
         MFLD  IDDISTUT,                                               +        
               LTH=4                                                            
         MFLD  IDKUNDNR,                                               +        
               LTH=6                                                            
         MFLD  IDKUNDUT,                                               +        
               LTH=6                                                            
         MFLD  ARTIN,                                                  +        
               LTH=9                                                            
         MFLD  ARTUT,                                                  +        
               LTH=9                                                            
         MFLD  CMDIN2,                                                 +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DATUT2,                                                 +        
               LTH=6                                                            
         MFLD  KODUT2,                                                 +        
               LTH=2                                                            
         MFLD  SKODUT2,                                                +        
               LTH=2                                                            
         MFLD  DISTRU2,                                                +        
               LTH=4                                                            
         MFLD  KUNDU2,                                                 +        
               LTH=6                                                            
         MFLD  ORDERU2,                                                +        
               LTH=7                                                            
         MFLD  ARTNR2,                                                 +        
               LTH=9                                                            
         MFLD  KVANT2,                                                 +        
               LTH=7                                                            
         MFLD  DIFF2,                                                  +        
               LTH=7                                                            
         MFLD  ORDBEK2,                                                +        
               LTH=2                                                            
         MFLD  DC2,                                                    +        
               LTH=2                                                            
         MFLD  VTEXT2,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  STEXT2,                                                 +        
               LTH=1                                                            
         MFLD  DTEXT2,                                                 +        
               LTH=1                                                            
         MFLD  CMDIN3,                                                 +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DATUT3,                                                 +        
               LTH=6                                                            
         MFLD  KODUT3,                                                 +        
               LTH=2                                                            
         MFLD  SKODUT3,                                                +        
               LTH=2                                                            
         MFLD  DISTRU3,                                                +        
               LTH=4                                                            
         MFLD  KUNDU3,                                                 +        
               LTH=6                                                            
         MFLD  ORDERU3,                                                +        
               LTH=7                                                            
         MFLD  ARTNR3,                                                 +        
               LTH=9                                                            
         MFLD  KVANT3,                                                 +        
               LTH=7                                                            
         MFLD  DIFF3,                                                  +        
               LTH=7                                                            
         MFLD  ORDBEK3,                                                +        
               LTH=2                                                            
         MFLD  DC3,                                                    +        
               LTH=2                                                            
         MFLD  VTEXT3,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  STEXT3,                                                 +        
               LTH=1                                                            
         MFLD  DTEXT3,                                                 +        
               LTH=1                                                            
         MFLD  CMDIN4,                                                 +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DATUT4,                                                 +        
               LTH=6                                                            
         MFLD  KODUT4,                                                 +        
               LTH=2                                                            
         MFLD  SKODUT4,                                                +        
               LTH=2                                                            
         MFLD  DISTRU4,                                                +        
               LTH=4                                                            
         MFLD  KUNDU4,                                                 +        
               LTH=6                                                            
         MFLD  ORDERU4,                                                +        
               LTH=7                                                            
         MFLD  ARTNR4,                                                 +        
               LTH=9                                                            
         MFLD  KVANT4,                                                 +        
               LTH=7                                                            
         MFLD  DIFF4,                                                  +        
               LTH=7                                                            
         MFLD  ORDBEK4,                                                +        
               LTH=2                                                            
         MFLD  DC4,                                                    +        
               LTH=2                                                            
         MFLD  VTEXT4,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  STEXT4,                                                 +        
               LTH=1                                                            
         MFLD  DTEXT4,                                                 +        
               LTH=1                                                            
         MFLD  CMDIN5,                                                 +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DATUT5,                                                 +        
               LTH=6                                                            
         MFLD  KODUT5,                                                 +        
               LTH=2                                                            
         MFLD  SKODUT5,                                                +        
               LTH=2                                                            
         MFLD  DISTRU5,                                                +        
               LTH=4                                                            
         MFLD  KUNDU5,                                                 +        
               LTH=6                                                            
         MFLD  ORDERU5,                                                +        
               LTH=7                                                            
         MFLD  ARTNR5,                                                 +        
               LTH=9                                                            
         MFLD  KVANT5,                                                 +        
               LTH=7                                                            
         MFLD  DIFF5,                                                  +        
               LTH=7                                                            
         MFLD  ORDBEK5,                                                +        
               LTH=2                                                            
         MFLD  DC5,                                                    +        
               LTH=2                                                            
         MFLD  VTEXT5,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  STEXT5,                                                 +        
               LTH=1                                                            
         MFLD  DTEXT5,                                                 +        
               LTH=1                                                            
         MFLD  CMDIN6,                                                 +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DATUT6,                                                 +        
               LTH=6                                                            
         MFLD  KODUT6,                                                 +        
               LTH=2                                                            
         MFLD  SKODUT6,                                                +        
               LTH=2                                                            
         MFLD  DISTRU6,                                                +        
               LTH=4                                                            
         MFLD  KUNDU6,                                                 +        
               LTH=6                                                            
         MFLD  ORDERU6,                                                +        
               LTH=7                                                            
         MFLD  ARTNR6,                                                 +        
               LTH=9                                                            
         MFLD  KVANT6,                                                 +        
               LTH=7                                                            
         MFLD  DIFF6,                                                  +        
               LTH=7                                                            
         MFLD  ORDBEK6,                                                +        
               LTH=2                                                            
         MFLD  DC6,                                                    +        
               LTH=2                                                            
         MFLD  VTEXT6,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  STEXT6,                                                 +        
               LTH=1                                                            
         MFLD  DTEXT6,                                                 +        
               LTH=1                                                            
         MFLD  CMDIN7,                                                 +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DATUT7,                                                 +        
               LTH=6                                                            
         MFLD  KODUT7,                                                 +        
               LTH=2                                                            
         MFLD  SKODUT7,                                                +        
               LTH=2                                                            
         MFLD  DISTRU7,                                                +        
               LTH=4                                                            
         MFLD  KUNDU7,                                                 +        
               LTH=6                                                            
         MFLD  ORDERU7,                                                +        
               LTH=7                                                            
         MFLD  ARTNR7,                                                 +        
               LTH=9                                                            
         MFLD  KVANT7,                                                 +        
               LTH=7                                                            
         MFLD  DIFF7,                                                  +        
               LTH=7                                                            
         MFLD  ORDBEK7,                                                +        
               LTH=2                                                            
         MFLD  DC7,                                                    +        
               LTH=2                                                            
         MFLD  VTEXT7,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  STEXT7,                                                 +        
               LTH=1                                                            
         MFLD  DTEXT7,                                                 +        
               LTH=1                                                            
         MFLD  CMDIN8,                                                 +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DATUT8,                                                 +        
               LTH=6                                                            
         MFLD  KODUT8,                                                 +        
               LTH=2                                                            
         MFLD  SKODUT8,                                                +        
               LTH=2                                                            
         MFLD  DISTRU8,                                                +        
               LTH=4                                                            
         MFLD  KUNDU8,                                                 +        
               LTH=6                                                            
         MFLD  ORDERU8,                                                +        
               LTH=7                                                            
         MFLD  ARTNR8,                                                 +        
               LTH=9                                                            
         MFLD  KVANT8,                                                 +        
               LTH=7                                                            
         MFLD  DIFF8,                                                  +        
               LTH=7                                                            
         MFLD  ORDBEK8,                                                +        
               LTH=2                                                            
         MFLD  DC8,                                                    +        
               LTH=2                                                            
         MFLD  VTEXT8,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  STEXT8,                                                 +        
               LTH=1                                                            
         MFLD  DTEXT8,                                                 +        
               LTH=1                                                            
         MFLD  CMDIN9,                                                 +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DATUT9,                                                 +        
               LTH=6                                                            
         MFLD  KODUT9,                                                 +        
               LTH=2                                                            
         MFLD  SKODUT9,                                                +        
               LTH=2                                                            
         MFLD  DISTRU9,                                                +        
               LTH=4                                                            
         MFLD  KUNDU9,                                                 +        
               LTH=6                                                            
         MFLD  ORDERU9,                                                +        
               LTH=7                                                            
         MFLD  ARTNR9,                                                 +        
               LTH=9                                                            
         MFLD  KVANT9,                                                 +        
               LTH=7                                                            
         MFLD  DIFF9,                                                  +        
               LTH=7                                                            
         MFLD  ORDBEK9,                                                +        
               LTH=2                                                            
         MFLD  DC9,                                                    +        
               LTH=2                                                            
         MFLD  VTEXT9,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  STEXT9,                                                 +        
               LTH=1                                                            
         MFLD  DTEXT9,                                                 +        
               LTH=1                                                            
         MFLD  CMDIN10,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DATUT10,                                                +        
               LTH=6                                                            
         MFLD  KODUT10,                                                +        
               LTH=2                                                            
         MFLD  SKODUT10,                                               +        
               LTH=2                                                            
         MFLD  DISTRU10,                                               +        
               LTH=4                                                            
         MFLD  KUNDU10,                                                +        
               LTH=6                                                            
         MFLD  ORDERU10,                                               +        
               LTH=7                                                            
         MFLD  ARTNR10,                                                +        
               LTH=9                                                            
         MFLD  KVANT10,                                                +        
               LTH=7                                                            
         MFLD  DIFF10,                                                 +        
               LTH=7                                                            
         MFLD  ORDBEK10,                                               +        
               LTH=2                                                            
         MFLD  DC10,                                                   +        
               LTH=2                                                            
         MFLD  VTEXT10,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  STEXT10,                                                +        
               LTH=1                                                            
         MFLD  DTEXT10,                                                +        
               LTH=1                                                            
         MFLD  CMDIN11,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DATUT11,                                                +        
               LTH=6                                                            
         MFLD  KODUT11,                                                +        
               LTH=2                                                            
         MFLD  SKODUT11,                                               +        
               LTH=2                                                            
         MFLD  DISTRU11,                                               +        
               LTH=4                                                            
         MFLD  KUNDU11,                                                +        
               LTH=6                                                            
         MFLD  ORDERU11,                                               +        
               LTH=7                                                            
         MFLD  ARTNR11,                                                +        
               LTH=9                                                            
         MFLD  KVANT11,                                                +        
               LTH=7                                                            
         MFLD  DIFF11,                                                 +        
               LTH=7                                                            
         MFLD  ORDBEK11,                                               +        
               LTH=2                                                            
         MFLD  DC11,                                                   +        
               LTH=2                                                            
         MFLD  VTEXT11,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  STEXT11,                                                +        
               LTH=1                                                            
         MFLD  DTEXT11,                                                +        
               LTH=1                                                            
         MFLD  CMDIN12,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DATUT12,                                                +        
               LTH=6                                                            
         MFLD  KODUT12,                                                +        
               LTH=2                                                            
         MFLD  SKODUT12,                                               +        
               LTH=2                                                            
         MFLD  DISTRU12,                                               +        
               LTH=4                                                            
         MFLD  KUNDU12,                                                +        
               LTH=6                                                            
         MFLD  ORDERU12,                                               +        
               LTH=7                                                            
         MFLD  ARTNR12,                                                +        
               LTH=9                                                            
         MFLD  KVANT12,                                                +        
               LTH=7                                                            
         MFLD  DIFF12,                                                 +        
               LTH=7                                                            
         MFLD  ORDBEK12,                                               +        
               LTH=2                                                            
         MFLD  DC12,                                                   +        
               LTH=2                                                            
         MFLD  VTEXT12,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  STEXT12,                                                +        
               LTH=1                                                            
         MFLD  DTEXT12,                                                +        
               LTH=1                                                            
         MFLD  CMDIN13,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DATUT13,                                                +        
               LTH=6                                                            
         MFLD  KODUT13,                                                +        
               LTH=2                                                            
         MFLD  SKODUT13,                                               +        
               LTH=2                                                            
         MFLD  DISTRU13,                                               +        
               LTH=4                                                            
         MFLD  KUNDU13,                                                +        
               LTH=6                                                            
         MFLD  ORDERU13,                                               +        
               LTH=7                                                            
         MFLD  ARTNR13,                                                +        
               LTH=9                                                            
         MFLD  KVANT13,                                                +        
               LTH=7                                                            
         MFLD  DIFF13,                                                 +        
               LTH=7                                                            
         MFLD  ORDBEK13,                                               +        
               LTH=2                                                            
         MFLD  DC13,                                                   +        
               LTH=2                                                            
         MFLD  VTEXT13,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  STEXT13,                                                +        
               LTH=1                                                            
         MFLD  DTEXT13,                                                +        
               LTH=1                                                            
         MFLD  CMDIN14,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DATUT14,                                                +        
               LTH=6                                                            
         MFLD  KODUT14,                                                +        
               LTH=2                                                            
         MFLD  SKODUT14,                                               +        
               LTH=2                                                            
         MFLD  DISTRU14,                                               +        
               LTH=4                                                            
         MFLD  KUNDU14,                                                +        
               LTH=6                                                            
         MFLD  ORDERU14,                                               +        
               LTH=7                                                            
         MFLD  ARTNR14,                                                +        
               LTH=9                                                            
         MFLD  KVANT14,                                                +        
               LTH=7                                                            
         MFLD  DIFF14,                                                 +        
               LTH=7                                                            
         MFLD  ORDBEK14,                                               +        
               LTH=2                                                            
         MFLD  DC14,                                                   +        
               LTH=2                                                            
         MFLD  VTEXT14,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  STEXT14,                                                +        
               LTH=1                                                            
         MFLD  DTEXT14,                                                +        
               LTH=1                                                            
         MFLD  CMDIN15,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DATUT15,                                                +        
               LTH=6                                                            
         MFLD  KODUT15,                                                +        
               LTH=2                                                            
         MFLD  SKODUT15,                                               +        
               LTH=2                                                            
         MFLD  DISTRU15,                                               +        
               LTH=4                                                            
         MFLD  KUNDU15,                                                +        
               LTH=6                                                            
         MFLD  ORDERU15,                                               +        
               LTH=7                                                            
         MFLD  ARTNR15,                                                +        
               LTH=9                                                            
         MFLD  KVANT15,                                                +        
               LTH=7                                                            
         MFLD  DIFF15,                                                 +        
               LTH=7                                                            
         MFLD  ORDBEK15,                                               +        
               LTH=2                                                            
         MFLD  DC16,                                                   +        
               LTH=2                                                            
         MFLD  VTEXT16,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  STEXT16,                                                +        
               LTH=1                                                            
         MFLD  DTEXT16,                                                +        
               LTH=1                                                            
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
