***********************************************************************         
* CREATED BY PCC4448   ON 95/02/23  AT 11:11                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'ORDER ANNULLATION/ÄNDRING       '                               
W4F245   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W4T245 7',                                           +        
               8='W4T245 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T245U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W4T245  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W4T245V ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((2,8)),                                         +        
               FILL=PT                                                          
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Annullation orderrader extern',                        +        
               POS=(1,11),LTH=29,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Distr',                                                +        
               POS=(2,2),LTH=5,                                        +        
               ATTR=(ALPHA,PROT)                                                
IDDISTRI DFLD  POS=(2,8),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Kund',                                                 +        
               POS=(2,13),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
IDKUNDNI DFLD  POS=(2,18),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Order',                                                +        
               POS=(2,25),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
IDORDNRI DFLD  POS=(2,31),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DC',                                                   +        
               POS=(2,39),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
IDDCI    DFLD  POS=(2,42),LTH=2,                                       +        
               ATTR=(ALPHA,NOPROT)                                              
         DFLD  'Artnr',                                                +        
               POS=(2,45),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
IDARTNRI DFLD  POS=(2,51),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
IDDISTRU DFLD  POS=(3,8),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
IDKUNDNU DFLD  POS=(3,18),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
IDORDNRU DFLD  POS=(3,31),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
IDDCU    DFLD  POS=(3,42),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
IDARTNRU DFLD  POS=(3,51),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
IDORDERE DFLD  POS=(4,2),LTH=7,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
IDORDERN DFLD  POS=(4,10),LTH=7,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
IDDCE    DFLD  POS=(4,18),LTH=2,                                       +        
               ATTR=(ALPHA,PROT,NODISP,MOD)                                     
IDDCN    DFLD  POS=(4,21),LTH=2,                                       +        
               ATTR=(ALPHA,PROT,NODISP,MOD)                                     
ADLAGOME DFLD  POS=(4,24),LTH=3,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
ADLAGOMN DFLD  POS=(4,28),LTH=3,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
ADGANGE  DFLD  POS=(4,32),LTH=3,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
ADGANGN  DFLD  POS=(4,36),LTH=3,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
ADPLATSE DFLD  POS=(4,40),LTH=5,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
ADPLATSN DFLD  POS=(4,46),LTH=5,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
IDARTNRE DFLD  POS=(4,52),LTH=9,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
IDARTNRN DFLD  POS=(4,62),LTH=9,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
IDLOPNRE DFLD  POS=(4,72),LTH=3,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
IDLOPNRN DFLD  POS=(4,76),LTH=3,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
         DFLD  'Annullation hel order',                                +        
               POS=(5,2),LTH=21,                                       +        
               ATTR=(PROT)                                                      
FLJANEJ  DFLD  POS=(5,24),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Totalt radant',                                        +        
               POS=(5,28),LTH=13,                                      +        
               ATTR=(PROT)                                                      
KVRADER  DFLD  POS=(5,42),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Möjliga rader annullation',                            +        
               POS=(5,49),LTH=25,                                      +        
               ATTR=(PROT)                                                      
KV       DFLD  POS=(5,75),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DGIA0060 DFLD  POS=(6,2),LTH=3,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0061 DFLD  POS=(6,6),LTH=3,                                        +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0062 DFLD  POS=(6,10),LTH=3,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0063 DFLD  POS=(6,14),LTH=3,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0064 DFLD  POS=(6,18),LTH=3,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0065 DFLD  POS=(6,22),LTH=3,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0054 DFLD  POS=(6,26),LTH=3,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0055 DFLD  POS=(6,30),LTH=3,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0056 DFLD  POS=(6,34),LTH=3,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0057 DFLD  POS=(6,38),LTH=3,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0058 DFLD  POS=(6,42),LTH=3,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0059 DFLD  POS=(6,46),LTH=3,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
IDPRODE  DFLD  POS=(6,50),LTH=7,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
IDPRODN  DFLD  POS=(6,58),LTH=7,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
IDPLKE   DFLD  POS=(6,66),LTH=3,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
IDPLKN   DFLD  POS=(6,70),LTH=3,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
         DFLD  'CMD',                                                  +        
               POS=(7,2),LTH=3,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'Artnr   Antal Benämning',                              +        
               POS=(7,10),LTH=23,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Oref  DC',                                             +        
               POS=(7,53),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DGIA0030 DFLD  POS=(8,4),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
DGIA0024 DFLD  POS=(8,6),LTH=9,                                        +        
               ATTR=(NUM,PROT)                                                  
DGIA0036 DFLD  POS=(8,16),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0006 DFLD  POS=(8,24),LTH=25,                                      +        
               ATTR=(PROT)                                                      
DGIA0048 DFLD  POS=(8,50),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0018 DFLD  POS=(8,59),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDPROD1  DFLD  POS=(8,62),LTH=7,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
IDPLK1   DFLD  POS=(8,70),LTH=3,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0042 DFLD  POS=(8,74),LTH=3,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0012 DFLD  POS=(9,16),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
IDPROD2  DFLD  POS=(9,62),LTH=7,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
IDPLK2   DFLD  POS=(9,70),LTH=3,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0043 DFLD  POS=(9,74),LTH=3,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0031 DFLD  POS=(10,4),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0025 DFLD  POS=(10,6),LTH=9,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0037 DFLD  POS=(10,16),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0007 DFLD  POS=(10,24),LTH=25,                                     +        
               ATTR=(PROT)                                                      
DGIA0049 DFLD  POS=(10,50),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0019 DFLD  POS=(10,59),LTH=2,                                      +        
               ATTR=(PROT)                                                      
IDPROD3  DFLD  POS=(10,62),LTH=7,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
IDPLK3   DFLD  POS=(10,70),LTH=3,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0044 DFLD  POS=(10,74),LTH=3,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0013 DFLD  POS=(11,16),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
IDPROD4  DFLD  POS=(11,62),LTH=7,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
IDPLK4   DFLD  POS=(11,70),LTH=3,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0045 DFLD  POS=(11,74),LTH=3,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0032 DFLD  POS=(12,4),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0026 DFLD  POS=(12,6),LTH=9,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0038 DFLD  POS=(12,16),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0008 DFLD  POS=(12,24),LTH=25,                                     +        
               ATTR=(PROT)                                                      
DGIA0050 DFLD  POS=(12,50),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0020 DFLD  POS=(12,59),LTH=2,                                      +        
               ATTR=(PROT)                                                      
IDPROD5  DFLD  POS=(12,62),LTH=7,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
IDPLK5   DFLD  POS=(12,70),LTH=3,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0046 DFLD  POS=(12,74),LTH=3,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0014 DFLD  POS=(13,16),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
IDPROD6  DFLD  POS=(13,62),LTH=7,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
IDPLK6   DFLD  POS=(13,70),LTH=3,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0047 DFLD  POS=(13,74),LTH=3,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0033 DFLD  POS=(14,4),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0027 DFLD  POS=(14,6),LTH=9,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0039 DFLD  POS=(14,16),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0009 DFLD  POS=(14,24),LTH=25,                                     +        
               ATTR=(PROT)                                                      
DGIA0051 DFLD  POS=(14,50),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0021 DFLD  POS=(14,59),LTH=2,                                      +        
               ATTR=(PROT)                                                      
IDPU1    DFLD  POS=(14,68),LTH=5,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0000 DFLD  POS=(14,74),LTH=5,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0015 DFLD  POS=(15,16),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
IDPU2    DFLD  POS=(15,68),LTH=5,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0001 DFLD  POS=(15,74),LTH=5,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0034 DFLD  POS=(16,4),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0028 DFLD  POS=(16,6),LTH=9,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0040 DFLD  POS=(16,16),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0010 DFLD  POS=(16,24),LTH=25,                                     +        
               ATTR=(PROT)                                                      
DGIA0052 DFLD  POS=(16,50),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0022 DFLD  POS=(16,59),LTH=2,                                      +        
               ATTR=(PROT)                                                      
IDPU3    DFLD  POS=(16,68),LTH=5,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0002 DFLD  POS=(16,74),LTH=5,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0016 DFLD  POS=(17,16),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
IDPU4    DFLD  POS=(17,68),LTH=5,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0003 DFLD  POS=(17,74),LTH=5,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0035 DFLD  POS=(18,4),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0029 DFLD  POS=(18,6),LTH=9,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0041 DFLD  POS=(18,16),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0011 DFLD  POS=(18,24),LTH=25,                                     +        
               ATTR=(PROT)                                                      
DGIA0053 DFLD  POS=(18,50),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0023 DFLD  POS=(18,59),LTH=2,                                      +        
               ATTR=(PROT)                                                      
IDPU5    DFLD  POS=(18,68),LTH=5,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0004 DFLD  POS=(18,74),LTH=5,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0017 DFLD  POS=(19,16),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
IDPU6    DFLD  POS=(19,68),LTH=5,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0005 DFLD  POS=(19,74),LTH=5,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0066 DFLD  POS=(20,2),LTH=9,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0067 DFLD  POS=(20,12),LTH=9,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0068 DFLD  POS=(20,22),LTH=9,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0069 DFLD  POS=(20,32),LTH=9,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0070 DFLD  POS=(20,42),LTH=9,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0071 DFLD  POS=(20,52),LTH=9,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
IDPUE    DFLD  POS=(20,62),LTH=5,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
IDPUN    DFLD  POS=(20,68),LTH=5,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
         DFLD  '13',                                                   +        
               POS=(21,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '14',                                                   +        
               POS=(21,17),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '15',                                                   +        
               POS=(21,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16 Order ann/ändr 17',                                 +        
               POS=(21,49),LTH=20,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,17),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,49),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,67),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4I24501 MSG   TYPE=INPUT,                                             +        
               SOR=(W4F245),                                           +        
               OPT=2,                                                  +        
               NXT=W4O24501                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  (IDTRANS1,                                              +        
               '4'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  (IDTRANS2,                                              +        
               '2'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  (IDTRANS3,                                              +        
               '4'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  (IDTRANS4,                                              +        
               '5'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '42451',                                                +        
               LTH=5                                                            
         MFLD  (IDDISTRI,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDDISTRU,                                               +        
               LTH=4                                                            
         MFLD  (IDKUNDNI,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDKUNDNU,                                               +        
               LTH=6                                                            
         MFLD  (IDORDNRI,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDORDNRU,                                               +        
               LTH=7                                                            
         MFLD  (IDDCI,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDDCU,                                                  +        
               LTH=2                                                            
         MFLD  (IDARTNRI,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDARTNRU,                                               +        
               LTH=9                                                            
         MFLD  IDORDERE,                                               +        
               LTH=7                                                            
         MFLD  IDORDERN,                                               +        
               LTH=7                                                            
         MFLD  IDDCE,                                                  +        
               LTH=2                                                            
         MFLD  IDDCN,                                                  +        
               LTH=2                                                            
         MFLD  ADLAGOME,                                               +        
               LTH=3                                                            
         MFLD  ADLAGOMN,                                               +        
               LTH=3                                                            
         MFLD  ADGANGE,                                                +        
               LTH=3                                                            
         MFLD  ADGANGN,                                                +        
               LTH=3                                                            
         MFLD  ADPLATSE,                                               +        
               LTH=5                                                            
         MFLD  ADPLATSN,                                               +        
               LTH=5                                                            
         MFLD  IDARTNRE,                                               +        
               LTH=9                                                            
         MFLD  IDARTNRN,                                               +        
               LTH=9                                                            
         MFLD  IDLOPNRE,                                               +        
               LTH=3                                                            
         MFLD  IDLOPNRN,                                               +        
               LTH=3                                                            
         MFLD  IDPRODE,                                                +        
               LTH=7                                                            
         MFLD  IDPRODN,                                                +        
               LTH=7                                                            
         MFLD  IDPLKE,                                                 +        
               LTH=3                                                            
         MFLD  IDPLKN,                                                 +        
               LTH=3                                                            
         MFLD  IDPUE,                                                  +        
               LTH=5                                                            
         MFLD  IDPUN,                                                  +        
               LTH=5                                                            
         MFLD  (FLJANEJ,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (DGIA0030,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (DGIA0031,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (DGIA0032,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (DGIA0033,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (DGIA0034,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (DGIA0035,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (DGIA0012,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0013,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0014,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0015,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0016,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0017,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0042,                                               +        
               LTH=3                                                            
         MFLD  DGIA0043,                                               +        
               LTH=3                                                            
         MFLD  DGIA0044,                                               +        
               LTH=3                                                            
         MFLD  DGIA0045,                                               +        
               LTH=3                                                            
         MFLD  DGIA0046,                                               +        
               LTH=3                                                            
         MFLD  DGIA0047,                                               +        
               LTH=3                                                            
         MFLD  DGIA0060,                                               +        
               LTH=3                                                            
         MFLD  DGIA0061,                                               +        
               LTH=3                                                            
         MFLD  DGIA0062,                                               +        
               LTH=3                                                            
         MFLD  DGIA0063,                                               +        
               LTH=3                                                            
         MFLD  DGIA0064,                                               +        
               LTH=3                                                            
         MFLD  DGIA0065,                                               +        
               LTH=3                                                            
         MFLD  DGIA0054,                                               +        
               LTH=3                                                            
         MFLD  DGIA0055,                                               +        
               LTH=3                                                            
         MFLD  DGIA0056,                                               +        
               LTH=3                                                            
         MFLD  DGIA0057,                                               +        
               LTH=3                                                            
         MFLD  DGIA0058,                                               +        
               LTH=3                                                            
         MFLD  DGIA0059,                                               +        
               LTH=3                                                            
         MFLD  DGIA0000,                                               +        
               LTH=5                                                            
         MFLD  DGIA0001,                                               +        
               LTH=5                                                            
         MFLD  DGIA0002,                                               +        
               LTH=5                                                            
         MFLD  DGIA0003,                                               +        
               LTH=5                                                            
         MFLD  DGIA0004,                                               +        
               LTH=5                                                            
         MFLD  DGIA0005,                                               +        
               LTH=5                                                            
         MFLD  DGIA0066,                                               +        
               LTH=9                                                            
         MFLD  DGIA0067,                                               +        
               LTH=9                                                            
         MFLD  DGIA0068,                                               +        
               LTH=9                                                            
         MFLD  DGIA0069,                                               +        
               LTH=9                                                            
         MFLD  DGIA0070,                                               +        
               LTH=9                                                            
         MFLD  DGIA0071,                                               +        
               LTH=9                                                            
         MFLD  IDPROD1,                                                +        
               LTH=7                                                            
         MFLD  IDPROD2,                                                +        
               LTH=7                                                            
         MFLD  IDPROD3,                                                +        
               LTH=7                                                            
         MFLD  IDPROD4,                                                +        
               LTH=7                                                            
         MFLD  IDPROD5,                                                +        
               LTH=7                                                            
         MFLD  IDPROD6,                                                +        
               LTH=7                                                            
         MFLD  IDPLK1,                                                 +        
               LTH=3                                                            
         MFLD  IDPLK2,                                                 +        
               LTH=3                                                            
         MFLD  IDPLK3,                                                 +        
               LTH=3                                                            
         MFLD  IDPLK4,                                                 +        
               LTH=3                                                            
         MFLD  IDPLK5,                                                 +        
               LTH=3                                                            
         MFLD  IDPLK6,                                                 +        
               LTH=3                                                            
         MFLD  IDPU1,                                                  +        
               LTH=5                                                            
         MFLD  IDPU2,                                                  +        
               LTH=5                                                            
         MFLD  IDPU3,                                                  +        
               LTH=5                                                            
         MFLD  IDPU4,                                                  +        
               LTH=5                                                            
         MFLD  IDPU5,                                                  +        
               LTH=5                                                            
         MFLD  IDPU6,                                                  +        
               LTH=5                                                            
         MSGEND                                                                 
W4O24501 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4F245,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I24501,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDDISTRI,                                               +        
               LTH=4                                                            
         MFLD  IDDISTRU,                                               +        
               LTH=4                                                            
         MFLD  IDKUNDNI,                                               +        
               LTH=6                                                            
         MFLD  IDKUNDNU,                                               +        
               LTH=6                                                            
         MFLD  IDORDNRI,                                               +        
               LTH=7                                                            
         MFLD  IDORDNRU,                                               +        
               LTH=7                                                            
         MFLD  IDDCI,                                                  +        
               LTH=2                                                            
         MFLD  IDDCU,                                                  +        
               LTH=2                                                            
         MFLD  IDARTNRI,                                               +        
               LTH=9                                                            
         MFLD  IDARTNRU,                                               +        
               LTH=9                                                            
         MFLD  IDORDERE,                                               +        
               LTH=7                                                            
         MFLD  IDORDERN,                                               +        
               LTH=7                                                            
         MFLD  IDDCE,                                                  +        
               LTH=2                                                            
         MFLD  IDDCN,                                                  +        
               LTH=2                                                            
         MFLD  ADLAGOME,                                               +        
               LTH=3                                                            
         MFLD  ADLAGOMN,                                               +        
               LTH=3                                                            
         MFLD  ADGANGE,                                                +        
               LTH=3                                                            
         MFLD  ADGANGN,                                                +        
               LTH=3                                                            
         MFLD  ADPLATSE,                                               +        
               LTH=5                                                            
         MFLD  ADPLATSN,                                               +        
               LTH=5                                                            
         MFLD  IDARTNRE,                                               +        
               LTH=9                                                            
         MFLD  IDARTNRN,                                               +        
               LTH=9                                                            
         MFLD  IDLOPNRE,                                               +        
               LTH=3                                                            
         MFLD  IDLOPNRN,                                               +        
               LTH=3                                                            
         MFLD  IDPRODE,                                                +        
               LTH=7                                                            
         MFLD  IDPRODN,                                                +        
               LTH=7                                                            
         MFLD  IDPLKE,                                                 +        
               LTH=3                                                            
         MFLD  IDPLKN,                                                 +        
               LTH=3                                                            
         MFLD  IDPUE,                                                  +        
               LTH=5                                                            
         MFLD  IDPUN,                                                  +        
               LTH=5                                                            
         MFLD  FLJANEJ,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVRADER,                                                +        
               LTH=5                                                            
         MFLD  KV,                                                     +        
               LTH=5                                                            
         MFLD  DGIA0060,                                               +        
               LTH=3                                                            
         MFLD  DGIA0061,                                               +        
               LTH=3                                                            
         MFLD  DGIA0062,                                               +        
               LTH=3                                                            
         MFLD  DGIA0063,                                               +        
               LTH=3                                                            
         MFLD  DGIA0064,                                               +        
               LTH=3                                                            
         MFLD  DGIA0065,                                               +        
               LTH=3                                                            
         MFLD  DGIA0054,                                               +        
               LTH=3                                                            
         MFLD  DGIA0055,                                               +        
               LTH=3                                                            
         MFLD  DGIA0056,                                               +        
               LTH=3                                                            
         MFLD  DGIA0057,                                               +        
               LTH=3                                                            
         MFLD  DGIA0058,                                               +        
               LTH=3                                                            
         MFLD  DGIA0059,                                               +        
               LTH=3                                                            
         MFLD  DGIA0030,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0031,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0032,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0033,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0034,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0035,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0024,                                               +        
               LTH=9                                                            
         MFLD  DGIA0025,                                               +        
               LTH=9                                                            
         MFLD  DGIA0026,                                               +        
               LTH=9                                                            
         MFLD  DGIA0027,                                               +        
               LTH=9                                                            
         MFLD  DGIA0028,                                               +        
               LTH=9                                                            
         MFLD  DGIA0029,                                               +        
               LTH=9                                                            
         MFLD  DGIA0036,                                               +        
               LTH=7                                                            
         MFLD  DGIA0037,                                               +        
               LTH=7                                                            
         MFLD  DGIA0038,                                               +        
               LTH=7                                                            
         MFLD  DGIA0039,                                               +        
               LTH=7                                                            
         MFLD  DGIA0040,                                               +        
               LTH=7                                                            
         MFLD  DGIA0041,                                               +        
               LTH=7                                                            
         MFLD  DGIA0006,                                               +        
               LTH=25                                                           
         MFLD  DGIA0007,                                               +        
               LTH=25                                                           
         MFLD  DGIA0008,                                               +        
               LTH=25                                                           
         MFLD  DGIA0009,                                               +        
               LTH=25                                                           
         MFLD  DGIA0010,                                               +        
               LTH=25                                                           
         MFLD  DGIA0011,                                               +        
               LTH=25                                                           
         MFLD  DGIA0048,                                               +        
               LTH=7                                                            
         MFLD  DGIA0049,                                               +        
               LTH=7                                                            
         MFLD  DGIA0050,                                               +        
               LTH=7                                                            
         MFLD  DGIA0051,                                               +        
               LTH=7                                                            
         MFLD  DGIA0052,                                               +        
               LTH=7                                                            
         MFLD  DGIA0053,                                               +        
               LTH=7                                                            
         MFLD  DGIA0018,                                               +        
               LTH=2                                                            
         MFLD  DGIA0019,                                               +        
               LTH=2                                                            
         MFLD  DGIA0020,                                               +        
               LTH=2                                                            
         MFLD  DGIA0021,                                               +        
               LTH=2                                                            
         MFLD  DGIA0022,                                               +        
               LTH=2                                                            
         MFLD  DGIA0023,                                               +        
               LTH=2                                                            
         MFLD  DGIA0012,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0013,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0014,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0015,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0016,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0017,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0042,                                               +        
               LTH=3                                                            
         MFLD  DGIA0043,                                               +        
               LTH=3                                                            
         MFLD  DGIA0044,                                               +        
               LTH=3                                                            
         MFLD  DGIA0045,                                               +        
               LTH=3                                                            
         MFLD  DGIA0046,                                               +        
               LTH=3                                                            
         MFLD  DGIA0047,                                               +        
               LTH=3                                                            
         MFLD  DGIA0000,                                               +        
               LTH=5                                                            
         MFLD  DGIA0001,                                               +        
               LTH=5                                                            
         MFLD  DGIA0002,                                               +        
               LTH=5                                                            
         MFLD  DGIA0003,                                               +        
               LTH=5                                                            
         MFLD  DGIA0004,                                               +        
               LTH=5                                                            
         MFLD  DGIA0005,                                               +        
               LTH=5                                                            
         MFLD  DGIA0066,                                               +        
               LTH=9                                                            
         MFLD  DGIA0067,                                               +        
               LTH=9                                                            
         MFLD  DGIA0068,                                               +        
               LTH=9                                                            
         MFLD  DGIA0069,                                               +        
               LTH=9                                                            
         MFLD  DGIA0070,                                               +        
               LTH=9                                                            
         MFLD  DGIA0071,                                               +        
               LTH=9                                                            
         MFLD  IDPROD1,                                                +        
               LTH=7                                                            
         MFLD  IDPROD2,                                                +        
               LTH=7                                                            
         MFLD  IDPROD3,                                                +        
               LTH=7                                                            
         MFLD  IDPROD4,                                                +        
               LTH=7                                                            
         MFLD  IDPROD5,                                                +        
               LTH=7                                                            
         MFLD  IDPROD6,                                                +        
               LTH=7                                                            
         MFLD  IDPLK1,                                                 +        
               LTH=3                                                            
         MFLD  IDPLK2,                                                 +        
               LTH=3                                                            
         MFLD  IDPLK3,                                                 +        
               LTH=3                                                            
         MFLD  IDPLK4,                                                 +        
               LTH=3                                                            
         MFLD  IDPLK5,                                                 +        
               LTH=3                                                            
         MFLD  IDPLK6,                                                 +        
               LTH=3                                                            
         MFLD  IDPU1,                                                  +        
               LTH=5                                                            
         MFLD  IDPU2,                                                  +        
               LTH=5                                                            
         MFLD  IDPU3,                                                  +        
               LTH=5                                                            
         MFLD  IDPU4,                                                  +        
               LTH=5                                                            
         MFLD  IDPU5,                                                  +        
               LTH=5                                                            
         MFLD  IDPU6,                                                  +        
               LTH=5                                                            
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
