***********************************************************************         
* CREATED BY V059625   ON 03/03/19  AT 10:06                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'VOR MESSAGES INTERNAL           '                               
W4F275   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W4T225  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W4T275 6',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T275U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((5,11)),                                        +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'VOR Messages Internal',                                +        
               POS=(1,12),LTH=21,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Läst',                                                 +        
               POS=(3,2),LTH=4,                                        +        
               ATTR=(PROT)                                                      
FL       DFLD  POS=(3,7),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Distr',                                                +        
               POS=(3,9),LTH=5,                                        +        
               ATTR=(NUM,PROT)                                                  
DISTRUT  DFLD  POS=(3,15),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Kund',                                                 +        
               POS=(3,21),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
KUNDUT   DFLD  POS=(3,26),LTH=7,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Order',                                                +        
               POS=(3,34),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
ORDUT    DFLD  POS=(3,40),LTH=10,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Artnr',                                                +        
               POS=(3,51),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
ARTUT    DFLD  POS=(3,57),LTH=9,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Antal',                                                +        
               POS=(3,67),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
ANTUT    DFLD  POS=(3,73),LTH=7,                                       +        
               ATTR=(PROT)                                                      
DISTR    DFLD  POS=(4,2),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
KUNDNR   DFLD  POS=(4,8),LTH=6,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
KUNDRF   DFLD  POS=(4,16),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DAURSP   DFLD  POS=(4,27),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
ARTNR    DFLD  POS=(4,34),LTH=9,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
TIURSP   DFLD  POS=(4,44),LTH=8,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DAAVV    DFLD  POS=(4,54),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
TIAVV    DFLD  POS=(4,61),LTH=8,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  'VOR-Int:',                                             +        
               POS=(5,2),LTH=8,                                        +        
               ATTR=(PROT)                                                      
TEINT    DFLD  POS=(5,11),LTH=230,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'VOR-Ext:',                                             +        
               POS=(8,2),LTH=8,                                        +        
               ATTR=(NUM,PROT)                                                  
TEEXT    DFLD  POS=(8,11),LTH=310,                                     +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'SC',                                                   +        
               POS=(12,2),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
         DFLD  ':',                                                    +        
               POS=(12,9),LTH=1,                                       +        
               ATTR=(PROT)                                                      
TESC     DFLD  POS=(12,11),LTH=310,                                    +        
               ATTR=(PROT)                                                      
         DFLD  'Ansk   :',                                             +        
               POS=(16,2),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
TEANSK1  DFLD  POS=(16,11),LTH=64,                                     +        
               ATTR=(PROT)                                                      
TEANSK2  DFLD  POS=(17,11),LTH=64,                                     +        
               ATTR=(PROT)                                                      
TEANSK3  DFLD  POS=(18,11),LTH=64,                                     +        
               ATTR=(PROT)                                                      
TEANSK4  DFLD  POS=(19,11),LTH=64,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Lösn   :',                                             +        
               POS=(20,2),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
TELOSN   DFLD  POS=(20,11),LTH=150,                                    +        
               ATTR=(NOPROT)                                                    
         DFLD  'F3=JUMP TO 4225    F3=JUMP TO 4225    ',               +        
               POS=(22,2),LTH=38,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,MOD)                                                  
         FMTEND                                                                 
W4I27501 MSG   TYPE=INPUT,                                             +        
               SOR=(W4F275),                                           +        
               OPT=2,                                                  +        
               NXT=W4O27501                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  (IDTRANS1,                                              +        
               '4'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  (IDTRANS2,                                              +        
               '2'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  (IDTRANS3,                                              +        
               '7'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F7'                                                       
         MFLD  (IDTRANS4,                                              +        
               '5'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '42751',                                                +        
               LTH=5                                                            
         MFLD  (FL,                                                    +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DISTR,                                                 +        
               '    '),                                                +        
               LTH=4                                                            
         MFLD  (KUNDNR,                                                +        
               '      '),                                              +        
               LTH=6                                                            
         MFLD  (KUNDRF,                                                +        
               '       '),                                             +        
               LTH=7                                                            
         MFLD  (DAURSP,                                                +        
               '      '),                                              +        
               LTH=6                                                            
         MFLD  (ARTNR,                                                 +        
               '         '),                                           +        
               LTH=9                                                            
         MFLD  (TIURSP,                                                +        
               '        '),                                            +        
               LTH=8                                                            
         MFLD  (DAAVV,                                                 +        
               '      '),                                              +        
               LTH=6                                                            
         MFLD  (TIAVV,                                                 +        
               '        '),                                            +        
               LTH=8                                                            
         MFLD  (TEINT,                                                 +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++++'),                                              +        
               LTH=230,                                                +        
               FILL=X'40'                                                       
         MFLD  TEEXT,                                                  +        
               LTH=310,                                                +        
               FILL=X'40'                                                       
         MFLD  (TELOSN,                                                +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++++++++++++++++++++++++++++++++++++'),              +        
               LTH=150,                                                +        
               FILL=X'40'                                                       
         MSGEND                                                                 
W4O27501 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4F275,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I27501,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  FL,                                                     +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DISTRUT,                                                +        
               LTH=5                                                            
         MFLD  KUNDUT,                                                 +        
               LTH=7                                                            
         MFLD  ORDUT,                                                  +        
               LTH=10                                                           
         MFLD  ARTUT,                                                  +        
               LTH=9                                                            
         MFLD  ANTUT,                                                  +        
               LTH=7                                                            
         MFLD  DISTR,                                                  +        
               LTH=4                                                            
         MFLD  KUNDNR,                                                 +        
               LTH=6                                                            
         MFLD  KUNDRF,                                                 +        
               LTH=7                                                            
         MFLD  DAURSP,                                                 +        
               LTH=6                                                            
         MFLD  ARTNR,                                                  +        
               LTH=9                                                            
         MFLD  TIURSP,                                                 +        
               LTH=8                                                            
         MFLD  DAAVV,                                                  +        
               LTH=6                                                            
         MFLD  TIAVV,                                                  +        
               LTH=8                                                            
         MFLD  TEINT,                                                  +        
               LTH=232,                                                +        
               ATTR=(YES)                                                       
         MFLD  TEEXT,                                                  +        
               LTH=312,                                                +        
               ATTR=(YES)                                                       
         MFLD  TESC,                                                   +        
               LTH=310                                                          
         MFLD  TEANSK1,                                                +        
               LTH=64                                                           
         MFLD  TEANSK2,                                                +        
               LTH=64                                                           
         MFLD  TEANSK3,                                                +        
               LTH=64                                                           
         MFLD  TEANSK4,                                                +        
               LTH=64                                                           
         MFLD  TELOSN,                                                 +        
               LTH=152,                                                +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
