***********************************************************************         
* CREATED BY V028439   ON 08/04/08  AT 14:37                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'SPECIAL ORDERHUVUD              '                               
W4F231   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T231  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W4F231   DPAGE CURSOR=((5,8)),                                         +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'ORDERHUVUD SPECIAL',                                   +        
               POS=(1,12),LTH=18,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
FLVORKO  DFLD  POS=(4,56),LTH=1,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
TEDDI    DFLD  POS=(4,70),LTH=11,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Distr',                                                +        
               POS=(5,2),LTH=5,                                        +        
               ATTR=(NUM,PROT)                                                  
IDDISTR  DFLD  POS=(5,8),LTH=4,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Kund',                                                 +        
               POS=(5,14),LTH=4,                                       +        
               ATTR=(PROT)                                                      
IDKUNDNR DFLD  POS=(5,19),LTH=6,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Order',                                                +        
               POS=(5,27),LTH=5,                                       +        
               ATTR=(PROT)                                                      
IDORDNR  DFLD  POS=(5,33),LTH=5,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Kl',                                                   +        
               POS=(5,42),LTH=2,                                       +        
               ATTR=(PROT)                                                      
KDORDKL  DFLD  POS=(5,45),LTH=1,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Fk',                                                   +        
               POS=(5,48),LTH=2,                                       +        
               ATTR=(PROT)                                                      
KDFRAKT  DFLD  POS=(5,51),LTH=2,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'DC-styr',                                              +        
               POS=(5,55),LTH=7,                                       +        
               ATTR=(PROT)                                                      
IDDCSTYR DFLD  POS=(5,63),LTH=2,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Faktyp',                                               +        
               POS=(7,2),LTH=6,                                        +        
               ATTR=(PROT)                                                      
KDFAKTYP DFLD  POS=(7,9),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Kundref',                                              +        
               POS=(7,14),LTH=7,                                       +        
               ATTR=(PROT)                                                      
BEKUNDRF DFLD  POS=(7,22),LTH=15,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Lageravbok',                                           +        
               POS=(9,2),LTH=10,                                       +        
               ATTR=(PROT)                                                      
LAGERAVB DFLD  POS=(9,14),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Aut.packrapp',                                         +        
               POS=(9,20),LTH=12,                                      +        
               ATTR=(PROT)                                                      
FLPACRAP DFLD  POS=(9,33),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Aut.fakt',                                             +        
               POS=(9,41),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FLAUTFAK DFLD  POS=(9,50),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Leverantör',                                           +        
               POS=(10,2),LTH=10,                                      +        
               ATTR=(PROT)                                                      
IDLEVNR  DFLD  POS=(10,14),LTH=5,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Godsmott namn',                                        +        
               POS=(11,2),LTH=13,                                      +        
               ATTR=(PROT)                                                      
BEGMT1   DFLD  POS=(11,18),LTH=35,                                     +        
               ATTR=(NOPROT,MOD)                                                
BEGMT2   DFLD  POS=(12,18),LTH=35,                                     +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'gatuadress',                                           +        
               POS=(13,6),LTH=10,                                      +        
               ATTR=(PROT)                                                      
ADGMT1   DFLD  POS=(13,18),LTH=35,                                     +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'postadress',                                           +        
               POS=(14,6),LTH=10,                                      +        
               ATTR=(PROT)                                                      
ADGMT2   DFLD  POS=(14,18),LTH=35,                                     +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'land',                                                 +        
               POS=(15,12),LTH=4,                                      +        
               ATTR=(PROT)                                                      
ADGMT3   DFLD  POS=(15,18),LTH=35,                                     +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Godsmärkning',                                         +        
               POS=(16,2),LTH=12,                                      +        
               ATTR=(PROT)                                                      
BEGMRK1  DFLD  POS=(16,18),LTH=30,                                     +        
               ATTR=(NOPROT,MOD)                                                
BEGMRK2  DFLD  POS=(16,49),LTH=30,                                     +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Ftg',                                                  +        
               POS=(18,2),LTH=3,                                       +        
               ATTR=(PROT)                                                      
IDFTG    DFLD  POS=(18,6),LTH=2,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Konto',                                                +        
               POS=(18,11),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KONTO    DFLD  POS=(18,17),LTH=10,                                     +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'AnNo',                                                 +        
               POS=(18,28),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
IDANALYS DFLD  POS=(18,33),LTH=12,                                     +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Ks',                                                   +        
               POS=(18,46),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
IDKST    DFLD  POS=(18,49),LTH=10,                                     +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Internref',                                            +        
               POS=(18,61),LTH=9,                                      +        
               ATTR=(PROT)                                                      
BEINTREF DFLD  POS=(18,71),LTH=10,                                     +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  '13',                                                   +        
               POS=(21,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '14',                                                   +        
               POS=(21,17),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '15',                                                   +        
               POS=(21,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16',                                                   +        
               POS=(21,49),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,17),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,49),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(23,59),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4I23101 MSG   TYPE=INPUT,                                             +        
               SOR=(W4F231),                                           +        
               OPT=2,                                                  +        
               NXT=W4O23101                                                     
MID      LPAGE SOR=(W4F231)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '42311',                                                +        
               LTH=5                                                            
         MFLD  FLVORKO,                                                +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (IDDISTR,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDKUNDNR,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDORDNR,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDORDKL,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (KDFRAKT,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDDCSTYR,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KDFAKTYP,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (BEKUNDRF,                                              +        
               '+++++++++++++++'),                                     +        
               LTH=15,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (LAGERAVB,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLPACRAP,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLAUTFAK,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (BEGMT1,                                                +        
               '+++++++++++++++++++++++++++++++++++'),                 +        
               LTH=35,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (BEGMT2,                                                +        
               '+++++++++++++++++++++++++++++++++++'),                 +        
               LTH=35,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (ADGMT1,                                                +        
               '+++++++++++++++++++++++++++++++++++'),                 +        
               LTH=35,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (ADGMT2,                                                +        
               '+++++++++++++++++++++++++++++++++++'),                 +        
               LTH=35,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (ADGMT3,                                                +        
               '+++++++++++++++++++++++++++++++++++'),                 +        
               LTH=35,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (BEGMRK1,                                               +        
               '++++++++++++++++++++++++++++++'),                      +        
               LTH=30,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (BEGMRK2,                                               +        
               '++++++++++++++++++++++++++++++'),                      +        
               LTH=30,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDFTG,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KONTO,                                                 +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDANALYS,                                              +        
               '++++++++++++'),                                        +        
               LTH=12,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDKST,                                                 +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (BEINTREF,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDLEVNR,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MSGEND                                                                 
W4O23101 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4F231,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I23101,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W4F231                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  FLVORKO,                                                +        
               LTH=1                                                            
         MFLD  TEDDI,                                                  +        
               LTH=11                                                           
         MFLD  IDDISTR,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDKUNDNR,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDORDNR,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDORDKL,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDFRAKT,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDDCSTYR,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDFAKTYP,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BEKUNDRF,                                               +        
               LTH=15                                                           
         MFLD  LAGERAVB,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLPACRAP,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLAUTFAK,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BEGMT1,                                                 +        
               LTH=35                                                           
         MFLD  BEGMT2,                                                 +        
               LTH=35                                                           
         MFLD  ADGMT1,                                                 +        
               LTH=35                                                           
         MFLD  ADGMT2,                                                 +        
               LTH=35                                                           
         MFLD  ADGMT3,                                                 +        
               LTH=35                                                           
         MFLD  BEGMRK1,                                                +        
               LTH=30                                                           
         MFLD  BEGMRK2,                                                +        
               LTH=30                                                           
         MFLD  IDFTG,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KONTO,                                                  +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDANALYS,                                               +        
               LTH=14,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDKST,                                                  +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  BEINTREF,                                               +        
               LTH=10                                                           
         MFLD  IDLEVNR,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
