***********************************************************************         
* CREATED BY PCC4448   ON 95/02/06  AT 12:33                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'FRÅGA ORDERBEKRÄFTELSE ARTIKEL  '                               
W4F283   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W4T283 7',                                           +        
               8='W4T283 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T281  ',                                          +        
               14='W4T282  ',                                          +        
               15='W4T283  ',                                          +        
               16='W4T284  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((2,8)),                                         +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Fråga orderbekräftelse/art',                           +        
               POS=(1,12),LTH=26,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Distr',                                                +        
               POS=(2,2),LTH=5,                                        +        
               ATTR=(ALPHA,PROT)                                                
IDDISTRI DFLD  POS=(2,8),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Kund',                                                 +        
               POS=(2,13),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
IDKUNDNI DFLD  POS=(2,18),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Artnr',                                                +        
               POS=(2,25),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
IDARTNRI DFLD  POS=(2,31),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DC',                                                   +        
               POS=(2,41),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
IDDCIN   DFLD  POS=(2,44),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Kod',                                                  +        
               POS=(2,47),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
KODIN    DFLD  POS=(2,51),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '* Order',                                              +        
               POS=(2,54),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
IDORDNRI DFLD  POS=(2,62),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Fk',                                                   +        
               POS=(2,70),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
KDFRAKTI DFLD  POS=(2,73),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Kl',                                                   +        
               POS=(2,76),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
KDORDKLI DFLD  POS=(2,79),LTH=1,                                       +        
               ATTR=(NUM,NOPROT)                                                
IDDISTRU DFLD  POS=(3,8),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
IDKUNDNU DFLD  POS=(3,18),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
IDARTNRU DFLD  POS=(3,31),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
IDDCUT   DFLD  POS=(3,44),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
KODUT    DFLD  POS=(3,51),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  '*',                                                    +        
               POS=(3,54),LTH=1,                                       +        
               ATTR=(ALPHA,PROT)                                                
IDORDNRU DFLD  POS=(3,62),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
KDFRAKTU DFLD  POS=(3,73),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
KDORDKLU DFLD  POS=(3,79),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0122 DFLD  POS=(4,2),LTH=7,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0118 DFLD  POS=(4,10),LTH=9,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0120 DFLD  POS=(4,20),LTH=3,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0124 DFLD  POS=(4,24),LTH=3,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0126 DFLD  POS=(4,28),LTH=2,                                       +        
               ATTR=(ALPHA,PROT,NODISP,MOD)                                     
DGIA0128 DFLD  POS=(4,31),LTH=2,                                       +        
               ATTR=(ALPHA,PROT,NODISP,MOD)                                     
DGIA0130 DFLD  POS=(4,34),LTH=9,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0131 DFLD  POS=(4,45),LTH=10,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'Proforma',                                             +        
               POS=(4,64),LTH=8,                                       +        
               ATTR=(PROT)                                                      
PROFORMA DFLD  POS=(4,73),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0129 DFLD  POS=(4,76),LTH=1,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'Kod Datum',                                            +        
               POS=(5,2),LTH=9,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'Artnr   Order Kundref',                                +        
               POS=(5,19),LTH=21,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Antal DC    Oref Tillg.dat',                           +        
               POS=(5,51),LTH=26,                                      +        
               ATTR=(PROT)                                                      
DGIA0065 DFLD  POS=(6,2),LTH=3,                                        +        
               ATTR=(PROT)                                                      
DGIA0026 DFLD  POS=(6,6),LTH=6,                                        +        
               ATTR=(NUM,PROT)                                                  
DGIA0000 DFLD  POS=(6,13),LTH=11,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0052 DFLD  POS=(6,25),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0013 DFLD  POS=(6,33),LTH=15,                                      +        
               ATTR=(PROT)                                                      
DGIA0091 DFLD  POS=(6,49),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0078 DFLD  POS=(6,57),LTH=2,                                       +        
               ATTR=(ALPHA,PROT)                                                
DGIA0039 DFLD  POS=(6,60),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0104 DFLD  POS=(6,71),LTH=6,                                       +        
               ATTR=(PROT)                                                      
DGIA0066 DFLD  POS=(7,2),LTH=3,                                        +        
               ATTR=(PROT)                                                      
DGIA0027 DFLD  POS=(7,6),LTH=6,                                        +        
               ATTR=(NUM,PROT)                                                  
DGIA0001 DFLD  POS=(7,13),LTH=11,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0053 DFLD  POS=(7,25),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0014 DFLD  POS=(7,33),LTH=15,                                      +        
               ATTR=(PROT)                                                      
DGIA0092 DFLD  POS=(7,49),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0079 DFLD  POS=(7,57),LTH=2,                                       +        
               ATTR=(ALPHA,PROT)                                                
DGIA0040 DFLD  POS=(7,60),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0105 DFLD  POS=(7,71),LTH=6,                                       +        
               ATTR=(PROT)                                                      
DGIA0067 DFLD  POS=(8,2),LTH=3,                                        +        
               ATTR=(PROT)                                                      
DGIA0028 DFLD  POS=(8,6),LTH=6,                                        +        
               ATTR=(NUM,PROT)                                                  
DGIA0002 DFLD  POS=(8,13),LTH=11,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0054 DFLD  POS=(8,25),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0015 DFLD  POS=(8,33),LTH=15,                                      +        
               ATTR=(PROT)                                                      
DGIA0093 DFLD  POS=(8,49),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0080 DFLD  POS=(8,57),LTH=2,                                       +        
               ATTR=(ALPHA,PROT)                                                
DGIA0041 DFLD  POS=(8,60),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0106 DFLD  POS=(8,71),LTH=6,                                       +        
               ATTR=(PROT)                                                      
DGIA0068 DFLD  POS=(9,2),LTH=3,                                        +        
               ATTR=(PROT)                                                      
DGIA0029 DFLD  POS=(9,6),LTH=6,                                        +        
               ATTR=(NUM,PROT)                                                  
DGIA0003 DFLD  POS=(9,13),LTH=11,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0055 DFLD  POS=(9,25),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0016 DFLD  POS=(9,33),LTH=15,                                      +        
               ATTR=(PROT)                                                      
DGIA0094 DFLD  POS=(9,49),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0081 DFLD  POS=(9,57),LTH=2,                                       +        
               ATTR=(ALPHA,PROT)                                                
DGIA0042 DFLD  POS=(9,60),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0107 DFLD  POS=(9,71),LTH=6,                                       +        
               ATTR=(PROT)                                                      
DGIA0069 DFLD  POS=(10,2),LTH=3,                                       +        
               ATTR=(PROT)                                                      
DGIA0030 DFLD  POS=(10,6),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0004 DFLD  POS=(10,13),LTH=11,                                     +        
               ATTR=(NUM,PROT)                                                  
DGIA0056 DFLD  POS=(10,25),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0017 DFLD  POS=(10,33),LTH=15,                                     +        
               ATTR=(PROT)                                                      
DGIA0095 DFLD  POS=(10,49),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0082 DFLD  POS=(10,57),LTH=2,                                      +        
               ATTR=(ALPHA,PROT)                                                
DGIA0043 DFLD  POS=(10,60),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0108 DFLD  POS=(10,71),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0070 DFLD  POS=(11,2),LTH=3,                                       +        
               ATTR=(PROT)                                                      
DGIA0031 DFLD  POS=(11,6),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0005 DFLD  POS=(11,13),LTH=11,                                     +        
               ATTR=(NUM,PROT)                                                  
DGIA0057 DFLD  POS=(11,25),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0018 DFLD  POS=(11,33),LTH=15,                                     +        
               ATTR=(PROT)                                                      
DGIA0096 DFLD  POS=(11,49),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0083 DFLD  POS=(11,57),LTH=2,                                      +        
               ATTR=(ALPHA,PROT)                                                
DGIA0044 DFLD  POS=(11,60),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0109 DFLD  POS=(11,71),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0071 DFLD  POS=(12,2),LTH=3,                                       +        
               ATTR=(PROT)                                                      
DGIA0032 DFLD  POS=(12,6),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0006 DFLD  POS=(12,13),LTH=11,                                     +        
               ATTR=(NUM,PROT)                                                  
DGIA0058 DFLD  POS=(12,25),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0019 DFLD  POS=(12,33),LTH=15,                                     +        
               ATTR=(PROT)                                                      
DGIA0097 DFLD  POS=(12,49),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0084 DFLD  POS=(12,57),LTH=2,                                      +        
               ATTR=(ALPHA,PROT)                                                
DGIA0045 DFLD  POS=(12,60),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0110 DFLD  POS=(12,71),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0072 DFLD  POS=(13,2),LTH=3,                                       +        
               ATTR=(PROT)                                                      
DGIA0033 DFLD  POS=(13,6),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0007 DFLD  POS=(13,13),LTH=11,                                     +        
               ATTR=(NUM,PROT)                                                  
DGIA0059 DFLD  POS=(13,25),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0020 DFLD  POS=(13,33),LTH=15,                                     +        
               ATTR=(PROT)                                                      
DGIA0098 DFLD  POS=(13,49),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0085 DFLD  POS=(13,57),LTH=2,                                      +        
               ATTR=(ALPHA,PROT)                                                
DGIA0046 DFLD  POS=(13,60),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0111 DFLD  POS=(13,71),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0073 DFLD  POS=(14,2),LTH=3,                                       +        
               ATTR=(PROT)                                                      
DGIA0034 DFLD  POS=(14,6),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0008 DFLD  POS=(14,13),LTH=11,                                     +        
               ATTR=(NUM,PROT)                                                  
DGIA0060 DFLD  POS=(14,25),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0021 DFLD  POS=(14,33),LTH=15,                                     +        
               ATTR=(PROT)                                                      
DGIA0099 DFLD  POS=(14,49),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0086 DFLD  POS=(14,57),LTH=2,                                      +        
               ATTR=(ALPHA,PROT)                                                
DGIA0047 DFLD  POS=(14,60),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0112 DFLD  POS=(14,71),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0074 DFLD  POS=(15,2),LTH=3,                                       +        
               ATTR=(PROT)                                                      
DGIA0035 DFLD  POS=(15,6),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0009 DFLD  POS=(15,13),LTH=11,                                     +        
               ATTR=(NUM,PROT)                                                  
DGIA0061 DFLD  POS=(15,25),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0022 DFLD  POS=(15,33),LTH=15,                                     +        
               ATTR=(PROT)                                                      
DGIA0100 DFLD  POS=(15,49),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0087 DFLD  POS=(15,57),LTH=2,                                      +        
               ATTR=(ALPHA,PROT)                                                
DGIA0048 DFLD  POS=(15,60),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0113 DFLD  POS=(15,71),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0075 DFLD  POS=(16,2),LTH=3,                                       +        
               ATTR=(PROT)                                                      
DGIA0036 DFLD  POS=(16,6),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0010 DFLD  POS=(16,13),LTH=11,                                     +        
               ATTR=(NUM,PROT)                                                  
DGIA0062 DFLD  POS=(16,25),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0023 DFLD  POS=(16,33),LTH=15,                                     +        
               ATTR=(PROT)                                                      
DGIA0101 DFLD  POS=(16,49),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0088 DFLD  POS=(16,57),LTH=2,                                      +        
               ATTR=(ALPHA,PROT)                                                
DGIA0049 DFLD  POS=(16,60),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0114 DFLD  POS=(16,71),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0076 DFLD  POS=(17,2),LTH=3,                                       +        
               ATTR=(PROT)                                                      
DGIA0037 DFLD  POS=(17,6),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0011 DFLD  POS=(17,13),LTH=11,                                     +        
               ATTR=(NUM,PROT)                                                  
DGIA0063 DFLD  POS=(17,25),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0024 DFLD  POS=(17,33),LTH=15,                                     +        
               ATTR=(PROT)                                                      
DGIA0102 DFLD  POS=(17,49),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0089 DFLD  POS=(17,57),LTH=2,                                      +        
               ATTR=(ALPHA,PROT)                                                
DGIA0050 DFLD  POS=(17,60),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0115 DFLD  POS=(17,71),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0077 DFLD  POS=(18,2),LTH=3,                                       +        
               ATTR=(PROT)                                                      
DGIA0038 DFLD  POS=(18,6),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0012 DFLD  POS=(18,13),LTH=11,                                     +        
               ATTR=(NUM,PROT)                                                  
DGIA0064 DFLD  POS=(18,25),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0025 DFLD  POS=(18,33),LTH=15,                                     +        
               ATTR=(PROT)                                                      
DGIA0103 DFLD  POS=(18,49),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0090 DFLD  POS=(18,57),LTH=2,                                      +        
               ATTR=(ALPHA,PROT)                                                
DGIA0051 DFLD  POS=(18,60),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0116 DFLD  POS=(18,71),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Kod-info: bild 0813',                                  +        
               POS=(19,2),LTH=19,                                      +        
               ATTR=(PROT)                                                      
DGIA0121 DFLD  POS=(20,2),LTH=7,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0117 DFLD  POS=(20,10),LTH=9,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0119 DFLD  POS=(20,20),LTH=3,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0123 DFLD  POS=(20,24),LTH=3,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0125 DFLD  POS=(20,28),LTH=2,                                      +        
               ATTR=(ALPHA,PROT,NODISP,MOD)                                     
DGIA0127 DFLD  POS=(20,31),LTH=2,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0132 DFLD  POS=(20,34),LTH=9,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0133 DFLD  POS=(20,45),LTH=10,                                     +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  '13 Ordbekr.dist 14 Ordbekr.order 15 Ordbekr.art.16 Ordb+        
               ekr.fiche 17',                                          +        
               POS=(21,2),LTH=67,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,35),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,67),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4I28301 MSG   TYPE=INPUT,                                             +        
               SOR=(W4F283),                                           +        
               OPT=2,                                                  +        
               NXT=W4O28301                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  (IDTRANS1,                                              +        
               '4'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  (IDTRANS2,                                              +        
               '2'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F8'                                                       
         MFLD  (IDTRANS3,                                              +        
               '8'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  (IDTRANS4,                                              +        
               '3'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '42831',                                                +        
               LTH=5                                                            
         MFLD  (IDDISTRI,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDDISTRU,                                               +        
               LTH=4                                                            
         MFLD  (IDKUNDNI,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDKUNDNU,                                               +        
               LTH=6                                                            
         MFLD  (IDORDNRI,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDORDNRU,                                               +        
               LTH=7                                                            
         MFLD  (IDDCIN,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  (IDARTNRI,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDARTNRU,                                               +        
               LTH=9                                                            
         MFLD  (KODIN,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KODUT,                                                  +        
               LTH=2                                                            
         MFLD  (KDFRAKTI,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KDFRAKTU,                                               +        
               LTH=2                                                            
         MFLD  (KDORDKLI,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KDORDKLU,                                               +        
               LTH=1                                                            
         MFLD  DGIA0122,                                               +        
               LTH=7                                                            
         MFLD  DGIA0118,                                               +        
               LTH=9                                                            
         MFLD  DGIA0120,                                               +        
               LTH=3                                                            
         MFLD  DGIA0124,                                               +        
               LTH=3                                                            
         MFLD  DGIA0126,                                               +        
               LTH=2                                                            
         MFLD  DGIA0128,                                               +        
               LTH=2                                                            
         MFLD  DGIA0130,                                               +        
               LTH=9                                                            
         MFLD  DGIA0131,                                               +        
               LTH=10                                                           
         MFLD  (PROFORMA,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  DGIA0129,                                               +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  DGIA0121,                                               +        
               LTH=7                                                            
         MFLD  DGIA0117,                                               +        
               LTH=9                                                            
         MFLD  DGIA0119,                                               +        
               LTH=3                                                            
         MFLD  DGIA0123,                                               +        
               LTH=3                                                            
         MFLD  DGIA0125,                                               +        
               LTH=2                                                            
         MFLD  DGIA0127,                                               +        
               LTH=2                                                            
         MFLD  DGIA0132,                                               +        
               LTH=9                                                            
         MFLD  DGIA0133,                                               +        
               LTH=10                                                           
         MSGEND                                                                 
W4O28301 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4F283,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I28301,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDDISTRI,                                               +        
               LTH=4                                                            
         MFLD  IDDISTRU,                                               +        
               LTH=4                                                            
         MFLD  IDKUNDNI,                                               +        
               LTH=6                                                            
         MFLD  IDKUNDNU,                                               +        
               LTH=6                                                            
         MFLD  IDARTNRI,                                               +        
               LTH=9                                                            
         MFLD  IDARTNRU,                                               +        
               LTH=9                                                            
         MFLD  IDDCIN,                                                 +        
               LTH=2                                                            
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  KODIN,                                                  +        
               LTH=2                                                            
         MFLD  KODUT,                                                  +        
               LTH=2                                                            
         MFLD  IDORDNRI,                                               +        
               LTH=7                                                            
         MFLD  IDORDNRU,                                               +        
               LTH=7                                                            
         MFLD  KDFRAKTI,                                               +        
               LTH=2                                                            
         MFLD  KDFRAKTU,                                               +        
               LTH=2                                                            
         MFLD  KDORDKLI,                                               +        
               LTH=1                                                            
         MFLD  KDORDKLU,                                               +        
               LTH=1                                                            
         MFLD  DGIA0122,                                               +        
               LTH=7                                                            
         MFLD  DGIA0118,                                               +        
               LTH=9                                                            
         MFLD  DGIA0120,                                               +        
               LTH=3                                                            
         MFLD  DGIA0124,                                               +        
               LTH=3                                                            
         MFLD  DGIA0126,                                               +        
               LTH=2                                                            
         MFLD  DGIA0128,                                               +        
               LTH=2                                                            
         MFLD  DGIA0130,                                               +        
               LTH=9                                                            
         MFLD  DGIA0131,                                               +        
               LTH=10                                                           
         MFLD  PROFORMA,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0129,                                               +        
               LTH=1                                                            
         MFLD  DGIA0065,                                               +        
               LTH=3                                                            
         MFLD  DGIA0066,                                               +        
               LTH=3                                                            
         MFLD  DGIA0067,                                               +        
               LTH=3                                                            
         MFLD  DGIA0068,                                               +        
               LTH=3                                                            
         MFLD  DGIA0069,                                               +        
               LTH=3                                                            
         MFLD  DGIA0070,                                               +        
               LTH=3                                                            
         MFLD  DGIA0071,                                               +        
               LTH=3                                                            
         MFLD  DGIA0072,                                               +        
               LTH=3                                                            
         MFLD  DGIA0073,                                               +        
               LTH=3                                                            
         MFLD  DGIA0074,                                               +        
               LTH=3                                                            
         MFLD  DGIA0075,                                               +        
               LTH=3                                                            
         MFLD  DGIA0076,                                               +        
               LTH=3                                                            
         MFLD  DGIA0077,                                               +        
               LTH=3                                                            
         MFLD  DGIA0026,                                               +        
               LTH=6                                                            
         MFLD  DGIA0027,                                               +        
               LTH=6                                                            
         MFLD  DGIA0028,                                               +        
               LTH=6                                                            
         MFLD  DGIA0029,                                               +        
               LTH=6                                                            
         MFLD  DGIA0030,                                               +        
               LTH=6                                                            
         MFLD  DGIA0031,                                               +        
               LTH=6                                                            
         MFLD  DGIA0032,                                               +        
               LTH=6                                                            
         MFLD  DGIA0033,                                               +        
               LTH=6                                                            
         MFLD  DGIA0034,                                               +        
               LTH=6                                                            
         MFLD  DGIA0035,                                               +        
               LTH=6                                                            
         MFLD  DGIA0036,                                               +        
               LTH=6                                                            
         MFLD  DGIA0037,                                               +        
               LTH=6                                                            
         MFLD  DGIA0038,                                               +        
               LTH=6                                                            
         MFLD  DGIA0000,                                               +        
               LTH=11                                                           
         MFLD  DGIA0001,                                               +        
               LTH=11                                                           
         MFLD  DGIA0002,                                               +        
               LTH=11                                                           
         MFLD  DGIA0003,                                               +        
               LTH=11                                                           
         MFLD  DGIA0004,                                               +        
               LTH=11                                                           
         MFLD  DGIA0005,                                               +        
               LTH=11                                                           
         MFLD  DGIA0006,                                               +        
               LTH=11                                                           
         MFLD  DGIA0007,                                               +        
               LTH=11                                                           
         MFLD  DGIA0008,                                               +        
               LTH=11                                                           
         MFLD  DGIA0009,                                               +        
               LTH=11                                                           
         MFLD  DGIA0010,                                               +        
               LTH=11                                                           
         MFLD  DGIA0011,                                               +        
               LTH=11                                                           
         MFLD  DGIA0012,                                               +        
               LTH=11                                                           
         MFLD  DGIA0052,                                               +        
               LTH=7                                                            
         MFLD  DGIA0053,                                               +        
               LTH=7                                                            
         MFLD  DGIA0054,                                               +        
               LTH=7                                                            
         MFLD  DGIA0055,                                               +        
               LTH=7                                                            
         MFLD  DGIA0056,                                               +        
               LTH=7                                                            
         MFLD  DGIA0057,                                               +        
               LTH=7                                                            
         MFLD  DGIA0058,                                               +        
               LTH=7                                                            
         MFLD  DGIA0059,                                               +        
               LTH=7                                                            
         MFLD  DGIA0060,                                               +        
               LTH=7                                                            
         MFLD  DGIA0061,                                               +        
               LTH=7                                                            
         MFLD  DGIA0062,                                               +        
               LTH=7                                                            
         MFLD  DGIA0063,                                               +        
               LTH=7                                                            
         MFLD  DGIA0064,                                               +        
               LTH=7                                                            
         MFLD  DGIA0013,                                               +        
               LTH=15                                                           
         MFLD  DGIA0014,                                               +        
               LTH=15                                                           
         MFLD  DGIA0015,                                               +        
               LTH=15                                                           
         MFLD  DGIA0016,                                               +        
               LTH=15                                                           
         MFLD  DGIA0017,                                               +        
               LTH=15                                                           
         MFLD  DGIA0018,                                               +        
               LTH=15                                                           
         MFLD  DGIA0019,                                               +        
               LTH=15                                                           
         MFLD  DGIA0020,                                               +        
               LTH=15                                                           
         MFLD  DGIA0021,                                               +        
               LTH=15                                                           
         MFLD  DGIA0022,                                               +        
               LTH=15                                                           
         MFLD  DGIA0023,                                               +        
               LTH=15                                                           
         MFLD  DGIA0024,                                               +        
               LTH=15                                                           
         MFLD  DGIA0025,                                               +        
               LTH=15                                                           
         MFLD  DGIA0091,                                               +        
               LTH=7                                                            
         MFLD  DGIA0092,                                               +        
               LTH=7                                                            
         MFLD  DGIA0093,                                               +        
               LTH=7                                                            
         MFLD  DGIA0094,                                               +        
               LTH=7                                                            
         MFLD  DGIA0095,                                               +        
               LTH=7                                                            
         MFLD  DGIA0096,                                               +        
               LTH=7                                                            
         MFLD  DGIA0097,                                               +        
               LTH=7                                                            
         MFLD  DGIA0098,                                               +        
               LTH=7                                                            
         MFLD  DGIA0099,                                               +        
               LTH=7                                                            
         MFLD  DGIA0100,                                               +        
               LTH=7                                                            
         MFLD  DGIA0101,                                               +        
               LTH=7                                                            
         MFLD  DGIA0102,                                               +        
               LTH=7                                                            
         MFLD  DGIA0103,                                               +        
               LTH=7                                                            
         MFLD  DGIA0078,                                               +        
               LTH=2                                                            
         MFLD  DGIA0079,                                               +        
               LTH=2                                                            
         MFLD  DGIA0080,                                               +        
               LTH=2                                                            
         MFLD  DGIA0081,                                               +        
               LTH=2                                                            
         MFLD  DGIA0082,                                               +        
               LTH=2                                                            
         MFLD  DGIA0083,                                               +        
               LTH=2                                                            
         MFLD  DGIA0084,                                               +        
               LTH=2                                                            
         MFLD  DGIA0085,                                               +        
               LTH=2                                                            
         MFLD  DGIA0086,                                               +        
               LTH=2                                                            
         MFLD  DGIA0087,                                               +        
               LTH=2                                                            
         MFLD  DGIA0088,                                               +        
               LTH=2                                                            
         MFLD  DGIA0089,                                               +        
               LTH=2                                                            
         MFLD  DGIA0090,                                               +        
               LTH=2                                                            
         MFLD  DGIA0039,                                               +        
               LTH=7                                                            
         MFLD  DGIA0040,                                               +        
               LTH=7                                                            
         MFLD  DGIA0041,                                               +        
               LTH=7                                                            
         MFLD  DGIA0042,                                               +        
               LTH=7                                                            
         MFLD  DGIA0043,                                               +        
               LTH=7                                                            
         MFLD  DGIA0044,                                               +        
               LTH=7                                                            
         MFLD  DGIA0045,                                               +        
               LTH=7                                                            
         MFLD  DGIA0046,                                               +        
               LTH=7                                                            
         MFLD  DGIA0047,                                               +        
               LTH=7                                                            
         MFLD  DGIA0048,                                               +        
               LTH=7                                                            
         MFLD  DGIA0049,                                               +        
               LTH=7                                                            
         MFLD  DGIA0050,                                               +        
               LTH=7                                                            
         MFLD  DGIA0051,                                               +        
               LTH=7                                                            
         MFLD  DGIA0104,                                               +        
               LTH=6                                                            
         MFLD  DGIA0105,                                               +        
               LTH=6                                                            
         MFLD  DGIA0106,                                               +        
               LTH=6                                                            
         MFLD  DGIA0107,                                               +        
               LTH=6                                                            
         MFLD  DGIA0108,                                               +        
               LTH=6                                                            
         MFLD  DGIA0109,                                               +        
               LTH=6                                                            
         MFLD  DGIA0110,                                               +        
               LTH=6                                                            
         MFLD  DGIA0111,                                               +        
               LTH=6                                                            
         MFLD  DGIA0112,                                               +        
               LTH=6                                                            
         MFLD  DGIA0113,                                               +        
               LTH=6                                                            
         MFLD  DGIA0114,                                               +        
               LTH=6                                                            
         MFLD  DGIA0115,                                               +        
               LTH=6                                                            
         MFLD  DGIA0116,                                               +        
               LTH=6                                                            
         MFLD  DGIA0121,                                               +        
               LTH=7                                                            
         MFLD  DGIA0117,                                               +        
               LTH=9                                                            
         MFLD  DGIA0119,                                               +        
               LTH=3                                                            
         MFLD  DGIA0123,                                               +        
               LTH=3                                                            
         MFLD  DGIA0125,                                               +        
               LTH=2                                                            
         MFLD  DGIA0127,                                               +        
               LTH=2                                                            
         MFLD  DGIA0132,                                               +        
               LTH=9                                                            
         MFLD  DGIA0133,                                               +        
               LTH=10                                                           
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
