***********************************************************************         
* CREATED BY R035324   ON 91/05/27  AT 12:50                                    
***********************************************************************         
         TITLE 'UPPDATERING PROFKOMPL-3         '                               
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyzöéüäåÉ'                               
W4F268   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T268U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T261  ',                                          +        
               14='W4T262  ',                                          +        
               15='W4T264  ',                                          +        
               16='W4T265  ',                                          +        
               17='W4T266  ',                                          +        
               18='W4T267  ',                                          +        
               19='W4T268  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W4F268   DPAGE CURSOR=((2,8)),                                         +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(ALPHA,NOPROT,MOD)                                          
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Proformahuvud komplettering 3',                        +        
               POS=(1,11),LTH=29,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         DFLD  'Distr',                                                +        
               POS=(2,2),LTH=5,                                        +        
               ATTR=(ALPHA,PROT)                                                
DGIA0002 DFLD  POS=(2,8),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Kundnr',                                               +        
               POS=(2,13),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0004 DFLD  POS=(2,20),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Order',                                                +        
               POS=(2,27),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0006 DFLD  POS=(2,33),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '*Artnr',                                               +        
               POS=(2,41),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0000 DFLD  POS=(2,48),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0003 DFLD  POS=(3,8),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
DGIA0005 DFLD  POS=(3,20),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0007 DFLD  POS=(3,33),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  '*',                                                    +        
               POS=(3,41),LTH=1,                                       +        
               ATTR=(ALPHA,PROT)                                                
DGIA0001 DFLD  POS=(3,48),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Bet.',                                                 +        
               POS=(5,2),LTH=4,                                        +        
               ATTR=(PROT)                                                      
BETALN1  DFLD  POS=(5,9),LTH=72,                                       +        
               ATTR=(NOPROT)                                                    
BETALN2  DFLD  POS=(6,9),LTH=72,                                       +        
               ATTR=(NOPROT)                                                    
BETALN3  DFLD  POS=(7,9),LTH=72,                                       +        
               ATTR=(NOPROT)                                                    
BETALN4  DFLD  POS=(8,9),LTH=72,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Gilt.',                                                +        
               POS=(9,2),LTH=5,                                        +        
               ATTR=(NUM,PROT)                                                  
GILTIG1  DFLD  POS=(9,9),LTH=72,                                       +        
               ATTR=(NOPROT)                                                    
GILTIG2  DFLD  POS=(10,9),LTH=72,                                      +        
               ATTR=(NOPROT)                                                    
GILTIG3  DFLD  POS=(11,9),LTH=72,                                      +        
               ATTR=(NOPROT)                                                    
GILTIG4  DFLD  POS=(12,9),LTH=72,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Lev.',                                                 +        
               POS=(13,2),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
LEV1     DFLD  POS=(13,9),LTH=72,                                      +        
               ATTR=(NOPROT)                                                    
LEV2     DFLD  POS=(14,9),LTH=72,                                      +        
               ATTR=(NOPROT)                                                    
LEV3     DFLD  POS=(15,9),LTH=72,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Pack.',                                                +        
               POS=(16,2),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
PACKN    DFLD  POS=(16,9),LTH=72,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Övr.',                                                 +        
               POS=(17,2),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
OVRIGT1  DFLD  POS=(17,9),LTH=72,                                      +        
               ATTR=(NOPROT)                                                    
OVRIGT2  DFLD  POS=(18,9),LTH=72,                                      +        
               ATTR=(NOPROT)                                                    
OVRIGT3  DFLD  POS=(19,9),LTH=72,                                      +        
               ATTR=(NOPROT)                                                    
OVRIGT4  DFLD  POS=(20,9),LTH=72,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  '13 Nyupp huv   14 Nyupp rad    15 Ändr/bort huv 16 Ändr+        
               /Bort rad 17 Komplett 1',                               +        
               POS=(21,2),LTH=78,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  '18 Komplett 2  19 Komplett 3   20',                    +        
               POS=(22,2),LTH=33,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,67),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         DFLD  ' VCP ',POS=(23,58)                                              
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4I26801 MSG   TYPE=INPUT,                                             +        
               SOR=(W4F268),                                           +        
               OPT=2,                                                  +        
               NXT=W4O26801                                                     
MID      LPAGE SOR=(W4F268)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F8'                                                       
         MFLD  ' ',                                                    +        
               LTH=2                                                            
         MFLD  '42681',                                                +        
               LTH=5                                                            
         MFLD  (DGIA0002,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0004,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0006,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0000,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0003,                                               +        
               LTH=4                                                            
         MFLD  DGIA0005,                                               +        
               LTH=6                                                            
         MFLD  DGIA0007,                                               +        
               LTH=7                                                            
         MFLD  DGIA0001,                                               +        
               LTH=9                                                            
         MFLD  (BETALN1,                                               +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++++++++++++++'),                                    +        
               LTH=72,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (BETALN2,                                               +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++++++++++++++'),                                    +        
               LTH=72,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (BETALN3,                                               +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++++++++++++++'),                                    +        
               LTH=72,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (BETALN4,                                               +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++++++++++++++'),                                    +        
               LTH=72,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (GILTIG1,                                               +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++++++++++++++'),                                    +        
               LTH=72,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (GILTIG2,                                               +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++++++++++++++'),                                    +        
               LTH=72,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (GILTIG3,                                               +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++++++++++++++'),                                    +        
               LTH=72,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (GILTIG4,                                               +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++++++++++++++'),                                    +        
               LTH=72,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (LEV1,                                                  +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++++++++++++++'),                                    +        
               LTH=72,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (LEV2,                                                  +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++++++++++++++'),                                    +        
               LTH=72,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (LEV3,                                                  +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++++++++++++++'),                                    +        
               LTH=72,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (PACKN,                                                 +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++++++++++++++'),                                    +        
               LTH=72,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (OVRIGT1,                                               +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++++++++++++++'),                                    +        
               LTH=72,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (OVRIGT2,                                               +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++++++++++++++'),                                    +        
               LTH=72,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (OVRIGT3,                                               +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++++++++++++++'),                                    +        
               LTH=72,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (OVRIGT4,                                               +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++++++++++++++'),                                    +        
               LTH=72,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MSGEND                                                                 
W4O26801 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4F268,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I26801,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W4F268                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  DGIA0002,                                               +        
               LTH=4                                                            
         MFLD  DGIA0004,                                               +        
               LTH=6                                                            
         MFLD  DGIA0006,                                               +        
               LTH=7                                                            
         MFLD  DGIA0000,                                               +        
               LTH=9                                                            
         MFLD  DGIA0003,                                               +        
               LTH=4                                                            
         MFLD  DGIA0005,                                               +        
               LTH=6                                                            
         MFLD  DGIA0007,                                               +        
               LTH=7                                                            
         MFLD  DGIA0001,                                               +        
               LTH=9                                                            
         MFLD  BETALN1,                                                +        
               LTH=74,                                                 +        
               ATTR=(YES)                                                       
         MFLD  BETALN2,                                                +        
               LTH=74,                                                 +        
               ATTR=(YES)                                                       
         MFLD  BETALN3,                                                +        
               LTH=74,                                                 +        
               ATTR=(YES)                                                       
         MFLD  BETALN4,                                                +        
               LTH=74,                                                 +        
               ATTR=(YES)                                                       
         MFLD  GILTIG1,                                                +        
               LTH=74,                                                 +        
               ATTR=(YES)                                                       
         MFLD  GILTIG2,                                                +        
               LTH=74,                                                 +        
               ATTR=(YES)                                                       
         MFLD  GILTIG3,                                                +        
               LTH=74,                                                 +        
               ATTR=(YES)                                                       
         MFLD  GILTIG4,                                                +        
               LTH=74,                                                 +        
               ATTR=(YES)                                                       
         MFLD  LEV1,                                                   +        
               LTH=74,                                                 +        
               ATTR=(YES)                                                       
         MFLD  LEV2,                                                   +        
               LTH=74,                                                 +        
               ATTR=(YES)                                                       
         MFLD  LEV3,                                                   +        
               LTH=74,                                                 +        
               ATTR=(YES)                                                       
         MFLD  PACKN,                                                  +        
               LTH=74,                                                 +        
               ATTR=(YES)                                                       
         MFLD  OVRIGT1,                                                +        
               LTH=74,                                                 +        
               ATTR=(YES)                                                       
         MFLD  OVRIGT2,                                                +        
               LTH=74,                                                 +        
               ATTR=(YES)                                                       
         MFLD  OVRIGT3,                                                +        
               LTH=74,                                                 +        
               ATTR=(YES)                                                       
         MFLD  OVRIGT4,                                                +        
               LTH=74,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  FSYSMSG,                                                +        
               LTH=79                                                           
         MSGEND                                                                 
         END                                                                    
