*          DATA SET W4F342FII0 AT LEVEL 001 AS OF 86/01/28                      
         PRINT NOGEN                                                            
W4F342   FMT                                                                    
         DEV   TYPE=(3270,2),                                          *        
               FEAT=IGNORE,                                            *        
               PFK=(FLDPFK,'W0T501  ','W0T501  ','W0T501  ','W0T501  ',*        
               'W0T501  ','W0T501  ','W0T501  ','W0T501  ','W0T501  ', *        
               'WHELP   ','W0T501  ','/RCL.   ','W4T341  ','W4T342U ', *        
               'W0T501  ','W0T501  ','W0T501  ','W0T501  ','W0T501  ', *        
               'W0T501  ','W0T501  ','WHELP   ','W0T501  ','/RCL.   '),*        
               DSCA=X'0080',SYSMSG=FSYSMSG                                      
         DIV   TYPE=INOUT                                                       
         DPAGE CURSOR=((02,11)),                                       *        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(01,02),LTH=0001,ATTR=(ALPHA,NOPROT,MOD)                     
FLD0104  DFLD  POS=(01,04),LTH=0001,ATTR=(NUM)                                  
FLD0106  DFLD  POS=(01,06),LTH=0001,ATTR=(NUM)                                  
FLD0108  DFLD  POS=(01,08),LTH=0001,ATTR=(NUM)                                  
         DFLD  'SKAPA PACKAD ORDERLISTA',                              *        
               POS=(01,10),LTH=0023,ATTR=(NUM,PROT)                             
FLD0141  DFLD  POS=(01,41),LTH=0040,ATTR=(NUM,PROT,HI)                          
         DFLD  'PRODNR',                                               *        
               POS=(02,02),LTH=0006,ATTR=(NUM,PROT)                             
FLD0210  DFLD  POS=(02,11),LTH=0007,ATTR=NUM                                    
         DFLD  'DC',                                                   *        
               POS=(02,20),LTH=0002,ATTR=(NUM,PROT)                             
DCI      DFLD  POS=(02,24),LTH=0002,ATTR=(ALPHA,NOPROT)                         
FLD0310  DFLD  POS=(03,11),LTH=0007,ATTR=(NUM,PROT,MOD)                         
DCO      DFLD  POS=(03,24),LTH=0002,ATTR=(ALPHA,PROT,MOD)                       
         DFLD  '13 UTSKR.FÖLJS 14 SKAPA P.ORDL  15               16    *        
                        17              18             19              *        
                20               21             10/22 WHELP',          *        
               POS=(21,02),LTH=0156,ATTR=(NUM,PROT)                             
FLD2302  DFLD  POS=(23,02),LTH=0055,ATTR=(NUM,PROT,HI)                          
         DFLD  ' VCP ',POS=(23,58)                                              
FLD2364  DFLD  POS=(23,64),LTH=0008,ATTR=PROT                                   
FLD2373  DFLD  POS=(23,73),LTH=0008,ATTR=PROT                                   
FSYSMSG  DFLD  POS=(24,02),LTH=0079,ATTR=(NUM,PROT,HI)                          
         FMTEND                                                                 
         EJECT                                                                  
W4O34201 MSG   TYPE=OUTPUT,                                            *        
               SOR=(W4F342,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W4I34201,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  FLD0102,LTH=0001                                                 
         MFLD  FLD0104,LTH=0001                                                 
         MFLD  FLD0106,LTH=0001                                                 
         MFLD  FLD0108,LTH=0001                                                 
         MFLD  FLD0141,LTH=0040                                                 
         MFLD  FLD0210,LTH=0002                                                 
         MFLD  FLD0310,LTH=0007                                                 
         MFLD  DCI,LTH=0002                                                     
         MFLD  DCO,LTH=0002                                                     
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=1                                              
         MSGEND                                                                 
         EJECT                                                                  
W4I34201 MSG   TYPE=INPUT,                                             *        
               SOR=W4F342,                                             *        
               OPT=2,                                                  *        
               NXT=W4O34201                                                     
         SEG                                                                    
         MFLD  FLDPFK,LTH=0008,FILL=NULL                                        
         MFLD  'W',LTH=1                                                        
         MFLD  FLD0102,LTH=0001,FILL=C'4'                                       
         MFLD  'T',LTH=1                                                        
         MFLD  FLD0104,LTH=0001,FILL=C'3'                                       
         MFLD  FLD0106,LTH=0001,FILL=C'4'                                       
         MFLD  FLD0108,LTH=0001,FILL=C'2'                                       
         MFLD  'U ',LTH=2                                                       
         MFLD  '43421',LTH=5                                                    
         MFLD  (FLD0210,'+++++++'),LTH=0007,FILL=C'0',JUST=R                    
         MFLD  FLD0310,LTH=0007,FILL=C' '                                       
         MFLD  (DCI,'++'),LTH=0002,FILL=X'40'                                   
         MFLD  DCO,LTH=0002,FILL=X'40'                                          
         MSGEND                                                                 
         EJECT                                                                  
         END                                                                    
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
