***********************************************************************         
* CREATED BY V073825   ON 99/11/12  AT 08:30                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE '                                '                               
W4F391   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='WHELP   ',                                           +        
               2='WHELP   ',                                           +        
               3='WHELP   ',                                           +        
               4='WHELP   ',                                           +        
               5='WHELP   ',                                           +        
               6='WHELP   ',                                           +        
               7='WHELP   ',                                           +        
               8='WHELP   ',                                           +        
               9='WHELP   ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T391U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T305  ',                                          +        
               14='WHELP   ',                                          +        
               15='WHELP   ',                                          +        
               16='WHELP   ',                                          +        
               17='WHELP   ',                                          +        
               18='WHELP   ',                                          +        
               19='WHELP   ',                                          +        
               20='WHELP   ',                                          +        
               21='WHELP   ',                                          +        
               22='WHELP   ',                                          +        
               23='W4T391U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((7,2)),                                         +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,PROT)                                                  
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,PROT)                                                  
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'PACKRAPP. AVVIKELSE',                                  +        
               POS=(1,12),LTH=19,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'PRODNR',                                               +        
               POS=(2,2),LTH=6,                                        +        
               ATTR=(NUM,PROT)                                                  
FLD0209  DFLD  POS=(2,9),LTH=7,                                        +        
               ATTR=(PROT,NODISP)                                               
         DFLD  'DISTR',                                                +        
               POS=(2,18),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'KUND',                                                 +        
               POS=(2,29),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'FK    ORDER',                                          +        
               POS=(2,39),LTH=11,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'KLASS   DC',                                           +        
               POS=(2,58),LTH=10,                                      +        
               ATTR=(PROT)                                                      
FLD0309  DFLD  POS=(3,9),LTH=7,                                        +        
               ATTR=(PROT,MOD)                                                  
FLD0323  DFLD  POS=(3,23),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0333  DFLD  POS=(3,33),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0342  DFLD  POS=(3,42),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0351  DFLD  POS=(3,51),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0363  DFLD  POS=(3,63),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0000 DFLD  POS=(3,69),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'SENAST INRAPP. RAD',                                   +        
               POS=(5,2),LTH=18,                                       +        
               ATTR=(PROT)                                                      
FLD0524  DFLD  POS=(5,24),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
PRTVALAF DFLD  POS=(5,39),LTH=2,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'RADNR    PACK-ANTAL',                                  +        
               POS=(6,2),LTH=19,                                       +        
               ATTR=(PROT)                                                      
COL0207  DFLD  POS=(7,2),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
COL1107  DFLD  POS=(7,11),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL0208  DFLD  POS=(8,2),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
COL1108  DFLD  POS=(8,11),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL0209  DFLD  POS=(9,2),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
COL1109  DFLD  POS=(9,11),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL0210  DFLD  POS=(10,2),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL1110  DFLD  POS=(10,11),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL0211  DFLD  POS=(11,2),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL1111  DFLD  POS=(11,11),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL0212  DFLD  POS=(12,2),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL1112  DFLD  POS=(12,11),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL0213  DFLD  POS=(13,2),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL1113  DFLD  POS=(13,11),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL0214  DFLD  POS=(14,2),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL1114  DFLD  POS=(14,11),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL0215  DFLD  POS=(15,2),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL1115  DFLD  POS=(15,11),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL0216  DFLD  POS=(16,2),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL1116  DFLD  POS=(16,11),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL0217  DFLD  POS=(17,2),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL1117  DFLD  POS=(17,11),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL0218  DFLD  POS=(18,2),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL1118  DFLD  POS=(18,11),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL0219  DFLD  POS=(19,2),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL1119  DFLD  POS=(19,11),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '13 BÖRJA OM',                                          +        
               POS=(21,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '14',                                                   +        
               POS=(21,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '15',                                                   +        
               POS=(21,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16',                                                   +        
               POS=(21,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(23,59),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4O39101 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4F391,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I39101,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  FLD0209,                                                +        
               LTH=7                                                            
         MFLD  FLD0309,                                                +        
               LTH=7                                                            
         MFLD  FLD0323,                                                +        
               LTH=4                                                            
         MFLD  FLD0333,                                                +        
               LTH=6                                                            
         MFLD  FLD0342,                                                +        
               LTH=2                                                            
         MFLD  FLD0351,                                                +        
               LTH=5                                                            
         MFLD  FLD0363,                                                +        
               LTH=1                                                            
         MFLD  DGIA0000,                                               +        
               LTH=2                                                            
         MFLD  PRTVALAF,                                               +        
               LTH=2                                                            
         MFLD  FLD0524,                                                +        
               LTH=4                                                            
         MFLD  COL0207,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1107,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0208,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1108,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0209,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1109,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0210,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1110,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0211,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1111,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0212,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1112,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0213,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1113,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0214,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1114,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0215,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1115,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0216,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1116,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0217,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1117,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0218,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1118,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0219,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1119,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I39101 MSG   TYPE=INPUT,                                             +        
               SOR=(W4F391),                                           +        
               OPT=2,                                                  +        
               NXT=W4O39101                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F9'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  'U ',                                                   +        
               LTH=2                                                            
         MFLD  '43911',                                                +        
               LTH=5                                                            
         MFLD  (FLD0209,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0309,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0323,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0333,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0342,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0351,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0363,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0000,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (PRTVALAF,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0524,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL0207,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1107,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0208,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1108,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0209,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1109,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0210,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1110,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0211,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1111,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0212,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1112,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0213,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1113,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0214,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1114,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0215,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1115,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0216,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1116,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0217,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1117,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0218,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1118,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0219,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1119,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
