***********************************************************************         
* CREATED BY R038512   ON 91/09/04  AT 11:06                                    
***********************************************************************         
         TITLE 'LISTBESTÄLLNING WOPS W4F388     '                               
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyzöéüäåÉ'                               
W4F388   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W4T388 7',                                           +        
               8='W4T388 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T388U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T381  ',                                          +        
               14='W4T382  ',                                          +        
               15='W4T383  ',                                          +        
               16='W4T384  ',                                          +        
               17='W4T385  ',                                          +        
               18='W4T386  ',                                          +        
               19='W4T387  ',                                          +        
               20='W4T388  ',                                          +        
               21='W4T389  ',                                          +        
               22='WHELP   ',                                          +        
               23='W4T388U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W4F388   DPAGE CURSOR=((2,11)),                                        +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Listbeställning WOPS',                                 +        
               POS=(1,11),LTH=20,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,40),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Prod-grp',                                             +        
               POS=(2,2),LTH=8,                                        +        
               ATTR=(PROT)                                                      
DGIA0027 DFLD  POS=(2,11),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'DC',                                                   +        
               POS=(2,17),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DCI      DFLD  POS=(2,20),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DGIA0028 DFLD  POS=(3,11),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
DCO      DFLD  POS=(3,20),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
KDPRODKL DFLD  POS=(3,23),LTH=1,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
IDPRC    DFLD  POS=(3,25),LTH=4,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0029 DFLD  POS=(4,2),LTH=6,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0033 DFLD  POS=(4,9),LTH=3,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0031 DFLD  POS=(4,14),LTH=6,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0035 DFLD  POS=(4,21),LTH=3,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'Lista',                                                +        
               POS=(5,2),LTH=5,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'Best  Beskrivning',                                    +        
               POS=(5,15),LTH=17,                                      +        
               ATTR=(PROT)                                                      
DGIA0036 DFLD  POS=(6,2),LTH=10,                                       +        
               ATTR=(PROT)                                                      
DGIA0014 DFLD  POS=(6,16),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DGIA0001 DFLD  POS=(6,21),LTH=25,                                      +        
               ATTR=(PROT)                                                      
DGIA0037 DFLD  POS=(7,2),LTH=10,                                       +        
               ATTR=(PROT)                                                      
DGIA0015 DFLD  POS=(7,16),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DGIA0002 DFLD  POS=(7,21),LTH=25,                                      +        
               ATTR=(PROT)                                                      
DGIA0038 DFLD  POS=(8,2),LTH=10,                                       +        
               ATTR=(PROT)                                                      
DGIA0016 DFLD  POS=(8,16),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DGIA0003 DFLD  POS=(8,21),LTH=25,                                      +        
               ATTR=(PROT)                                                      
DGIA0039 DFLD  POS=(9,2),LTH=10,                                       +        
               ATTR=(PROT)                                                      
DGIA0017 DFLD  POS=(9,16),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DGIA0004 DFLD  POS=(9,21),LTH=25,                                      +        
               ATTR=(PROT)                                                      
DGIA0040 DFLD  POS=(10,2),LTH=10,                                      +        
               ATTR=(PROT)                                                      
DGIA0018 DFLD  POS=(10,16),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0005 DFLD  POS=(10,21),LTH=25,                                     +        
               ATTR=(PROT)                                                      
DGIA0032 DFLD  POS=(11,2),LTH=10,                                      +        
               ATTR=(PROT)                                                      
DGIA0019 DFLD  POS=(11,16),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0006 DFLD  POS=(11,21),LTH=25,                                     +        
               ATTR=(PROT)                                                      
DGIA0041 DFLD  POS=(12,2),LTH=10,                                      +        
               ATTR=(PROT)                                                      
DGIA0020 DFLD  POS=(12,16),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0007 DFLD  POS=(12,21),LTH=25,                                     +        
               ATTR=(PROT)                                                      
DGIA0042 DFLD  POS=(13,2),LTH=10,                                      +        
               ATTR=(PROT)                                                      
DGIA0021 DFLD  POS=(13,16),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0008 DFLD  POS=(13,21),LTH=25,                                     +        
               ATTR=(PROT)                                                      
DGIA0043 DFLD  POS=(14,2),LTH=10,                                      +        
               ATTR=(PROT)                                                      
DGIA0022 DFLD  POS=(14,16),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0009 DFLD  POS=(14,21),LTH=25,                                     +        
               ATTR=(PROT)                                                      
DGIA0044 DFLD  POS=(15,2),LTH=10,                                      +        
               ATTR=(PROT)                                                      
DGIA0023 DFLD  POS=(15,16),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0010 DFLD  POS=(15,21),LTH=25,                                     +        
               ATTR=(PROT)                                                      
DGIA0045 DFLD  POS=(16,2),LTH=10,                                      +        
               ATTR=(PROT)                                                      
DGIA0024 DFLD  POS=(16,16),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0011 DFLD  POS=(16,21),LTH=25,                                     +        
               ATTR=(PROT)                                                      
DGIA0046 DFLD  POS=(17,2),LTH=10,                                      +        
               ATTR=(PROT)                                                      
DGIA0025 DFLD  POS=(17,16),LTH=1,                                      +        
               ATTR=(PROT)                                                      
BESK12   DFLD  POS=(17,21),LTH=25,                                     +        
               ATTR=(PROT)                                                      
DGIA0047 DFLD  POS=(18,2),LTH=10,                                      +        
               ATTR=(PROT)                                                      
DGIA0026 DFLD  POS=(18,16),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0012 DFLD  POS=(18,21),LTH=25,                                     +        
               ATTR=(PROT)                                                      
DGIA0030 DFLD  POS=(19,2),LTH=6,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0034 DFLD  POS=(19,9),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0013 DFLD  POS=(19,16),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0000 DFLD  POS=(19,21),LTH=25,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'Borttag',                                              +        
               POS=(19,50),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FLBORT   DFLD  POS=(19,58),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'J/N',                                                  +        
               POS=(19,60),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  '13 Synk PRC stat 14 Synk PRC rad 15 Dagordplan   16 Bem+        
               anning PRC 17 Trpvolym',                                +        
               POS=(21,2),LTH=77,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18 BO-plan  Ptid 19 BO-plan  rad 20 Listbest',         +        
               POS=(22,2),LTH=44,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21 Packare/skift 22 Whelp',                            +        
               POS=(22,51),LTH=25,                                     +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  ' VCP ',POS=(23,58)                                              
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W4I38801 MSG   TYPE=INPUT,                                             +        
               SOR=(W4F388),                                           +        
               OPT=2,                                                  +        
               NXT=W4O38801                                                     
MID      LPAGE SOR=(W4F388)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  (IDTRANS1,                                              +        
               '4'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  (IDTRANS2,                                              +        
               '3'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  (IDTRANS3,                                              +        
               '8'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F8'                                                       
         MFLD  (IDTRANS4,                                              +        
               '8'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F8'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '43881',                                                +        
               LTH=5                                                            
         MFLD  (DGIA0027,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  DGIA0028,                                               +        
               LTH=5                                                            
         MFLD  (DCI,                                                   +        
               '++'),                                                  +        
               LTH=2                                                   +        
               FILL=X'40'                                                       
         MFLD  DCO,                                                    +        
               LTH=2                                                            
         MFLD  KDPRODKL,                                               +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDPRC,                                                  +        
               LTH=4,                                                  +        
               JUST=L,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0029,                                               +        
               LTH=6,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  DGIA0033,                                               +        
               LTH=3                                                            
         MFLD  DGIA0031,                                               +        
               LTH=6,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  DGIA0035,                                               +        
               LTH=3                                                            
         MFLD  (DGIA0030,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0034,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0013,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0000,                                              +        
               '+++++++++++++++++++++++++'),                           +        
               LTH=25,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLBORT,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4O38801 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4F388,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I38801,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W4F388                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  DGIA0027,                                               +        
               LTH=5                                                            
         MFLD  DCI,                                                    +        
               LTH=2                                                            
         MFLD  DGIA0028,                                               +        
               LTH=5                                                            
         MFLD  DCO,                                                    +        
               LTH=2                                                            
         MFLD  KDPRODKL,                                               +        
               LTH=1                                                            
         MFLD  IDPRC,                                                  +        
               LTH=4                                                            
         MFLD  DGIA0029,                                               +        
               LTH=6                                                            
         MFLD  DGIA0033,                                               +        
               LTH=3                                                            
         MFLD  DGIA0031,                                               +        
               LTH=6                                                            
         MFLD  DGIA0035,                                               +        
               LTH=3                                                            
         MFLD  DGIA0036,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0014,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0001,                                               +        
               LTH=27,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0037,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0015,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0002,                                               +        
               LTH=27,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0038,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0016,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0003,                                               +        
               LTH=27,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0039,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0017,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0004,                                               +        
               LTH=27,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0040,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0018,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0005,                                               +        
               LTH=27,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0032,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0019,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0006,                                               +        
               LTH=27,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0041,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0020,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0007,                                               +        
               LTH=27,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0042,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0021,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0008,                                               +        
               LTH=27,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0043,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0022,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0009,                                               +        
               LTH=27,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0044,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0023,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0010,                                               +        
               LTH=27,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0045,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0024,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0011,                                               +        
               LTH=27,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0046,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0025,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BESK12,                                                 +        
               LTH=27,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0047,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0026,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0012,                                               +        
               LTH=27,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0030,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0034,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0013,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0000,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLBORT,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
