***********************************************************************         
* CREATED BY PC36147   ON 94/11/26  AT 15:09                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE '                                '                               
W4F392   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='WHELP   ',                                           +        
               2='WHELP   ',                                           +        
               3='WHELP   ',                                           +        
               4='WHELP   ',                                           +        
               5='WHELP   ',                                           +        
               6='WHELP   ',                                           +        
               7='WHELP   ',                                           +        
               8='WHELP   ',                                           +        
               9='WHELP   ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T392U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T305  ',                                          +        
               14='WHELP   ',                                          +        
               15='WHELP   ',                                          +        
               16='WHELP   ',                                          +        
               17='WHELP   ',                                          +        
               18='WHELP   ',                                          +        
               19='WHELP   ',                                          +        
               20='WHELP   ',                                          +        
               21='WHELP   ',                                          +        
               22='WHELP   ',                                          +        
               23='W4T392U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((7,9)),                                         +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  'PACKNINGSRAPP. SVERIGE KOLLI',                         +        
               POS=(1,11),LTH=28,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'PRODNR',                                               +        
               POS=(2,2),LTH=6,                                        +        
               ATTR=(NUM,PROT)                                                  
FLD0209  DFLD  POS=(2,9),LTH=7,                                        +        
               ATTR=(PROT,NODISP)                                               
         DFLD  'DISTR',                                                +        
               POS=(2,17),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'KUND',                                                 +        
               POS=(2,28),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'FK    ORDER',                                          +        
               POS=(2,39),LTH=11,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'KLASS    DC',                                          +        
               POS=(2,57),LTH=11,                                      +        
               ATTR=(PROT)                                                      
FLD0309  DFLD  POS=(3,9),LTH=7,                                        +        
               ATTR=(PROT,MOD)                                                  
FLD0323  DFLD  POS=(3,23),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0333  DFLD  POS=(3,33),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0342  DFLD  POS=(3,42),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0351  DFLD  POS=(3,51),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0363  DFLD  POS=(3,63),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0000 DFLD  POS=(3,69),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'SENAST INRAPP. KOLLI',                                 +        
               POS=(5,2),LTH=20,                                       +        
               ATTR=(PROT)                                                      
FLD0525  DFLD  POS=(5,25),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'KOLLI  KOLLIKOD  BTOVIKT  EMB',                        +        
               POS=(6,2),LTH=29,                                       +        
               ATTR=(PROT)                                                      
COL0207  DFLD  POS=(7,2),LTH=5,                                        +        
               ATTR=(PROT,MOD)                                                  
COL0907  DFLD  POS=(7,9),LTH=8,                                        +        
               ATTR=(NOPROT)                                                    
COL1907  DFLD  POS=(7,19),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL2907  DFLD  POS=(7,29),LTH=1,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL0208  DFLD  POS=(8,2),LTH=5,                                        +        
               ATTR=(PROT,MOD)                                                  
COL0908  DFLD  POS=(8,9),LTH=8,                                        +        
               ATTR=(NOPROT)                                                    
COL1908  DFLD  POS=(8,19),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL2908  DFLD  POS=(8,29),LTH=1,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL0209  DFLD  POS=(9,2),LTH=5,                                        +        
               ATTR=(PROT,MOD)                                                  
COL0909  DFLD  POS=(9,9),LTH=8,                                        +        
               ATTR=(NOPROT)                                                    
COL1909  DFLD  POS=(9,19),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL2909  DFLD  POS=(9,29),LTH=1,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL0210  DFLD  POS=(10,2),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
COL0910  DFLD  POS=(10,9),LTH=8,                                       +        
               ATTR=(NOPROT)                                                    
COL1910  DFLD  POS=(10,19),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL2910  DFLD  POS=(10,29),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL0211  DFLD  POS=(11,2),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
COL0911  DFLD  POS=(11,9),LTH=8,                                       +        
               ATTR=(NOPROT)                                                    
COL1911  DFLD  POS=(11,19),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL2911  DFLD  POS=(11,29),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL0212  DFLD  POS=(12,2),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
COL0912  DFLD  POS=(12,9),LTH=8,                                       +        
               ATTR=(NOPROT)                                                    
COL1912  DFLD  POS=(12,19),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL2912  DFLD  POS=(12,29),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL0213  DFLD  POS=(13,2),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
COL0913  DFLD  POS=(13,9),LTH=8,                                       +        
               ATTR=(NOPROT)                                                    
COL1913  DFLD  POS=(13,19),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL2913  DFLD  POS=(13,29),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL0214  DFLD  POS=(14,2),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
COL0914  DFLD  POS=(14,9),LTH=8,                                       +        
               ATTR=(NOPROT)                                                    
COL1914  DFLD  POS=(14,19),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL2914  DFLD  POS=(14,29),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL0215  DFLD  POS=(15,2),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
COL0915  DFLD  POS=(15,9),LTH=8,                                       +        
               ATTR=(NOPROT)                                                    
COL1915  DFLD  POS=(15,19),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL2915  DFLD  POS=(15,29),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL0216  DFLD  POS=(16,2),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
COL0916  DFLD  POS=(16,9),LTH=8,                                       +        
               ATTR=(NOPROT)                                                    
COL1916  DFLD  POS=(16,19),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL2916  DFLD  POS=(16,29),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL0217  DFLD  POS=(17,2),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
COL0917  DFLD  POS=(17,9),LTH=8,                                       +        
               ATTR=(NOPROT)                                                    
COL1917  DFLD  POS=(17,19),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL2917  DFLD  POS=(17,29),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL0218  DFLD  POS=(18,2),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
COL0918  DFLD  POS=(18,9),LTH=8,                                       +        
               ATTR=(NOPROT)                                                    
COL1918  DFLD  POS=(18,19),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL2918  DFLD  POS=(18,29),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL0219  DFLD  POS=(19,2),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
COL0919  DFLD  POS=(19,9),LTH=8,                                       +        
               ATTR=(NOPROT)                                                    
COL1919  DFLD  POS=(19,19),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL2919  DFLD  POS=(19,29),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '13 BÖRJA OM',                                          +        
               POS=(21,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '14',                                                   +        
               POS=(21,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '15',                                                   +        
               POS=(21,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16',                                                   +        
               POS=(21,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4O39201 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4F392,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I39201,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  FLD0309,                                                +        
               LTH=7                                                            
         MFLD  FLD0323,                                                +        
               LTH=4                                                            
         MFLD  FLD0333,                                                +        
               LTH=6                                                            
         MFLD  FLD0342,                                                +        
               LTH=2                                                            
         MFLD  FLD0351,                                                +        
               LTH=5                                                            
         MFLD  FLD0363,                                                +        
               LTH=1                                                            
         MFLD  DGIA0000,                                               +        
               LTH=2                                                            
         MFLD  FLD0525,                                                +        
               LTH=5                                                            
         MFLD  COL0207,                                                +        
               LTH=5                                                            
         MFLD  COL0907,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1907,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2907,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0208,                                                +        
               LTH=5                                                            
         MFLD  COL0908,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1908,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2908,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0209,                                                +        
               LTH=5                                                            
         MFLD  COL0909,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1909,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2909,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0210,                                                +        
               LTH=5                                                            
         MFLD  COL0910,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1910,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2910,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0211,                                                +        
               LTH=5                                                            
         MFLD  COL0911,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1911,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2911,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0212,                                                +        
               LTH=5                                                            
         MFLD  COL0912,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1912,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2912,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0213,                                                +        
               LTH=5                                                            
         MFLD  COL0913,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1913,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2913,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0214,                                                +        
               LTH=5                                                            
         MFLD  COL0914,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1914,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2914,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0215,                                                +        
               LTH=5                                                            
         MFLD  COL0915,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1915,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2915,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0216,                                                +        
               LTH=5                                                            
         MFLD  COL0916,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1916,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2916,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0217,                                                +        
               LTH=5                                                            
         MFLD  COL0917,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1917,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2917,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0218,                                                +        
               LTH=5                                                            
         MFLD  COL0918,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1918,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2918,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0219,                                                +        
               LTH=5                                                            
         MFLD  COL0919,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1919,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2919,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I39201 MSG   TYPE=INPUT,                                             +        
               SOR=(W4F392),                                           +        
               OPT=2,                                                  +        
               NXT=W4O39201                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F9'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  'U ',                                                   +        
               LTH=2                                                            
         MFLD  '43921',                                                +        
               LTH=5                                                            
         MFLD  (FLD0209,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0309,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0323,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0333,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0342,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0351,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0363,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0000,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0525,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0207,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0907,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL1907,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2907,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0208,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0908,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL1908,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2908,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0209,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0909,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL1909,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2909,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0210,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0910,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL1910,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2910,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0211,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0911,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL1911,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2911,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0212,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0912,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL1912,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2912,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0213,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0913,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL1913,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2913,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0214,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0914,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL1914,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2914,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0215,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0915,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL1915,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2915,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0216,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0916,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL1916,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2916,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0217,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0917,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL1917,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2917,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0218,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0918,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL1918,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2918,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0219,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0919,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL1919,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2919,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
