***********************************************************************         
* CREATED BY PC36147   ON 95/03/21  AT 16:12                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE '                                '                               
W4F305   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T305U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T301  ',                                          +        
               14='W4T302  ',                                          +        
               15='W4T303  ',                                          +        
               16='W0T501  ',                                          +        
               17='W4T305  ',                                          +        
               18='W4T306  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W4T305U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,10)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'PACKNINGSRAPP. BÖRJA OM',                              +        
               POS=(1,11),LTH=23,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'PRODNR',                                               +        
               POS=(2,2),LTH=6,                                        +        
               ATTR=(NUM,PROT)                                                  
FLD0209  DFLD  POS=(2,9),LTH=7,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'DISTR',                                                +        
               POS=(2,17),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'KUND',                                                 +        
               POS=(2,28),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'FK    ORDNR',                                          +        
               POS=(2,40),LTH=11,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'KLASS   DC',                                           +        
               POS=(2,58),LTH=10,                                      +        
               ATTR=(PROT)                                                      
DGIA0000 DFLD  POS=(2,69),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
FLD0309  DFLD  POS=(3,9),LTH=7,                                        +        
               ATTR=(PROT,MOD)                                                  
FLD0323  DFLD  POS=(3,23),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0333  DFLD  POS=(3,33),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0342  DFLD  POS=(3,42),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0351  DFLD  POS=(3,51),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0363  DFLD  POS=(3,63),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0001 DFLD  POS=(3,69),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'USERID:',                                              +        
               POS=(5,2),LTH=7,                                        +        
               ATTR=(PROT)                                                      
FLD0511  DFLD  POS=(5,11),LTH=8,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'VILL DU GÅ TILLBAKA:',                                 +        
               POS=(5,21),LTH=20,                                      +        
               ATTR=(PROT)                                                      
FLD0542  DFLD  POS=(5,42),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  '(SVARA J)',                                            +        
               POS=(5,46),LTH=9,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'GRUNDBILD',                                            +        
               POS=(6,2),LTH=9,                                        +        
               ATTR=(PROT)                                                      
FLD0617  DFLD  POS=(6,17),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0621  DFLD  POS=(6,21),LTH=12,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'RADBILD',                                              +        
               POS=(6,40),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FLD0655  DFLD  POS=(6,55),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0659  DFLD  POS=(6,59),LTH=12,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'DELNINGSBILD',                                         +        
               POS=(7,2),LTH=12,                                       +        
               ATTR=(PROT)                                                      
FLD0717  DFLD  POS=(7,17),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0721  DFLD  POS=(7,21),LTH=12,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'KOLLIBILD',                                            +        
               POS=(7,40),LTH=9,                                       +        
               ATTR=(PROT)                                                      
FLD0755  DFLD  POS=(7,55),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0759  DFLD  POS=(7,59),LTH=12,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'AVVIKELSEBILD',                                        +        
               POS=(8,2),LTH=13,                                       +        
               ATTR=(PROT)                                                      
FLD0817  DFLD  POS=(8,17),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0821  DFLD  POS=(8,21),LTH=12,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'URSPRUNGSBILD',                                        +        
               POS=(8,40),LTH=13,                                      +        
               ATTR=(PROT)                                                      
FLD0855  DFLD  POS=(8,55),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0859  DFLD  POS=(8,59),LTH=12,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'BÖRJA OM',                                             +        
               POS=(10,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FLD1012  DFLD  POS=(10,12),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  '(SVARA J)',                                            +        
               POS=(10,14),LTH=9,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'BACKA TILL',                                           +        
               POS=(11,2),LTH=10,                                      +        
               ATTR=(PROT)                                                      
FLD1114  DFLD  POS=(11,14),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1122  DFLD  POS=(11,22),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  '(SVARA J)',                                            +        
               POS=(11,25),LTH=9,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '13 GRUND SVE    14 GRUND EXP    15 GRUND UDDA   16',   +        
               POS=(21,2),LTH=50,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18 GRUND MANORD 19',                                   +        
               POS=(22,2),LTH=18,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4O30501 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4F305,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I30501,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  FLD0209,                                                +        
               LTH=7                                                            
         MFLD  FLD0309,                                                +        
               LTH=7                                                            
         MFLD  FLD0323,                                                +        
               LTH=4                                                            
         MFLD  FLD0333,                                                +        
               LTH=6                                                            
         MFLD  FLD0342,                                                +        
               LTH=2                                                            
         MFLD  FLD0351,                                                +        
               LTH=5                                                            
         MFLD  FLD0363,                                                +        
               LTH=1                                                            
         MFLD  DGIA0000,                                               +        
               LTH=2                                                            
         MFLD  DGIA0001,                                               +        
               LTH=2                                                            
         MFLD  FLD0511,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0542,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0617,                                                +        
               LTH=2                                                            
         MFLD  FLD0621,                                                +        
               LTH=12                                                           
         MFLD  FLD0655,                                                +        
               LTH=2                                                            
         MFLD  FLD0659,                                                +        
               LTH=12                                                           
         MFLD  FLD0717,                                                +        
               LTH=2                                                            
         MFLD  FLD0721,                                                +        
               LTH=12                                                           
         MFLD  FLD0755,                                                +        
               LTH=2                                                            
         MFLD  FLD0759,                                                +        
               LTH=12                                                           
         MFLD  FLD0817,                                                +        
               LTH=2                                                            
         MFLD  FLD0821,                                                +        
               LTH=12                                                           
         MFLD  FLD0855,                                                +        
               LTH=2                                                            
         MFLD  FLD0859,                                                +        
               LTH=12                                                           
         MFLD  FLD1012,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1114,                                                +        
               LTH=6                                                            
         MFLD  FLD1122,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I30501 MSG   TYPE=INPUT,                                             +        
               SOR=(W4F305),                                           +        
               OPT=2,                                                  +        
               NXT=W4O30501                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '43051',                                                +        
               LTH=5                                                            
         MFLD  (FLD0209,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0309,                                               +        
               '       '),                                             +        
               LTH=7,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0323,                                               +        
               '    '),                                                +        
               LTH=4,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0333,                                               +        
               '      '),                                              +        
               LTH=6,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0342,                                               +        
               '  '),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0351,                                               +        
               '     '),                                               +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0363,                                               +        
               ' '),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0000,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0001,                                              +        
               '  '),                                                  +        
               LTH=2                                                            
         MFLD  (FLD0511,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0542,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1012,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1122,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
