*          DATA SET W4F321FII0 AT LEVEL 001 AS OF 86/07/02                      
         PRINT NOGEN                                                            
W4F321   FMT                                                                    
         DEV   TYPE=(3270,2),                                          *        
               FEAT=IGNORE,                                            *        
               PFK=(FLDPFK,'W0T501  ','W0T501  ','W0T501  ','W0T501  ',*        
               'W0T501  ','W0T501  ','W4T321 7','W4T321 8','W0T501  ', *        
               'WHELP   ','W0T501  ','/RCL.   ','W4T321  ','W4T322  ', *        
               'W4T323  ','W4T324  ','W4T325  ','W0T501  ','W0T501  ', *        
               'W0T501  ','W0T501  ','WHELP   ','W0T501  ','/RCL.   '),*        
               DSCA=X'0080',SYSMSG=FSYSMSG                                      
         DIV   TYPE=INOUT                                                       
         DPAGE CURSOR=((02,10)),                                       *        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(01,02),LTH=0001,ATTR=(ALPHA,NOPROT,MOD)                     
FLD0104  DFLD  POS=(01,04),LTH=0001,ATTR=(NUM)                                  
FLD0106  DFLD  POS=(01,06),LTH=0001,ATTR=(NUM)                                  
FLD0108  DFLD  POS=(01,08),LTH=0001,ATTR=(NUM)                                  
         DFLD  'EJ RAPPORTERADE RADER / ORDER',                        *        
               POS=(01,10),LTH=0029,ATTR=(NUM,PROT)                             
FLD0140  DFLD  POS=(01,40),LTH=0040,ATTR=(NUM,PROT,HI)                          
         DFLD  'PACKARE',                                              *        
               POS=(02,02),LTH=0007,ATTR=(NUM,PROT)                             
FLD0210  DFLD  POS=(02,10),LTH=0005,ATTR=(NUM)                                  
FLD0310  DFLD  POS=(03,10),LTH=0005,ATTR=(NUM,PROT,MOD)                         
         DFLD  'DISTR',                                                *        
               POS=(02,16),LTH=0005,ATTR=(NUM,PROT)                             
FLD0223  DFLD  POS=(02,22),LTH=0004,ATTR=(NUM)                                  
FLD0323  DFLD  POS=(03,22),LTH=0004,ATTR=(NUM,PROT,MOD)                         
         DFLD  'KUND',                                                 *        
               POS=(02,27),LTH=0004,ATTR=(NUM,PROT)                             
FLD0234  DFLD  POS=(02,32),LTH=0006,ATTR=(NUM)                                  
FLD0334  DFLD  POS=(03,32),LTH=0006,ATTR=(NUM,PROT,MOD)                         
         DFLD  'ORDER',                                                *        
               POS=(02,39),LTH=0005,ATTR=(NUM,PROT)                             
FLD0248  DFLD  POS=(02,45),LTH=0005,ATTR=(NUM)                                  
FLD0348  DFLD  POS=(03,45),LTH=0005,ATTR=(NUM,PROT,MOD)                         
         DFLD  'KOLLI',                                                *        
               POS=(02,51),LTH=0005,ATTR=(NUM,PROT)                             
FLD0261  DFLD  POS=(02,57),LTH=0005,ATTR=(NUM)                                  
FLD0361  DFLD  POS=(03,57),LTH=0005,ATTR=(NUM,PROT,MOD)                         
         DFLD  'PROD',                                                 *        
               POS=(02,63),LTH=0004,ATTR=(NUM,PROT)                             
FLD0274  DFLD  POS=(02,68),LTH=0007,ATTR=(NUM)                                  
FLD0374  DFLD  POS=(03,68),LTH=0007,ATTR=(NUM,PROT,MOD)                         
         DFLD  'DC',                                                   *        
               POS=(02,76),LTH=0002,ATTR=(NUM,PROT)                             
DCI      DFLD  POS=(02,79),LTH=0002,ATTR=(ALPHA,NOPROT)                         
DCO      DFLD  POS=(03,79),LTH=0002,ATTR=(ALPHA,PROT,MOD)                       
         DFLD  '                ANTAL KVAR                             *        
                    ANTAL KVAR         ',                              *        
               POS=(05,02),LTH=0079,ATTR=(NUM,PROT)                             
         DFLD  'OMR FROM - TOM  PÅ DELRAPP  PACK-ID         OMR FROM - *        
               TOM  PÅ DELRAPP  PACK-ID',                              *        
               POS=(06,02),LTH=0079,ATTR=(NUM,PROT)                             
FLD0455  DFLD  POS=(04,55),LTH=0016,ATTR=(NUM,PROT,MOD,NODISP)                  
         DO    13,SUF=07                                                        
COL02    DFLD  POS=(07,02),LTH=0002,ATTR=(NUM,PROT)                             
COL06    DFLD  POS=(07,06),LTH=0004,ATTR=(NUM,PROT)                             
COL12    DFLD  POS=(07,12),LTH=0004,ATTR=(NUM,PROT)                             
COL22    DFLD  POS=(07,22),LTH=0006,ATTR=(NUM,PROT)                             
COL32    DFLD  POS=(07,32),LTH=0005,ATTR=(NUM,PROT)                             
COL46    DFLD  POS=(07,46),LTH=0002,ATTR=(NUM,PROT)                             
COL50    DFLD  POS=(07,50),LTH=0004,ATTR=(NUM,PROT)                             
COL56    DFLD  POS=(07,56),LTH=0004,ATTR=(NUM,PROT)                             
COL66    DFLD  POS=(07,66),LTH=0006,ATTR=(NUM,PROT)                             
COL76    DFLD  POS=(07,76),LTH=0005,ATTR=(NUM,PROT)                             
         ENDDO                                                                  
         DFLD  '13 EJ RAPP RAD  14 PU HUVUD     15 PU RADER     16 PÅB.*        
               EJ AVSL  17 NOLLJAGARE   18              19             *        
                20              21              10 WHELP',             *        
               POS=(21,02),LTH=0152,ATTR=(NUM,PROT)                             
FLD2302  DFLD  POS=(23,02),LTH=0055,ATTR=(NUM,PROT,HI)                          
         DFLD  ' VCP ',POS=(23,58)                                              
FLD2364  DFLD  POS=(23,64),LTH=0008,ATTR=(NUM,PROT)                             
FLD2373  DFLD  POS=(23,73),LTH=0008,ATTR=(NUM,PROT)                             
FSYSMSG  DFLD  POS=(24,02),LTH=0079,ATTR=(NUM,PROT,HI)                          
         FMTEND                                                                 
         EJECT                                                                  
W4O32101 MSG   TYPE=OUTPUT,                                            *        
               SOR=(W4F321,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W4I32101,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  FLD0102,LTH=0001                                                 
         MFLD  FLD0104,LTH=0001                                                 
         MFLD  FLD0106,LTH=0001                                                 
         MFLD  FLD0108,LTH=0001                                                 
         MFLD  FLD0140,LTH=0040                                                 
         MFLD  FLD0210,LTH=0002                                                 
         MFLD  FLD0310,LTH=0005                                                 
         MFLD  FLD0223,LTH=0002                                                 
         MFLD  FLD0323,LTH=0004                                                 
         MFLD  FLD0234,LTH=0002                                                 
         MFLD  FLD0334,LTH=0006                                                 
         MFLD  FLD0248,LTH=0002                                                 
         MFLD  FLD0348,LTH=0005                                                 
         MFLD  FLD0261,LTH=0002                                                 
         MFLD  FLD0361,LTH=0005                                                 
         MFLD  FLD0274,LTH=0002                                                 
         MFLD  FLD0374,LTH=0007                                                 
         MFLD  DCI,LTH=0002                                                     
         MFLD  DCO,LTH=0002                                                     
         MFLD  FLD0455,LTH=0016                                                 
         DO    13,SUF=07                                                        
         MFLD  COL02,LTH=0002                                                   
         MFLD  COL06,LTH=0004                                                   
         MFLD  COL12,LTH=0004                                                   
         MFLD  COL22,LTH=0006                                                   
         MFLD  COL32,LTH=0005                                                   
         MFLD  COL46,LTH=0002                                                   
         MFLD  COL50,LTH=0004                                                   
         MFLD  COL56,LTH=0004                                                   
         MFLD  COL66,LTH=0006                                                   
         MFLD  COL76,LTH=0005                                                   
         ENDDO                                                                  
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=1                                              
         MSGEND                                                                 
         EJECT                                                                  
W4I32101 MSG   TYPE=INPUT,                                             *        
               SOR=W4F321,                                             *        
               OPT=2,                                                  *        
               NXT=W4O32101                                                     
         SEG                                                                    
         MFLD  FLDPFK,LTH=0008,FILL=NULL                                        
         MFLD  'W',LTH=1                                                        
         MFLD  FLD0102,LTH=0001,FILL=C'4'                                       
         MFLD  'T',LTH=1                                                        
         MFLD  FLD0104,LTH=0001,FILL=C'3'                                       
         MFLD  FLD0106,LTH=0001,FILL=C'2'                                       
         MFLD  FLD0108,LTH=0001,FILL=C'1'                                       
         MFLD  '  ',LTH=2                                                       
         MFLD  '43211',LTH=5                                                    
         MFLD  (FLD0210,'+++++'),LTH=0005,FILL=C'0',JUST=R                      
         MFLD  FLD0310,LTH=0005,FILL=C'0'                                       
         MFLD  (FLD0223,'++++'),LTH=0004,FILL=C'0',JUST=R                       
         MFLD  FLD0323,LTH=0004,FILL=C'0'                                       
         MFLD  (FLD0234,'++++++'),LTH=0006,FILL=C'0',JUST=R                     
         MFLD  FLD0334,LTH=0006,FILL=C'0'                                       
         MFLD  (FLD0248,'+++++'),LTH=0005,FILL=C'0',JUST=R                      
         MFLD  FLD0348,LTH=0005,FILL=C'0'                                       
         MFLD  (FLD0261,'+++++'),LTH=0005,FILL=C'0',JUST=R                      
         MFLD  FLD0361,LTH=0005,FILL=C'0'                                       
         MFLD  (FLD0274,'+++++++'),LTH=0007,FILL=C'0',JUST=R                    
         MFLD  FLD0374,LTH=0007,FILL=C'0'                                       
         MFLD  (DCI,'++'),LTH=0002,FILL=X'40'                                   
         MFLD  DCO,LTH=0002,FILL=X'40'                                          
         MFLD  FLD0455,LTH=0016,FILL=C'0'                                       
         MSGEND                                                                 
         EJECT                                                                  
         END                                                                    
