***********************************************************************         
* CREATED BY R038512   ON 91/09/04  AT 11:05                                    
***********************************************************************         
         TITLE 'BULKORDER PLANNING TIMES (4386) '                               
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyzöéüäåÉ'                               
W4F386   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W4T386 7',                                           +        
               8='W4T386 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='R5T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T381  ',                                          +        
               14='W4T382  ',                                          +        
               15='W4T383  ',                                          +        
               16='W4T384  ',                                          +        
               17='W4T385  ',                                          +        
               18='W4T386  ',                                          +        
               19='W4T387  ',                                          +        
               20='W4T388  ',                                          +        
               21='W4T389  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((2,11)),                                        +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Planering bulkorder - ptid',                           +        
               POS=(1,11),LTH=26,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Prod-grp',                                             +        
               POS=(2,2),LTH=8,                                        +        
               ATTR=(ALPHA,PROT)                                                
KDPRCGRP DFLD  POS=(2,11),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'P-klass',                                              +        
               POS=(2,17),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
PRDKL1   DFLD  POS=(2,25),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  '-',                                                    +        
               POS=(2,27),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
PRDKL2   DFLD  POS=(2,29),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'PRC',                                                  +        
               POS=(2,31),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
IDPRC    DFLD  POS=(2,35),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'RFS',                                                  +        
               POS=(2,40),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
TIRFS1   DFLD  POS=(2,44),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(2,51),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
TIRFS2   DFLD  POS=(2,53),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Ber',                                                  +        
               POS=(2,60),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
KDKLK    DFLD  POS=(2,64),LTH=1,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(2,66),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
         DFLD  'DC',                                                   +        
               POS=(2,68),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DCI      DFLD  POS=(2,71),LTH=2,                                       +        
               ATTR=(PROT)                                                      
PRCGRP03 DFLD  POS=(3,11),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
PRDK102  DFLD  POS=(3,25),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
PRDKL203 DFLD  POS=(3,29),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
IDPRC03  DFLD  POS=(3,35),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
TIRFS103 DFLD  POS=(3,44),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
TIRFS203 DFLD  POS=(3,53),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
KDKLK03  DFLD  POS=(3,64),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
DCO      DFLD  POS=(3,71),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
PFE      DFLD  POS=(4,2),LTH=4,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
PF8      DFLD  POS=(4,7),LTH=4,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'O r d e r k ö',                                        +        
               POS=(5,7),LTH=13,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Kapacitet   Dagens produktion',                        +        
               POS=(5,42),LTH=29,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'PRC  Total  Idag Id-kv   Reg  Utskr    Kan',           +        
               POS=(6,2),LTH=42,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '+ -',                                                  +        
               POS=(6,49),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'A',                                                    +        
               POS=(6,59),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'B',                                                    +        
               POS=(6,66),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'C',                                                    +        
               POS=(6,73),LTH=1,                                       +        
               ATTR=(PROT)                                                      
PRC07    DFLD  POS=(7,2),LTH=4,                                        +        
               ATTR=(PROT)                                                      
TT107    DFLD  POS=(7,7),LTH=5,                                        +        
               ATTR=(NUM,PROT)                                                  
TT207    DFLD  POS=(7,13),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
TT307    DFLD  POS=(7,19),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
TT407    DFLD  POS=(7,25),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
TT507    DFLD  POS=(7,32),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
TT607    DFLD  POS=(7,39),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
TT707    DFLD  POS=(7,45),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
TT807    DFLD  POS=(7,54),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
TT907    DFLD  POS=(7,61),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
TTA07    DFLD  POS=(7,68),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
PRC08    DFLD  POS=(8,2),LTH=4,                                        +        
               ATTR=(PROT)                                                      
TT108    DFLD  POS=(8,7),LTH=5,                                        +        
               ATTR=(NUM,PROT)                                                  
TT208    DFLD  POS=(8,13),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
TT308    DFLD  POS=(8,19),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
TT408    DFLD  POS=(8,25),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
TT508    DFLD  POS=(8,32),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
TT608    DFLD  POS=(8,39),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
TT708    DFLD  POS=(8,45),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
TT808    DFLD  POS=(8,54),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
TT908    DFLD  POS=(8,61),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
TTA08    DFLD  POS=(8,68),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
PRC09    DFLD  POS=(9,2),LTH=4,                                        +        
               ATTR=(PROT)                                                      
TT109    DFLD  POS=(9,7),LTH=5,                                        +        
               ATTR=(NUM,PROT)                                                  
TT209    DFLD  POS=(9,13),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
TT309    DFLD  POS=(9,19),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
TT409    DFLD  POS=(9,25),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
TT509    DFLD  POS=(9,32),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
TT609    DFLD  POS=(9,39),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
TT709    DFLD  POS=(9,45),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
TT809    DFLD  POS=(9,54),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
TT909    DFLD  POS=(9,61),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
TTA09    DFLD  POS=(9,68),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
PRC10    DFLD  POS=(10,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
TT110    DFLD  POS=(10,7),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
TT210    DFLD  POS=(10,13),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
TT310    DFLD  POS=(10,19),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
TT410    DFLD  POS=(10,25),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
TT510    DFLD  POS=(10,32),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
TT610    DFLD  POS=(10,39),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
TT710    DFLD  POS=(10,45),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
TT810    DFLD  POS=(10,54),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
TT910    DFLD  POS=(10,61),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
TTA10    DFLD  POS=(10,68),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
PRC11    DFLD  POS=(11,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
TT111    DFLD  POS=(11,7),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
TT211    DFLD  POS=(11,13),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
TT311    DFLD  POS=(11,19),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
TT411    DFLD  POS=(11,25),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
TT511    DFLD  POS=(11,32),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
TT611    DFLD  POS=(11,39),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
TT711    DFLD  POS=(11,45),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
TT811    DFLD  POS=(11,54),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
TT911    DFLD  POS=(11,61),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
TTA11    DFLD  POS=(11,68),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
PRC12    DFLD  POS=(12,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
TT112    DFLD  POS=(12,7),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
TT212    DFLD  POS=(12,13),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
TT312    DFLD  POS=(12,19),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
TT412    DFLD  POS=(12,25),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
TT512    DFLD  POS=(12,32),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
TT612    DFLD  POS=(12,39),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
TT712    DFLD  POS=(12,45),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
TT812    DFLD  POS=(12,54),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
TT912    DFLD  POS=(12,61),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
TTA12    DFLD  POS=(12,68),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
PRC13    DFLD  POS=(13,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
TT113    DFLD  POS=(13,7),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
TT213    DFLD  POS=(13,13),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
TT313    DFLD  POS=(13,19),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
TT413    DFLD  POS=(13,25),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
TT513    DFLD  POS=(13,32),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
TT613    DFLD  POS=(13,39),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
TT713    DFLD  POS=(13,45),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
TT813    DFLD  POS=(13,54),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
TT913    DFLD  POS=(13,61),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
TTA13    DFLD  POS=(13,68),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
PRC14    DFLD  POS=(14,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
TT114    DFLD  POS=(14,7),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
TT214    DFLD  POS=(14,13),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
TT314    DFLD  POS=(14,19),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
TT414    DFLD  POS=(14,25),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
TT514    DFLD  POS=(14,32),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
TT614    DFLD  POS=(14,39),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
TT714    DFLD  POS=(14,45),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
TT814    DFLD  POS=(14,54),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
TT914    DFLD  POS=(14,61),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
TTA14    DFLD  POS=(14,68),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
PRC15    DFLD  POS=(15,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
TT115    DFLD  POS=(15,7),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
TT215    DFLD  POS=(15,13),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
TT315    DFLD  POS=(15,19),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
TT415    DFLD  POS=(15,25),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
TT515    DFLD  POS=(15,32),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
TT615    DFLD  POS=(15,39),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
TT715    DFLD  POS=(15,45),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
TT815    DFLD  POS=(15,54),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
TT915    DFLD  POS=(15,61),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
TTA15    DFLD  POS=(15,68),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
PRC16    DFLD  POS=(16,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
TT116    DFLD  POS=(16,7),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
TT216    DFLD  POS=(16,13),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
TT316    DFLD  POS=(16,19),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
TT416    DFLD  POS=(16,25),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
TT516    DFLD  POS=(16,32),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
TT616    DFLD  POS=(16,39),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
TT716    DFLD  POS=(16,45),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
TT816    DFLD  POS=(16,54),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
TT916    DFLD  POS=(16,61),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
TTA16    DFLD  POS=(16,68),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
PRC17    DFLD  POS=(17,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
TT117    DFLD  POS=(17,7),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
TT217    DFLD  POS=(17,13),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
TT317    DFLD  POS=(17,19),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
TT417    DFLD  POS=(17,25),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
TT517    DFLD  POS=(17,32),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
TT617    DFLD  POS=(17,39),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
TT717    DFLD  POS=(17,45),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
TT817    DFLD  POS=(17,54),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
TT917    DFLD  POS=(17,61),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
TTA17    DFLD  POS=(17,68),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
PRC18    DFLD  POS=(18,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
TT118    DFLD  POS=(18,7),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
TT218    DFLD  POS=(18,13),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
TT318    DFLD  POS=(18,19),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
TT418    DFLD  POS=(18,25),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
TT518    DFLD  POS=(18,32),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
TT618    DFLD  POS=(18,39),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
TT728    DFLD  POS=(18,45),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
TT818    DFLD  POS=(18,54),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
TT918    DFLD  POS=(18,61),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
TTA18    DFLD  POS=(18,68),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'TOT:',                                                 +        
               POS=(19,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
TT119    DFLD  POS=(19,7),LTH=5,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
TT219    DFLD  POS=(19,13),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
TT319    DFLD  POS=(19,19),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
TT419    DFLD  POS=(19,25),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
TT519    DFLD  POS=(19,32),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
TT619    DFLD  POS=(19,39),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
TT719    DFLD  POS=(19,45),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
TT819    DFLD  POS=(19,54),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
TT919    DFLD  POS=(19,61),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
TTA19    DFLD  POS=(19,68),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  '13 Synk PRC stat 14 Synk PRC rad  15 Dagordplan  16 Bem+        
               anning PRC 17 Trpvolym',                                +        
               POS=(21,2),LTH=77,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18 BO-plan  Ptid 19 BO-plan  rad  20 Listbest    21 Pac+        
               kare skift 10 WHELP',                                   +        
               POS=(22,2),LTH=74,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  ' VCP ',POS=(23,58)                                              
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W4I38601 MSG   TYPE=INPUT,                                             +        
               SOR=(W4F386,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4O38601                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F8'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '43861',                                                +        
               LTH=5                                                            
         MFLD  (KDPRCGRP,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (PRDKL1,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (PRDKL2,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (IDPRC,                                                 +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TIRFS1,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (TIRFS2,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (KDKLK,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (DCI,                                                   +        
               '++'),                                                  +        
               LTH=2                                                   +        
               FILL=X'40'                                                       
         MFLD  PRCGRP03,                                               +        
               LTH=5                                                            
         MFLD  PRDK102,                                                +        
               LTH=1                                                            
         MFLD  PRDKL203,                                               +        
               LTH=1                                                            
         MFLD  IDPRC03,                                                +        
               LTH=4                                                            
         MFLD  TIRFS103,                                               +        
               LTH=6                                                            
         MFLD  TIRFS203,                                               +        
               LTH=6                                                            
         MFLD  KDKLK03,                                                +        
               LTH=1                                                            
         MFLD  DCO,                                                    +        
               LTH=2                                                            
         MFLD  PFE,                                                    +        
               LTH=4                                                            
         MFLD  PF8,                                                    +        
               LTH=4                                                            
         MFLD  TT119,                                                  +        
               LTH=5                                                            
         MFLD  TT219,                                                  +        
               LTH=5                                                            
         MFLD  TT319,                                                  +        
               LTH=5                                                            
         MFLD  TT419,                                                  +        
               LTH=5                                                            
         MFLD  TT519,                                                  +        
               LTH=5                                                            
         MFLD  TT619,                                                  +        
               LTH=5                                                            
         MFLD  TT719,                                                  +        
               LTH=7                                                            
         MFLD  TT819,                                                  +        
               LTH=6                                                            
         MFLD  TT919,                                                  +        
               LTH=6                                                            
         MFLD  TTA19,                                                  +        
               LTH=6                                                            
         MSGEND                                                                 
W4O38601 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4F386,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I38601,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  KDPRCGRP,                                               +        
               LTH=5                                                            
         MFLD  PRDKL1,                                                 +        
               LTH=1                                                            
         MFLD  PRDKL2,                                                 +        
               LTH=1                                                            
         MFLD  IDPRC,                                                  +        
               LTH=4                                                            
         MFLD  TIRFS1,                                                 +        
               LTH=6                                                            
         MFLD  TIRFS2,                                                 +        
               LTH=6                                                            
         MFLD  KDKLK,                                                  +        
               LTH=1                                                            
         MFLD  DCI,                                                    +        
               LTH=2                                                            
         MFLD  PRCGRP03,                                               +        
               LTH=5                                                            
         MFLD  PRDK102,                                                +        
               LTH=1                                                            
         MFLD  PRDKL203,                                               +        
               LTH=1                                                            
         MFLD  IDPRC03,                                                +        
               LTH=4                                                            
         MFLD  TIRFS103,                                               +        
               LTH=6                                                            
         MFLD  TIRFS203,                                               +        
               LTH=6                                                            
         MFLD  KDKLK03,                                                +        
               LTH=1                                                            
         MFLD  DCO,                                                    +        
               LTH=2                                                            
         MFLD  PFE,                                                    +        
               LTH=4                                                            
         MFLD  PF8,                                                    +        
               LTH=4                                                            
         MFLD  PRC07,                                                  +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT107,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT207,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT307,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT407,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT507,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT607,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT707,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT807,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT907,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TTA07,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRC08,                                                  +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT108,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT208,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT308,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT408,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT508,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT608,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT708,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT808,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT908,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TTA08,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRC09,                                                  +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT109,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT209,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT309,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT409,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT509,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT609,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT709,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT809,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT909,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TTA09,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRC10,                                                  +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT110,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT210,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT310,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT410,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT510,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT610,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT710,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT810,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT910,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TTA10,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRC11,                                                  +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT111,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT211,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT311,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT411,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT511,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT611,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT711,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT811,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT911,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TTA11,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRC12,                                                  +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT112,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT212,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT312,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT412,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT512,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT612,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT712,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT812,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT912,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TTA12,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRC13,                                                  +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT113,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT213,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT313,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT413,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT513,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT613,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT713,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT813,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT913,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TTA13,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRC14,                                                  +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT114,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT214,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT314,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT414,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT514,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT614,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT714,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT814,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT914,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TTA14,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRC15,                                                  +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT115,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT215,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT315,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT415,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT515,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT615,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT715,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT815,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT915,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TTA15,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRC16,                                                  +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT116,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT216,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT316,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT416,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT516,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT616,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT716,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT816,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT916,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TTA16,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRC17,                                                  +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT117,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT217,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT317,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT417,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT517,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT617,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT717,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT817,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT917,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TTA17,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRC18,                                                  +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT118,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT218,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT318,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT418,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT518,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT618,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT728,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT818,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT918,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TTA18,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT119,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT219,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT319,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT419,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT519,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT619,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT719,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT819,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TT919,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TTA19,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
