***********************************************************************         
* CREATED BY V036147   ON 99/10/22  AT 15:51                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE '                                '                               
W4F331   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T331  ',                                          +        
               14='W4T332  ',                                          +        
               15='W4T333  ',                                          +        
               16='W4T334  ',                                          +        
               17='W4T335  ',                                          +        
               18='W4T336  ',                                          +        
               19='W0T501  ',                                          +        
               20='W4T338  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,8)),                                         +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'KOLLIRAPPORTERING BANDSTATION',                        +        
               POS=(1,10),LTH=29,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD0140  DFLD  POS=(1,40),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'DISTR',                                                +        
               POS=(2,2),LTH=5,                                        +        
               ATTR=(PROT)                                                      
FLD0208  DFLD  POS=(2,8),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'KUND',                                                 +        
               POS=(2,14),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FLD0219  DFLD  POS=(2,19),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'ORDER',                                                +        
               POS=(2,27),LTH=5,                                       +        
               ATTR=(PROT)                                                      
FLD0233  DFLD  POS=(2,33),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'KOLLI',                                                +        
               POS=(2,42),LTH=5,                                       +        
               ATTR=(PROT)                                                      
FLD0248  DFLD  POS=(2,48),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DC',                                                   +        
               POS=(2,56),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DGIA0000 DFLD  POS=(2,59),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'PRODNR',                                               +        
               POS=(2,63),LTH=6,                                       +        
               ATTR=(PROT)                                                      
PRODNRIN DFLD  POS=(2,70),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
FLD0308  DFLD  POS=(3,8),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
FLD0319  DFLD  POS=(3,19),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0333  DFLD  POS=(3,33),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0348  DFLD  POS=(3,48),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0001 DFLD  POS=(3,59),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
PRODNRUT DFLD  POS=(3,70),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'AF-PRIN',                                              +        
               POS=(5,2),LTH=7,                                        +        
               ATTR=(PROT)                                                      
FLD0510  DFLD  POS=(5,10),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'FS-PRIN',                                              +        
               POS=(5,16),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FLD0523  DFLD  POS=(5,24),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
FLD0610  DFLD  POS=(6,10),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0623  DFLD  POS=(6,24),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'KOLLIKOD',                                             +        
               POS=(8,2),LTH=8,                                        +        
               ATTR=(PROT)                                                      
FLD0811  DFLD  POS=(8,11),LTH=8,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'EMB',                                                  +        
               POS=(8,21),LTH=3,                                       +        
               ATTR=(PROT)                                                      
FLD0825  DFLD  POS=(8,25),LTH=1,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'LÄNGD',                                                +        
               POS=(8,28),LTH=5,                                       +        
               ATTR=(PROT)                                                      
FLD0834  DFLD  POS=(8,34),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'BREDD',                                                +        
               POS=(8,40),LTH=5,                                       +        
               ATTR=(PROT)                                                      
FLD0846  DFLD  POS=(8,46),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'HÖJD',                                                 +        
               POS=(8,51),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FLD0856  DFLD  POS=(8,56),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
FLD1502  DFLD  POS=(15,2),LTH=7,                                       +        
               ATTR=(PROT,HI)                                                   
FLD1510  DFLD  POS=(15,10),LTH=3,                                      +        
               ATTR=(NUM,PROT,HI)                                               
FLD1514  DFLD  POS=(15,14),LTH=3,                                      +        
               ATTR=(NUM,PROT,HI)                                               
FLD1518  DFLD  POS=(15,18),LTH=3,                                      +        
               ATTR=(NUM,PROT,HI)                                               
FLD1522  DFLD  POS=(15,22),LTH=3,                                      +        
               ATTR=(NUM,PROT,HI)                                               
FLD1526  DFLD  POS=(15,26),LTH=15,                                     +        
               ATTR=(NUM,PROT,HI)                                               
         DFLD  '13 BANDSTAT EXP 14 RÄTTA KOLLI  15 KOLLIFLAGGA  16 FLYT+        
               TA KOLLI 17 FLERKOLLI',                                 +        
               POS=(21,2),LTH=76,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18 RÄTTA FLERKOLLI 19',                                +        
               POS=(22,2),LTH=21,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20 BANDSTAT SVE 21',                                   +        
               POS=(22,34),LTH=18,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(23,59),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4O33101 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4F331,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I33101,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0140,                                                +        
               LTH=40                                                           
         MFLD  FLD0208,                                                +        
               LTH=2                                                            
         MFLD  FLD0308,                                                +        
               LTH=4                                                            
         MFLD  FLD0219,                                                +        
               LTH=2                                                            
         MFLD  FLD0319,                                                +        
               LTH=6                                                            
         MFLD  FLD0233,                                                +        
               LTH=2                                                            
         MFLD  FLD0333,                                                +        
               LTH=5                                                            
         MFLD  FLD0248,                                                +        
               LTH=2                                                            
         MFLD  FLD0348,                                                +        
               LTH=5                                                            
         MFLD  DGIA0000,                                               +        
               LTH=2                                                            
         MFLD  DGIA0001,                                               +        
               LTH=2                                                            
         MFLD  PRODNRIN,                                               +        
               LTH=2                                                            
         MFLD  PRODNRUT,                                               +        
               LTH=7                                                            
         MFLD  FLD0510,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0610,                                                +        
               LTH=2                                                            
         MFLD  FLD0523,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0623,                                                +        
               LTH=2                                                            
         MFLD  FLD0811,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD0825,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0834,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0846,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0856,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1502,                                                +        
               LTH=7                                                            
         MFLD  FLD1510,                                                +        
               LTH=3                                                            
         MFLD  FLD1514,                                                +        
               LTH=3                                                            
         MFLD  FLD1518,                                                +        
               LTH=3                                                            
         MFLD  FLD1522,                                                +        
               LTH=3                                                            
         MFLD  FLD1526,                                                +        
               LTH=15                                                           
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I33101 MSG   TYPE=INPUT,                                             +        
               SOR=(W4F331),                                           +        
               OPT=2,                                                  +        
               NXT=W4O33101                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '43311',                                                +        
               LTH=5                                                            
         MFLD  (FLD0208,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0308,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0219,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0319,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0233,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0333,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0248,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0348,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0000,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  DGIA0001,                                               +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (PRODNRIN,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  PRODNRUT,                                               +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0510,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  FLD0610,                                                +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0523,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  FLD0623,                                                +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0811,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0825,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0834,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0846,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0856,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
