***********************************************************************         
* CREATED BY PC36147   ON 97/04/10  AT 13:31                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE '                                '                               
W4F316   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W4T316 7',                                           +        
               8='W4T316 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T316U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T311  ',                                          +        
               14='W4T312  ',                                          +        
               15='W4T313  ',                                          +        
               16='W4T314  ',                                          +        
               17='W4T315  ',                                          +        
               18='W4T316  ',                                          +        
               19='W4T317  ',                                          +        
               20='W4T318  ',                                          +        
               21='W4T319  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,10)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'KOLLI RÄTTNING',                                       +        
               POS=(1,10),LTH=14,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'PACKARE',                                              +        
               POS=(2,2),LTH=7,                                        +        
               ATTR=(NUM,PROT)                                                  
FLD0210  DFLD  POS=(2,10),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DIST',                                                 +        
               POS=(2,16),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0002 DFLD  POS=(2,21),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'KUND',                                                 +        
               POS=(2,26),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0232  DFLD  POS=(2,31),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'ORDER',                                                +        
               POS=(2,38),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0007 DFLD  POS=(2,44),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'KOLLI',                                                +        
               POS=(2,50),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0004 DFLD  POS=(2,56),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'PROD',                                                 +        
               POS=(2,62),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0009 DFLD  POS=(2,67),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DC',                                                   +        
               POS=(2,75),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0000 DFLD  POS=(2,78),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FLD0310  DFLD  POS=(3,10),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0003 DFLD  POS=(3,21),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0006 DFLD  POS=(3,31),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0008 DFLD  POS=(3,44),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0005 DFLD  POS=(3,56),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0010 DFLD  POS=(3,67),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0001 DFLD  POS=(3,78),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0459  DFLD  POS=(4,59),LTH=4,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0472  DFLD  POS=(4,72),LTH=5,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'RAD  ANTAL-I-KOLLI  ÅTERBOK  VISA FRÅN RAD',           +        
               POS=(6,3),LTH=42,                                       +        
               ATTR=(PROT)                                                      
FLD0646  DFLD  POS=(6,46),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'ÅTERBOKA HELA SIDAN',                                  +        
               POS=(6,54),LTH=19,                                      +        
               ATTR=(PROT)                                                      
FLD0674  DFLD  POS=(6,74),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL0207  DFLD  POS=(7,2),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
COL1107  DFLD  POS=(7,11),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
COL2607  DFLD  POS=(7,26),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL0208  DFLD  POS=(8,2),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
COL1108  DFLD  POS=(8,11),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
COL2608  DFLD  POS=(8,26),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL0209  DFLD  POS=(9,2),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
COL1109  DFLD  POS=(9,11),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
COL2609  DFLD  POS=(9,26),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL0210  DFLD  POS=(10,2),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1110  DFLD  POS=(10,11),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL2610  DFLD  POS=(10,26),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
COL0211  DFLD  POS=(11,2),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1111  DFLD  POS=(11,11),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL2611  DFLD  POS=(11,26),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
COL0212  DFLD  POS=(12,2),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1112  DFLD  POS=(12,11),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL2612  DFLD  POS=(12,26),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
COL0213  DFLD  POS=(13,2),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1113  DFLD  POS=(13,11),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL2613  DFLD  POS=(13,26),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
COL0214  DFLD  POS=(14,2),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1114  DFLD  POS=(14,11),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL2614  DFLD  POS=(14,26),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
COL0215  DFLD  POS=(15,2),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1115  DFLD  POS=(15,11),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL2615  DFLD  POS=(15,26),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
COL0216  DFLD  POS=(16,2),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1116  DFLD  POS=(16,11),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL2616  DFLD  POS=(16,26),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
COL0217  DFLD  POS=(17,2),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1117  DFLD  POS=(17,11),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL2617  DFLD  POS=(17,26),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
COL0218  DFLD  POS=(18,2),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1118  DFLD  POS=(18,11),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL2618  DFLD  POS=(18,26),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
COL0219  DFLD  POS=(19,2),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1119  DFLD  POS=(19,11),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL2619  DFLD  POS=(19,26),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  '13 DELA ORDER  14 DELA ORD.F/U  15 KOLLIRAPP-3   16 KOL+        
               LIRAPP-1 17 KOLLIRAPP-2',                               +        
               POS=(21,2),LTH=78,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18 KOLLI RÄTTN 19 URSPR.RAPP    20 EJ RAPP.RADER 21',  +        
               POS=(22,2),LTH=51,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10  WHELP',                                            +        
               POS=(22,66),LTH=9,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4O31601 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4F316,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I31601,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  FLD0210,                                                +        
               LTH=2                                                            
         MFLD  FLD0310,                                                +        
               LTH=5                                                            
         MFLD  DGIA0002,                                               +        
               LTH=2                                                            
         MFLD  DGIA0003,                                               +        
               LTH=4                                                            
         MFLD  FLD0232,                                                +        
               LTH=2                                                            
         MFLD  DGIA0006,                                               +        
               LTH=6                                                            
         MFLD  DGIA0007,                                               +        
               LTH=2                                                            
         MFLD  DGIA0008,                                               +        
               LTH=5                                                            
         MFLD  DGIA0004,                                               +        
               LTH=2                                                            
         MFLD  DGIA0005,                                               +        
               LTH=5                                                            
         MFLD  DGIA0009,                                               +        
               LTH=2                                                            
         MFLD  DGIA0010,                                               +        
               LTH=7                                                            
         MFLD  DGIA0000,                                               +        
               LTH=2                                                            
         MFLD  DGIA0001,                                               +        
               LTH=2                                                            
         MFLD  FLD0459,                                                +        
               LTH=4                                                            
         MFLD  FLD0472,                                                +        
               LTH=5                                                            
         MFLD  FLD0646,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0674,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0207,                                                +        
               LTH=4                                                            
         MFLD  COL1107,                                                +        
               LTH=6                                                            
         MFLD  COL2607,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0208,                                                +        
               LTH=4                                                            
         MFLD  COL1108,                                                +        
               LTH=6                                                            
         MFLD  COL2608,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0209,                                                +        
               LTH=4                                                            
         MFLD  COL1109,                                                +        
               LTH=6                                                            
         MFLD  COL2609,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0210,                                                +        
               LTH=4                                                            
         MFLD  COL1110,                                                +        
               LTH=6                                                            
         MFLD  COL2610,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0211,                                                +        
               LTH=4                                                            
         MFLD  COL1111,                                                +        
               LTH=6                                                            
         MFLD  COL2611,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0212,                                                +        
               LTH=4                                                            
         MFLD  COL1112,                                                +        
               LTH=6                                                            
         MFLD  COL2612,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0213,                                                +        
               LTH=4                                                            
         MFLD  COL1113,                                                +        
               LTH=6                                                            
         MFLD  COL2613,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0214,                                                +        
               LTH=4                                                            
         MFLD  COL1114,                                                +        
               LTH=6                                                            
         MFLD  COL2614,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0215,                                                +        
               LTH=4                                                            
         MFLD  COL1115,                                                +        
               LTH=6                                                            
         MFLD  COL2615,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0216,                                                +        
               LTH=4                                                            
         MFLD  COL1116,                                                +        
               LTH=6                                                            
         MFLD  COL2616,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0217,                                                +        
               LTH=4                                                            
         MFLD  COL1117,                                                +        
               LTH=6                                                            
         MFLD  COL2617,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0218,                                                +        
               LTH=4                                                            
         MFLD  COL1118,                                                +        
               LTH=6                                                            
         MFLD  COL2618,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0219,                                                +        
               LTH=4                                                            
         MFLD  COL1119,                                                +        
               LTH=6                                                            
         MFLD  COL2619,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I31601 MSG   TYPE=INPUT,                                             +        
               SOR=(W4F316),                                           +        
               OPT=2,                                                  +        
               NXT=W4O31601                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '43161',                                                +        
               LTH=5                                                            
         MFLD  (FLD0210,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0310,                                                +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0002,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0003,                                               +        
               LTH=4                                                            
         MFLD  (FLD0232,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0006,                                               +        
               LTH=6                                                            
         MFLD  (DGIA0007,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0008,                                               +        
               LTH=5                                                            
         MFLD  (DGIA0004,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0005,                                               +        
               LTH=5                                                            
         MFLD  (DGIA0009,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0010,                                               +        
               LTH=7                                                            
         MFLD  (DGIA0000,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  DGIA0001,                                               +        
               LTH=2                                                            
         MFLD  FLD0459,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0472,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0646,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0674,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL0207,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1107,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (COL2607,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL0208,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1108,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (COL2608,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL0209,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1109,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (COL2609,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL0210,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1110,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (COL2610,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL0211,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1111,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (COL2611,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL0212,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1112,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (COL2612,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL0213,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1113,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (COL2613,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL0214,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1114,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (COL2614,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL0215,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1115,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (COL2615,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL0216,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1116,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (COL2616,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL0217,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1117,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (COL2617,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL0218,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1118,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (COL2618,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL0219,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1119,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (COL2619,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
