***********************************************************************         
* CREATED BY R038512   ON 91/09/04  AT 11:06                                    
***********************************************************************         
         TITLE 'KNYTA PACKARE TILL SKIFT W4F389 '                               
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyzˆÈ¸‰Â…'                               
W4F389   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W4T389 7',                                           +        
               8='W4T389 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T389U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T381  ',                                          +        
               14='W4T382  ',                                          +        
               15='W4T383  ',                                          +        
               16='W4T384  ',                                          +        
               17='W4T385  ',                                          +        
               18='W4T386  ',                                          +        
               19='W4T387  ',                                          +        
               20='W4T388  ',                                          +        
               21='W4T389  ',                                          +        
               22='WHELP   ',                                          +        
               23='W4T389U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W4F389   DPAGE CURSOR=((2,10)),                                        +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Knyta packare till skift',                             +        
               POS=(1,11),LTH=24,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,40),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Packare',                                              +        
               POS=(2,2),LTH=7,                                        +        
               ATTR=(PROT)                                                      
DGIA0004 DFLD  POS=(2,10),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Skift',                                                +        
               POS=(2,21),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DGIA0000 DFLD  POS=(2,27),LTH=1,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(2,29),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
         DFLD  'DC',                                                   +        
               POS=(2,31),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DCI      DFLD  POS=(2,34),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DGIA0007 DFLD  POS=(3,10),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0002 DFLD  POS=(3,27),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
DCO      DFLD  POS=(3,34),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0003 DFLD  POS=(4,2),LTH=8,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0006 DFLD  POS=(4,12),LTH=8,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'Packare Skift   Packare Skift   Packare Skift   Packare+        
                Skift   Packare Skift',                                +        
               POS=(5,3),LTH=77,                                       +        
               ATTR=(PROT)                                                      
URAD1    DFLD  POS=(6,2),LTH=8,                                        +        
               ATTR=(PROT,MOD)                                                  
SRAD1    DFLD  POS=(6,13),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
URAD14   DFLD  POS=(6,18),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
SRAD14   DFLD  POS=(6,29),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
URAD27   DFLD  POS=(6,34),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
SRAD27   DFLD  POS=(6,45),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
URAD40   DFLD  POS=(6,50),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
SRAD40   DFLD  POS=(6,61),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
URAD53   DFLD  POS=(6,66),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
SRAD53   DFLD  POS=(6,77),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
URAD2    DFLD  POS=(7,2),LTH=8,                                        +        
               ATTR=(PROT,MOD)                                                  
SRAD2    DFLD  POS=(7,13),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
URAD15   DFLD  POS=(7,18),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
SRAD15   DFLD  POS=(7,29),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
URAD28   DFLD  POS=(7,34),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
SRAD28   DFLD  POS=(7,45),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
URAD41   DFLD  POS=(7,50),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
SRAD41   DFLD  POS=(7,61),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
URAD54   DFLD  POS=(7,66),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
SRAD54   DFLD  POS=(7,77),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
URAD3    DFLD  POS=(8,2),LTH=8,                                        +        
               ATTR=(PROT,MOD)                                                  
SRAD3    DFLD  POS=(8,13),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
URAD16   DFLD  POS=(8,18),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
SRAD16   DFLD  POS=(8,29),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
URAD29   DFLD  POS=(8,34),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
SRAD29   DFLD  POS=(8,45),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
URAD42   DFLD  POS=(8,50),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
SRAD42   DFLD  POS=(8,61),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
URAD55   DFLD  POS=(8,66),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
SRAD55   DFLD  POS=(8,77),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
URAD4    DFLD  POS=(9,2),LTH=8,                                        +        
               ATTR=(PROT,MOD)                                                  
SRAD4    DFLD  POS=(9,13),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
URAD17   DFLD  POS=(9,18),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
SRAD17   DFLD  POS=(9,29),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
URAD30   DFLD  POS=(9,34),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
SRAD30   DFLD  POS=(9,45),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
URAD43   DFLD  POS=(9,50),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
SRAD43   DFLD  POS=(9,61),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
URAD56   DFLD  POS=(9,66),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
SRAD56   DFLD  POS=(9,77),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
URAD5    DFLD  POS=(10,2),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
SRAD5    DFLD  POS=(10,13),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
URAD18   DFLD  POS=(10,18),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
SRAD18   DFLD  POS=(10,29),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
URAD31   DFLD  POS=(10,34),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
SRAD31   DFLD  POS=(10,45),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
URAD44   DFLD  POS=(10,50),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
SRAD44   DFLD  POS=(10,61),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
URAD57   DFLD  POS=(10,66),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
SRAD57   DFLD  POS=(10,77),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
URAD6    DFLD  POS=(11,2),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
SRAD6    DFLD  POS=(11,13),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
URAD19   DFLD  POS=(11,18),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
SRAD19   DFLD  POS=(11,29),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
URAD32   DFLD  POS=(11,34),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
SRAD32   DFLD  POS=(11,45),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
URAD45   DFLD  POS=(11,50),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
SRAD45   DFLD  POS=(11,61),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
URAD58   DFLD  POS=(11,66),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
SRAD58   DFLD  POS=(11,77),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
URAD7    DFLD  POS=(12,2),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
SRAD7    DFLD  POS=(12,13),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
URAD20   DFLD  POS=(12,18),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
SRAD20   DFLD  POS=(12,29),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
URAD33   DFLD  POS=(12,34),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
SRAD33   DFLD  POS=(12,45),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
URAD46   DFLD  POS=(12,50),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
SRAD46   DFLD  POS=(12,61),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
URAD59   DFLD  POS=(12,66),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
SRAD59   DFLD  POS=(12,77),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
URAD8    DFLD  POS=(13,2),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
SRAD8    DFLD  POS=(13,13),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
URAD21   DFLD  POS=(13,18),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
SRAD21   DFLD  POS=(13,29),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
URAD34   DFLD  POS=(13,34),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
SRAD34   DFLD  POS=(13,45),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
URAD47   DFLD  POS=(13,50),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
SRAD47   DFLD  POS=(13,61),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
URAD60   DFLD  POS=(13,66),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
SRAD60   DFLD  POS=(13,77),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
URAD9    DFLD  POS=(14,2),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
SRAD9    DFLD  POS=(14,13),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
URAD22   DFLD  POS=(14,18),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
SRAD22   DFLD  POS=(14,29),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
URAD35   DFLD  POS=(14,34),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
SRAD35   DFLD  POS=(14,45),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
URAD48   DFLD  POS=(14,50),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
SRAD48   DFLD  POS=(14,61),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
URAD61   DFLD  POS=(14,66),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
SRAD61   DFLD  POS=(14,77),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
URAD10   DFLD  POS=(15,2),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
SRAD10   DFLD  POS=(15,13),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
URAD23   DFLD  POS=(15,18),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
SRAD23   DFLD  POS=(15,29),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
URAD36   DFLD  POS=(15,34),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
SRAD36   DFLD  POS=(15,45),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
URAD49   DFLD  POS=(15,50),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
SRAD49   DFLD  POS=(15,61),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
URAD62   DFLD  POS=(15,66),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
SRAD62   DFLD  POS=(15,77),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
URAD11   DFLD  POS=(16,2),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
SRAD11   DFLD  POS=(16,13),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
URAD24   DFLD  POS=(16,18),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
SRAD24   DFLD  POS=(16,29),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
URAD37   DFLD  POS=(16,34),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
SRAD37   DFLD  POS=(16,45),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
URAD50   DFLD  POS=(16,50),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
SRAD50   DFLD  POS=(16,61),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
URAD63   DFLD  POS=(16,66),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
SRAD63   DFLD  POS=(16,77),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
URAD12   DFLD  POS=(17,2),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
SRAD12   DFLD  POS=(17,13),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
URAD25   DFLD  POS=(17,18),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
SRAD25   DFLD  POS=(17,29),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
URAD38   DFLD  POS=(17,34),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
SRAD38   DFLD  POS=(17,45),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
URAD51   DFLD  POS=(17,50),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
SRAD51   DFLD  POS=(17,61),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
URAD64   DFLD  POS=(17,66),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
SRAD64   DFLD  POS=(17,77),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
URAD13   DFLD  POS=(18,2),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
SRAD13   DFLD  POS=(18,13),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
URAD26   DFLD  POS=(18,18),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
SRAD26   DFLD  POS=(18,29),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
URAD39   DFLD  POS=(18,34),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
SRAD39   DFLD  POS=(18,45),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
URAD52   DFLD  POS=(18,50),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
SRAD52   DFLD  POS=(18,61),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
URAD65   DFLD  POS=(18,66),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
SRAD65   DFLD  POS=(18,77),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Packare',                                              +        
               POS=(19,2),LTH=7,                                       +        
               ATTR=(PROT)                                                      
DGIA0005 DFLD  POS=(19,10),LTH=8,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Skift',                                                +        
               POS=(19,20),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0001 DFLD  POS=(19,26),LTH=1,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  ' ',                                                    +        
               POS=(19,28),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
         DFLD  '13 Synk PRC stat 14 Synk PRC rad  15 Dagordplan 16 Bema+        
               nning PRC 17 Trpvolym',                                 +        
               POS=(21,2),LTH=76,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18 BO-plan  Ptid 19 BO-plan  rad  20 Listbest   21 Pack+        
               are skift 10 Whelp',                                    +        
               POS=(22,2),LTH=73,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  ' VCP ',POS=(23,58)                                              
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W4I38901 MSG   TYPE=INPUT,                                             +        
               SOR=(W4F389,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4O38901                                                     
MID      LPAGE SOR=(W4F389)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  (IDTRANS1,                                              +        
               '4'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  (IDTRANS2,                                              +        
               '3'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  (IDTRANS3,                                              +        
               '8'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F8'                                                       
         MFLD  (IDTRANS4,                                              +        
               '9'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F9'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '43891',                                                +        
               LTH=5                                                            
         MFLD  (DGIA0004,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0007,                                               +        
               LTH=8                                                            
         MFLD  (DGIA0000,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  DGIA0002,                                               +        
               LTH=1                                                            
         MFLD  (DCI,                                                   +        
               '++'),                                                  +        
               LTH=2                                                   +        
               FILL=X'40'                                                       
         MFLD  DCO,                                                    +        
               LTH=2                                                            
         MFLD  DGIA0003,                                               +        
               LTH=8                                                            
         MFLD  DGIA0006,                                               +        
               LTH=8                                                            
         MFLD  (DGIA0005,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0001,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4O38901 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4F389,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I38901,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W4F389                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  DGIA0004,                                               +        
               LTH=2                                                            
         MFLD  DGIA0007,                                               +        
               LTH=8                                                            
         MFLD  DGIA0000,                                               +        
               LTH=2                                                            
         MFLD  DGIA0002,                                               +        
               LTH=1                                                            
         MFLD  DCI,                                                    +        
               LTH=2                                                            
         MFLD  DCO,                                                    +        
               LTH=2                                                            
         MFLD  DGIA0003,                                               +        
               LTH=8                                                            
         MFLD  DGIA0006,                                               +        
               LTH=8                                                            
         MFLD  URAD1,                                                  +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  SRAD1,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  URAD2,                                                  +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  SRAD2,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  URAD3,                                                  +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  SRAD3,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  URAD4,                                                  +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  SRAD4,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  URAD5,                                                  +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  SRAD5,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  URAD6,                                                  +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  SRAD6,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  URAD7,                                                  +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  SRAD7,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  URAD8,                                                  +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  SRAD8,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  URAD9,                                                  +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  SRAD9,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  URAD10,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  SRAD10,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  URAD11,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  SRAD11,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  URAD12,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  SRAD12,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  URAD13,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  SRAD13,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  URAD14,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  SRAD14,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  URAD15,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  SRAD15,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  URAD16,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  SRAD16,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  URAD17,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  SRAD17,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  URAD18,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  SRAD18,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  URAD19,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  SRAD19,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  URAD20,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  SRAD20,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  URAD21,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  SRAD21,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  URAD22,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  SRAD22,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  URAD23,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  SRAD23,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  URAD24,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  SRAD24,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  URAD25,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  SRAD25,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  URAD26,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  SRAD26,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  URAD27,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  SRAD27,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  URAD28,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  SRAD28,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  URAD29,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  SRAD29,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  URAD30,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  SRAD30,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  URAD31,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  SRAD31,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  URAD32,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  SRAD32,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  URAD33,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  SRAD33,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  URAD34,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  SRAD34,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  URAD35,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  SRAD35,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  URAD36,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  SRAD36,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  URAD37,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  SRAD37,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  URAD38,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  SRAD38,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  URAD39,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  SRAD39,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  URAD40,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  SRAD40,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  URAD41,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  SRAD41,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  URAD42,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  SRAD42,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  URAD43,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  SRAD43,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  URAD44,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  SRAD44,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  URAD45,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  SRAD45,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  URAD46,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  SRAD46,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  URAD47,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  SRAD47,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  URAD48,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  SRAD48,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  URAD49,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  SRAD49,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  URAD50,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  SRAD50,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  URAD51,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  SRAD51,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  URAD52,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  SRAD52,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  URAD53,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  SRAD53,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  URAD54,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  SRAD54,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  URAD55,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  SRAD55,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  URAD56,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  SRAD56,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  URAD57,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  SRAD57,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  URAD58,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  SRAD58,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  URAD59,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  SRAD59,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  URAD60,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  SRAD60,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  URAD61,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  SRAD61,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  URAD62,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  SRAD62,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  URAD63,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  SRAD63,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  URAD64,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  SRAD64,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  URAD65,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  SRAD65,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0005,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0001,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
