***********************************************************************         
* CREATED BY PCC4448   ON 95/02/14  AT 14:29                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'BYGGTIDER FÖR SATSER TEST       '                               
W4F358   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T358U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W4T354  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W4T358  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W4T358U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((2,13)),                                        +        
               FILL=PT                                                          
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Byggtider för satser',                                 +        
               POS=(1,12),LTH=20,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,34),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Artikelnr',                                            +        
               POS=(2,2),LTH=9,                                        +        
               ATTR=(PROT)                                                      
IDARTNRI DFLD  POS=(2,13),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
IDARTNRU DFLD  POS=(3,13),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Benämning',                                            +        
               POS=(5,2),LTH=9,                                        +        
               ATTR=(PROT)                                                      
BEART    DFLD  POS=(5,12),LTH=25,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Tim',                                                  +        
               POS=(5,38),LTH=3,                                       +        
               ATTR=(ALPHA,PROT)                                                
TIHH     DFLD  POS=(5,42),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Min',                                                  +        
               POS=(5,46),LTH=3,                                       +        
               ATTR=(PROT)                                                      
TIMM     DFLD  POS=(5,50),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Tim   Min',                                            +        
               POS=(18,4),LTH=9,                                       +        
               ATTR=(PROT)                                                      
DGIA0000 DFLD  POS=(19,5),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0001 DFLD  POS=(19,11),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '13',                                                   +        
               POS=(21,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '14',                                                   +        
               POS=(21,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '15',                                                   +        
               POS=(21,35),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16 Satskö PRC  17',                                    +        
               POS=(21,51),LTH=17,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20 Byggtid sats 21',                                   +        
               POS=(22,35),LTH=18,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2372  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NOPROT)                                                    
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4I35801 MSG   TYPE=INPUT,                                             +        
               SOR=(W4F358),                                           +        
               OPT=2,                                                  +        
               NXT=W4I35801                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F8'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '43581',                                                +        
               LTH=5                                                            
         MFLD  (IDARTNRI,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDARTNRU,                                               +        
               LTH=9                                                            
         MFLD  (DGIA0000,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0001,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
W4O35801 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4F358,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I35801,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDARTNRI,                                               +        
               LTH=9                                                            
         MFLD  IDARTNRU,                                               +        
               LTH=9                                                            
         MFLD  BEART,                                                  +        
               LTH=25                                                           
         MFLD  TIHH,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TIMM,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0000,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0001,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2372,                                               +        
               TIME)                                                            
         MFLD  FSYSMSG,                                                +        
               LTH=79                                                           
         MSGEND                                                                 
         END                                                                    
