***********************************************************************         
* CREATED BY PC36147   ON 95/10/17  AT 08:26                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'PLANERING DAGORDER(SCREEN 4383) '                               
W4F383   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W4T383 7',                                           +        
               8='W4T383 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T381  ',                                          +        
               14='W4T382  ',                                          +        
               15='W4T383  ',                                          +        
               16='W4T384  ',                                          +        
               17='W4T385  ',                                          +        
               18='W4T386  ',                                          +        
               19='W4T387  ',                                          +        
               20='W4T388  ',                                          +        
               21='W4T389  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((2,6)),                                         +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Planering dagorder',                                   +        
               POS=(1,11),LTH=18,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'PRC',                                                  +        
               POS=(2,2),LTH=3,                                        +        
               ATTR=(ALPHA,PROT)                                                
PRC2     DFLD  POS=(2,6),LTH=4,                                        +        
               ATTR=(NOPROT)                                                    
         DFLD  'RFS',                                                  +        
               POS=(2,11),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
RFSDAT2  DFLD  POS=(2,15),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
RFSTM2   DFLD  POS=(2,22),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Trpid',                                                +        
               POS=(2,27),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
TRP2     DFLD  POS=(2,33),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Avt-tid',                                              +        
               POS=(2,39),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
TRPDAT2  DFLD  POS=(2,47),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
TRPTM2   DFLD  POS=(2,54),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DC',                                                   +        
               POS=(2,59),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DC2      DFLD  POS=(2,62),LTH=2,                                       +        
               ATTR=(PROT)                                                      
PRC3     DFLD  POS=(3,6),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
RFSDAT3  DFLD  POS=(3,15),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
RFSTM3   DFLD  POS=(3,22),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
TRP3     DFLD  POS=(3,33),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
TRPDAT3  DFLD  POS=(3,47),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
TRPTM3   DFLD  POS=(3,54),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DC3      DFLD  POS=(3,62),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
F8ORDER  DFLD  POS=(4,2),LTH=7,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
F8PRODNR DFLD  POS=(4,10),LTH=7,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
F8PLKLST DFLD  POS=(4,18),LTH=3,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
F8TIRFS  DFLD  POS=(4,22),LTH=10,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
F8PRCVAR DFLD  POS=(4,33),LTH=1,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
FEORDER  DFLD  POS=(4,35),LTH=7,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
FEPRODNR DFLD  POS=(4,43),LTH=7,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
FEPLKLST DFLD  POS=(4,51),LTH=3,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
FETIRFS  DFLD  POS=(4,55),LTH=10,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
FEPRCVAR DFLD  POS=(4,66),LTH=1,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
FXIDPRC  DFLD  POS=(4,68),LTH=4,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'LST',                                                  +        
               POS=(5,7),LTH=3,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'Ptid',                                                 +        
               POS=(5,16),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'RFS',                                                  +        
               POS=(5,25),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Rad LO-10    Vikt   Volym   Order Trpid  MP',          +        
               POS=(5,35),LTH=43,                                      +        
               ATTR=(PROT)                                                      
LST06    DFLD  POS=(6,2),LTH=11,                                       +        
               ATTR=(PROT)                                                      
TID06    DFLD  POS=(6,14),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
RFS06    DFLD  POS=(6,21),LTH=11,                                      +        
               ATTR=(NUM,PROT)                                                  
RAD06    DFLD  POS=(6,33),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
MEZ06    DFLD  POS=(6,39),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
VIKT06   DFLD  POS=(6,45),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
VOL06    DFLD  POS=(6,53),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
ORD06    DFLD  POS=(6,61),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
TRP06    DFLD  POS=(6,69),LTH=5,                                       +        
               ATTR=(PROT)                                                      
M        DFLD  POS=(6,75),LTH=3,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
LST07    DFLD  POS=(7,2),LTH=11,                                       +        
               ATTR=(PROT)                                                      
TID07    DFLD  POS=(7,14),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
RFS07    DFLD  POS=(7,21),LTH=11,                                      +        
               ATTR=(NUM,PROT)                                                  
RAD07    DFLD  POS=(7,33),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
MEZ07    DFLD  POS=(7,39),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
VIKT07   DFLD  POS=(7,45),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
VOL07    DFLD  POS=(7,53),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
ORD07    DFLD  POS=(7,61),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
TRP07    DFLD  POS=(7,69),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '***',                                                  +        
               POS=(7,75),LTH=3,                                       +        
               ATTR=(ALPHA,PROT)                                                
LST08    DFLD  POS=(8,2),LTH=11,                                       +        
               ATTR=(PROT)                                                      
TID08    DFLD  POS=(8,14),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
RFS08    DFLD  POS=(8,21),LTH=11,                                      +        
               ATTR=(NUM,PROT)                                                  
RAD08    DFLD  POS=(8,33),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
MEZ08    DFLD  POS=(8,39),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
VIKT08   DFLD  POS=(8,45),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
VOL08    DFLD  POS=(8,53),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
ORD08    DFLD  POS=(8,61),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
TRP08    DFLD  POS=(8,69),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'PU',                                                   +        
               POS=(8,76),LTH=2,                                       +        
               ATTR=(PROT)                                                      
LST09    DFLD  POS=(9,2),LTH=11,                                       +        
               ATTR=(PROT)                                                      
TID09    DFLD  POS=(9,14),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
RFS09    DFLD  POS=(9,21),LTH=11,                                      +        
               ATTR=(NUM,PROT)                                                  
RAD09    DFLD  POS=(9,33),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
MEZ09    DFLD  POS=(9,39),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
VIKT09   DFLD  POS=(9,45),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
VOL09    DFLD  POS=(9,53),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
ORD09    DFLD  POS=(9,61),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
TRP09    DFLD  POS=(9,69),LTH=5,                                       +        
               ATTR=(PROT)                                                      
P        DFLD  POS=(9,75),LTH=3,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
LST10    DFLD  POS=(10,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
TID10    DFLD  POS=(10,14),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
RFS10    DFLD  POS=(10,21),LTH=11,                                     +        
               ATTR=(NUM,PROT)                                                  
RAD10    DFLD  POS=(10,33),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
MEZ10    DFLD  POS=(10,39),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
VIKT10   DFLD  POS=(10,45),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
VOL10    DFLD  POS=(10,53),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
ORD10    DFLD  POS=(10,61),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
TRP10    DFLD  POS=(10,69),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '***',                                                  +        
               POS=(10,75),LTH=3,                                      +        
               ATTR=(ALPHA,PROT)                                                
LST11    DFLD  POS=(11,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
TID11    DFLD  POS=(11,14),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
RFS11    DFLD  POS=(11,21),LTH=11,                                     +        
               ATTR=(NUM,PROT)                                                  
RAD11    DFLD  POS=(11,33),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
MEZ11    DFLD  POS=(11,39),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
VIKT11   DFLD  POS=(11,45),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
VOL11    DFLD  POS=(11,53),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
ORD11    DFLD  POS=(11,61),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
TRP11    DFLD  POS=(11,69),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
LST12    DFLD  POS=(12,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
TID12    DFLD  POS=(12,14),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
RFS12    DFLD  POS=(12,21),LTH=11,                                     +        
               ATTR=(NUM,PROT)                                                  
RAD12    DFLD  POS=(12,33),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
MEZ12    DFLD  POS=(12,39),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
VIKT12   DFLD  POS=(12,45),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
VOL12    DFLD  POS=(12,53),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
ORD12    DFLD  POS=(12,61),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
TRP12    DFLD  POS=(12,69),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
LST13    DFLD  POS=(13,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
TID13    DFLD  POS=(13,14),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
RFS13    DFLD  POS=(13,21),LTH=11,                                     +        
               ATTR=(NUM,PROT)                                                  
RAD13    DFLD  POS=(13,33),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
MEZ13    DFLD  POS=(13,39),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
VIKT13   DFLD  POS=(13,45),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
VOL13    DFLD  POS=(13,53),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
ORD13    DFLD  POS=(13,61),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
TRP13    DFLD  POS=(13,69),LTH=5,                                      +        
               ATTR=(PROT)                                                      
LST14    DFLD  POS=(14,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
TID14    DFLD  POS=(14,14),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
RFS14    DFLD  POS=(14,21),LTH=11,                                     +        
               ATTR=(NUM,PROT)                                                  
RAD14    DFLD  POS=(14,33),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
MEZ14    DFLD  POS=(14,39),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
VIKT14   DFLD  POS=(14,45),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
VOL14    DFLD  POS=(14,53),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
ORD14    DFLD  POS=(14,61),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
TRP14    DFLD  POS=(14,69),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
LST15    DFLD  POS=(15,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
TID15    DFLD  POS=(15,14),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
RFS15    DFLD  POS=(15,21),LTH=11,                                     +        
               ATTR=(NUM,PROT)                                                  
RAD15    DFLD  POS=(15,33),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
MEZ15    DFLD  POS=(15,39),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
VIKT15   DFLD  POS=(15,45),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
VOL15    DFLD  POS=(15,53),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
ORD15    DFLD  POS=(15,61),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
TRP15    DFLD  POS=(15,69),LTH=5,                                      +        
               ATTR=(PROT)                                                      
LST16    DFLD  POS=(16,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
TID16    DFLD  POS=(16,14),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
RFS16    DFLD  POS=(16,21),LTH=11,                                     +        
               ATTR=(NUM,PROT)                                                  
RAD16    DFLD  POS=(16,33),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
MEZ16    DFLD  POS=(16,39),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
VIKT16   DFLD  POS=(16,45),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
VOL16    DFLD  POS=(16,53),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
ORD16    DFLD  POS=(16,61),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
TRP16    DFLD  POS=(16,69),LTH=5,                                      +        
               ATTR=(PROT)                                                      
LST17    DFLD  POS=(17,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
TID17    DFLD  POS=(17,14),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
RFS17    DFLD  POS=(17,21),LTH=11,                                     +        
               ATTR=(NUM,PROT)                                                  
RAD17    DFLD  POS=(17,33),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
MEZ17    DFLD  POS=(17,39),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
VIKT17   DFLD  POS=(17,45),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
VOL17    DFLD  POS=(17,53),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
ORD17    DFLD  POS=(17,61),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
TRP17    DFLD  POS=(17,69),LTH=5,                                      +        
               ATTR=(PROT)                                                      
LST18    DFLD  POS=(18,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
TID18    DFLD  POS=(18,14),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
RFS18    DFLD  POS=(18,21),LTH=11,                                     +        
               ATTR=(NUM,PROT)                                                  
RAD18    DFLD  POS=(18,33),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
MEZ18    DFLD  POS=(18,39),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
VIKT18   DFLD  POS=(18,45),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
VOL18    DFLD  POS=(18,53),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
ORD18    DFLD  POS=(18,61),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
TRP18    DFLD  POS=(18,69),LTH=5,                                      +        
               ATTR=(PROT)                                                      
LST19    DFLD  POS=(19,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
TID19    DFLD  POS=(19,14),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
RFS19    DFLD  POS=(19,21),LTH=11,                                     +        
               ATTR=(NUM,PROT)                                                  
RAD19    DFLD  POS=(19,33),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
MEZ19    DFLD  POS=(19,39),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
VIKT19   DFLD  POS=(19,45),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
VOL19    DFLD  POS=(19,53),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
ORD19    DFLD  POS=(19,61),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
TRP19    DFLD  POS=(19,69),LTH=5,                                      +        
               ATTR=(PROT)                                                      
F8LST    DFLD  POS=(20,2),LTH=10,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
FELST    DFLD  POS=(20,14),LTH=10,                                     +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  '13 Synk PRC Stat 14 Synk PRC rad  15 Dagordplan. 16 Bem+        
               anning PRC 17 Trpvolym',                                +        
               POS=(21,2),LTH=77,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18 BO-plan  Ptid 19 BO-plan  rad  20 Listbest.   21 Pac+        
               kare skift 10 WHELP',                                   +        
               POS=(22,2),LTH=74,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W4I38301 MSG   TYPE=INPUT,                                             +        
               SOR=(W4F383,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4O38301                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F8'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  ' ',                                                    +        
               LTH=2                                                            
         MFLD  '43831',                                                +        
               LTH=5                                                            
         MFLD  (PRC2,                                                  +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (RFSDAT2,                                               +        
               '++++++'),                                              +        
               LTH=6                                                            
         MFLD  (RFSTM2,                                                +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (TRP2,                                                  +        
               '+++++'),                                               +        
               LTH=5                                                            
         MFLD  (TRPDAT2,                                               +        
               '++++++'),                                              +        
               LTH=6                                                            
         MFLD  (TRPTM2,                                                +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (DC2,                                                   +        
               '++'),                                                  +        
               LTH=2                                                            
         MFLD  PRC3,                                                   +        
               LTH=4                                                            
         MFLD  RFSDAT3,                                                +        
               LTH=6                                                            
         MFLD  RFSTM3,                                                 +        
               LTH=4                                                            
         MFLD  TRP3,                                                   +        
               LTH=5                                                            
         MFLD  TRPDAT3,                                                +        
               LTH=6                                                            
         MFLD  TRPTM3,                                                 +        
               LTH=4                                                            
         MFLD  DC3,                                                    +        
               LTH=2                                                            
         MFLD  M,                                                      +        
               LTH=3                                                            
         MFLD  P,                                                      +        
               LTH=3                                                            
         MFLD  F8ORDER,                                                +        
               LTH=7                                                            
         MFLD  F8PRODNR,                                               +        
               LTH=7                                                            
         MFLD  F8PLKLST,                                               +        
               LTH=3                                                            
         MFLD  F8TIRFS,                                                +        
               LTH=10                                                           
         MFLD  F8PRCVAR,                                               +        
               LTH=1                                                            
         MFLD  FEORDER,                                                +        
               LTH=7                                                            
         MFLD  FEPRODNR,                                               +        
               LTH=7                                                            
         MFLD  FEPLKLST,                                               +        
               LTH=3                                                            
         MFLD  FETIRFS,                                                +        
               LTH=10                                                           
         MFLD  FEPRCVAR,                                               +        
               LTH=1                                                            
         MFLD  FXIDPRC,                                                +        
               LTH=4                                                            
         MFLD  F8LST,                                                  +        
               LTH=10                                                           
         MFLD  FELST,                                                  +        
               LTH=10                                                           
         MSGEND                                                                 
W4O38301 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4F383,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I38301,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  PRC2,                                                   +        
               LTH=4                                                            
         MFLD  RFSDAT2,                                                +        
               LTH=6                                                            
         MFLD  RFSTM2,                                                 +        
               LTH=4                                                            
         MFLD  TRP2,                                                   +        
               LTH=5                                                            
         MFLD  TRPDAT2,                                                +        
               LTH=6                                                            
         MFLD  TRPTM2,                                                 +        
               LTH=4                                                            
         MFLD  DC2,                                                    +        
               LTH=2                                                            
         MFLD  PRC3,                                                   +        
               LTH=4                                                            
         MFLD  RFSDAT3,                                                +        
               LTH=6                                                            
         MFLD  RFSTM3,                                                 +        
               LTH=4                                                            
         MFLD  TRP3,                                                   +        
               LTH=5                                                            
         MFLD  TRPDAT3,                                                +        
               LTH=6                                                            
         MFLD  TRPTM3,                                                 +        
               LTH=4                                                            
         MFLD  DC3,                                                    +        
               LTH=2                                                            
         MFLD  F8ORDER,                                                +        
               LTH=7                                                            
         MFLD  F8PRODNR,                                               +        
               LTH=7                                                            
         MFLD  F8PLKLST,                                               +        
               LTH=3                                                            
         MFLD  F8TIRFS,                                                +        
               LTH=10                                                           
         MFLD  F8PRCVAR,                                               +        
               LTH=1                                                            
         MFLD  FEORDER,                                                +        
               LTH=7                                                            
         MFLD  FEPRODNR,                                               +        
               LTH=7                                                            
         MFLD  FEPLKLST,                                               +        
               LTH=3                                                            
         MFLD  FETIRFS,                                                +        
               LTH=10                                                           
         MFLD  FEPRCVAR,                                               +        
               LTH=1                                                            
         MFLD  FXIDPRC,                                                +        
               LTH=4                                                            
         MFLD  LST06,                                                  +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TID06,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RFS06,                                                  +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  RAD06,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  MEZ06,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VIKT06,                                                 +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VOL06,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ORD06,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TRP06,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LST07,                                                  +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TID07,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RFS07,                                                  +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  RAD07,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  MEZ07,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VIKT07,                                                 +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VOL07,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ORD07,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TRP07,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LST08,                                                  +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TID08,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RFS08,                                                  +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  RAD08,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  MEZ08,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VIKT08,                                                 +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VOL08,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ORD08,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TRP08,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LST09,                                                  +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TID09,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RFS09,                                                  +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  RAD09,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  MEZ09,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VIKT09,                                                 +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VOL09,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ORD09,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TRP09,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LST10,                                                  +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TID10,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RFS10,                                                  +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  RAD10,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  MEZ10,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VIKT10,                                                 +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VOL10,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ORD10,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TRP10,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LST11,                                                  +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TID11,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RFS11,                                                  +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  RAD11,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  MEZ11,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VIKT11,                                                 +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VOL11,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ORD11,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TRP11,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LST12,                                                  +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TID12,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RFS12,                                                  +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  RAD12,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  MEZ12,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VIKT12,                                                 +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VOL12,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ORD12,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TRP12,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LST13,                                                  +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TID13,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RFS13,                                                  +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  RAD13,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  MEZ13,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VIKT13,                                                 +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VOL13,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ORD13,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TRP13,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LST14,                                                  +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TID14,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RFS14,                                                  +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  RAD14,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  MEZ14,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VIKT14,                                                 +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VOL14,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ORD14,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TRP14,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LST15,                                                  +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TID15,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RFS15,                                                  +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  RAD15,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  MEZ15,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VIKT15,                                                 +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VOL15,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ORD15,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TRP15,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LST16,                                                  +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TID16,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RFS16,                                                  +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  RAD16,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  MEZ16,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VIKT16,                                                 +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VOL16,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ORD16,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TRP16,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LST17,                                                  +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TID17,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RFS17,                                                  +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  RAD17,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  MEZ17,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VIKT17,                                                 +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VOL17,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ORD17,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TRP17,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LST18,                                                  +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TID18,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RFS18,                                                  +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  RAD18,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  MEZ18,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VIKT18,                                                 +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VOL18,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ORD18,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TRP18,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LST19,                                                  +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TID19,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RFS19,                                                  +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  RAD19,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  MEZ19,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VIKT19,                                                 +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VOL19,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ORD19,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TRP19,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  M,                                                      +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  P,                                                      +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  F8LST,                                                  +        
               LTH=10                                                           
         MFLD  FELST,                                                  +        
               LTH=10                                                           
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
