***********************************************************************         
* CREATED BY V036147   ON 00/09/11  AT 09:25                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE '                                '                               
W4F341   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T341  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,7)),                                         +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'SKAPA FÖLJESEDEL',                                     +        
               POS=(1,10),LTH=16,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD0140  DFLD  POS=(1,40),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'DIST',                                                 +        
               POS=(2,2),LTH=4,                                        +        
               ATTR=(PROT)                                                      
FLD0208  DFLD  POS=(2,7),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'KUND',                                                 +        
               POS=(2,12),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0220  DFLD  POS=(2,17),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'ORDER',                                                +        
               POS=(2,24),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0234  DFLD  POS=(2,30),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
PLKLSTIN DFLD  POS=(2,36),LTH=1,                                       +        
               ATTR=(NUM,PROT,NODISP)                                           
         DFLD  'KOLLI',                                                +        
               POS=(2,38),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0001 DFLD  POS=(2,44),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'KOLL-TOM',                                             +        
               POS=(2,50),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
KOLLITIN DFLD  POS=(2,59),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'PRNTR',                                                +        
               POS=(2,65),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
PRTVALIN DFLD  POS=(2,71),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'DC',                                                   +        
               POS=(2,75),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DCIN     DFLD  POS=(2,78),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
FLD0308  DFLD  POS=(3,7),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
KUNDUT   DFLD  POS=(3,17),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
ORDERUT  DFLD  POS=(3,30),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
PLKLSTUT DFLD  POS=(3,36),LTH=1,                                       +        
               ATTR=(NUM,PROT,NODISP)                                           
DGIA0002 DFLD  POS=(3,44),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
KOLLITUT DFLD  POS=(3,59),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0003 DFLD  POS=(3,71),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0000 DFLD  POS=(3,78),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Svensk text(J)',                                       +        
               POS=(6,2),LTH=14,                                       +        
               ATTR=(PROT)                                                      
FLD0617  DFLD  POS=(6,17),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  '13',                                                   +        
               POS=(21,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '14',                                                   +        
               POS=(21,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '15',                                                   +        
               POS=(21,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16',                                                   +        
               POS=(21,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,67),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,67),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(23,59),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W4O34101 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4F341,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I34101,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001,                                           +        
               NXT=W4I34101                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0140,                                                +        
               LTH=40                                                           
         MFLD  FLD0208,                                                +        
               LTH=2                                                            
         MFLD  FLD0308,                                                +        
               LTH=4                                                            
         MFLD  FLD0220,                                                +        
               LTH=2                                                            
         MFLD  KUNDUT,                                                 +        
               LTH=6                                                            
         MFLD  FLD0234,                                                +        
               LTH=2                                                            
         MFLD  ORDERUT,                                                +        
               LTH=5                                                            
         MFLD  PLKLSTIN,                                               +        
               LTH=1                                                            
         MFLD  PLKLSTUT,                                               +        
               LTH=1                                                            
         MFLD  DGIA0001,                                               +        
               LTH=2                                                            
         MFLD  DGIA0002,                                               +        
               LTH=5                                                            
         MFLD  KOLLITIN,                                               +        
               LTH=2                                                            
         MFLD  KOLLITUT,                                               +        
               LTH=5                                                            
         MFLD  PRTVALIN,                                               +        
               LTH=2                                                            
         MFLD  DGIA0003,                                               +        
               LTH=2                                                            
         MFLD  DCIN,                                                   +        
               LTH=2                                                            
         MFLD  DGIA0000,                                               +        
               LTH=2                                                            
         MFLD  (FLD0617,                                               +        
               'N'),                                                   +        
               LTH=1                                                            
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I34101 MSG   TYPE=INPUT,                                             +        
               SOR=(W4F341),                                           +        
               OPT=2,                                                  +        
               NXT=W4O34101                                                     
DGI00003 LPAGE SOR=(DGI00001),                                         +        
               NXT=W4O34101                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '43411',                                                +        
               LTH=5                                                            
         MFLD  (FLD0208,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0308,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0220,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KUNDUT,                                                 +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0234,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  ORDERUT,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  PLKLSTIN,                                               +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  PLKLSTUT,                                               +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0001,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0002,                                               +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (KOLLITIN,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KOLLITUT,                                               +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (PRTVALIN,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  DGIA0003,                                               +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DCIN,                                                  +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  DGIA0000,                                               +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  FLD0617,                                                +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
