***********************************************************************         
* CREATED BY PC36147   ON 94/10/28  AT 14:13                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'PRINTER PER PRC FORMAT          '                               
W4F365   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W4T365 7',                                           +        
               8='W4T365 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T365U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T361  ',                                          +        
               14='W4T362  ',                                          +        
               15='W4T363  ',                                          +        
               16='W4T364  ',                                          +        
               17='W4T365  ',                                          +        
               18='W4T366  ',                                          +        
               19='W4T367  ',                                          +        
               20='W4T368  ',                                          +        
               21='W4T369  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W4F365   DPAGE CURSOR=((2,9))                                                   
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Printer per PRC',                                      +        
               POS=(1,11),LTH=15,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'PRC',                                                  +        
               POS=(2,5),LTH=3,                                        +        
               ATTR=(PROT)                                                      
DGIA0068 DFLD  POS=(2,9),LTH=4,                                        +        
               ATTR=(NOPROT)                                                    
         DFLD  'DC',                                                   +        
               POS=(2,15),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DGIA0092 DFLD  POS=(2,18),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DGIA0069 DFLD  POS=(3,9),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
DGIA0093 DFLD  POS=(3,18),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0043 DFLD  POS=(4,2),LTH=2,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0044 DFLD  POS=(4,9),LTH=2,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'Generell printer',                                     +        
               POS=(5,2),LTH=16,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Pu',                                                   +        
               POS=(5,28),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DGIA0070 DFLD  POS=(5,31),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Ple',                                                  +        
               POS=(5,48),LTH=3,                                       +        
               ATTR=(PROT)                                                      
DGIA0046 DFLD  POS=(5,52),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Undantag',                                             +        
               POS=(6,37),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Lag',                                                  +        
               POS=(7,4),LTH=3,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'Pu-  Sid-  Ple-  Sid-',                                +        
               POS=(7,15),LTH=21,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Lag',                                                  +        
               POS=(7,44),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Pu-  Sid-  Ple-  Sid-',                                +        
               POS=(7,55),LTH=21,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'omr  PRC   prt  bryt  prt   bryt',                     +        
               POS=(8,4),LTH=32,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'omr  PRC   prt  bryt  prt   bryt',                     +        
               POS=(8,44),LTH=32,                                      +        
               ATTR=(PROT)                                                      
OMR1     DFLD  POS=(9,5),LTH=2,                                        +        
               ATTR=(PROT)                                                      
IDPRC1   DFLD  POS=(9,9),LTH=4,                                        +        
               ATTR=(PROT)                                                      
DGIA0072 DFLD  POS=(9,15),LTH=3,                                       +        
               ATTR=(PROT)                                                      
DGIA0023 DFLD  POS=(9,20),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DGIA0048 DFLD  POS=(9,26),LTH=3,                                       +        
               ATTR=(PROT)                                                      
DGIA0002 DFLD  POS=(9,32),LTH=1,                                       +        
               ATTR=(PROT)                                                      
OMR11    DFLD  POS=(9,45),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDPRC11  DFLD  POS=(9,49),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0074 DFLD  POS=(9,55),LTH=3,                                       +        
               ATTR=(PROT)                                                      
DGIA0025 DFLD  POS=(9,60),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DGIA0050 DFLD  POS=(9,66),LTH=3,                                       +        
               ATTR=(PROT)                                                      
DGIA0004 DFLD  POS=(9,72),LTH=1,                                       +        
               ATTR=(PROT)                                                      
OMR2     DFLD  POS=(10,5),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDPRC2   DFLD  POS=(10,9),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0083 DFLD  POS=(10,15),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0034 DFLD  POS=(10,20),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0059 DFLD  POS=(10,26),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0013 DFLD  POS=(10,32),LTH=1,                                      +        
               ATTR=(PROT)                                                      
OMR12    DFLD  POS=(10,45),LTH=2,                                      +        
               ATTR=(PROT)                                                      
IDPRC12  DFLD  POS=(10,49),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0075 DFLD  POS=(10,55),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0026 DFLD  POS=(10,60),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0051 DFLD  POS=(10,66),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0005 DFLD  POS=(10,72),LTH=1,                                      +        
               ATTR=(PROT)                                                      
OMR3     DFLD  POS=(11,5),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDPRC3   DFLD  POS=(11,9),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0085 DFLD  POS=(11,15),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0036 DFLD  POS=(11,20),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0061 DFLD  POS=(11,26),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0015 DFLD  POS=(11,32),LTH=1,                                      +        
               ATTR=(PROT)                                                      
OMR13    DFLD  POS=(11,45),LTH=2,                                      +        
               ATTR=(PROT)                                                      
IDPRC13  DFLD  POS=(11,49),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0076 DFLD  POS=(11,55),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0027 DFLD  POS=(11,60),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0052 DFLD  POS=(11,66),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0006 DFLD  POS=(11,72),LTH=1,                                      +        
               ATTR=(PROT)                                                      
OMR4     DFLD  POS=(12,5),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDPRC4   DFLD  POS=(12,9),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0086 DFLD  POS=(12,15),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0037 DFLD  POS=(12,20),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0062 DFLD  POS=(12,26),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0016 DFLD  POS=(12,32),LTH=1,                                      +        
               ATTR=(PROT)                                                      
OMR14    DFLD  POS=(12,45),LTH=2,                                      +        
               ATTR=(PROT)                                                      
IDPRC14  DFLD  POS=(12,49),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0077 DFLD  POS=(12,55),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0028 DFLD  POS=(12,60),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0053 DFLD  POS=(12,66),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0007 DFLD  POS=(12,72),LTH=1,                                      +        
               ATTR=(PROT)                                                      
OMR5     DFLD  POS=(13,5),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDPRC5   DFLD  POS=(13,9),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0087 DFLD  POS=(13,15),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0038 DFLD  POS=(13,20),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0063 DFLD  POS=(13,26),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0017 DFLD  POS=(13,32),LTH=1,                                      +        
               ATTR=(PROT)                                                      
OMR15    DFLD  POS=(13,45),LTH=2,                                      +        
               ATTR=(PROT)                                                      
IDPRC15  DFLD  POS=(13,49),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0078 DFLD  POS=(13,55),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0029 DFLD  POS=(13,60),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0054 DFLD  POS=(13,66),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0008 DFLD  POS=(13,72),LTH=1,                                      +        
               ATTR=(PROT)                                                      
OMR6     DFLD  POS=(14,5),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDPRC6   DFLD  POS=(14,9),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0088 DFLD  POS=(14,15),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0039 DFLD  POS=(14,20),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0064 DFLD  POS=(14,26),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0018 DFLD  POS=(14,32),LTH=1,                                      +        
               ATTR=(PROT)                                                      
OMR16    DFLD  POS=(14,45),LTH=2,                                      +        
               ATTR=(PROT)                                                      
IDPRC16  DFLD  POS=(14,49),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0079 DFLD  POS=(14,55),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0030 DFLD  POS=(14,60),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0055 DFLD  POS=(14,66),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0009 DFLD  POS=(14,72),LTH=1,                                      +        
               ATTR=(PROT)                                                      
OMR7     DFLD  POS=(15,5),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDPRC7   DFLD  POS=(15,9),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0089 DFLD  POS=(15,15),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0040 DFLD  POS=(15,20),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0065 DFLD  POS=(15,26),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0019 DFLD  POS=(15,32),LTH=1,                                      +        
               ATTR=(PROT)                                                      
OMR17    DFLD  POS=(15,45),LTH=2,                                      +        
               ATTR=(PROT)                                                      
IDPRC17  DFLD  POS=(15,49),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0080 DFLD  POS=(15,55),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0031 DFLD  POS=(15,60),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0056 DFLD  POS=(15,66),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0010 DFLD  POS=(15,72),LTH=1,                                      +        
               ATTR=(PROT)                                                      
OMR8     DFLD  POS=(16,5),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDPRC8   DFLD  POS=(16,9),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0090 DFLD  POS=(16,15),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0041 DFLD  POS=(16,20),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0066 DFLD  POS=(16,26),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0020 DFLD  POS=(16,32),LTH=1,                                      +        
               ATTR=(PROT)                                                      
OMR18    DFLD  POS=(16,45),LTH=2,                                      +        
               ATTR=(PROT)                                                      
IDPRC18  DFLD  POS=(16,49),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0081 DFLD  POS=(16,55),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0032 DFLD  POS=(16,60),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0057 DFLD  POS=(16,66),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0011 DFLD  POS=(16,72),LTH=1,                                      +        
               ATTR=(PROT)                                                      
OMR9     DFLD  POS=(17,5),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDPRC9   DFLD  POS=(17,9),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0091 DFLD  POS=(17,15),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0042 DFLD  POS=(17,20),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0067 DFLD  POS=(17,26),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0021 DFLD  POS=(17,32),LTH=1,                                      +        
               ATTR=(PROT)                                                      
OMR19    DFLD  POS=(17,45),LTH=2,                                      +        
               ATTR=(PROT)                                                      
IDPRC19  DFLD  POS=(17,49),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0082 DFLD  POS=(17,55),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0033 DFLD  POS=(17,60),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0058 DFLD  POS=(17,66),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0012 DFLD  POS=(17,72),LTH=1,                                      +        
               ATTR=(PROT)                                                      
OMR10    DFLD  POS=(18,5),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDPRC10  DFLD  POS=(18,9),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0073 DFLD  POS=(18,15),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0024 DFLD  POS=(18,20),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0049 DFLD  POS=(18,26),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0003 DFLD  POS=(18,32),LTH=1,                                      +        
               ATTR=(PROT)                                                      
OMR20    DFLD  POS=(18,45),LTH=2,                                      +        
               ATTR=(PROT)                                                      
IDPRC20  DFLD  POS=(18,49),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0084 DFLD  POS=(18,55),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0035 DFLD  POS=(18,60),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0060 DFLD  POS=(18,66),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0014 DFLD  POS=(18,72),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0045 DFLD  POS=(19,5),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0000 DFLD  POS=(19,9),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0071 DFLD  POS=(19,15),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0022 DFLD  POS=(19,20),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0047 DFLD  POS=(19,26),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0001 DFLD  POS=(19,32),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  ' ',                                                    +        
               POS=(19,34),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
         DFLD  '13 P-klasstab   14 HLO-tabell   15 Ptid-tab',          +        
               POS=(21,2),LTH=43,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16 PRC-regler   17 Printer/PRC',                       +        
               POS=(21,50),LTH=30,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '18 PRCstyr-tab  19 Kundreg',                           +        
               POS=(22,2),LTH=26,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20 Gen arbtid   21 Dagl arbtid  10 WHELP',             +        
               POS=(22,34),LTH=40,                                     +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2374  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4I36501 MSG   TYPE=INPUT,                                             +        
               SOR=(W4F365),                                           +        
               OPT=2,                                                  +        
               NXT=W4O36501                                                     
MID      LPAGE SOR=(W4F365)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  ' ',                                                    +        
               LTH=2                                                            
         MFLD  '43651',                                                +        
               LTH=5                                                            
         MFLD  (DGIA0068,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0069,                                               +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0092,                                              +        
               '++'),                                                  +        
               LTH=2                                                            
         MFLD  DGIA0093,                                               +        
               LTH=2                                                            
         MFLD  DGIA0043,                                               +        
               LTH=2                                                            
         MFLD  DGIA0044,                                               +        
               LTH=2                                                            
         MFLD  (DGIA0070,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0046,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0045,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0000,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0071,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0022,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0047,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0001,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
W4O36501 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4F365,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I36501,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W4F365                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  DGIA0068,                                               +        
               LTH=4                                                            
         MFLD  DGIA0069,                                               +        
               LTH=4                                                            
         MFLD  DGIA0092,                                               +        
               LTH=2                                                            
         MFLD  DGIA0093,                                               +        
               LTH=2                                                            
         MFLD  DGIA0043,                                               +        
               LTH=2                                                            
         MFLD  DGIA0044,                                               +        
               LTH=2                                                            
         MFLD  DGIA0070,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0046,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OMR1,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDPRC1,                                                 +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0072,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0023,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0048,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0002,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OMR2,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDPRC2,                                                 +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0083,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0034,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0059,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0013,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OMR3,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDPRC3,                                                 +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0085,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0036,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0061,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0015,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OMR4,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDPRC4,                                                 +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0086,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0037,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0062,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0016,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OMR5,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDPRC5,                                                 +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0087,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0038,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0063,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0017,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OMR6,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDPRC6,                                                 +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0088,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0039,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0064,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0018,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OMR7,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDPRC7,                                                 +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0089,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0040,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0065,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0019,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OMR8,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDPRC8,                                                 +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0090,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0041,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0066,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0020,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OMR9,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDPRC9,                                                 +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0091,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0042,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0067,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0021,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OMR10,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDPRC10,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0073,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0024,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0049,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0003,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OMR11,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDPRC11,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0074,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0025,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0050,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0004,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OMR12,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDPRC12,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0075,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0026,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0051,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0005,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OMR13,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDPRC13,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0076,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0027,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0052,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0006,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OMR14,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDPRC14,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0077,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0028,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0053,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0007,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OMR15,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDPRC15,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0078,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0029,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0054,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0008,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OMR16,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDPRC16,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0079,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0030,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0055,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0009,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OMR17,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDPRC17,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0080,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0031,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0056,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0010,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OMR18,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDPRC18,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0081,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0032,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0057,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0011,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OMR19,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDPRC19,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0082,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0033,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0058,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0012,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OMR20,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDPRC20,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0084,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0035,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0060,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0014,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0045,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0000,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0071,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0022,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0047,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0001,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2374,                                               +        
               TIME)                                                            
         MFLD  FSYSMSG,                                                +        
               LTH=79                                                           
         MSGEND                                                                 
         END                                                                    
