***********************************************************************         
* CREATED BY PCC4448   ON 95/03/03  AT 14:46                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'ORDERKÖ I PRC                   '                               
W4F352   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W4T352 6',                                           +        
               7='W4T352 7',                                           +        
               8='W4T352 8',                                           +        
               9='W4T352 9',                                           +        
               10='WHELP   ',                                          +        
               11='W4T352U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T351  ',                                          +        
               14='W4T352  ',                                          +        
               15='W4T353  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W4T356  ',                                          +        
               19='W4T357  ',                                          +        
               20='W0T501  ',                                          +        
               21='W4T359  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((2,9)),                                         +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Orderkö i produktionskanal',                           +        
               POS=(1,12),LTH=26,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'PRC',                                                  +        
               POS=(2,5),LTH=3,                                        +        
               ATTR=(PROT)                                                      
DGIA0078 DFLD  POS=(2,9),LTH=4,                                        +        
               ATTR=(NOPROT)                                                    
         DFLD  'Packare',                                              +        
               POS=(2,14),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0110 DFLD  POS=(2,22),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Bord',                                                 +        
               POS=(2,31),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0026 DFLD  POS=(2,36),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Trp-id',                                               +        
               POS=(2,40),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0107 DFLD  POS=(2,47),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DC',                                                   +        
               POS=(2,54),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DGIA0000 DFLD  POS=(2,57),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Plocksats',                                            +        
               POS=(2,61),LTH=9,                                       +        
               ATTR=(PROT)                                                      
FLKLAR   DFLD  POS=(2,71),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'J/N',                                                  +        
               POS=(2,73),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0080 DFLD  POS=(3,9),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
DGIA0111 DFLD  POS=(3,22),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0027 DFLD  POS=(3,36),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0109 DFLD  POS=(3,47),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0001 DFLD  POS=(3,57),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
KVORDENT DFLD  POS=(3,62),LTH=7,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
KVRADENT DFLD  POS=(3,70),LTH=5,                                       +        
               ATTR=(ALPHA,PROT,NODISP,MOD)                                     
DGIA0106 DFLD  POS=(4,1),LTH=5,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0124 DFLD  POS=(4,7),LTH=6,                                        +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0126 DFLD  POS=(4,14),LTH=5,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0130 DFLD  POS=(4,20),LTH=10,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0132 DFLD  POS=(4,31),LTH=6,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KVORDER  DFLD  POS=(4,38),LTH=7,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KVRADER  DFLD  POS=(4,46),LTH=5,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
IDPLKLST DFLD  POS=(4,52),LTH=3,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0064 DFLD  POS=(4,56),LTH=3,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0079 DFLD  POS=(4,60),LTH=4,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0128 DFLD  POS=(4,65),LTH=10,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
         DFLD  'PU-print',                                             +        
               POS=(5,54),LTH=8,                                       +        
               ATTR=(PROT)                                                      
KDPRTPU  DFLD  POS=(5,63),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'PLE-print',                                            +        
               POS=(5,68),LTH=9,                                       +        
               ATTR=(PROT)                                                      
KDPRTPLE DFLD  POS=(5,78),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'P',                                                    +        
               POS=(6,2),LTH=1,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'Dist   Kund  Order',                                   +        
               POS=(6,8),LTH=18,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'LST  P-tid',                                           +        
               POS=(6,32),LTH=10,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'RFS  Rad',                                             +        
               POS=(6,48),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Vikt  Volym Trpid PS',                                 +        
               POS=(6,61),LTH=20,                                      +        
               ATTR=(PROT)                                                      
DGIA0015 DFLD  POS=(7,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
DGIA0082 DFLD  POS=(7,4),LTH=1,                                        +        
               ATTR=(NUM,PROT)                                                  
DGIA0003 DFLD  POS=(7,6),LTH=1,                                        +        
               ATTR=(PROT)                                                      
DGIA0029 DFLD  POS=(7,8),LTH=4,                                        +        
               ATTR=(PROT)                                                      
DGIA0041 DFLD  POS=(7,13),LTH=7,                                       +        
               ATTR=(PROT)                                                      
DGIA0053 DFLD  POS=(7,21),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DGIA0113 DFLD  POS=(7,27),LTH=54,                                      +        
               ATTR=(PROT)                                                      
DGIA0016 DFLD  POS=(8,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
DGIA0083 DFLD  POS=(8,4),LTH=1,                                        +        
               ATTR=(NUM,PROT)                                                  
DGIA0004 DFLD  POS=(8,6),LTH=1,                                        +        
               ATTR=(PROT)                                                      
DGIA0030 DFLD  POS=(8,8),LTH=4,                                        +        
               ATTR=(PROT)                                                      
DGIA0042 DFLD  POS=(8,13),LTH=7,                                       +        
               ATTR=(PROT)                                                      
DGIA0054 DFLD  POS=(8,21),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DGIA0114 DFLD  POS=(8,27),LTH=54,                                      +        
               ATTR=(PROT)                                                      
DGIA0017 DFLD  POS=(9,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
DGIA0084 DFLD  POS=(9,4),LTH=1,                                        +        
               ATTR=(NUM,PROT)                                                  
DGIA0005 DFLD  POS=(9,6),LTH=1,                                        +        
               ATTR=(PROT)                                                      
DGIA0031 DFLD  POS=(9,8),LTH=4,                                        +        
               ATTR=(PROT)                                                      
DGIA0043 DFLD  POS=(9,13),LTH=7,                                       +        
               ATTR=(PROT)                                                      
DGIA0063 DFLD  POS=(9,21),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DGIA0115 DFLD  POS=(9,27),LTH=54,                                      +        
               ATTR=(PROT)                                                      
DGIA0018 DFLD  POS=(10,2),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
DGIA0085 DFLD  POS=(10,4),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0006 DFLD  POS=(10,6),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DGIA0032 DFLD  POS=(10,8),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0044 DFLD  POS=(10,13),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DGIA0055 DFLD  POS=(10,21),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0116 DFLD  POS=(10,27),LTH=54,                                     +        
               ATTR=(PROT)                                                      
DGIA0019 DFLD  POS=(11,2),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
DGIA0086 DFLD  POS=(11,4),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0007 DFLD  POS=(11,6),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DGIA0033 DFLD  POS=(11,8),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0045 DFLD  POS=(11,13),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DGIA0056 DFLD  POS=(11,21),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0117 DFLD  POS=(11,27),LTH=54,                                     +        
               ATTR=(PROT)                                                      
DGIA0020 DFLD  POS=(12,2),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
DGIA0087 DFLD  POS=(12,4),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0008 DFLD  POS=(12,6),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DGIA0034 DFLD  POS=(12,8),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0046 DFLD  POS=(12,13),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DGIA0057 DFLD  POS=(12,21),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0118 DFLD  POS=(12,27),LTH=54,                                     +        
               ATTR=(PROT)                                                      
DGIA0021 DFLD  POS=(13,2),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
DGIA0088 DFLD  POS=(13,4),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0009 DFLD  POS=(13,6),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DGIA0035 DFLD  POS=(13,8),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0047 DFLD  POS=(13,13),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DGIA0058 DFLD  POS=(13,21),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0119 DFLD  POS=(13,27),LTH=54,                                     +        
               ATTR=(PROT)                                                      
DGIA0022 DFLD  POS=(14,2),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
DGIA0089 DFLD  POS=(14,4),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0010 DFLD  POS=(14,6),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DGIA0036 DFLD  POS=(14,8),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0048 DFLD  POS=(14,13),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DGIA0059 DFLD  POS=(14,21),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0120 DFLD  POS=(14,27),LTH=54,                                     +        
               ATTR=(PROT)                                                      
DGIA0023 DFLD  POS=(15,2),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
DGIA0090 DFLD  POS=(15,4),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0011 DFLD  POS=(15,6),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DGIA0037 DFLD  POS=(15,8),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0049 DFLD  POS=(15,13),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DGIA0060 DFLD  POS=(15,21),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0121 DFLD  POS=(15,27),LTH=54,                                     +        
               ATTR=(PROT)                                                      
DGIA0024 DFLD  POS=(16,2),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
DGIA0091 DFLD  POS=(16,4),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0012 DFLD  POS=(16,6),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DGIA0038 DFLD  POS=(16,8),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0050 DFLD  POS=(16,13),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DGIA0061 DFLD  POS=(16,21),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0122 DFLD  POS=(16,27),LTH=54,                                     +        
               ATTR=(PROT)                                                      
DGIA0025 DFLD  POS=(17,2),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
DGIA0092 DFLD  POS=(17,4),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0013 DFLD  POS=(17,6),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DGIA0039 DFLD  POS=(17,8),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0051 DFLD  POS=(17,13),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DGIA0062 DFLD  POS=(17,21),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0123 DFLD  POS=(17,27),LTH=54,                                     +        
               ATTR=(PROT)                                                      
DGIA0093 DFLD  POS=(18,2),LTH=7,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0065 DFLD  POS=(18,10),LTH=3,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0094 DFLD  POS=(18,14),LTH=7,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0066 DFLD  POS=(18,22),LTH=3,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0095 DFLD  POS=(18,26),LTH=7,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0067 DFLD  POS=(18,34),LTH=3,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0096 DFLD  POS=(18,38),LTH=7,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0068 DFLD  POS=(18,46),LTH=3,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0097 DFLD  POS=(18,50),LTH=7,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0069 DFLD  POS=(18,58),LTH=3,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0098 DFLD  POS=(18,62),LTH=7,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0070 DFLD  POS=(18,70),LTH=3,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0099 DFLD  POS=(18,74),LTH=7,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0071 DFLD  POS=(19,2),LTH=3,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0100 DFLD  POS=(19,6),LTH=7,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0072 DFLD  POS=(19,14),LTH=3,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0101 DFLD  POS=(19,18),LTH=7,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0073 DFLD  POS=(19,26),LTH=3,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0102 DFLD  POS=(19,30),LTH=7,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0074 DFLD  POS=(19,38),LTH=3,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0103 DFLD  POS=(19,42),LTH=7,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0075 DFLD  POS=(19,50),LTH=3,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0104 DFLD  POS=(19,54),LTH=7,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0076 DFLD  POS=(19,62),LTH=3,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0134 DFLD  POS=(20,1),LTH=6,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0108 DFLD  POS=(20,8),LTH=5,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0125 DFLD  POS=(20,14),LTH=6,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0127 DFLD  POS=(20,21),LTH=5,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0131 DFLD  POS=(20,27),LTH=10,                                     +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0129 DFLD  POS=(20,38),LTH=10,                                     +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0133 DFLD  POS=(20,49),LTH=6,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0135 DFLD  POS=(20,56),LTH=6,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
         DFLD  '13 Utskrift PS 14 Orderkö i PRC 15 Man utskr   16',    +        
               POS=(21,2),LTH=49,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18 Rad specemb 19 Order per PRC F9 Exp. kund',         +        
               POS=(22,2),LTH=34,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21 Ann utskr ord 22',                                  +        
               POS=(22,49),LTH=19,                                     +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4I35201 MSG   TYPE=INPUT,                                             +        
               SOR=(W4F352),                                           +        
               OPT=2,                                                  +        
               NXT=W4O35201                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '43521',                                                +        
               LTH=5                                                            
         MFLD  (DGIA0078,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  DGIA0080,                                               +        
               LTH=4                                                            
         MFLD  (DGIA0110,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0111,                                               +        
               LTH=8                                                            
         MFLD  (DGIA0026,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  DGIA0027,                                               +        
               LTH=3                                                            
         MFLD  (DGIA0107,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  DGIA0109,                                               +        
               LTH=5                                                            
         MFLD  (DGIA0000,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  DGIA0001,                                               +        
               LTH=2                                                            
         MFLD  KVORDENT,                                               +        
               LTH=7                                                            
         MFLD  KVRADENT,                                               +        
               LTH=5                                                            
         MFLD  DGIA0106,                                               +        
               LTH=5                                                            
         MFLD  DGIA0124,                                               +        
               LTH=6                                                            
         MFLD  DGIA0126,                                               +        
               LTH=5                                                            
         MFLD  DGIA0130,                                               +        
               LTH=10                                                           
         MFLD  DGIA0132,                                               +        
               LTH=6                                                            
         MFLD  KVORDER,                                                +        
               LTH=7                                                            
         MFLD  KVRADER,                                                +        
               LTH=5                                                            
         MFLD  IDPLKLST,                                               +        
               LTH=3                                                            
         MFLD  DGIA0064,                                               +        
               LTH=3                                                            
         MFLD  DGIA0079,                                               +        
               LTH=4                                                            
         MFLD  DGIA0128,                                               +        
               LTH=10                                                           
         MFLD  DGIA0015,                                               +        
               LTH=1                                                            
         MFLD  DGIA0016,                                               +        
               LTH=1                                                            
         MFLD  DGIA0017,                                               +        
               LTH=1                                                            
         MFLD  DGIA0018,                                               +        
               LTH=1                                                            
         MFLD  DGIA0019,                                               +        
               LTH=1                                                            
         MFLD  DGIA0020,                                               +        
               LTH=1                                                            
         MFLD  DGIA0021,                                               +        
               LTH=1                                                            
         MFLD  DGIA0022,                                               +        
               LTH=1                                                            
         MFLD  DGIA0023,                                               +        
               LTH=1                                                            
         MFLD  DGIA0024,                                               +        
               LTH=1                                                            
         MFLD  DGIA0025,                                               +        
               LTH=1                                                            
         MFLD  DGIA0093,                                               +        
               LTH=7                                                            
         MFLD  DGIA0065,                                               +        
               LTH=3                                                            
         MFLD  DGIA0094,                                               +        
               LTH=7                                                            
         MFLD  DGIA0066,                                               +        
               LTH=3                                                            
         MFLD  DGIA0095,                                               +        
               LTH=7                                                            
         MFLD  DGIA0067,                                               +        
               LTH=3                                                            
         MFLD  DGIA0096,                                               +        
               LTH=7                                                            
         MFLD  DGIA0068,                                               +        
               LTH=3                                                            
         MFLD  DGIA0097,                                               +        
               LTH=7                                                            
         MFLD  DGIA0069,                                               +        
               LTH=3                                                            
         MFLD  DGIA0098,                                               +        
               LTH=7                                                            
         MFLD  DGIA0070,                                               +        
               LTH=3                                                            
         MFLD  DGIA0099,                                               +        
               LTH=7                                                            
         MFLD  DGIA0071,                                               +        
               LTH=3                                                            
         MFLD  DGIA0100,                                               +        
               LTH=7                                                            
         MFLD  DGIA0072,                                               +        
               LTH=3                                                            
         MFLD  DGIA0101,                                               +        
               LTH=7                                                            
         MFLD  DGIA0073,                                               +        
               LTH=3                                                            
         MFLD  DGIA0102,                                               +        
               LTH=7                                                            
         MFLD  DGIA0074,                                               +        
               LTH=3                                                            
         MFLD  DGIA0103,                                               +        
               LTH=7                                                            
         MFLD  DGIA0075,                                               +        
               LTH=3                                                            
         MFLD  DGIA0104,                                               +        
               LTH=7                                                            
         MFLD  DGIA0076,                                               +        
               LTH=3                                                            
         MFLD  DGIA0134,                                               +        
               LTH=6                                                            
         MFLD  DGIA0108,                                               +        
               LTH=5                                                            
         MFLD  DGIA0125,                                               +        
               LTH=6                                                            
         MFLD  DGIA0127,                                               +        
               LTH=5                                                            
         MFLD  DGIA0131,                                               +        
               LTH=10                                                           
         MFLD  DGIA0129,                                               +        
               LTH=10                                                           
         MFLD  DGIA0133,                                               +        
               LTH=6                                                            
         MFLD  DGIA0135,                                               +        
               LTH=6                                                            
         MFLD  FLKLAR,                                                 +        
               LTH=1,                                                  +        
               FILL=X'D5'                                                       
         MFLD  (KDPRTPU,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KDPRTPLE,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MSGEND                                                                 
W4O35201 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4F352,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I35201,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  DGIA0078,                                               +        
               LTH=2                                                            
         MFLD  DGIA0080,                                               +        
               LTH=4                                                            
         MFLD  DGIA0110,                                               +        
               LTH=2                                                            
         MFLD  DGIA0111,                                               +        
               LTH=8                                                            
         MFLD  DGIA0026,                                               +        
               LTH=2                                                            
         MFLD  DGIA0027,                                               +        
               LTH=3                                                            
         MFLD  DGIA0107,                                               +        
               LTH=2                                                            
         MFLD  DGIA0109,                                               +        
               LTH=5                                                            
         MFLD  DGIA0000,                                               +        
               LTH=2                                                            
         MFLD  DGIA0001,                                               +        
               LTH=2                                                            
         MFLD  KVORDENT,                                               +        
               LTH=7                                                            
         MFLD  KVRADENT,                                               +        
               LTH=5                                                            
         MFLD  DGIA0106,                                               +        
               LTH=5                                                            
         MFLD  DGIA0124,                                               +        
               LTH=6                                                            
         MFLD  DGIA0126,                                               +        
               LTH=5                                                            
         MFLD  DGIA0130,                                               +        
               LTH=10                                                           
         MFLD  DGIA0132,                                               +        
               LTH=6                                                            
         MFLD  KVORDER,                                                +        
               LTH=7                                                            
         MFLD  KVRADER,                                                +        
               LTH=5                                                            
         MFLD  IDPLKLST,                                               +        
               LTH=3                                                            
         MFLD  DGIA0064,                                               +        
               LTH=3                                                            
         MFLD  DGIA0079,                                               +        
               LTH=4                                                            
         MFLD  DGIA0128,                                               +        
               LTH=10                                                           
         MFLD  DGIA0015,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0082,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0003,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0029,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0041,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0053,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0113,                                               +        
               LTH=56,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0016,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0083,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0004,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0030,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0042,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0054,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0114,                                               +        
               LTH=56,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0017,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0084,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0005,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0031,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0043,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0063,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0115,                                               +        
               LTH=56,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0018,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0085,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0006,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0032,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0044,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0055,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0116,                                               +        
               LTH=56,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0019,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0086,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0007,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0033,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0045,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0056,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0117,                                               +        
               LTH=56,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0020,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0087,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0008,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0034,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0046,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0057,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0118,                                               +        
               LTH=56,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0021,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0088,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0009,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0035,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0047,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0058,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0119,                                               +        
               LTH=56,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0022,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0089,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0010,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0036,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0048,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0059,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0120,                                               +        
               LTH=56,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0023,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0090,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0011,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0037,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0049,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0060,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0121,                                               +        
               LTH=56,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0024,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0091,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0012,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0038,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0050,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0061,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0122,                                               +        
               LTH=56,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0025,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0092,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0013,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0039,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0051,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0062,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0123,                                               +        
               LTH=56,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0093,                                               +        
               LTH=7                                                            
         MFLD  DGIA0065,                                               +        
               LTH=3                                                            
         MFLD  DGIA0094,                                               +        
               LTH=7                                                            
         MFLD  DGIA0066,                                               +        
               LTH=3                                                            
         MFLD  DGIA0095,                                               +        
               LTH=7                                                            
         MFLD  DGIA0067,                                               +        
               LTH=3                                                            
         MFLD  DGIA0096,                                               +        
               LTH=7                                                            
         MFLD  DGIA0068,                                               +        
               LTH=3                                                            
         MFLD  DGIA0097,                                               +        
               LTH=7                                                            
         MFLD  DGIA0069,                                               +        
               LTH=3                                                            
         MFLD  DGIA0098,                                               +        
               LTH=7                                                            
         MFLD  DGIA0070,                                               +        
               LTH=3                                                            
         MFLD  DGIA0099,                                               +        
               LTH=7                                                            
         MFLD  DGIA0071,                                               +        
               LTH=3                                                            
         MFLD  DGIA0100,                                               +        
               LTH=7                                                            
         MFLD  DGIA0072,                                               +        
               LTH=3                                                            
         MFLD  DGIA0101,                                               +        
               LTH=7                                                            
         MFLD  DGIA0073,                                               +        
               LTH=3                                                            
         MFLD  DGIA0102,                                               +        
               LTH=7                                                            
         MFLD  DGIA0074,                                               +        
               LTH=3                                                            
         MFLD  DGIA0103,                                               +        
               LTH=7                                                            
         MFLD  DGIA0075,                                               +        
               LTH=3                                                            
         MFLD  DGIA0104,                                               +        
               LTH=7                                                            
         MFLD  DGIA0076,                                               +        
               LTH=3                                                            
         MFLD  DGIA0134,                                               +        
               LTH=6                                                            
         MFLD  DGIA0108,                                               +        
               LTH=5                                                            
         MFLD  DGIA0125,                                               +        
               LTH=6                                                            
         MFLD  DGIA0127,                                               +        
               LTH=5                                                            
         MFLD  DGIA0131,                                               +        
               LTH=10                                                           
         MFLD  DGIA0129,                                               +        
               LTH=10                                                           
         MFLD  DGIA0133,                                               +        
               LTH=6                                                            
         MFLD  DGIA0135,                                               +        
               LTH=6                                                            
         MFLD  FLKLAR,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDPRTPU,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDPRTPLE,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
