***********************************************************************         
* CREATED BY PC36147   ON 95/02/07  AT 13:35                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'REGISTRERA SPECIALEMBALLAGE RAD '                               
W4F356   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W4T356 7',                                           +        
               8='W4T356 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T356U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T351  ',                                          +        
               14='W4T352  ',                                          +        
               15='W4T353  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W4T356  ',                                          +        
               19='W4T357  ',                                          +        
               20='W0T501  ',                                          +        
               21='W4T359  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W4F356   DPAGE CURSOR=((2,7)),                                         +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Rader/Specialemballage',                               +        
               POS=(1,11),LTH=22,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,40),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Dist',                                                 +        
               POS=(2,2),LTH=4,                                        +        
               ATTR=(PROT)                                                      
DGIA0079 DFLD  POS=(2,7),LTH=4,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Kund',                                                 +        
               POS=(2,12),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0081 DFLD  POS=(2,17),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Ord',                                                  +        
               POS=(2,24),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0174 DFLD  POS=(2,28),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'LO',                                                   +        
               POS=(2,36),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0172 DFLD  POS=(2,39),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Pnr',                                                  +        
               POS=(2,42),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0176 DFLD  POS=(2,46),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Ekod',                                                 +        
               POS=(2,54),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0170 DFLD  POS=(2,59),LTH=1,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Art',                                                  +        
               POS=(2,61),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0000 DFLD  POS=(2,65),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DC',                                                   +        
               POS=(2,75),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0002 DFLD  POS=(2,78),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0080 DFLD  POS=(3,7),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
DGIA0082 DFLD  POS=(3,17),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0175 DFLD  POS=(3,28),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0173 DFLD  POS=(3,39),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0177 DFLD  POS=(3,46),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0171 DFLD  POS=(3,59),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0001 DFLD  POS=(3,65),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0003 DFLD  POS=(3,78),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0063 DFLD  POS=(4,2),LTH=9,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0083 DFLD  POS=(4,12),LTH=3,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0018 DFLD  POS=(4,16),LTH=2,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0064 DFLD  POS=(4,19),LTH=9,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0084 DFLD  POS=(4,29),LTH=3,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0019 DFLD  POS=(4,33),LTH=2,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0099 DFLD  POS=(4,36),LTH=7,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
         DFLD  'Embid',                                                +        
               POS=(5,2),LTH=5,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'Artnr Lnr Ekod   Adress    Urs    Best Benämning',     +        
               POS=(5,17),LTH=48,                                      +        
               ATTR=(PROT)                                                      
DGIA0114 DFLD  POS=(6,3),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
DGIA0100 DFLD  POS=(6,8),LTH=4,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0065 DFLD  POS=(6,13),LTH=9,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0085 DFLD  POS=(6,23),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0142 DFLD  POS=(6,29),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0020 DFLD  POS=(6,32),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0004 DFLD  POS=(6,35),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0035 DFLD  POS=(6,38),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0128 DFLD  POS=(6,45),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0156 DFLD  POS=(6,48),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0049 DFLD  POS=(6,56),LTH=25,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0120 DFLD  POS=(7,3),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
DGIA0106 DFLD  POS=(7,8),LTH=4,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0071 DFLD  POS=(7,13),LTH=9,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0091 DFLD  POS=(7,23),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0148 DFLD  POS=(7,29),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0026 DFLD  POS=(7,32),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0010 DFLD  POS=(7,35),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0041 DFLD  POS=(7,38),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0134 DFLD  POS=(7,45),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0162 DFLD  POS=(7,48),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0055 DFLD  POS=(7,56),LTH=25,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0121 DFLD  POS=(8,3),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
DGIA0107 DFLD  POS=(8,8),LTH=4,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0072 DFLD  POS=(8,13),LTH=9,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0092 DFLD  POS=(8,23),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0149 DFLD  POS=(8,29),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0027 DFLD  POS=(8,32),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0011 DFLD  POS=(8,35),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0042 DFLD  POS=(8,38),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0135 DFLD  POS=(8,45),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0163 DFLD  POS=(8,48),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0056 DFLD  POS=(8,56),LTH=25,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0122 DFLD  POS=(9,3),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
DGIA0108 DFLD  POS=(9,8),LTH=4,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0073 DFLD  POS=(9,13),LTH=9,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0093 DFLD  POS=(9,23),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0150 DFLD  POS=(9,29),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0028 DFLD  POS=(9,32),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0012 DFLD  POS=(9,35),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0043 DFLD  POS=(9,38),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0136 DFLD  POS=(9,45),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0164 DFLD  POS=(9,48),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0057 DFLD  POS=(9,56),LTH=25,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0123 DFLD  POS=(10,3),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0109 DFLD  POS=(10,8),LTH=4,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0074 DFLD  POS=(10,13),LTH=9,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0094 DFLD  POS=(10,23),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0151 DFLD  POS=(10,29),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0029 DFLD  POS=(10,32),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0013 DFLD  POS=(10,35),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0044 DFLD  POS=(10,38),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0137 DFLD  POS=(10,45),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0165 DFLD  POS=(10,48),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0058 DFLD  POS=(10,56),LTH=25,                                     +        
               ATTR=(PROT,MOD)                                                  
DGIA0124 DFLD  POS=(11,3),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0110 DFLD  POS=(11,8),LTH=4,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0075 DFLD  POS=(11,13),LTH=9,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0095 DFLD  POS=(11,23),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0152 DFLD  POS=(11,29),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0030 DFLD  POS=(11,32),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0014 DFLD  POS=(11,35),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0045 DFLD  POS=(11,38),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0138 DFLD  POS=(11,45),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0166 DFLD  POS=(11,48),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0059 DFLD  POS=(11,56),LTH=25,                                     +        
               ATTR=(PROT,MOD)                                                  
DGIA0125 DFLD  POS=(12,3),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0111 DFLD  POS=(12,8),LTH=4,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0076 DFLD  POS=(12,13),LTH=9,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0096 DFLD  POS=(12,23),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0153 DFLD  POS=(12,29),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0031 DFLD  POS=(12,32),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0015 DFLD  POS=(12,35),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0046 DFLD  POS=(12,38),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0139 DFLD  POS=(12,45),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0167 DFLD  POS=(12,48),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0060 DFLD  POS=(12,56),LTH=25,                                     +        
               ATTR=(PROT,MOD)                                                  
DGIA0126 DFLD  POS=(13,3),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0112 DFLD  POS=(13,8),LTH=4,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0077 DFLD  POS=(13,13),LTH=9,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0097 DFLD  POS=(13,23),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0154 DFLD  POS=(13,29),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0032 DFLD  POS=(13,32),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0016 DFLD  POS=(13,35),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0047 DFLD  POS=(13,38),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0140 DFLD  POS=(13,45),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0168 DFLD  POS=(13,48),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0061 DFLD  POS=(13,56),LTH=25,                                     +        
               ATTR=(PROT,MOD)                                                  
DGIA0127 DFLD  POS=(14,3),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0113 DFLD  POS=(14,8),LTH=4,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0078 DFLD  POS=(14,13),LTH=9,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0098 DFLD  POS=(14,23),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0155 DFLD  POS=(14,29),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0033 DFLD  POS=(14,32),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0017 DFLD  POS=(14,35),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0048 DFLD  POS=(14,38),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0141 DFLD  POS=(14,45),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0169 DFLD  POS=(14,48),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0062 DFLD  POS=(14,56),LTH=25,                                     +        
               ATTR=(PROT,MOD)                                                  
DGIA0115 DFLD  POS=(15,3),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0101 DFLD  POS=(15,8),LTH=4,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0066 DFLD  POS=(15,13),LTH=9,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0086 DFLD  POS=(15,23),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0143 DFLD  POS=(15,29),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0021 DFLD  POS=(15,32),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0005 DFLD  POS=(15,35),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0036 DFLD  POS=(15,38),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0129 DFLD  POS=(15,45),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0157 DFLD  POS=(15,48),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0050 DFLD  POS=(15,56),LTH=25,                                     +        
               ATTR=(PROT,MOD)                                                  
DGIA0116 DFLD  POS=(16,3),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0102 DFLD  POS=(16,8),LTH=4,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0067 DFLD  POS=(16,13),LTH=9,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0087 DFLD  POS=(16,23),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0144 DFLD  POS=(16,29),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0022 DFLD  POS=(16,32),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0006 DFLD  POS=(16,35),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0037 DFLD  POS=(16,38),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0130 DFLD  POS=(16,45),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0158 DFLD  POS=(16,48),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0051 DFLD  POS=(16,56),LTH=25,                                     +        
               ATTR=(PROT,MOD)                                                  
DGIA0117 DFLD  POS=(17,3),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0103 DFLD  POS=(17,8),LTH=4,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0068 DFLD  POS=(17,13),LTH=9,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0088 DFLD  POS=(17,23),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0145 DFLD  POS=(17,29),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0023 DFLD  POS=(17,32),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0007 DFLD  POS=(17,35),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0038 DFLD  POS=(17,38),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0131 DFLD  POS=(17,45),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0159 DFLD  POS=(17,48),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0052 DFLD  POS=(17,56),LTH=25,                                     +        
               ATTR=(PROT,MOD)                                                  
DGIA0118 DFLD  POS=(18,3),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0104 DFLD  POS=(18,8),LTH=4,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0069 DFLD  POS=(18,13),LTH=9,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0089 DFLD  POS=(18,23),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0146 DFLD  POS=(18,29),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0024 DFLD  POS=(18,32),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0008 DFLD  POS=(18,35),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0039 DFLD  POS=(18,38),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0132 DFLD  POS=(18,45),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0160 DFLD  POS=(18,48),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0053 DFLD  POS=(18,56),LTH=25,                                     +        
               ATTR=(PROT,MOD)                                                  
DGIA0119 DFLD  POS=(19,3),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0105 DFLD  POS=(19,8),LTH=4,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0070 DFLD  POS=(19,13),LTH=9,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0090 DFLD  POS=(19,23),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0147 DFLD  POS=(19,29),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0025 DFLD  POS=(19,32),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0009 DFLD  POS=(19,35),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0040 DFLD  POS=(19,38),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0133 DFLD  POS=(19,45),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0161 DFLD  POS=(19,48),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0054 DFLD  POS=(19,56),LTH=25,                                     +        
               ATTR=(PROT,MOD)                                                  
DGIA0034 DFLD  POS=(20,2),LTH=70,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  '13 Utskrift Ps  14 Orderkö i PRC 15 Man utskr   16',   +        
               POS=(21,2),LTH=50,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,67),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18 Rad specemb  19 Order per PRC 20',                  +        
               POS=(22,2),LTH=35,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21 Ann utskr ord 22',                                  +        
               POS=(22,50),LTH=19,                                     +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W4I35601 MSG   TYPE=INPUT,                                             +        
               SOR=(W4F356),                                           +        
               OPT=2,                                                  +        
               NXT=W4O35601                                                     
MID      LPAGE SOR=(W4F356)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  (IDTRANS1,                                              +        
               '4'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  (IDTRANS2,                                              +        
               '3'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  (IDTRANS3,                                              +        
               '5'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  (IDTRANS4,                                              +        
               '6'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  ' ',                                                    +        
               LTH=2                                                            
         MFLD  '43561',                                                +        
               LTH=5                                                            
         MFLD  (DGIA0079,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0080,                                              +        
               '    '),                                                +        
               LTH=4                                                            
         MFLD  (DGIA0081,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0082,                                               +        
               LTH=6                                                            
         MFLD  (DGIA0174,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0175,                                               +        
               LTH=7                                                            
         MFLD  (DGIA0172,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0173,                                               +        
               LTH=2                                                            
         MFLD  (DGIA0176,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0177,                                               +        
               LTH=7                                                            
         MFLD  (DGIA0170,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0171,                                               +        
               LTH=1                                                            
         MFLD  (DGIA0000,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0001,                                               +        
               LTH=9                                                            
         MFLD  (DGIA0002,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  DGIA0003,                                               +        
               LTH=2                                                            
         MFLD  DGIA0063,                                               +        
               LTH=9                                                            
         MFLD  DGIA0083,                                               +        
               LTH=3                                                            
         MFLD  DGIA0018,                                               +        
               LTH=2                                                            
         MFLD  DGIA0064,                                               +        
               LTH=9                                                            
         MFLD  DGIA0084,                                               +        
               LTH=3                                                            
         MFLD  DGIA0019,                                               +        
               LTH=2                                                            
         MFLD  DGIA0099,                                               +        
               LTH=7                                                            
         MFLD  DGIA0114,                                               +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0100,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0065,                                               +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0085,                                               +        
               LTH=3                                                            
         MFLD  DGIA0020,                                               +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0004,                                               +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0120,                                               +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0106,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0071,                                               +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0091,                                               +        
               LTH=3                                                            
         MFLD  DGIA0026,                                               +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0010,                                               +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0121,                                              +        
               '    '),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0107,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0072,                                               +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0092,                                               +        
               LTH=3                                                            
         MFLD  DGIA0027,                                               +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0011,                                               +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0122,                                               +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0108,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0073,                                               +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0093,                                               +        
               LTH=3                                                            
         MFLD  DGIA0028,                                               +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0012,                                               +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0123,                                               +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0109,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0074,                                               +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0094,                                               +        
               LTH=3                                                            
         MFLD  DGIA0029,                                               +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0013,                                               +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0124,                                               +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0110,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0075,                                               +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0095,                                               +        
               LTH=3                                                            
         MFLD  DGIA0030,                                               +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0014,                                               +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0125,                                               +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0111,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0076,                                               +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0096,                                               +        
               LTH=3                                                            
         MFLD  DGIA0031,                                               +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0015,                                               +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0126,                                               +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0112,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0077,                                               +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0097,                                               +        
               LTH=3                                                            
         MFLD  DGIA0032,                                               +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0016,                                               +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0127,                                               +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0113,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0078,                                               +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0098,                                               +        
               LTH=3                                                            
         MFLD  DGIA0033,                                               +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0017,                                               +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0115,                                               +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0101,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0066,                                               +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0086,                                               +        
               LTH=3                                                            
         MFLD  DGIA0021,                                               +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0005,                                               +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0116,                                               +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0102,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0067,                                               +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0087,                                               +        
               LTH=3                                                            
         MFLD  DGIA0022,                                               +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0006,                                               +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0117,                                               +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0103,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0068,                                               +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0088,                                               +        
               LTH=3                                                            
         MFLD  DGIA0023,                                               +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0007,                                               +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0118,                                               +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0104,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0069,                                               +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0089,                                               +        
               LTH=3                                                            
         MFLD  DGIA0024,                                               +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0008,                                               +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0119,                                               +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0105,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0070,                                               +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0090,                                               +        
               LTH=3                                                            
         MFLD  DGIA0025,                                               +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0009,                                               +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0034,                                               +        
               LTH=70                                                           
         MSGEND                                                                 
W4O35601 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4F356,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I35601,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W4F356                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  DGIA0079,                                               +        
               LTH=2                                                            
         MFLD  DGIA0080,                                               +        
               LTH=4                                                            
         MFLD  DGIA0081,                                               +        
               LTH=2                                                            
         MFLD  DGIA0082,                                               +        
               LTH=6                                                            
         MFLD  DGIA0174,                                               +        
               LTH=2                                                            
         MFLD  DGIA0175,                                               +        
               LTH=7                                                            
         MFLD  DGIA0172,                                               +        
               LTH=2                                                            
         MFLD  DGIA0173,                                               +        
               LTH=2                                                            
         MFLD  DGIA0176,                                               +        
               LTH=2                                                            
         MFLD  DGIA0177,                                               +        
               LTH=7                                                            
         MFLD  DGIA0170,                                               +        
               LTH=2                                                            
         MFLD  DGIA0171,                                               +        
               LTH=1                                                            
         MFLD  DGIA0000,                                               +        
               LTH=2                                                            
         MFLD  DGIA0001,                                               +        
               LTH=9                                                            
         MFLD  DGIA0002,                                               +        
               LTH=2                                                            
         MFLD  DGIA0003,                                               +        
               LTH=2                                                            
         MFLD  DGIA0063,                                               +        
               LTH=9                                                            
         MFLD  DGIA0083,                                               +        
               LTH=3                                                            
         MFLD  DGIA0018,                                               +        
               LTH=2                                                            
         MFLD  DGIA0064,                                               +        
               LTH=9                                                            
         MFLD  DGIA0084,                                               +        
               LTH=3                                                            
         MFLD  DGIA0019,                                               +        
               LTH=2                                                            
         MFLD  DGIA0099,                                               +        
               LTH=7                                                            
         MFLD  DGIA0114,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0100,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0065,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0085,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0142,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0020,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0004,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0035,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0128,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0156,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0049,                                               +        
               LTH=27,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0120,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0106,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0071,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0091,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0148,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0026,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0010,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0041,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0134,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0162,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0055,                                               +        
               LTH=27,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0121,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0107,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0072,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0092,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0149,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0027,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0011,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0042,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0135,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0163,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0056,                                               +        
               LTH=27,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0122,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0108,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0073,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0093,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0150,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0028,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0012,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0043,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0136,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0164,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0057,                                               +        
               LTH=27,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0123,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0109,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0074,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0094,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0151,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0029,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0013,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0044,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0137,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0165,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0058,                                               +        
               LTH=27,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0124,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0110,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0075,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0095,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0152,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0030,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0014,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0045,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0138,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0166,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0059,                                               +        
               LTH=27,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0125,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0111,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0076,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0096,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0153,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0031,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0015,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0046,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0139,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0167,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0060,                                               +        
               LTH=27,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0126,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0112,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0077,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0097,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0154,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0032,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0016,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0047,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0140,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0168,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0061,                                               +        
               LTH=27,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0127,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0113,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0078,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0098,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0155,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0033,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0017,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0048,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0141,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0169,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0062,                                               +        
               LTH=27,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0115,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0101,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0066,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0086,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0143,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0021,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0005,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0036,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0129,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0157,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0050,                                               +        
               LTH=27,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0116,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0102,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0067,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0087,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0144,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0022,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0006,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0037,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0130,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0158,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0051,                                               +        
               LTH=27,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0117,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0103,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0068,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0088,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0145,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0023,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0007,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0038,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0131,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0159,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0052,                                               +        
               LTH=27,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0118,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0104,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0069,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0089,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0146,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0024,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0008,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0039,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0132,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0160,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0053,                                               +        
               LTH=27,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0119,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0105,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0070,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0090,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0147,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0025,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0009,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0040,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0133,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0161,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0054,                                               +        
               LTH=27,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0034,                                               +        
               LTH=70                                                           
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
