***********************************************************************         
* CREATED BY V073825   ON 99/10/29  AT 13:36                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE '                                '                               
W4F396   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='WHELP   ',                                           +        
               2='WHELP   ',                                           +        
               3='WHELP   ',                                           +        
               4='WHELP   ',                                           +        
               5='WHELP   ',                                           +        
               6='WHELP   ',                                           +        
               7='WHELP   ',                                           +        
               8='WHELP   ',                                           +        
               9='WHELP   ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T396U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T305  ',                                          +        
               14='WHELP   ',                                          +        
               15='WHELP   ',                                          +        
               16='WHELP   ',                                          +        
               17='WHELP   ',                                          +        
               18='WHELP   ',                                          +        
               19='WHELP   ',                                          +        
               20='WHELP   ',                                          +        
               21='WHELP   ',                                          +        
               22='WHELP   ',                                          +        
               23='W4T396U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((7,11)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  'PACKNINGSRAPP. EXPORT KOLLI',                          +        
               POS=(1,11),LTH=27,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'PRODNR',                                               +        
               POS=(2,2),LTH=6,                                        +        
               ATTR=(NUM,PROT)                                                  
FLD0209  DFLD  POS=(2,9),LTH=7,                                        +        
               ATTR=(PROT,NODISP)                                               
         DFLD  'DISTR',                                                +        
               POS=(2,17),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'KUND',                                                 +        
               POS=(2,28),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'FK    ORDER',                                          +        
               POS=(2,39),LTH=11,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'KLASS   DC',                                           +        
               POS=(2,57),LTH=10,                                      +        
               ATTR=(PROT)                                                      
FLD0309  DFLD  POS=(3,9),LTH=7,                                        +        
               ATTR=(PROT,MOD)                                                  
FLD0323  DFLD  POS=(3,23),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0333  DFLD  POS=(3,33),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0342  DFLD  POS=(3,42),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0351  DFLD  POS=(3,51),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0363  DFLD  POS=(3,63),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0000 DFLD  POS=(3,68),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'SENAST INRAPP. KOLLI',                                 +        
               POS=(5,2),LTH=20,                                       +        
               ATTR=(PROT)                                                      
FLD0525  DFLD  POS=(5,25),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
PRTVALAF DFLD  POS=(5,42),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'KOLLI    KOLLIKOD  BTOVIKT',                           +        
               POS=(6,2),LTH=26,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'ADRESS  EMB  LÄNGD  BREDD  HÖJD',                      +        
               POS=(6,34),LTH=31,                                      +        
               ATTR=(PROT)                                                      
COL0407  DFLD  POS=(7,4),LTH=5,                                        +        
               ATTR=(PROT,MOD)                                                  
COL1107  DFLD  POS=(7,11),LTH=8,                                       +        
               ATTR=(NOPROT)                                                    
COL2107  DFLD  POS=(7,21),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL3007  DFLD  POS=(7,30),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL3707  DFLD  POS=(7,37),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
COL4307  DFLD  POS=(7,43),LTH=1,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL4807  DFLD  POS=(7,48),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL5607  DFLD  POS=(7,56),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL6207  DFLD  POS=(7,62),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL0408  DFLD  POS=(8,4),LTH=5,                                        +        
               ATTR=(PROT,MOD)                                                  
COL1108  DFLD  POS=(8,11),LTH=8,                                       +        
               ATTR=(NOPROT)                                                    
COL2108  DFLD  POS=(8,21),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL3008  DFLD  POS=(8,30),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL3708  DFLD  POS=(8,37),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
COL4308  DFLD  POS=(8,43),LTH=1,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL4808  DFLD  POS=(8,48),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL5608  DFLD  POS=(8,56),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL6208  DFLD  POS=(8,62),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL0409  DFLD  POS=(9,4),LTH=5,                                        +        
               ATTR=(PROT,MOD)                                                  
COL1109  DFLD  POS=(9,11),LTH=8,                                       +        
               ATTR=(NOPROT)                                                    
COL2109  DFLD  POS=(9,21),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL3009  DFLD  POS=(9,30),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL3709  DFLD  POS=(9,37),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
COL4309  DFLD  POS=(9,43),LTH=1,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL4809  DFLD  POS=(9,48),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL5609  DFLD  POS=(9,56),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL6209  DFLD  POS=(9,62),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL0410  DFLD  POS=(10,4),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1110  DFLD  POS=(10,11),LTH=8,                                      +        
               ATTR=(NOPROT)                                                    
COL2110  DFLD  POS=(10,21),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL3010  DFLD  POS=(10,30),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL3710  DFLD  POS=(10,37),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
COL4310  DFLD  POS=(10,43),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL4810  DFLD  POS=(10,48),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL5610  DFLD  POS=(10,56),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL6210  DFLD  POS=(10,62),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL0411  DFLD  POS=(11,4),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1111  DFLD  POS=(11,11),LTH=8,                                      +        
               ATTR=(NOPROT)                                                    
COL2111  DFLD  POS=(11,21),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL3011  DFLD  POS=(11,30),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL3711  DFLD  POS=(11,37),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
COL4311  DFLD  POS=(11,43),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL4811  DFLD  POS=(11,48),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL5611  DFLD  POS=(11,56),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL6211  DFLD  POS=(11,62),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL0412  DFLD  POS=(12,4),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1112  DFLD  POS=(12,11),LTH=8,                                      +        
               ATTR=(NOPROT)                                                    
COL2112  DFLD  POS=(12,21),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL3012  DFLD  POS=(12,30),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL3712  DFLD  POS=(12,37),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
COL4312  DFLD  POS=(12,43),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL4812  DFLD  POS=(12,48),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL5612  DFLD  POS=(12,56),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL6212  DFLD  POS=(12,62),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL0413  DFLD  POS=(13,4),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1113  DFLD  POS=(13,11),LTH=8,                                      +        
               ATTR=(NOPROT)                                                    
COL2113  DFLD  POS=(13,21),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL3013  DFLD  POS=(13,30),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL3713  DFLD  POS=(13,37),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
COL4313  DFLD  POS=(13,43),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL4813  DFLD  POS=(13,48),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL5613  DFLD  POS=(13,56),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL6213  DFLD  POS=(13,62),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL0414  DFLD  POS=(14,4),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1114  DFLD  POS=(14,11),LTH=8,                                      +        
               ATTR=(NOPROT)                                                    
COL2114  DFLD  POS=(14,21),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL3014  DFLD  POS=(14,30),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL3714  DFLD  POS=(14,37),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
COL4314  DFLD  POS=(14,43),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL4814  DFLD  POS=(14,48),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL5614  DFLD  POS=(14,56),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL6214  DFLD  POS=(14,62),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL0415  DFLD  POS=(15,4),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1115  DFLD  POS=(15,11),LTH=8,                                      +        
               ATTR=(NOPROT)                                                    
COL2115  DFLD  POS=(15,21),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL3015  DFLD  POS=(15,30),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL3715  DFLD  POS=(15,37),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
COL4315  DFLD  POS=(15,43),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL4815  DFLD  POS=(15,48),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL5615  DFLD  POS=(15,56),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL6215  DFLD  POS=(15,62),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL0416  DFLD  POS=(16,4),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1116  DFLD  POS=(16,11),LTH=8,                                      +        
               ATTR=(NOPROT)                                                    
COL2116  DFLD  POS=(16,21),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL3016  DFLD  POS=(16,30),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL3716  DFLD  POS=(16,37),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
COL4316  DFLD  POS=(16,43),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL4816  DFLD  POS=(16,48),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL5616  DFLD  POS=(16,56),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL6216  DFLD  POS=(16,62),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL0417  DFLD  POS=(17,4),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1117  DFLD  POS=(17,11),LTH=8,                                      +        
               ATTR=(NOPROT)                                                    
COL2117  DFLD  POS=(17,21),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL3017  DFLD  POS=(17,30),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL3717  DFLD  POS=(17,37),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
COL4317  DFLD  POS=(17,43),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL4817  DFLD  POS=(17,48),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL5617  DFLD  POS=(17,56),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL6217  DFLD  POS=(17,62),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL0418  DFLD  POS=(18,4),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1118  DFLD  POS=(18,11),LTH=8,                                      +        
               ATTR=(NOPROT)                                                    
COL2118  DFLD  POS=(18,21),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL3018  DFLD  POS=(18,30),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL3718  DFLD  POS=(18,37),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
COL4318  DFLD  POS=(18,43),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL4818  DFLD  POS=(18,48),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL5618  DFLD  POS=(18,56),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL6218  DFLD  POS=(18,62),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL0419  DFLD  POS=(19,4),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1119  DFLD  POS=(19,11),LTH=8,                                      +        
               ATTR=(NOPROT)                                                    
COL2119  DFLD  POS=(19,21),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL3019  DFLD  POS=(19,30),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL3719  DFLD  POS=(19,37),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
COL4319  DFLD  POS=(19,43),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL4819  DFLD  POS=(19,48),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL5619  DFLD  POS=(19,56),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL6219  DFLD  POS=(19,62),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '13 BÖRJA OM',                                          +        
               POS=(21,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '14',                                                   +        
               POS=(21,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '15',                                                   +        
               POS=(21,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16',                                                   +        
               POS=(21,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(23,59),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4O39601 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4F396,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I39601,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  FLD0209,                                                +        
               LTH=7                                                            
         MFLD  FLD0309,                                                +        
               LTH=7                                                            
         MFLD  FLD0323,                                                +        
               LTH=4                                                            
         MFLD  FLD0333,                                                +        
               LTH=6                                                            
         MFLD  FLD0342,                                                +        
               LTH=2                                                            
         MFLD  FLD0351,                                                +        
               LTH=5                                                            
         MFLD  FLD0363,                                                +        
               LTH=1                                                            
         MFLD  DGIA0000,                                               +        
               LTH=2                                                            
         MFLD  PRTVALAF,                                               +        
               LTH=2                                                            
         MFLD  FLD0525,                                                +        
               LTH=5                                                            
         MFLD  COL0407,                                                +        
               LTH=5                                                            
         MFLD  COL1107,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2107,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3007,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3707,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4307,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4807,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL5607,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL6207,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0408,                                                +        
               LTH=5                                                            
         MFLD  COL1108,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2108,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3008,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3708,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4308,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4808,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL5608,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL6208,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0409,                                                +        
               LTH=5                                                            
         MFLD  COL1109,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2109,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3009,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3709,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4309,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4809,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL5609,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL6209,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0410,                                                +        
               LTH=5                                                            
         MFLD  COL1110,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2110,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3010,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3710,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4310,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4810,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL5610,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL6210,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0411,                                                +        
               LTH=5                                                            
         MFLD  COL1111,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2111,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3011,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3711,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4311,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4811,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL5611,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL6211,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0412,                                                +        
               LTH=5                                                            
         MFLD  COL1112,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2112,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3012,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3712,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4312,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4812,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL5612,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL6212,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0413,                                                +        
               LTH=5                                                            
         MFLD  COL1113,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2113,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3013,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3713,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4313,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4813,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL5613,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL6213,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0414,                                                +        
               LTH=5                                                            
         MFLD  COL1114,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2114,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3014,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3714,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4314,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4814,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL5614,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL6214,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0415,                                                +        
               LTH=5                                                            
         MFLD  COL1115,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2115,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3015,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3715,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4315,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4815,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL5615,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL6215,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0416,                                                +        
               LTH=5                                                            
         MFLD  COL1116,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2116,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3016,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3716,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4316,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4816,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL5616,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL6216,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0417,                                                +        
               LTH=5                                                            
         MFLD  COL1117,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2117,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3017,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3717,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4317,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4817,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL5617,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL6217,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0418,                                                +        
               LTH=5                                                            
         MFLD  COL1118,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2118,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3018,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3718,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4318,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4818,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL5618,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL6218,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0419,                                                +        
               LTH=5                                                            
         MFLD  COL1119,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2119,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3019,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3719,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4319,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4819,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL5619,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL6219,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I39601 MSG   TYPE=INPUT,                                             +        
               SOR=(W4F396),                                           +        
               OPT=2,                                                  +        
               NXT=W4O39601                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F9'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  'U ',                                                   +        
               LTH=2                                                            
         MFLD  '43961',                                                +        
               LTH=5                                                            
         MFLD  (FLD0209,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0309,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0323,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0333,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0342,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0351,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0363,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0000,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (PRTVALAF,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0525,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0407,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1107,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL2107,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL3007,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL3707,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL4307,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4807,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL5607,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL6207,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0408,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1108,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL2108,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL3008,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL3708,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL4308,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4808,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL5608,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL6208,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0409,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1109,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL2109,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL3009,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL3709,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL4309,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4809,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL5609,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL6209,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0410,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1110,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL2110,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL3010,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL3710,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL4310,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4810,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL5610,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL6210,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0411,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1111,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL2111,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL3011,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL3711,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL4311,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4811,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL5611,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL6211,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0412,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1112,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL2112,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL3012,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL3712,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL4312,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4812,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL5612,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL6212,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0413,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1113,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL2113,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL3013,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL3713,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL4313,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4813,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL5613,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL6213,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0414,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1114,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL2114,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL3014,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL3714,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL4314,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4814,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL5614,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL6214,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0415,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1115,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL2115,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL3015,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL3715,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL4315,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4815,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL5615,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL6215,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0416,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1116,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL2116,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL3016,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL3716,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL4316,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4816,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL5616,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL6216,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0417,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1117,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL2117,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL3017,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL3717,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL4317,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4817,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL5617,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL6217,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0418,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1118,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL2118,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL3018,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL3718,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL4318,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4818,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL5618,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL6218,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0419,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1119,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL2119,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL3019,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL3719,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL4319,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4819,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL5619,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL6219,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
