***********************************************************************         
* CREATED BY PCC8448   ON 99/05/11  AT 11:45                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE '                                '                               
W4F315   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T311  ',                                          +        
               14='W4T312  ',                                          +        
               15='W4T313  ',                                          +        
               16='W4T314  ',                                          +        
               17='W4T315  ',                                          +        
               18='W4T316  ',                                          +        
               19='W4T317  ',                                          +        
               20='W4T318U ',                                          +        
               21='W4T319  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,10)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'KOLLIRAPPORTERING-2',                                  +        
               POS=(1,10),LTH=19,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'PACKARE',                                              +        
               POS=(2,2),LTH=7,                                        +        
               ATTR=(NUM,PROT)                                                  
FLD0210  DFLD  POS=(2,10),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DIST',                                                 +        
               POS=(2,16),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0002 DFLD  POS=(2,21),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'KUND',                                                 +        
               POS=(2,26),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0232  DFLD  POS=(2,31),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'ORDER',                                                +        
               POS=(2,38),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0007 DFLD  POS=(2,44),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'KOLLI',                                                +        
               POS=(2,50),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0004 DFLD  POS=(2,56),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'PROD',                                                 +        
               POS=(2,62),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0009 DFLD  POS=(2,67),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DC',                                                   +        
               POS=(2,75),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0000 DFLD  POS=(2,78),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FLD0310  DFLD  POS=(3,10),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0003 DFLD  POS=(3,21),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0006 DFLD  POS=(3,31),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0008 DFLD  POS=(3,44),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0005 DFLD  POS=(3,56),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0010 DFLD  POS=(3,67),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0001 DFLD  POS=(3,78),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0460  DFLD  POS=(4,60),LTH=4,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'KOLLIKOD BR.VIKT SISTA.KLI  EMB LÄNGD BREDD HÖJD  ADRES+        
               S',                                                     +        
               POS=(5,2),LTH=56,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'KOLLI FOM   TOM',                                      +        
               POS=(5,64),LTH=15,                                      +        
               ATTR=(PROT)                                                      
FLD0602  DFLD  POS=(6,2),LTH=8,                                        +        
               ATTR=(NOPROT)                                                    
FLD0611  DFLD  POS=(6,11),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
FLD0622  DFLD  POS=(6,22),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
FLD0631  DFLD  POS=(6,31),LTH=1,                                       +        
               ATTR=(NUM,NOPROT)                                                
FLD0635  DFLD  POS=(6,35),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
FLD0641  DFLD  POS=(6,41),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
FLD0647  DFLD  POS=(6,47),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
FLD0652  DFLD  POS=(6,52),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
FLD0656  DFLD  POS=(6,56),LTH=3,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0660  DFLD  POS=(6,60),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
FLD0668  DFLD  POS=(6,68),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(6,74),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0676  DFLD  POS=(6,76),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'RAD-FOM   RAD-TOM  ANTAL I KOLLI  AF-PRIN:',           +        
               POS=(7,2),LTH=42,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0749  DFLD  POS=(7,45),LTH=2,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'FS-PRIN:',                                             +        
               POS=(7,49),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FLD0765  DFLD  POS=(7,58),LTH=2,                                       +        
               ATTR=(NOPROT,MOD)                                                
COL0508  DFLD  POS=(8,5),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(8,11),LTH=1,                                       +        
               ATTR=(PROT)                                                      
COL1408  DFLD  POS=(8,14),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL2408  DFLD  POS=(8,24),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL0509  DFLD  POS=(9,5),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(9,11),LTH=1,                                       +        
               ATTR=(PROT)                                                      
COL1409  DFLD  POS=(9,14),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL2409  DFLD  POS=(9,24),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL0510  DFLD  POS=(10,5),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(10,11),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL1410  DFLD  POS=(10,14),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL2410  DFLD  POS=(10,24),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL0511  DFLD  POS=(11,5),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(11,11),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL1411  DFLD  POS=(11,14),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL2411  DFLD  POS=(11,24),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL0512  DFLD  POS=(12,5),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(12,11),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL1412  DFLD  POS=(12,14),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL2412  DFLD  POS=(12,24),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL0513  DFLD  POS=(13,5),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(13,11),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL1413  DFLD  POS=(13,14),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL2413  DFLD  POS=(13,24),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL0514  DFLD  POS=(14,5),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(14,11),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL1414  DFLD  POS=(14,14),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL2414  DFLD  POS=(14,24),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL0515  DFLD  POS=(15,5),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(15,11),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL1415  DFLD  POS=(15,14),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL2415  DFLD  POS=(15,24),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL0516  DFLD  POS=(16,5),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(16,11),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL1416  DFLD  POS=(16,14),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL2416  DFLD  POS=(16,24),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL0517  DFLD  POS=(17,5),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(17,11),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL1417  DFLD  POS=(17,14),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL2417  DFLD  POS=(17,24),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL0518  DFLD  POS=(18,5),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(18,11),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL1418  DFLD  POS=(18,14),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL2418  DFLD  POS=(18,24),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL0519  DFLD  POS=(19,5),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(19,11),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL1419  DFLD  POS=(19,14),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL2419  DFLD  POS=(19,24),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '13 DELA ORDER  14 DELA ORD.F/U  15 KOLLIRAPP-3   16 KOL+        
               LIRAPP-1 17 KOLLIRAPP-2',                               +        
               POS=(21,2),LTH=78,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18 KOLLI RÄTTN 19 URSPR.RAPP    20 EJ RAPP.RADER 21',  +        
               POS=(22,2),LTH=51,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4O31501 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4F315,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I31501,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  FLD0210,                                                +        
               LTH=2                                                            
         MFLD  FLD0310,                                                +        
               LTH=5                                                            
         MFLD  DGIA0002,                                               +        
               LTH=2                                                            
         MFLD  DGIA0003,                                               +        
               LTH=4                                                            
         MFLD  FLD0232,                                                +        
               LTH=2                                                            
         MFLD  DGIA0006,                                               +        
               LTH=6                                                            
         MFLD  DGIA0007,                                               +        
               LTH=2                                                            
         MFLD  DGIA0008,                                               +        
               LTH=5                                                            
         MFLD  DGIA0004,                                               +        
               LTH=2                                                            
         MFLD  DGIA0005,                                               +        
               LTH=5                                                            
         MFLD  DGIA0009,                                               +        
               LTH=2                                                            
         MFLD  DGIA0010,                                               +        
               LTH=7                                                            
         MFLD  DGIA0000,                                               +        
               LTH=2                                                            
         MFLD  DGIA0001,                                               +        
               LTH=2                                                            
         MFLD  FLD0460,                                                +        
               LTH=4                                                            
         MFLD  FLD0602,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD0611,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0622,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0631,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0635,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0641,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0647,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0652,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0656,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0660,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0668,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0676,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0749,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0765,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0508,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1408,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2408,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0509,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1409,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2409,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0510,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1410,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2410,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0511,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1411,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2411,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0512,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1412,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2412,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0513,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1413,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2413,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0514,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1414,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2414,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0515,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1415,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2415,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0516,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1416,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2416,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0517,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1417,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2417,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0518,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1418,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2418,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0519,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1419,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2419,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2302,                                                +        
               LTH=61                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I31501 MSG   TYPE=INPUT,                                             +        
               SOR=(W4F315),                                           +        
               OPT=2,                                                  +        
               NXT=W4O31501                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '43151',                                                +        
               LTH=5                                                            
         MFLD  (FLD0210,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0310,                                                +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0002,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0003,                                               +        
               LTH=4                                                            
         MFLD  (FLD0232,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0006,                                               +        
               LTH=6                                                            
         MFLD  (DGIA0007,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0008,                                               +        
               LTH=5                                                            
         MFLD  (DGIA0004,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0005,                                               +        
               LTH=5                                                            
         MFLD  (DGIA0009,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0010,                                               +        
               LTH=7                                                            
         MFLD  (DGIA0000,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  DGIA0001,                                               +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  FLD0460,                                                +        
               LTH=4,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0602,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0611,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0622,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0631,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0635,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0641,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0647,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0652,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0656,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0660,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0668,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0676,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0749,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0765,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL0508,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1408,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2408,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0509,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1409,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2409,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0510,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1410,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2410,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0511,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1411,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2411,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0512,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1412,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2412,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0513,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1413,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2413,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0514,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1414,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2414,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0515,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1415,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2415,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0516,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1416,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2416,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0517,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1417,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2417,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0518,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1418,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2418,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0519,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1419,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2419,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
