***********************************************************************         
* CREATED BY PC36147   ON 95/02/14  AT 17:10                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE '                                '                               
W4F359   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T359  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T351  ',                                          +        
               14='W4T352  ',                                          +        
               15='W4T353  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W4T356  ',                                          +        
               19='W4T357  ',                                          +        
               20='W0T501  ',                                          +        
               21='W4T359  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((2,8)),                                         +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'ANNULLATION AV UTSKR. ORDERDEL',                       +        
               POS=(1,10),LTH=30,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'DISTR',                                                +        
               POS=(2,2),LTH=5,                                        +        
               ATTR=(ALPHA,PROT)                                                
FLD0208  DFLD  POS=(2,8),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'PRODNR',                                               +        
               POS=(2,14),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0221  DFLD  POS=(2,21),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'PLKLST',                                               +        
               POS=(2,30),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0237  DFLD  POS=(2,37),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'RADNR',                                                +        
               POS=(2,41),LTH=5,                                       +        
               ATTR=(PROT)                                                      
FLD0247  DFLD  POS=(2,47),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DC',                                                   +        
               POS=(2,53),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DGIA0000 DFLD  POS=(2,56),LTH=2,                                       +        
               ATTR=(ALPHA,NOPROT)                                              
FLD0308  DFLD  POS=(3,8),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
FLD0321  DFLD  POS=(3,21),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0337  DFLD  POS=(3,37),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0347  DFLD  POS=(3,47),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0001 DFLD  POS=(3,56),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'DISTR  KUNDNR  ORDER  CL  KL  ANT-RADER  ANT-RAPP-RADER+        
               ',                                                      +        
               POS=(5,2),LTH=55,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'AVBOKAT-ANT',                                          +        
               POS=(5,64),LTH=11,                                      +        
               ATTR=(PROT)                                                      
FLD0603  DFLD  POS=(6,3),LTH=4,                                        +        
               ATTR=(PROT)                                                      
FLD0609  DFLD  POS=(6,9),LTH=6,                                        +        
               ATTR=(PROT)                                                      
FLD0617  DFLD  POS=(6,17),LTH=5,                                       +        
               ATTR=(PROT)                                                      
FLD0625  DFLD  POS=(6,25),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0629  DFLD  POS=(6,29),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0634  DFLD  POS=(6,36),LTH=5,                                       +        
               ATTR=(PROT)                                                      
FLD0647  DFLD  POS=(6,52),LTH=5,                                       +        
               ATTR=(PROT)                                                      
FLD0664  DFLD  POS=(6,69),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'ANNULLERA HELA J/N    :',                              +        
               POS=(8,2),LTH=23,                                       +        
               ATTR=(PROT)                                                      
FLD0826  DFLD  POS=(8,26),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'ANNULLERA INTERVALL   :',                              +        
               POS=(10,2),LTH=23,                                      +        
               ATTR=(PROT)                                                      
FLD1026  DFLD  POS=(10,26),LTH=4,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '-',                                                    +        
               POS=(10,31),LTH=1,                                      +        
               ATTR=(ALPHA,PROT)                                                
FLD1033  DFLD  POS=(10,33),LTH=4,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'ANNULLERA ANTAL PÅ RAD:',                              +        
               POS=(12,2),LTH=23,                                      +        
               ATTR=(PROT)                                                      
FLD1226  DFLD  POS=(12,26),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '13 Utskrift Ps  14 Orderkö i PRC 15 Man utskr',        +        
               POS=(21,2),LTH=45,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16',                                                   +        
               POS=(21,52),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,69),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18 Rad specemb  19 Order per PRC 20',                  +        
               POS=(22,2),LTH=35,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21 Ann utskr ord 22',                                  +        
               POS=(22,52),LTH=19,                                     +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W4O35901 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4F359,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I35901,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  FLD0208,                                                +        
               LTH=2                                                            
         MFLD  FLD0308,                                                +        
               LTH=4                                                            
         MFLD  FLD0221,                                                +        
               LTH=2                                                            
         MFLD  FLD0321,                                                +        
               LTH=7                                                            
         MFLD  FLD0237,                                                +        
               LTH=2                                                            
         MFLD  FLD0337,                                                +        
               LTH=3                                                            
         MFLD  FLD0247,                                                +        
               LTH=2                                                            
         MFLD  FLD0347,                                                +        
               LTH=4                                                            
         MFLD  DGIA0000,                                               +        
               LTH=2                                                            
         MFLD  DGIA0001,                                               +        
               LTH=2                                                            
         MFLD  FLD0603,                                                +        
               LTH=4                                                            
         MFLD  FLD0609,                                                +        
               LTH=6                                                            
         MFLD  FLD0617,                                                +        
               LTH=5                                                            
         MFLD  FLD0625,                                                +        
               LTH=2                                                            
         MFLD  FLD0629,                                                +        
               LTH=1                                                            
         MFLD  FLD0634,                                                +        
               LTH=5                                                            
         MFLD  FLD0647,                                                +        
               LTH=5                                                            
         MFLD  FLD0664,                                                +        
               LTH=6                                                            
         MFLD  FLD0826,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1026,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1033,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1226,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I35901 MSG   TYPE=INPUT,                                             +        
               SOR=(W4F359),                                           +        
               OPT=2,                                                  +        
               NXT=W4O35901                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F9'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '43591',                                                +        
               LTH=5                                                            
         MFLD  (FLD0208,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0308,                                                +        
               LTH=4,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0221,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0321,                                                +        
               LTH=7,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0237,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0337,                                                +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0247,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0347,                                                +        
               LTH=4,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0000,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0001,                                               +        
               LTH=2                                                            
         MFLD  (FLD0826,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1026,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1033,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1226,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  '++++',                                                 +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  '+++',                                                  +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
