***********************************************************************         
* CREATED BY PC36147   ON 94/11/26  AT 15:09                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE '                                '                               
W4F395   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='WHELP   ',                                           +        
               2='WHELP   ',                                           +        
               3='WHELP   ',                                           +        
               4='WHELP   ',                                           +        
               5='WHELP   ',                                           +        
               6='WHELP   ',                                           +        
               7='WHELP   ',                                           +        
               8='WHELP   ',                                           +        
               9='WHELP   ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T395U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T305  ',                                          +        
               14='WHELP   ',                                          +        
               15='WHELP   ',                                          +        
               16='WHELP   ',                                          +        
               17='WHELP   ',                                          +        
               18='WHELP   ',                                          +        
               19='WHELP   ',                                          +        
               20='WHELP   ',                                          +        
               21='WHELP   ',                                          +        
               22='WHELP   ',                                          +        
               23='W4T395U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((7,3)),                                         +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  'PACKNINGSRAPP. EXPORT DELNING',                        +        
               POS=(1,11),LTH=29,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'PRODNR',                                               +        
               POS=(2,2),LTH=6,                                        +        
               ATTR=(NUM,PROT)                                                  
FLD0209  DFLD  POS=(2,9),LTH=7,                                        +        
               ATTR=(PROT,NODISP)                                               
         DFLD  'DISTR',                                                +        
               POS=(2,17),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'KUND',                                                 +        
               POS=(2,28),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'FK    ORDER',                                          +        
               POS=(2,39),LTH=11,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'KLASS   DC',                                           +        
               POS=(2,57),LTH=10,                                      +        
               ATTR=(PROT)                                                      
FLD0309  DFLD  POS=(3,9),LTH=7,                                        +        
               ATTR=(PROT,MOD)                                                  
FLD0323  DFLD  POS=(3,23),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0333  DFLD  POS=(3,33),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0342  DFLD  POS=(3,42),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0351  DFLD  POS=(3,51),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0363  DFLD  POS=(3,63),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0000 DFLD  POS=(3,68),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0402  DFLD  POS=(4,2),LTH=1,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0404  DFLD  POS=(4,4),LTH=1,                                        +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
         DFLD  'SENAST INRAPP. RADNR',                                 +        
               POS=(5,2),LTH=20,                                       +        
               ATTR=(PROT)                                                      
FLD0524  DFLD  POS=(5,24),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'RAPP. ANTAL',                                          +        
               POS=(5,30),LTH=11,                                      +        
               ATTR=(PROT)                                                      
FLD0543  DFLD  POS=(5,43),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
PRTVALAF DFLD  POS=(5,51),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'RADNR  PACKAT-ANT  DELAT-ANT  KOLLI-FOM  KOLLI-TOM  *  +        
               DELAT-ANT  KOLLI',                                      +        
               POS=(6,2),LTH=71,                                       +        
               ATTR=(PROT)                                                      
FLD0703  DFLD  POS=(7,3),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0713  DFLD  POS=(7,13),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0724  DFLD  POS=(7,24),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
FLD0736  DFLD  POS=(7,36),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
FLD0747  DFLD  POS=(7,47),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '*',                                                    +        
               POS=(7,54),LTH=1,                                       +        
               ATTR=(PROT)                                                      
COL6007  DFLD  POS=(7,60),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL7007  DFLD  POS=(7,70),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '*',                                                    +        
               POS=(8,54),LTH=1,                                       +        
               ATTR=(PROT)                                                      
COL6008  DFLD  POS=(8,60),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL7008  DFLD  POS=(8,70),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '*',                                                    +        
               POS=(9,54),LTH=1,                                       +        
               ATTR=(PROT)                                                      
COL6009  DFLD  POS=(9,60),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL7009  DFLD  POS=(9,70),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '*',                                                    +        
               POS=(10,54),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL6010  DFLD  POS=(10,60),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL7010  DFLD  POS=(10,70),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '*',                                                    +        
               POS=(11,54),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL6011  DFLD  POS=(11,60),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL7011  DFLD  POS=(11,70),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '*',                                                    +        
               POS=(12,54),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL6012  DFLD  POS=(12,60),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL7012  DFLD  POS=(12,70),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '*',                                                    +        
               POS=(13,54),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL6013  DFLD  POS=(13,60),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL7013  DFLD  POS=(13,70),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '*',                                                    +        
               POS=(14,54),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL6014  DFLD  POS=(14,60),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL7014  DFLD  POS=(14,70),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '*',                                                    +        
               POS=(15,54),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL6015  DFLD  POS=(15,60),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL7015  DFLD  POS=(15,70),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '*',                                                    +        
               POS=(16,54),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL6016  DFLD  POS=(16,60),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL7016  DFLD  POS=(16,70),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '*',                                                    +        
               POS=(17,54),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL6017  DFLD  POS=(17,60),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL7017  DFLD  POS=(17,70),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '*',                                                    +        
               POS=(18,54),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL6018  DFLD  POS=(18,60),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL7018  DFLD  POS=(18,70),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '*',                                                    +        
               POS=(19,54),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL6019  DFLD  POS=(19,60),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL7019  DFLD  POS=(19,70),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '13 BÖRJA OM',                                          +        
               POS=(21,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '14',                                                   +        
               POS=(21,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '15',                                                   +        
               POS=(21,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16',                                                   +        
               POS=(21,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4O39501 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4F395,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I39501,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  FLD0209,                                                +        
               LTH=7                                                            
         MFLD  FLD0309,                                                +        
               LTH=7                                                            
         MFLD  FLD0323,                                                +        
               LTH=4                                                            
         MFLD  FLD0333,                                                +        
               LTH=6                                                            
         MFLD  FLD0342,                                                +        
               LTH=2                                                            
         MFLD  PRTVALAF,                                               +        
               LTH=2                                                            
         MFLD  FLD0351,                                                +        
               LTH=5                                                            
         MFLD  FLD0363,                                                +        
               LTH=1                                                            
         MFLD  DGIA0000,                                               +        
               LTH=2                                                            
         MFLD  FLD0402,                                                +        
               LTH=1                                                            
         MFLD  FLD0404,                                                +        
               LTH=1                                                            
         MFLD  FLD0524,                                                +        
               LTH=4                                                            
         MFLD  FLD0543,                                                +        
               LTH=6                                                            
         MFLD  FLD0703,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0713,                                                +        
               LTH=6                                                            
         MFLD  FLD0724,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0736,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0747,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL6007,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL7007,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL6008,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL7008,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL6009,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL7009,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL6010,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL7010,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL6011,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL7011,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL6012,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL7012,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL6013,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL7013,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL6014,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL7014,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL6015,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL7015,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL6016,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL7016,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL6017,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL7017,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL6018,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL7018,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL6019,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL7019,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I39501 MSG   TYPE=INPUT,                                             +        
               SOR=(W4F395),                                           +        
               OPT=2,                                                  +        
               NXT=W4O39501                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F9'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  'U ',                                                   +        
               LTH=2                                                            
         MFLD  '43951',                                                +        
               LTH=5                                                            
         MFLD  (FLD0209,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0309,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0323,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0333,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0342,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (PRTVALAF,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0351,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0363,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0000,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0402,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0404,                                               +        
               'J'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0524,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0543,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0703,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0713,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0724,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0736,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0747,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL6007,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL7007,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL6008,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL7008,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL6009,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL7009,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL6010,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL7010,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL6011,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL7011,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL6012,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL7012,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL6013,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL7013,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL6014,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL7014,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL6015,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL7015,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL6016,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL7016,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL6017,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL7017,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL6018,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL7018,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL6019,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL7019,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
