***********************************************************************         
* CREATED BY PC36147   ON 98/06/11  AT 16:23                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE '                                '                               
W4F318   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W4T318 7',                                           +        
               8='W4T318 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T311  ',                                          +        
               14='W4T312  ',                                          +        
               15='W4T313  ',                                          +        
               16='W4T314  ',                                          +        
               17='W4T315  ',                                          +        
               18='W4T316  ',                                          +        
               19='W4T317  ',                                          +        
               20='W4T318  ',                                          +        
               21='W4T319  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,10)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Kontroll ej rapporterat',                              +        
               POS=(1,10),LTH=23,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Packare',                                              +        
               POS=(2,2),LTH=7,                                        +        
               ATTR=(ALPHA,PROT)                                                
FLD0210  DFLD  POS=(2,10),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Dist',                                                 +        
               POS=(2,16),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0002 DFLD  POS=(2,21),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Kund',                                                 +        
               POS=(2,26),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0232  DFLD  POS=(2,31),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Order',                                                +        
               POS=(2,38),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0007 DFLD  POS=(2,44),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Kolli',                                                +        
               POS=(2,50),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0004 DFLD  POS=(2,56),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Prod',                                                 +        
               POS=(2,62),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0009 DFLD  POS=(2,67),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DC',                                                   +        
               POS=(2,75),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0000 DFLD  POS=(2,78),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FLD0310  DFLD  POS=(3,10),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0003 DFLD  POS=(3,21),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0006 DFLD  POS=(3,31),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0008 DFLD  POS=(3,44),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0005 DFLD  POS=(3,56),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0010 DFLD  POS=(3,67),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0001 DFLD  POS=(3,78),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0456  DFLD  POS=(4,53),LTH=3,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0460  DFLD  POS=(4,57),LTH=4,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
FLD0465  DFLD  POS=(4,62),LTH=5,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
         DFLD  'Omr   Radnr  Nollj  Delrapp-kvar',                     +        
               POS=(5,2),LTH=32,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Omr   Radnr  Nollj  Delrapp-kvar',                     +        
               POS=(5,43),LTH=32,                                      +        
               ATTR=(PROT)                                                      
COL0206  DFLD  POS=(6,2),LTH=2,                                        +        
               ATTR=(PROT)                                                      
COL0906  DFLD  POS=(6,9),LTH=4,                                        +        
               ATTR=(PROT)                                                      
COL1706  DFLD  POS=(6,17),LTH=1,                                       +        
               ATTR=(PROT)                                                      
COL2506  DFLD  POS=(6,25),LTH=6,                                       +        
               ATTR=(PROT)                                                      
COL4320  DFLD  POS=(6,43),LTH=2,                                       +        
               ATTR=(PROT)                                                      
COL5020  DFLD  POS=(6,50),LTH=4,                                       +        
               ATTR=(PROT)                                                      
COL5820  DFLD  POS=(6,58),LTH=1,                                       +        
               ATTR=(PROT)                                                      
COL6620  DFLD  POS=(6,66),LTH=6,                                       +        
               ATTR=(PROT)                                                      
COL0207  DFLD  POS=(7,2),LTH=2,                                        +        
               ATTR=(PROT)                                                      
COL0907  DFLD  POS=(7,9),LTH=4,                                        +        
               ATTR=(PROT)                                                      
COL1707  DFLD  POS=(7,17),LTH=1,                                       +        
               ATTR=(PROT)                                                      
COL2507  DFLD  POS=(7,25),LTH=6,                                       +        
               ATTR=(PROT)                                                      
COL4321  DFLD  POS=(7,43),LTH=2,                                       +        
               ATTR=(PROT)                                                      
COL5021  DFLD  POS=(7,50),LTH=4,                                       +        
               ATTR=(PROT)                                                      
COL5821  DFLD  POS=(7,58),LTH=1,                                       +        
               ATTR=(PROT)                                                      
COL6621  DFLD  POS=(7,66),LTH=6,                                       +        
               ATTR=(PROT)                                                      
COL0208  DFLD  POS=(8,2),LTH=2,                                        +        
               ATTR=(PROT)                                                      
COL0908  DFLD  POS=(8,9),LTH=4,                                        +        
               ATTR=(PROT)                                                      
COL1708  DFLD  POS=(8,17),LTH=1,                                       +        
               ATTR=(PROT)                                                      
COL2508  DFLD  POS=(8,25),LTH=6,                                       +        
               ATTR=(PROT)                                                      
COL4322  DFLD  POS=(8,43),LTH=2,                                       +        
               ATTR=(PROT)                                                      
COL5022  DFLD  POS=(8,50),LTH=4,                                       +        
               ATTR=(PROT)                                                      
COL5822  DFLD  POS=(8,58),LTH=1,                                       +        
               ATTR=(PROT)                                                      
COL6622  DFLD  POS=(8,66),LTH=6,                                       +        
               ATTR=(PROT)                                                      
COL0209  DFLD  POS=(9,2),LTH=2,                                        +        
               ATTR=(PROT)                                                      
COL0909  DFLD  POS=(9,9),LTH=4,                                        +        
               ATTR=(PROT)                                                      
COL1709  DFLD  POS=(9,17),LTH=1,                                       +        
               ATTR=(PROT)                                                      
COL2509  DFLD  POS=(9,25),LTH=6,                                       +        
               ATTR=(PROT)                                                      
COL4323  DFLD  POS=(9,43),LTH=2,                                       +        
               ATTR=(PROT)                                                      
COL5023  DFLD  POS=(9,50),LTH=4,                                       +        
               ATTR=(PROT)                                                      
COL5823  DFLD  POS=(9,58),LTH=1,                                       +        
               ATTR=(PROT)                                                      
COL6623  DFLD  POS=(9,66),LTH=6,                                       +        
               ATTR=(PROT)                                                      
COL0210  DFLD  POS=(10,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
COL0910  DFLD  POS=(10,9),LTH=4,                                       +        
               ATTR=(PROT)                                                      
COL1710  DFLD  POS=(10,17),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL2510  DFLD  POS=(10,25),LTH=6,                                      +        
               ATTR=(PROT)                                                      
COL4324  DFLD  POS=(10,43),LTH=2,                                      +        
               ATTR=(PROT)                                                      
COL5024  DFLD  POS=(10,50),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL5824  DFLD  POS=(10,58),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL6624  DFLD  POS=(10,66),LTH=6,                                      +        
               ATTR=(PROT)                                                      
COL0211  DFLD  POS=(11,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
COL0911  DFLD  POS=(11,9),LTH=4,                                       +        
               ATTR=(PROT)                                                      
COL1711  DFLD  POS=(11,17),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL2511  DFLD  POS=(11,25),LTH=6,                                      +        
               ATTR=(PROT)                                                      
COL4325  DFLD  POS=(11,43),LTH=2,                                      +        
               ATTR=(PROT)                                                      
COL5025  DFLD  POS=(11,50),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL5825  DFLD  POS=(11,58),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL6625  DFLD  POS=(11,66),LTH=6,                                      +        
               ATTR=(PROT)                                                      
COL0212  DFLD  POS=(12,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
COL0912  DFLD  POS=(12,9),LTH=4,                                       +        
               ATTR=(PROT)                                                      
COL1712  DFLD  POS=(12,17),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL2512  DFLD  POS=(12,25),LTH=6,                                      +        
               ATTR=(PROT)                                                      
COL4326  DFLD  POS=(12,43),LTH=2,                                      +        
               ATTR=(PROT)                                                      
COL5026  DFLD  POS=(12,50),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL5826  DFLD  POS=(12,58),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL6626  DFLD  POS=(12,66),LTH=6,                                      +        
               ATTR=(PROT)                                                      
COL0213  DFLD  POS=(13,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
COL0913  DFLD  POS=(13,9),LTH=4,                                       +        
               ATTR=(PROT)                                                      
COL1713  DFLD  POS=(13,17),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL2513  DFLD  POS=(13,25),LTH=6,                                      +        
               ATTR=(PROT)                                                      
COL4327  DFLD  POS=(13,43),LTH=2,                                      +        
               ATTR=(PROT)                                                      
COL5027  DFLD  POS=(13,50),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL5827  DFLD  POS=(13,58),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL6627  DFLD  POS=(13,66),LTH=6,                                      +        
               ATTR=(PROT)                                                      
COL0214  DFLD  POS=(14,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
COL0914  DFLD  POS=(14,9),LTH=4,                                       +        
               ATTR=(PROT)                                                      
COL1714  DFLD  POS=(14,17),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL2514  DFLD  POS=(14,25),LTH=6,                                      +        
               ATTR=(PROT)                                                      
COL4328  DFLD  POS=(14,43),LTH=2,                                      +        
               ATTR=(PROT)                                                      
COL5028  DFLD  POS=(14,50),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL5828  DFLD  POS=(14,58),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL6628  DFLD  POS=(14,66),LTH=6,                                      +        
               ATTR=(PROT)                                                      
COL0215  DFLD  POS=(15,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
COL0915  DFLD  POS=(15,9),LTH=4,                                       +        
               ATTR=(PROT)                                                      
COL1715  DFLD  POS=(15,17),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL2515  DFLD  POS=(15,25),LTH=6,                                      +        
               ATTR=(PROT)                                                      
COL4329  DFLD  POS=(15,43),LTH=2,                                      +        
               ATTR=(PROT)                                                      
COL5029  DFLD  POS=(15,50),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL5829  DFLD  POS=(15,58),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL6629  DFLD  POS=(15,66),LTH=6,                                      +        
               ATTR=(PROT)                                                      
COL0216  DFLD  POS=(16,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
COL0916  DFLD  POS=(16,9),LTH=4,                                       +        
               ATTR=(PROT)                                                      
COL1716  DFLD  POS=(16,17),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL2516  DFLD  POS=(16,25),LTH=6,                                      +        
               ATTR=(PROT)                                                      
COL4330  DFLD  POS=(16,43),LTH=2,                                      +        
               ATTR=(PROT)                                                      
COL5030  DFLD  POS=(16,50),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL5830  DFLD  POS=(16,58),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL6630  DFLD  POS=(16,66),LTH=6,                                      +        
               ATTR=(PROT)                                                      
COL0217  DFLD  POS=(17,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
COL0917  DFLD  POS=(17,9),LTH=4,                                       +        
               ATTR=(PROT)                                                      
COL1717  DFLD  POS=(17,17),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL2517  DFLD  POS=(17,25),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1743  DFLD  POS=(17,43),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1750  DFLD  POS=(17,50),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD1758  DFLD  POS=(17,58),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1766  DFLD  POS=(17,66),LTH=6,                                      +        
               ATTR=(PROT)                                                      
COL0218  DFLD  POS=(18,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
COL0918  DFLD  POS=(18,9),LTH=4,                                       +        
               ATTR=(PROT)                                                      
COL1718  DFLD  POS=(18,17),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL2518  DFLD  POS=(18,25),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1836  DFLD  POS=(18,36),LTH=38,                                     +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Plocklistnummer',                                      +        
               POS=(19,2),LTH=15,                                      +        
               ATTR=(PROT)                                                      
COL1819  DFLD  POS=(19,18),LTH=3,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Nästa orderdel:',                                      +        
               POS=(19,36),LTH=15,                                     +        
               ATTR=(PROT)                                                      
FLNXTODL DFLD  POS=(19,52),LTH=1,                                      +        
               ATTR=(NOPROT,HI)                                                 
         DFLD  'Kontroll OK (J/N):',                                   +        
               POS=(19,55),LTH=18,                                     +        
               ATTR=(PROT)                                                      
FLOKODEL DFLD  POS=(19,74),LTH=1,                                      +        
               ATTR=(NOPROT,HI)                                                 
FLD2002  DFLD  POS=(20,2),LTH=3,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD2006  DFLD  POS=(20,6),LTH=3,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD2010  DFLD  POS=(20,10),LTH=3,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  '13 Dela order  14 Dela ord.F/U  15 Kollirapp-3   16 Kol+        
               lirapp-1 17 Kollirapp-2',                               +        
               POS=(21,2),LTH=78,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18 Kolli rättn 19 Urspr.rapp    20 Ej rapp rader 21',  +        
               POS=(22,2),LTH=51,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 Whelp',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT,NODISP)                                               
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT,NODISP)                                           
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4O31801 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4F318,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I31801,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  FLD0210,                                                +        
               LTH=2                                                            
         MFLD  FLD0310,                                                +        
               LTH=5                                                            
         MFLD  DGIA0002,                                               +        
               LTH=2                                                            
         MFLD  DGIA0003,                                               +        
               LTH=4                                                            
         MFLD  FLD0232,                                                +        
               LTH=2                                                            
         MFLD  DGIA0006,                                               +        
               LTH=6                                                            
         MFLD  DGIA0007,                                               +        
               LTH=2                                                            
         MFLD  DGIA0008,                                               +        
               LTH=5                                                            
         MFLD  DGIA0004,                                               +        
               LTH=2                                                            
         MFLD  DGIA0005,                                               +        
               LTH=5                                                            
         MFLD  DGIA0009,                                               +        
               LTH=2                                                            
         MFLD  DGIA0010,                                               +        
               LTH=7                                                            
         MFLD  DGIA0000,                                               +        
               LTH=2                                                            
         MFLD  DGIA0001,                                               +        
               LTH=2                                                            
         MFLD  COL1819,                                                +        
               LTH=3                                                            
         MFLD  FLNXTODL,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLOKODEL,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0456,                                                +        
               LTH=3                                                            
         MFLD  FLD0460,                                                +        
               LTH=4                                                            
         MFLD  FLD0465,                                                +        
               LTH=5                                                            
         MFLD  FLD2002,                                                +        
               LTH=3                                                            
         MFLD  FLD2006,                                                +        
               LTH=3                                                            
         MFLD  FLD2010,                                                +        
               LTH=3                                                            
         MFLD  COL0206,                                                +        
               LTH=2                                                            
         MFLD  COL0906,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1706,                                                +        
               LTH=1                                                            
         MFLD  COL2506,                                                +        
               LTH=6                                                            
         MFLD  COL0207,                                                +        
               LTH=2                                                            
         MFLD  COL0907,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1707,                                                +        
               LTH=1                                                            
         MFLD  COL2507,                                                +        
               LTH=6                                                            
         MFLD  COL0208,                                                +        
               LTH=2                                                            
         MFLD  COL0908,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1708,                                                +        
               LTH=1                                                            
         MFLD  COL2508,                                                +        
               LTH=6                                                            
         MFLD  COL0209,                                                +        
               LTH=2                                                            
         MFLD  COL0909,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1709,                                                +        
               LTH=1                                                            
         MFLD  COL2509,                                                +        
               LTH=6                                                            
         MFLD  COL0210,                                                +        
               LTH=2                                                            
         MFLD  COL0910,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1710,                                                +        
               LTH=1                                                            
         MFLD  COL2510,                                                +        
               LTH=6                                                            
         MFLD  COL0211,                                                +        
               LTH=2                                                            
         MFLD  COL0911,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1711,                                                +        
               LTH=1                                                            
         MFLD  COL2511,                                                +        
               LTH=6                                                            
         MFLD  COL0212,                                                +        
               LTH=2                                                            
         MFLD  COL0912,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1712,                                                +        
               LTH=1                                                            
         MFLD  COL2512,                                                +        
               LTH=6                                                            
         MFLD  COL0213,                                                +        
               LTH=2                                                            
         MFLD  COL0913,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1713,                                                +        
               LTH=1                                                            
         MFLD  COL2513,                                                +        
               LTH=6                                                            
         MFLD  COL0214,                                                +        
               LTH=2                                                            
         MFLD  COL0914,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1714,                                                +        
               LTH=1                                                            
         MFLD  COL2514,                                                +        
               LTH=6                                                            
         MFLD  COL0215,                                                +        
               LTH=2                                                            
         MFLD  COL0915,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1715,                                                +        
               LTH=1                                                            
         MFLD  COL2515,                                                +        
               LTH=6                                                            
         MFLD  COL0216,                                                +        
               LTH=2                                                            
         MFLD  COL0916,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1716,                                                +        
               LTH=1                                                            
         MFLD  COL2516,                                                +        
               LTH=6                                                            
         MFLD  COL0217,                                                +        
               LTH=2                                                            
         MFLD  COL0917,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1717,                                                +        
               LTH=1                                                            
         MFLD  COL2517,                                                +        
               LTH=6                                                            
         MFLD  COL0218,                                                +        
               LTH=2                                                            
         MFLD  COL0918,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1718,                                                +        
               LTH=1                                                            
         MFLD  COL2518,                                                +        
               LTH=6                                                            
         MFLD  COL4320,                                                +        
               LTH=2                                                            
         MFLD  COL5020,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL5820,                                                +        
               LTH=1                                                            
         MFLD  COL6620,                                                +        
               LTH=6                                                            
         MFLD  COL4321,                                                +        
               LTH=2                                                            
         MFLD  COL5021,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL5821,                                                +        
               LTH=1                                                            
         MFLD  COL6621,                                                +        
               LTH=6                                                            
         MFLD  COL4322,                                                +        
               LTH=2                                                            
         MFLD  COL5022,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL5822,                                                +        
               LTH=1                                                            
         MFLD  COL6622,                                                +        
               LTH=6                                                            
         MFLD  COL4323,                                                +        
               LTH=2                                                            
         MFLD  COL5023,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL5823,                                                +        
               LTH=1                                                            
         MFLD  COL6623,                                                +        
               LTH=6                                                            
         MFLD  COL4324,                                                +        
               LTH=2                                                            
         MFLD  COL5024,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL5824,                                                +        
               LTH=1                                                            
         MFLD  COL6624,                                                +        
               LTH=6                                                            
         MFLD  COL4325,                                                +        
               LTH=2                                                            
         MFLD  COL5025,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL5825,                                                +        
               LTH=1                                                            
         MFLD  COL6625,                                                +        
               LTH=6                                                            
         MFLD  COL4326,                                                +        
               LTH=2                                                            
         MFLD  COL5026,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL5826,                                                +        
               LTH=1                                                            
         MFLD  COL6626,                                                +        
               LTH=6                                                            
         MFLD  COL4327,                                                +        
               LTH=2                                                            
         MFLD  COL5027,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL5827,                                                +        
               LTH=1                                                            
         MFLD  COL6627,                                                +        
               LTH=6                                                            
         MFLD  COL4328,                                                +        
               LTH=2                                                            
         MFLD  COL5028,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL5828,                                                +        
               LTH=1                                                            
         MFLD  COL6628,                                                +        
               LTH=6                                                            
         MFLD  COL4329,                                                +        
               LTH=2                                                            
         MFLD  COL5029,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL5829,                                                +        
               LTH=1                                                            
         MFLD  COL6629,                                                +        
               LTH=6                                                            
         MFLD  COL4330,                                                +        
               LTH=2                                                            
         MFLD  COL5030,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL5830,                                                +        
               LTH=1                                                            
         MFLD  COL6630,                                                +        
               LTH=6                                                            
         MFLD  FLD1743,                                                +        
               LTH=2                                                            
         MFLD  FLD1750,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1758,                                                +        
               LTH=1                                                            
         MFLD  FLD1766,                                                +        
               LTH=6                                                            
         MFLD  FLD1836,                                                +        
               LTH=38                                                           
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I31801 MSG   TYPE=INPUT,                                             +        
               SOR=(W4F318),                                           +        
               OPT=2,                                                  +        
               NXT=W4O31801                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F8'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '43181',                                                +        
               LTH=5                                                            
         MFLD  (FLD0210,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0310,                                                +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0002,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0003,                                               +        
               LTH=4                                                            
         MFLD  (FLD0232,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0006,                                               +        
               LTH=6                                                            
         MFLD  (DGIA0007,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0008,                                               +        
               LTH=5                                                            
         MFLD  (DGIA0004,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0005,                                               +        
               LTH=5                                                            
         MFLD  (DGIA0009,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0010,                                               +        
               LTH=7                                                            
         MFLD  (DGIA0000,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  DGIA0001,                                               +        
               LTH=2                                                            
         MFLD  FLD0456,                                                +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0460,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0465,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD1743,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1750,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1758,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1766,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD2002,                                                +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  FLD2006,                                                +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD2010,                                                +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLNXTODL,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLOKODEL,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
