***********************************************************************         
* CREATED BY V036147   ON 07/10/25  AT 10:54                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE '                                '                               
W4F324   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W4T324 7',                                           +        
               8='W4T324 8',                                           +        
               9='W4T324 9',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T321  ',                                          +        
               14='W4T322  ',                                          +        
               15='W4T323  ',                                          +        
               16='W4T324  ',                                          +        
               17='W4T325  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,10)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'PÅBÖRJADE EJ AVSLUTADE ORDER',                         +        
               POS=(1,11),LTH=28,                                      +        
               ATTR=(PROT)                                                      
FLD0140  DFLD  POS=(1,40),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'PACKOMR',                                              +        
               POS=(2,2),LTH=7,                                        +        
               ATTR=(PROT)                                                      
FLD0210  DFLD  POS=(2,10),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DISTR',                                                +        
               POS=(2,16),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0223  DFLD  POS=(2,22),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'KUND',                                                 +        
               POS=(2,27),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0234  DFLD  POS=(2,32),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'ORDER',                                                +        
               POS=(2,39),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0248  DFLD  POS=(2,45),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'KLASS',                                                +        
               POS=(2,51),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0261  DFLD  POS=(2,57),LTH=1,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'PROD',                                                 +        
               POS=(2,63),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FLD0274  DFLD  POS=(2,68),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DC',                                                   +        
               POS=(2,76),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DCI      DFLD  POS=(2,79),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
FLD0310  DFLD  POS=(3,10),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0323  DFLD  POS=(3,22),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0334  DFLD  POS=(3,32),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0348  DFLD  POS=(3,45),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0361  DFLD  POS=(3,57),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0374  DFLD  POS=(3,68),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
DCO      DFLD  POS=(3,79),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0448  DFLD  POS=(4,48),LTH=11,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0461  DFLD  POS=(4,61),LTH=7,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'BEGÄRD',                                               +        
               POS=(5,6),LTH=6,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'ANTAL  ANTAL  ANT  UTSKR  START',                      +        
               POS=(5,50),LTH=31,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'CMD PACKDAT KL DISTR KUND   ORDER  FK  PROD',          +        
               POS=(6,2),LTH=43,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'RADER   PACK  KLI  DATUM  DATUM',                      +        
               POS=(6,50),LTH=31,                                      +        
               ATTR=(PROT)                                                      
KDCMD1   DFLD  POS=(7,3),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
DGIA0081 DFLD  POS=(7,7),LTH=5,                                        +        
               ATTR=(PROT)                                                      
KDORDKL1 DFLD  POS=(7,14),LTH=1,                                       +        
               ATTR=(PROT)                                                      
IDDISTR1 DFLD  POS=(7,17),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0004 DFLD  POS=(7,23),LTH=6,                                       +        
               ATTR=(PROT)                                                      
IDORDNR1 DFLD  POS=(7,30),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
KDFRAKT1 DFLD  POS=(7,37),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DGIA0021 DFLD  POS=(7,41),LTH=7,                                       +        
               ATTR=(PROT)                                                      
DGIA0068 DFLD  POS=(7,50),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DGIA0055 DFLD  POS=(7,57),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DGIA0042 DFLD  POS=(7,63),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
TIUTSKR1 DFLD  POS=(7,69),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DGIA0094 DFLD  POS=(7,76),LTH=5,                                       +        
               ATTR=(PROT)                                                      
KDCMD2   DFLD  POS=(8,3),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
DGIA0086 DFLD  POS=(8,7),LTH=5,                                        +        
               ATTR=(PROT)                                                      
KDORDKL2 DFLD  POS=(8,14),LTH=1,                                       +        
               ATTR=(PROT)                                                      
IDDISTR2 DFLD  POS=(8,17),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0009 DFLD  POS=(8,23),LTH=6,                                       +        
               ATTR=(PROT)                                                      
IDORDNR2 DFLD  POS=(8,30),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
KDFRAKT2 DFLD  POS=(8,37),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DGIA0026 DFLD  POS=(8,41),LTH=7,                                       +        
               ATTR=(PROT)                                                      
DGIA0073 DFLD  POS=(8,50),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DGIA0060 DFLD  POS=(8,57),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DGIA0047 DFLD  POS=(8,63),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
TIUTSKR2 DFLD  POS=(8,69),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DGIA0099 DFLD  POS=(8,76),LTH=5,                                       +        
               ATTR=(PROT)                                                      
KDCMD3   DFLD  POS=(9,3),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
DGIA0087 DFLD  POS=(9,7),LTH=5,                                        +        
               ATTR=(PROT)                                                      
KDORDKL3 DFLD  POS=(9,14),LTH=1,                                       +        
               ATTR=(PROT)                                                      
IDDISTR3 DFLD  POS=(9,17),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0010 DFLD  POS=(9,23),LTH=6,                                       +        
               ATTR=(PROT)                                                      
IDORDNR3 DFLD  POS=(9,30),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
KDFRAKT3 DFLD  POS=(9,37),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DGIA0027 DFLD  POS=(9,41),LTH=7,                                       +        
               ATTR=(PROT)                                                      
DGIA0074 DFLD  POS=(9,50),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DGIA0061 DFLD  POS=(9,57),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DGIA0048 DFLD  POS=(9,63),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
TIUTSKR3 DFLD  POS=(9,69),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DGIA0100 DFLD  POS=(9,76),LTH=5,                                       +        
               ATTR=(PROT)                                                      
KDCMD4   DFLD  POS=(10,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0088 DFLD  POS=(10,7),LTH=5,                                       +        
               ATTR=(PROT)                                                      
KDORDKL4 DFLD  POS=(10,14),LTH=1,                                      +        
               ATTR=(PROT)                                                      
IDDISTR4 DFLD  POS=(10,17),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0011 DFLD  POS=(10,23),LTH=6,                                      +        
               ATTR=(PROT)                                                      
IDORDNR4 DFLD  POS=(10,30),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KDFRAKT4 DFLD  POS=(10,37),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0028 DFLD  POS=(10,41),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DGIA0075 DFLD  POS=(10,50),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0062 DFLD  POS=(10,57),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0049 DFLD  POS=(10,63),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
TIUTSKR4 DFLD  POS=(10,69),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0101 DFLD  POS=(10,76),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KDCMD5   DFLD  POS=(11,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0089 DFLD  POS=(11,7),LTH=5,                                       +        
               ATTR=(PROT)                                                      
KDORDKL5 DFLD  POS=(11,14),LTH=1,                                      +        
               ATTR=(PROT)                                                      
IDDISTR5 DFLD  POS=(11,17),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0012 DFLD  POS=(11,23),LTH=6,                                      +        
               ATTR=(PROT)                                                      
IDORDNR5 DFLD  POS=(11,30),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KDFRAKT5 DFLD  POS=(11,37),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0029 DFLD  POS=(11,41),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DGIA0076 DFLD  POS=(11,50),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0063 DFLD  POS=(11,57),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0050 DFLD  POS=(11,63),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
TIUTSKR5 DFLD  POS=(11,69),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0102 DFLD  POS=(11,76),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KDCMD6   DFLD  POS=(12,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0090 DFLD  POS=(12,7),LTH=5,                                       +        
               ATTR=(PROT)                                                      
KDORDKL6 DFLD  POS=(12,14),LTH=1,                                      +        
               ATTR=(PROT)                                                      
IDDISTR6 DFLD  POS=(12,17),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0013 DFLD  POS=(12,23),LTH=6,                                      +        
               ATTR=(PROT)                                                      
IDORDNR6 DFLD  POS=(12,30),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KDFRAKT6 DFLD  POS=(12,37),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0030 DFLD  POS=(12,41),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DGIA0077 DFLD  POS=(12,50),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0064 DFLD  POS=(12,57),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0051 DFLD  POS=(12,63),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
TIUTSKR6 DFLD  POS=(12,69),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0103 DFLD  POS=(12,76),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KDCMD7   DFLD  POS=(13,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0091 DFLD  POS=(13,7),LTH=5,                                       +        
               ATTR=(PROT)                                                      
KDORDKL7 DFLD  POS=(13,14),LTH=1,                                      +        
               ATTR=(PROT)                                                      
IDDISTR7 DFLD  POS=(13,17),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0014 DFLD  POS=(13,23),LTH=6,                                      +        
               ATTR=(PROT)                                                      
IDORDNR7 DFLD  POS=(13,30),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KDFRAKT7 DFLD  POS=(13,37),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0031 DFLD  POS=(13,41),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DGIA0078 DFLD  POS=(13,50),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0065 DFLD  POS=(13,57),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0052 DFLD  POS=(13,63),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
TIUTSKR7 DFLD  POS=(13,69),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0104 DFLD  POS=(13,76),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KDCMD8   DFLD  POS=(14,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0092 DFLD  POS=(14,7),LTH=5,                                       +        
               ATTR=(PROT)                                                      
KDORDKL8 DFLD  POS=(14,14),LTH=1,                                      +        
               ATTR=(PROT)                                                      
IDDISTR8 DFLD  POS=(14,17),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0015 DFLD  POS=(14,23),LTH=6,                                      +        
               ATTR=(PROT)                                                      
IDORDNR8 DFLD  POS=(14,30),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KDFRAKT8 DFLD  POS=(14,37),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0032 DFLD  POS=(14,41),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DGIA0079 DFLD  POS=(14,50),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0066 DFLD  POS=(14,57),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0053 DFLD  POS=(14,63),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
TIUTSKR8 DFLD  POS=(14,69),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0105 DFLD  POS=(14,76),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KDCMD9   DFLD  POS=(15,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0093 DFLD  POS=(15,7),LTH=5,                                       +        
               ATTR=(PROT)                                                      
KDORDKL9 DFLD  POS=(15,14),LTH=1,                                      +        
               ATTR=(PROT)                                                      
IDDISTR9 DFLD  POS=(15,17),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0016 DFLD  POS=(15,23),LTH=6,                                      +        
               ATTR=(PROT)                                                      
IDORDNR9 DFLD  POS=(15,30),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KDFRAKT9 DFLD  POS=(15,37),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0033 DFLD  POS=(15,41),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DGIA0080 DFLD  POS=(15,50),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0067 DFLD  POS=(15,57),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0054 DFLD  POS=(15,63),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
TIUTSKR9 DFLD  POS=(15,69),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0106 DFLD  POS=(15,76),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KDCMD10  DFLD  POS=(16,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0082 DFLD  POS=(16,7),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DGIA0038 DFLD  POS=(16,14),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0000 DFLD  POS=(16,17),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0005 DFLD  POS=(16,23),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0017 DFLD  POS=(16,30),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0034 DFLD  POS=(16,37),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0022 DFLD  POS=(16,41),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DGIA0069 DFLD  POS=(16,50),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0056 DFLD  POS=(16,57),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0043 DFLD  POS=(16,63),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0107 DFLD  POS=(16,69),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0095 DFLD  POS=(16,76),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KDCMD11  DFLD  POS=(17,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0083 DFLD  POS=(17,7),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DGIA0039 DFLD  POS=(17,14),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0001 DFLD  POS=(17,17),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0006 DFLD  POS=(17,23),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0018 DFLD  POS=(17,30),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0035 DFLD  POS=(17,37),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0023 DFLD  POS=(17,41),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DGIA0070 DFLD  POS=(17,50),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0057 DFLD  POS=(17,57),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0044 DFLD  POS=(17,63),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0108 DFLD  POS=(17,69),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0096 DFLD  POS=(17,76),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KDCMD12  DFLD  POS=(18,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0084 DFLD  POS=(18,7),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DGIA0040 DFLD  POS=(18,14),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0002 DFLD  POS=(18,17),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0007 DFLD  POS=(18,23),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0019 DFLD  POS=(18,30),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0036 DFLD  POS=(18,37),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0024 DFLD  POS=(18,41),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DGIA0071 DFLD  POS=(18,50),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0058 DFLD  POS=(18,57),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0045 DFLD  POS=(18,63),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0109 DFLD  POS=(18,69),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0097 DFLD  POS=(18,76),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KDCMD13  DFLD  POS=(19,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0085 DFLD  POS=(19,7),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DGIA0041 DFLD  POS=(19,14),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0003 DFLD  POS=(19,17),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0008 DFLD  POS=(19,23),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0020 DFLD  POS=(19,30),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0037 DFLD  POS=(19,37),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0025 DFLD  POS=(19,41),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DGIA0072 DFLD  POS=(19,50),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0059 DFLD  POS=(19,57),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0046 DFLD  POS=(19,63),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0110 DFLD  POS=(19,69),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0098 DFLD  POS=(19,76),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '13 EJ RAPP RAD  14 PU HUVUD',                          +        
               POS=(21,2),LTH=27,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '15 PU RADER',                                          +        
               POS=(21,34),LTH=11,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '16 PÅB.EJ AVSL  17 NOLLJAGARE',                        +        
               POS=(21,50),LTH=29,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'F9 Jump to 4312 10 WHELP',                             +        
               POS=(22,50),LTH=24,                                     +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(23,59),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W4O32401 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4F324,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I32401,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001,                                           +        
               NXT=W4I32401                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0140,                                                +        
               LTH=40                                                           
         MFLD  FLD0210,                                                +        
               LTH=2                                                            
         MFLD  FLD0310,                                                +        
               LTH=5                                                            
         MFLD  FLD0223,                                                +        
               LTH=2                                                            
         MFLD  FLD0323,                                                +        
               LTH=4                                                            
         MFLD  FLD0234,                                                +        
               LTH=2                                                            
         MFLD  FLD0334,                                                +        
               LTH=6                                                            
         MFLD  FLD0248,                                                +        
               LTH=2                                                            
         MFLD  FLD0348,                                                +        
               LTH=5                                                            
         MFLD  FLD0261,                                                +        
               LTH=2                                                            
         MFLD  FLD0361,                                                +        
               LTH=1                                                            
         MFLD  FLD0274,                                                +        
               LTH=2                                                            
         MFLD  FLD0374,                                                +        
               LTH=7                                                            
         MFLD  DCI,                                                    +        
               LTH=2                                                            
         MFLD  DCO,                                                    +        
               LTH=2                                                            
         MFLD  FLD0448,                                                +        
               LTH=11                                                           
         MFLD  FLD0461,                                                +        
               LTH=7                                                            
         MFLD  KDCMD1,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0081,                                               +        
               LTH=5                                                            
         MFLD  KDORDKL1,                                               +        
               LTH=1                                                            
         MFLD  IDDISTR1,                                               +        
               LTH=4                                                            
         MFLD  DGIA0004,                                               +        
               LTH=6                                                            
         MFLD  IDORDNR1,                                               +        
               LTH=5                                                            
         MFLD  KDFRAKT1,                                               +        
               LTH=2                                                            
         MFLD  DGIA0021,                                               +        
               LTH=7                                                            
         MFLD  DGIA0068,                                               +        
               LTH=5                                                            
         MFLD  DGIA0055,                                               +        
               LTH=5                                                            
         MFLD  DGIA0042,                                               +        
               LTH=4                                                            
         MFLD  TIUTSKR1,                                               +        
               LTH=5                                                            
         MFLD  DGIA0094,                                               +        
               LTH=5                                                            
         MFLD  KDCMD2,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0086,                                               +        
               LTH=5                                                            
         MFLD  KDORDKL2,                                               +        
               LTH=1                                                            
         MFLD  IDDISTR2,                                               +        
               LTH=4                                                            
         MFLD  DGIA0009,                                               +        
               LTH=6                                                            
         MFLD  IDORDNR2,                                               +        
               LTH=5                                                            
         MFLD  KDFRAKT2,                                               +        
               LTH=2                                                            
         MFLD  DGIA0026,                                               +        
               LTH=7                                                            
         MFLD  DGIA0073,                                               +        
               LTH=5                                                            
         MFLD  DGIA0060,                                               +        
               LTH=5                                                            
         MFLD  DGIA0047,                                               +        
               LTH=4                                                            
         MFLD  TIUTSKR2,                                               +        
               LTH=5                                                            
         MFLD  DGIA0099,                                               +        
               LTH=5                                                            
         MFLD  KDCMD3,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0087,                                               +        
               LTH=5                                                            
         MFLD  KDORDKL3,                                               +        
               LTH=1                                                            
         MFLD  IDDISTR3,                                               +        
               LTH=4                                                            
         MFLD  DGIA0010,                                               +        
               LTH=6                                                            
         MFLD  IDORDNR3,                                               +        
               LTH=5                                                            
         MFLD  KDFRAKT3,                                               +        
               LTH=2                                                            
         MFLD  DGIA0027,                                               +        
               LTH=7                                                            
         MFLD  DGIA0074,                                               +        
               LTH=5                                                            
         MFLD  DGIA0061,                                               +        
               LTH=5                                                            
         MFLD  DGIA0048,                                               +        
               LTH=4                                                            
         MFLD  TIUTSKR3,                                               +        
               LTH=5                                                            
         MFLD  DGIA0100,                                               +        
               LTH=5                                                            
         MFLD  KDCMD4,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0088,                                               +        
               LTH=5                                                            
         MFLD  KDORDKL4,                                               +        
               LTH=1                                                            
         MFLD  IDDISTR4,                                               +        
               LTH=4                                                            
         MFLD  DGIA0011,                                               +        
               LTH=6                                                            
         MFLD  IDORDNR4,                                               +        
               LTH=5                                                            
         MFLD  KDFRAKT4,                                               +        
               LTH=2                                                            
         MFLD  DGIA0028,                                               +        
               LTH=7                                                            
         MFLD  DGIA0075,                                               +        
               LTH=5                                                            
         MFLD  DGIA0062,                                               +        
               LTH=5                                                            
         MFLD  DGIA0049,                                               +        
               LTH=4                                                            
         MFLD  TIUTSKR4,                                               +        
               LTH=5                                                            
         MFLD  DGIA0101,                                               +        
               LTH=5                                                            
         MFLD  KDCMD5,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0089,                                               +        
               LTH=5                                                            
         MFLD  KDORDKL5,                                               +        
               LTH=1                                                            
         MFLD  IDDISTR5,                                               +        
               LTH=4                                                            
         MFLD  DGIA0012,                                               +        
               LTH=6                                                            
         MFLD  IDORDNR5,                                               +        
               LTH=5                                                            
         MFLD  KDFRAKT5,                                               +        
               LTH=2                                                            
         MFLD  DGIA0029,                                               +        
               LTH=7                                                            
         MFLD  DGIA0076,                                               +        
               LTH=5                                                            
         MFLD  DGIA0063,                                               +        
               LTH=5                                                            
         MFLD  DGIA0050,                                               +        
               LTH=4                                                            
         MFLD  TIUTSKR5,                                               +        
               LTH=5                                                            
         MFLD  DGIA0102,                                               +        
               LTH=5                                                            
         MFLD  KDCMD6,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0090,                                               +        
               LTH=5                                                            
         MFLD  KDORDKL6,                                               +        
               LTH=1                                                            
         MFLD  IDDISTR6,                                               +        
               LTH=4                                                            
         MFLD  DGIA0013,                                               +        
               LTH=6                                                            
         MFLD  IDORDNR6,                                               +        
               LTH=5                                                            
         MFLD  KDFRAKT6,                                               +        
               LTH=2                                                            
         MFLD  DGIA0030,                                               +        
               LTH=7                                                            
         MFLD  DGIA0077,                                               +        
               LTH=5                                                            
         MFLD  DGIA0064,                                               +        
               LTH=5                                                            
         MFLD  DGIA0051,                                               +        
               LTH=4                                                            
         MFLD  TIUTSKR6,                                               +        
               LTH=5                                                            
         MFLD  DGIA0103,                                               +        
               LTH=5                                                            
         MFLD  KDCMD7,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0091,                                               +        
               LTH=5                                                            
         MFLD  KDORDKL7,                                               +        
               LTH=1                                                            
         MFLD  IDDISTR7,                                               +        
               LTH=4                                                            
         MFLD  DGIA0014,                                               +        
               LTH=6                                                            
         MFLD  IDORDNR7,                                               +        
               LTH=5                                                            
         MFLD  KDFRAKT7,                                               +        
               LTH=2                                                            
         MFLD  DGIA0031,                                               +        
               LTH=7                                                            
         MFLD  DGIA0078,                                               +        
               LTH=5                                                            
         MFLD  DGIA0065,                                               +        
               LTH=5                                                            
         MFLD  DGIA0052,                                               +        
               LTH=4                                                            
         MFLD  TIUTSKR7,                                               +        
               LTH=5                                                            
         MFLD  DGIA0104,                                               +        
               LTH=5                                                            
         MFLD  KDCMD8,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0092,                                               +        
               LTH=5                                                            
         MFLD  KDORDKL8,                                               +        
               LTH=1                                                            
         MFLD  IDDISTR8,                                               +        
               LTH=4                                                            
         MFLD  DGIA0015,                                               +        
               LTH=6                                                            
         MFLD  IDORDNR8,                                               +        
               LTH=5                                                            
         MFLD  KDFRAKT8,                                               +        
               LTH=2                                                            
         MFLD  DGIA0032,                                               +        
               LTH=7                                                            
         MFLD  DGIA0079,                                               +        
               LTH=5                                                            
         MFLD  DGIA0066,                                               +        
               LTH=5                                                            
         MFLD  DGIA0053,                                               +        
               LTH=4                                                            
         MFLD  TIUTSKR8,                                               +        
               LTH=5                                                            
         MFLD  DGIA0105,                                               +        
               LTH=5                                                            
         MFLD  KDCMD9,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0093,                                               +        
               LTH=5                                                            
         MFLD  KDORDKL9,                                               +        
               LTH=1                                                            
         MFLD  IDDISTR9,                                               +        
               LTH=4                                                            
         MFLD  DGIA0016,                                               +        
               LTH=6                                                            
         MFLD  IDORDNR9,                                               +        
               LTH=5                                                            
         MFLD  KDFRAKT9,                                               +        
               LTH=2                                                            
         MFLD  DGIA0033,                                               +        
               LTH=7                                                            
         MFLD  DGIA0080,                                               +        
               LTH=5                                                            
         MFLD  DGIA0067,                                               +        
               LTH=5                                                            
         MFLD  DGIA0054,                                               +        
               LTH=4                                                            
         MFLD  TIUTSKR9,                                               +        
               LTH=5                                                            
         MFLD  DGIA0106,                                               +        
               LTH=5                                                            
         MFLD  KDCMD10,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0082,                                               +        
               LTH=5                                                            
         MFLD  DGIA0038,                                               +        
               LTH=1                                                            
         MFLD  DGIA0000,                                               +        
               LTH=4                                                            
         MFLD  DGIA0005,                                               +        
               LTH=6                                                            
         MFLD  DGIA0017,                                               +        
               LTH=5                                                            
         MFLD  DGIA0034,                                               +        
               LTH=2                                                            
         MFLD  DGIA0022,                                               +        
               LTH=7                                                            
         MFLD  DGIA0069,                                               +        
               LTH=5                                                            
         MFLD  DGIA0056,                                               +        
               LTH=5                                                            
         MFLD  DGIA0043,                                               +        
               LTH=4                                                            
         MFLD  DGIA0107,                                               +        
               LTH=5                                                            
         MFLD  DGIA0095,                                               +        
               LTH=5                                                            
         MFLD  KDCMD11,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0083,                                               +        
               LTH=5                                                            
         MFLD  DGIA0039,                                               +        
               LTH=1                                                            
         MFLD  DGIA0001,                                               +        
               LTH=4                                                            
         MFLD  DGIA0006,                                               +        
               LTH=6                                                            
         MFLD  DGIA0018,                                               +        
               LTH=5                                                            
         MFLD  DGIA0035,                                               +        
               LTH=2                                                            
         MFLD  DGIA0023,                                               +        
               LTH=7                                                            
         MFLD  DGIA0070,                                               +        
               LTH=5                                                            
         MFLD  DGIA0057,                                               +        
               LTH=5                                                            
         MFLD  DGIA0044,                                               +        
               LTH=4                                                            
         MFLD  DGIA0108,                                               +        
               LTH=5                                                            
         MFLD  DGIA0096,                                               +        
               LTH=5                                                            
         MFLD  KDCMD12,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0084,                                               +        
               LTH=5                                                            
         MFLD  DGIA0040,                                               +        
               LTH=1                                                            
         MFLD  DGIA0002,                                               +        
               LTH=4                                                            
         MFLD  DGIA0007,                                               +        
               LTH=6                                                            
         MFLD  DGIA0019,                                               +        
               LTH=5                                                            
         MFLD  DGIA0036,                                               +        
               LTH=2                                                            
         MFLD  DGIA0024,                                               +        
               LTH=7                                                            
         MFLD  DGIA0071,                                               +        
               LTH=5                                                            
         MFLD  DGIA0058,                                               +        
               LTH=5                                                            
         MFLD  DGIA0045,                                               +        
               LTH=4                                                            
         MFLD  DGIA0109,                                               +        
               LTH=5                                                            
         MFLD  DGIA0097,                                               +        
               LTH=5                                                            
         MFLD  KDCMD13,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0085,                                               +        
               LTH=5                                                            
         MFLD  DGIA0041,                                               +        
               LTH=1                                                            
         MFLD  DGIA0003,                                               +        
               LTH=4                                                            
         MFLD  DGIA0008,                                               +        
               LTH=6                                                            
         MFLD  DGIA0020,                                               +        
               LTH=5                                                            
         MFLD  DGIA0037,                                               +        
               LTH=2                                                            
         MFLD  DGIA0025,                                               +        
               LTH=7                                                            
         MFLD  DGIA0072,                                               +        
               LTH=5                                                            
         MFLD  DGIA0059,                                               +        
               LTH=5                                                            
         MFLD  DGIA0046,                                               +        
               LTH=4                                                            
         MFLD  DGIA0110,                                               +        
               LTH=5                                                            
         MFLD  DGIA0098,                                               +        
               LTH=5                                                            
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I32401 MSG   TYPE=INPUT,                                             +        
               SOR=(W4F324),                                           +        
               OPT=2,                                                  +        
               NXT=W4O32401                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '43241',                                                +        
               LTH=5                                                            
         MFLD  (FLD0210,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0310,                                                +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0223,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0323,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0234,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0334,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0248,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0348,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0261,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0361,                                                +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0274,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0374,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (DCI,                                                   +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  DCO,                                                    +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  FLD0448,                                                +        
               LTH=11,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0461,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (KDCMD1,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KDCMD2,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KDCMD3,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KDCMD4,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KDCMD5,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KDCMD6,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KDCMD7,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KDCMD8,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KDCMD9,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KDCMD10,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KDCMD11,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KDCMD12,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KDCMD13,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
