***********************************************************************         
* CREATED BY PC36147   ON 95/09/13  AT 08:03                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'DEFINIERA HUVUDLAGEROMRÅDE      '                               
W4F362   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYMSG,                                          +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W4T362 7',                                           +        
               8='W4T362 7',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T362U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T361  ',                                          +        
               14='W4T362  ',                                          +        
               15='W4T363  ',                                          +        
               16='W4T364  ',                                          +        
               17='W4T365  ',                                          +        
               18='W4T366  ',                                          +        
               19='W4T367  ',                                          +        
               20='W4T368  ',                                          +        
               21='W4T369  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W4F362   DPAGE CURSOR=((2,12)),                                        +        
               FILL=PT                                                          
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Definiera huvudlagerområde',                           +        
               POS=(1,11),LTH=26,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,40),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'HLO-tab',                                              +        
               POS=(2,4),LTH=7,                                        +        
               ATTR=(PROT)                                                      
TABELLID DFLD  POS=(2,12),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Huvudlager omr',                                       +        
               POS=(2,16),LTH=14,                                      +        
               ATTR=(PROT)                                                      
FLD0231  DFLD  POS=(2,31),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DC',                                                   +        
               POS=(2,35),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DGIA0198 DFLD  POS=(2,38),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FLD0312  DFLD  POS=(3,12),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0331  DFLD  POS=(3,31),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0199 DFLD  POS=(3,38),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'LO HLO  LO HLO  LO HLO  LO HLO  LO HLO  LO HLO  LO HLO +        
                LO HLO  LO HLO  LO HLO',                               +        
               POS=(5,2),LTH=78,                                       +        
               ATTR=(PROT)                                                      
DGIA0099 DFLD  POS=(6,2),LTH=2,                                        +        
               ATTR=(PROT,MOD)                                                  
DGIA0000 DFLD  POS=(6,6),LTH=2,                                        +        
               ATTR=(PROT,MOD)                                                  
DGIA0109 DFLD  POS=(6,10),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0010 DFLD  POS=(6,14),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0119 DFLD  POS=(6,18),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0020 DFLD  POS=(6,22),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0129 DFLD  POS=(6,26),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0030 DFLD  POS=(6,30),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0139 DFLD  POS=(6,34),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0040 DFLD  POS=(6,38),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0149 DFLD  POS=(6,42),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0050 DFLD  POS=(6,46),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0159 DFLD  POS=(6,50),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0060 DFLD  POS=(6,54),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0169 DFLD  POS=(6,58),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0070 DFLD  POS=(6,62),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0179 DFLD  POS=(6,66),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0080 DFLD  POS=(6,70),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0189 DFLD  POS=(6,74),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0090 DFLD  POS=(6,78),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0100 DFLD  POS=(7,2),LTH=2,                                        +        
               ATTR=(PROT,MOD)                                                  
DGIA0001 DFLD  POS=(7,6),LTH=2,                                        +        
               ATTR=(PROT,MOD)                                                  
DGIA0110 DFLD  POS=(7,10),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0011 DFLD  POS=(7,14),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0120 DFLD  POS=(7,18),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0021 DFLD  POS=(7,22),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0130 DFLD  POS=(7,26),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0031 DFLD  POS=(7,30),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0140 DFLD  POS=(7,34),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0041 DFLD  POS=(7,38),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0150 DFLD  POS=(7,42),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0051 DFLD  POS=(7,46),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0160 DFLD  POS=(7,50),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0061 DFLD  POS=(7,54),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0170 DFLD  POS=(7,58),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0071 DFLD  POS=(7,62),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0180 DFLD  POS=(7,66),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0081 DFLD  POS=(7,70),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0190 DFLD  POS=(7,74),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0091 DFLD  POS=(7,78),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0101 DFLD  POS=(8,2),LTH=2,                                        +        
               ATTR=(PROT,MOD)                                                  
DGIA0002 DFLD  POS=(8,6),LTH=2,                                        +        
               ATTR=(PROT,MOD)                                                  
DGIA0111 DFLD  POS=(8,10),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0012 DFLD  POS=(8,14),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0121 DFLD  POS=(8,18),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0022 DFLD  POS=(8,22),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0131 DFLD  POS=(8,26),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0032 DFLD  POS=(8,30),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0141 DFLD  POS=(8,34),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0042 DFLD  POS=(8,38),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0151 DFLD  POS=(8,42),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0052 DFLD  POS=(8,46),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0161 DFLD  POS=(8,50),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0062 DFLD  POS=(8,54),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0171 DFLD  POS=(8,58),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0072 DFLD  POS=(8,62),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0181 DFLD  POS=(8,66),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0082 DFLD  POS=(8,70),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0191 DFLD  POS=(8,74),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0092 DFLD  POS=(8,78),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0102 DFLD  POS=(9,2),LTH=2,                                        +        
               ATTR=(PROT,MOD)                                                  
DGIA0003 DFLD  POS=(9,6),LTH=2,                                        +        
               ATTR=(PROT,MOD)                                                  
DGIA0112 DFLD  POS=(9,10),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0013 DFLD  POS=(9,14),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0122 DFLD  POS=(9,18),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0023 DFLD  POS=(9,22),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0132 DFLD  POS=(9,26),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0033 DFLD  POS=(9,30),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0142 DFLD  POS=(9,34),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0043 DFLD  POS=(9,38),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0152 DFLD  POS=(9,42),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0053 DFLD  POS=(9,46),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0162 DFLD  POS=(9,50),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0063 DFLD  POS=(9,54),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0172 DFLD  POS=(9,58),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0073 DFLD  POS=(9,62),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0182 DFLD  POS=(9,66),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0083 DFLD  POS=(9,70),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0192 DFLD  POS=(9,74),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0093 DFLD  POS=(9,78),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0103 DFLD  POS=(10,2),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0004 DFLD  POS=(10,6),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0113 DFLD  POS=(10,10),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0014 DFLD  POS=(10,14),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0123 DFLD  POS=(10,18),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0024 DFLD  POS=(10,22),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0133 DFLD  POS=(10,26),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0034 DFLD  POS=(10,30),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0143 DFLD  POS=(10,34),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0044 DFLD  POS=(10,38),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0153 DFLD  POS=(10,42),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0054 DFLD  POS=(10,46),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0163 DFLD  POS=(10,50),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0064 DFLD  POS=(10,54),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0173 DFLD  POS=(10,58),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0074 DFLD  POS=(10,62),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0183 DFLD  POS=(10,66),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0084 DFLD  POS=(10,70),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0193 DFLD  POS=(10,74),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0094 DFLD  POS=(10,78),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0104 DFLD  POS=(11,2),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0005 DFLD  POS=(11,6),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0114 DFLD  POS=(11,10),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0015 DFLD  POS=(11,14),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0124 DFLD  POS=(11,18),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0025 DFLD  POS=(11,22),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0134 DFLD  POS=(11,26),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0035 DFLD  POS=(11,30),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0144 DFLD  POS=(11,34),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0045 DFLD  POS=(11,38),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0154 DFLD  POS=(11,42),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0055 DFLD  POS=(11,46),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0164 DFLD  POS=(11,50),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0065 DFLD  POS=(11,54),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0174 DFLD  POS=(11,58),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0075 DFLD  POS=(11,62),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0184 DFLD  POS=(11,66),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0085 DFLD  POS=(11,70),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0194 DFLD  POS=(11,74),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0095 DFLD  POS=(11,78),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0105 DFLD  POS=(12,2),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0006 DFLD  POS=(12,6),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0115 DFLD  POS=(12,10),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0016 DFLD  POS=(12,14),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0125 DFLD  POS=(12,18),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0026 DFLD  POS=(12,22),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0135 DFLD  POS=(12,26),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0036 DFLD  POS=(12,30),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0145 DFLD  POS=(12,34),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0046 DFLD  POS=(12,38),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0155 DFLD  POS=(12,42),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0056 DFLD  POS=(12,46),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0165 DFLD  POS=(12,50),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0066 DFLD  POS=(12,54),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0175 DFLD  POS=(12,58),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0076 DFLD  POS=(12,62),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0185 DFLD  POS=(12,66),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0086 DFLD  POS=(12,70),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0195 DFLD  POS=(12,74),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0096 DFLD  POS=(12,78),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0106 DFLD  POS=(13,2),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0007 DFLD  POS=(13,6),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0116 DFLD  POS=(13,10),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0017 DFLD  POS=(13,14),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0126 DFLD  POS=(13,18),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0027 DFLD  POS=(13,22),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0136 DFLD  POS=(13,26),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0037 DFLD  POS=(13,30),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0146 DFLD  POS=(13,34),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0047 DFLD  POS=(13,38),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0156 DFLD  POS=(13,42),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0057 DFLD  POS=(13,46),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0166 DFLD  POS=(13,50),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0067 DFLD  POS=(13,54),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0176 DFLD  POS=(13,58),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0077 DFLD  POS=(13,62),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0186 DFLD  POS=(13,66),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0087 DFLD  POS=(13,70),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0196 DFLD  POS=(13,74),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0097 DFLD  POS=(13,78),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0107 DFLD  POS=(14,2),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0008 DFLD  POS=(14,6),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0117 DFLD  POS=(14,10),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0018 DFLD  POS=(14,14),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0127 DFLD  POS=(14,18),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0028 DFLD  POS=(14,22),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0137 DFLD  POS=(14,26),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0038 DFLD  POS=(14,30),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0147 DFLD  POS=(14,34),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0048 DFLD  POS=(14,38),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0157 DFLD  POS=(14,42),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0058 DFLD  POS=(14,46),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0167 DFLD  POS=(14,50),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0068 DFLD  POS=(14,54),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0177 DFLD  POS=(14,58),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0078 DFLD  POS=(14,62),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0187 DFLD  POS=(14,66),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0088 DFLD  POS=(14,70),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0197 DFLD  POS=(14,74),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0098 DFLD  POS=(14,78),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0108 DFLD  POS=(15,2),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0009 DFLD  POS=(15,6),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0118 DFLD  POS=(15,10),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0019 DFLD  POS=(15,14),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0128 DFLD  POS=(15,18),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0029 DFLD  POS=(15,22),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0138 DFLD  POS=(15,26),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0039 DFLD  POS=(15,30),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0148 DFLD  POS=(15,34),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0049 DFLD  POS=(15,38),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0158 DFLD  POS=(15,42),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0059 DFLD  POS=(15,46),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0168 DFLD  POS=(15,50),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0069 DFLD  POS=(15,54),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0178 DFLD  POS=(15,58),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0079 DFLD  POS=(15,62),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0188 DFLD  POS=(15,66),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0089 DFLD  POS=(15,70),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
LO1      DFLD  POS=(19,2),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
HLO1     DFLD  POS=(19,6),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
LO2      DFLD  POS=(19,10),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
HLO2     DFLD  POS=(19,14),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
LO3      DFLD  POS=(19,18),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
HLO3     DFLD  POS=(19,22),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
LO4      DFLD  POS=(19,26),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
HLO4     DFLD  POS=(19,30),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
LO5      DFLD  POS=(19,34),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
HLO5     DFLD  POS=(19,38),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '13 P-klasstab   14 HLO-tabell   15 Ptid-tab    16 PRC-r+        
               egler   17 Printer/PRC',                                +        
               POS=(21,2),LTH=77,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18 PRCstyr-tab  19 Kundreg',                           +        
               POS=(22,2),LTH=26,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20 Gen arbtid  21 Dagl arbtid  10 WHELP',              +        
               POS=(22,34),LTH=39,                                     +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYMSG   DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4I36201 MSG   TYPE=INPUT,                                             +        
               SOR=(W4F362),                                           +        
               OPT=2,                                                  +        
               NXT=W4O36201                                                     
MID      LPAGE SOR=(W4F362)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '43621',                                                +        
               LTH=5                                                            
         MFLD  (TABELLID,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0312,                                                +        
               LTH=2                                                            
         MFLD  (DGIA0198,                                              +        
               '++'),                                                  +        
               LTH=2                                                            
         MFLD  DGIA0199,                                               +        
               LTH=2                                                            
         MFLD  (FLD0231,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0331,                                                +        
               LTH=2                                                            
         MFLD  (LO1,                                                   +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (HLO1,                                                  +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (LO2,                                                   +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (HLO2,                                                  +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (LO3,                                                   +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (HLO3,                                                  +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (LO4,                                                   +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (HLO4,                                                  +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (LO5,                                                   +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (HLO5,                                                  +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
W4O36201 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4F362,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I36201,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W4F362                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  TABELLID,                                               +        
               LTH=2                                                            
         MFLD  FLD0312,                                                +        
               LTH=2                                                            
         MFLD  DGIA0198,                                               +        
               LTH=2                                                            
         MFLD  DGIA0199,                                               +        
               LTH=2                                                            
         MFLD  FLD0231,                                                +        
               LTH=2                                                            
         MFLD  FLD0331,                                                +        
               LTH=2                                                            
         MFLD  DGIA0099,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0100,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0101,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0102,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0103,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0104,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0105,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0106,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0107,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0108,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0109,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0110,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0111,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0112,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0113,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0114,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0115,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0116,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0117,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0118,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0119,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0120,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0121,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0122,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0123,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0124,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0125,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0126,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0127,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0128,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0129,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0130,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0131,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0132,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0133,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0134,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0135,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0136,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0137,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0138,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0139,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0140,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0141,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0142,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0143,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0144,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0145,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0146,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0147,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0148,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0149,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0150,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0151,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0152,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0153,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0154,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0155,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0156,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0157,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0158,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0159,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0160,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0161,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0162,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0163,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0164,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0165,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0166,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0167,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0168,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0169,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0170,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0171,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0172,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0173,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0174,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0175,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0176,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0177,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0178,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0179,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0180,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0181,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0182,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0183,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0184,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0185,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0186,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0187,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0188,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0189,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0190,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0191,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0192,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0193,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0194,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0195,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0196,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0197,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0000,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0001,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0002,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0003,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0004,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0005,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0006,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0007,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0008,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0009,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0010,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0011,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0012,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0013,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0014,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0015,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0016,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0017,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0018,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0019,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0020,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0021,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0022,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0023,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0024,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0025,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0026,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0027,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0028,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0029,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0030,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0031,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0032,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0033,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0034,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0035,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0036,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0037,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0038,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0039,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0040,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0041,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0042,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0043,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0044,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0045,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0046,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0047,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0048,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0049,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0050,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0051,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0052,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0053,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0054,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0055,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0056,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0057,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0058,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0059,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0060,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0061,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0062,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0063,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0064,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0065,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0066,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0067,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0068,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0069,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0070,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0071,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0072,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0073,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0074,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0075,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0076,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0077,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0078,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0079,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0080,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0081,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0082,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0083,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0084,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0085,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0086,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0087,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0088,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0089,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0090,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0091,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0092,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0093,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0094,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0095,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0096,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0097,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0098,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LO1,                                                    +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  HLO1,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LO2,                                                    +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  HLO2,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LO3,                                                    +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  HLO3,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LO4,                                                    +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  HLO4,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LO5,                                                    +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  HLO5,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  FSYMSG,                                                 +        
               LTH=79                                                           
         MSGEND                                                                 
         END                                                                    
