***********************************************************************         
* CREATED BY PCC6483   ON 97/03/05  AT 07:22                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'FRÅGA PÅ ORDER KUNDINFO         '                               
W4F504   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W4T504 4',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T501  ',                                          +        
               14='W4T502  ',                                          +        
               15='W4T503  ',                                          +        
               16='W4T504  ',                                          +        
               17='W4T505  ',                                          +        
               18='W4T506  ',                                          +        
               19='W4T507  ',                                          +        
               20='W4T508  ',                                          +        
               21='W4T509  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((2,7)),                                         +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'FRÅGA ORDER KUNDINFO',                                 +        
               POS=(1,12),LTH=20,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Dist',                                                 +        
               POS=(2,2),LTH=4,                                        +        
               ATTR=(ALPHA,PROT)                                                
IDDISTRI DFLD  POS=(2,7),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Kund',                                                 +        
               POS=(2,12),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
IDKUNDNI DFLD  POS=(2,17),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Order',                                                +        
               POS=(2,24),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
IDORDNRI DFLD  POS=(2,30),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Art',                                                  +        
               POS=(2,38),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
IDARTNRI DFLD  POS=(2,42),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Kli',                                                  +        
               POS=(2,52),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
IDKOLLI  DFLD  POS=(2,56),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Prod',                                                 +        
               POS=(2,62),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0000 DFLD  POS=(2,67),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DC',                                                   +        
               POS=(2,75),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
IDDCI    DFLD  POS=(2,78),LTH=2,                                       +        
               ATTR=(ALPHA,NOPROT)                                              
         DFLD  ' ',                                                    +        
               POS=(3,1),LTH=1,                                        +        
               ATTR=(ALPHA)                                                     
IDDISTRU DFLD  POS=(3,7),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
IDKUNDNU DFLD  POS=(3,17),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
IDORDNRU DFLD  POS=(3,30),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
IDARTNRU DFLD  POS=(3,42),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
IDKOLLU  DFLD  POS=(3,56),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0001 DFLD  POS=(3,67),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
IDDCU    DFLD  POS=(3,78),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Skrivare/Proformadokument',                            +        
               POS=(5,52),LTH=25,                                      +        
               ATTR=(PROT)                                                      
DGIA0002 DFLD  POS=(5,78),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Kundref',                                              +        
               POS=(6,2),LTH=7,                                        +        
               ATTR=(NUM,PROT)                                                  
BEKUNDRF DFLD  POS=(6,10),LTH=15,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Kampanjref',                                           +        
               POS=(6,29),LTH=10,                                      +        
               ATTR=(PROT)                                                      
KAMPREF  DFLD  POS=(6,40),LTH=7,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Regdat',                                               +        
               POS=(7,2),LTH=6,                                        +        
               ATTR=(PROT)                                                      
TIREGDAT DFLD  POS=(7,9),LTH=6,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'RFS',                                                  +        
               POS=(7,17),LTH=3,                                       +        
               ATTR=(PROT)                                                      
TIRFS    DFLD  POS=(7,21),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'TrpId',                                                +        
               POS=(7,29),LTH=5,                                       +        
               ATTR=(PROT)                                                      
IDTRP    DFLD  POS=(7,35),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Avgdat',                                               +        
               POS=(7,42),LTH=6,                                       +        
               ATTR=(PROT)                                                      
TIAAMMDD DFLD  POS=(7,49),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'tid',                                                  +        
               POS=(7,57),LTH=3,                                       +        
               ATTR=(PROT)                                                      
TIHHMM   DFLD  POS=(7,61),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Köparens namn',                                        +        
               POS=(9,2),LTH=13,                                       +        
               ATTR=(PROT)                                                      
BEKOP1   DFLD  POS=(9,18),LTH=35,                                      +        
               ATTR=(PROT)                                                      
BEKOP2   DFLD  POS=(10,18),LTH=35,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Köparens adress',                                      +        
               POS=(11,2),LTH=15,                                      +        
               ATTR=(PROT)                                                      
ADKOP1   DFLD  POS=(11,18),LTH=35,                                     +        
               ATTR=(PROT)                                                      
ADKOP2   DFLD  POS=(12,18),LTH=35,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Godsmottagare',                                        +        
               POS=(14,9),LTH=13,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Betalningsansvarig',                                   +        
               POS=(14,46),LTH=18,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Namn',                                                 +        
               POS=(15,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
BEGMT1   DFLD  POS=(15,9),LTH=35,                                      +        
               ATTR=(PROT)                                                      
BEBET1   DFLD  POS=(15,46),LTH=35,                                     +        
               ATTR=(PROT)                                                      
BEGMT2   DFLD  POS=(16,9),LTH=35,                                      +        
               ATTR=(PROT)                                                      
BEBET2   DFLD  POS=(16,46),LTH=35,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Adress',                                               +        
               POS=(17,2),LTH=6,                                       +        
               ATTR=(ALPHA,PROT)                                                
ADGMT1   DFLD  POS=(17,9),LTH=35,                                      +        
               ATTR=(PROT)                                                      
ADBET1   DFLD  POS=(17,46),LTH=35,                                     +        
               ATTR=(PROT)                                                      
ADGMT2   DFLD  POS=(18,9),LTH=35,                                      +        
               ATTR=(PROT)                                                      
ADBET2   DFLD  POS=(18,46),LTH=35,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Godsmärkning',                                         +        
               POS=(19,2),LTH=12,                                      +        
               ATTR=(ALPHA,PROT)                                                
BEGDMRK1 DFLD  POS=(19,15),LTH=30,                                     +        
               ATTR=(PROT)                                                      
BEGDMRK2 DFLD  POS=(19,46),LTH=30,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '13 Order allm  14 Order artikel 15 Order värde 16 Order+        
                kundinfo 17 Pack/last',                                +        
               POS=(21,2),LTH=77,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18 Last kollin 19 Arkiv PU',                           +        
               POS=(22,2),LTH=26,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20 Kollin',                                            +        
               POS=(22,34),LTH=9,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21 Fråga artikel  10 WHELP',                           +        
               POS=(22,49),LTH=26,                                     +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4I50401 MSG   TYPE=INPUT,                                             +        
               SOR=(W4F504),                                           +        
               OPT=2,                                                  +        
               NXT=W4O50401                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '45041',                                                +        
               LTH=5                                                            
         MFLD  (IDDISTRI,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDDISTRU,                                               +        
               LTH=4                                                            
         MFLD  (IDKUNDNI,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDKUNDNU,                                               +        
               LTH=6                                                            
         MFLD  (IDORDNRI,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDORDNRU,                                               +        
               LTH=7                                                            
         MFLD  (IDARTNRI,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDARTNRU,                                               +        
               LTH=9                                                            
         MFLD  (IDKOLLI,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDKOLLU,                                                +        
               LTH=5                                                            
         MFLD  (DGIA0000,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0001,                                               +        
               LTH=7                                                            
         MFLD  (IDDCI,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  IDDCU,                                                  +        
               LTH=2                                                            
         MFLD  DGIA0002,                                               +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MSGEND                                                                 
W4O50401 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4F504,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I50401,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDDISTRI,                                               +        
               LTH=2                                                            
         MFLD  IDDISTRU,                                               +        
               LTH=4                                                            
         MFLD  IDKUNDNI,                                               +        
               LTH=2                                                            
         MFLD  IDKUNDNU,                                               +        
               LTH=6                                                            
         MFLD  IDORDNRI,                                               +        
               LTH=2                                                            
         MFLD  IDORDNRU,                                               +        
               LTH=7                                                            
         MFLD  IDARTNRI,                                               +        
               LTH=2                                                            
         MFLD  IDARTNRU,                                               +        
               LTH=9                                                            
         MFLD  IDKOLLI,                                                +        
               LTH=2                                                            
         MFLD  IDKOLLU,                                                +        
               LTH=5                                                            
         MFLD  DGIA0000,                                               +        
               LTH=2                                                            
         MFLD  DGIA0001,                                               +        
               LTH=7                                                            
         MFLD  IDDCI,                                                  +        
               LTH=2                                                            
         MFLD  IDDCU,                                                  +        
               LTH=2                                                            
         MFLD  DGIA0002,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BEKUNDRF,                                               +        
               LTH=15                                                           
         MFLD  KAMPREF,                                                +        
               LTH=7                                                            
         MFLD  TIREGDAT,                                               +        
               LTH=6                                                            
         MFLD  TIRFS,                                                  +        
               LTH=6                                                            
         MFLD  IDTRP,                                                  +        
               LTH=5                                                            
         MFLD  TIAAMMDD,                                               +        
               LTH=6                                                            
         MFLD  TIHHMM,                                                 +        
               LTH=5                                                            
         MFLD  BEKOP1,                                                 +        
               LTH=35                                                           
         MFLD  BEKOP2,                                                 +        
               LTH=35                                                           
         MFLD  ADKOP1,                                                 +        
               LTH=35                                                           
         MFLD  ADKOP2,                                                 +        
               LTH=35                                                           
         MFLD  BEGMT1,                                                 +        
               LTH=35                                                           
         MFLD  BEBET1,                                                 +        
               LTH=35                                                           
         MFLD  BEGMT2,                                                 +        
               LTH=35                                                           
         MFLD  BEBET2,                                                 +        
               LTH=35                                                           
         MFLD  ADGMT1,                                                 +        
               LTH=35                                                           
         MFLD  ADBET1,                                                 +        
               LTH=35                                                           
         MFLD  ADGMT2,                                                 +        
               LTH=35                                                           
         MFLD  ADBET2,                                                 +        
               LTH=35                                                           
         MFLD  BEGDMRK1,                                               +        
               LTH=30                                                           
         MFLD  BEGDMRK2,                                               +        
               LTH=30                                                           
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
