***********************************************************************         
* CREATED BY V077376   ON 02/03/28  AT 08:14                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE '                                '                               
W4F573   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W4T573 7',                                           +        
               8='W4T573 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T573U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T571  ',                                          +        
               14='W4T572  ',                                          +        
               15='W4T573  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W4T573  ',                                          +        
               24='  RCL.  ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,8)),                                         +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'RESERVERADE RO/TPO',                                   +        
               POS=(1,12),LTH=18,                                      +        
               ATTR=(PROT)                                                      
FLD0136  DFLD  POS=(1,36),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Distr',                                                +        
               POS=(2,2),LTH=5,                                        +        
               ATTR=(PROT)                                                      
FLD0208  DFLD  POS=(2,8),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Kund',                                                 +        
               POS=(2,13),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0218  DFLD  POS=(2,18),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Artikel',                                              +        
               POS=(2,25),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0233  DFLD  POS=(2,33),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Kl',                                                   +        
               POS=(2,43),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0246  DFLD  POS=(2,46),LTH=1,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Psl',                                                  +        
               POS=(2,48),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0252  DFLD  POS=(2,52),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Order',                                                +        
               POS=(2,55),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0261  DFLD  POS=(2,61),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'TPO',                                                  +        
               POS=(2,67),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0271  DFLD  POS=(2,71),LTH=1,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DC',                                                   +        
               POS=(2,73),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0276  DFLD  POS=(2,76),LTH=2,                                       +        
               ATTR=(ALPHA,NOPROT)                                              
FLD0308  DFLD  POS=(3,8),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
FLD0318  DFLD  POS=(3,18),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0333  DFLD  POS=(3,33),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0346  DFLD  POS=(3,46),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0352  DFLD  POS=(3,52),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0361  DFLD  POS=(3,61),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0371  DFLD  POS=(3,71),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0376  DFLD  POS=(3,76),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0402  DFLD  POS=(4,2),LTH=4,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0407  DFLD  POS=(4,7),LTH=6,                                        +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
FLD0414  DFLD  POS=(4,14),LTH=9,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
FLD0424  DFLD  POS=(4,24),LTH=1,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
FLD0426  DFLD  POS=(4,26),LTH=2,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
FLD0429  DFLD  POS=(4,29),LTH=5,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
FLD0435  DFLD  POS=(4,35),LTH=1,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
FLD0437  DFLD  POS=(4,37),LTH=6,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
FLD0444  DFLD  POS=(4,44),LTH=2,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
FLD0447  DFLD  POS=(4,47),LTH=2,                                       +        
               ATTR=(ALPHA,PROT,NODISP,MOD)                                     
FLD0450  DFLD  POS=(4,50),LTH=26,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
TEDDI    DFLD  POS=(4,77),LTH=3,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  'A   Kund   Artikel   Antal Benämning',                 +        
               POS=(5,2),LTH=36,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Kl Fk Order Ft F    Fob.net',                          +        
               POS=(5,44),LTH=27,                                      +        
               ATTR=(PROT)                                                      
KDVALISO DFLD  POS=(5,72),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'T Dc',                                                 +        
               POS=(5,76),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0621  DFLD  POS=(6,21),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FLD0646  DFLD  POS=(6,45),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0648  DFLD  POS=(6,47),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0662  DFLD  POS=(6,61),LTH=10,                                      +        
               ATTR=(PROT)                                                      
COL0207  DFLD  POS=(7,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
COL0407  DFLD  POS=(7,4),LTH=6,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
COL1107  DFLD  POS=(7,11),LTH=9,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL2107  DFLD  POS=(7,21),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL2907  DFLD  POS=(7,29),LTH=15,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL4507  DFLD  POS=(7,45),LTH=1,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL4707  DFLD  POS=(7,47),LTH=2,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL5007  DFLD  POS=(7,50),LTH=5,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL5707  DFLD  POS=(7,57),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
COL5907  DFLD  POS=(7,59),LTH=1,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL6107  DFLD  POS=(7,61),LTH=10,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL7207  DFLD  POS=(7,72),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
COL7607  DFLD  POS=(7,76),LTH=1,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL7807  DFLD  POS=(7,78),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
COL0208  DFLD  POS=(8,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
COL0408  DFLD  POS=(8,4),LTH=6,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
COL1108  DFLD  POS=(8,11),LTH=9,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL2108  DFLD  POS=(8,21),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL2908  DFLD  POS=(8,29),LTH=15,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL4508  DFLD  POS=(8,45),LTH=1,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL4708  DFLD  POS=(8,47),LTH=2,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL5008  DFLD  POS=(8,50),LTH=5,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL5708  DFLD  POS=(8,57),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
COL5908  DFLD  POS=(8,59),LTH=1,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL6108  DFLD  POS=(8,61),LTH=10,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL7208  DFLD  POS=(8,72),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
COL7608  DFLD  POS=(8,76),LTH=1,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL7808  DFLD  POS=(8,78),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
COL0209  DFLD  POS=(9,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
COL0409  DFLD  POS=(9,4),LTH=6,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
COL1109  DFLD  POS=(9,11),LTH=9,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL2109  DFLD  POS=(9,21),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL2909  DFLD  POS=(9,29),LTH=15,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL4509  DFLD  POS=(9,45),LTH=1,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL4709  DFLD  POS=(9,47),LTH=2,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL5009  DFLD  POS=(9,50),LTH=5,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL5709  DFLD  POS=(9,57),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
COL5909  DFLD  POS=(9,59),LTH=1,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL6109  DFLD  POS=(9,61),LTH=10,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL7209  DFLD  POS=(9,72),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
COL7609  DFLD  POS=(9,76),LTH=1,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL7809  DFLD  POS=(9,78),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
COL0210  DFLD  POS=(10,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL0410  DFLD  POS=(10,4),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL1110  DFLD  POS=(10,11),LTH=9,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2110  DFLD  POS=(10,21),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2910  DFLD  POS=(10,29),LTH=15,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
COL4510  DFLD  POS=(10,45),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL4710  DFLD  POS=(10,47),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL5010  DFLD  POS=(10,50),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL5710  DFLD  POS=(10,57),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
COL5910  DFLD  POS=(10,59),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL6110  DFLD  POS=(10,61),LTH=10,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
COL7210  DFLD  POS=(10,72),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
COL7610  DFLD  POS=(10,76),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL7810  DFLD  POS=(10,78),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
COL0211  DFLD  POS=(11,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL0411  DFLD  POS=(11,4),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL1111  DFLD  POS=(11,11),LTH=9,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2111  DFLD  POS=(11,21),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2911  DFLD  POS=(11,29),LTH=15,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
COL4511  DFLD  POS=(11,45),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL4711  DFLD  POS=(11,47),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL5011  DFLD  POS=(11,50),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL5711  DFLD  POS=(11,57),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
COL5911  DFLD  POS=(11,59),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL6111  DFLD  POS=(11,61),LTH=10,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
COL7211  DFLD  POS=(11,72),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
COL7611  DFLD  POS=(11,76),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL7811  DFLD  POS=(11,78),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
COL0212  DFLD  POS=(12,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL0412  DFLD  POS=(12,4),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL1112  DFLD  POS=(12,11),LTH=9,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2112  DFLD  POS=(12,21),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2912  DFLD  POS=(12,29),LTH=15,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
COL4512  DFLD  POS=(12,45),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL4712  DFLD  POS=(12,47),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL5012  DFLD  POS=(12,50),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL5712  DFLD  POS=(12,57),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
COL5912  DFLD  POS=(12,59),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL6112  DFLD  POS=(12,61),LTH=10,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
COL7212  DFLD  POS=(12,72),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
COL7612  DFLD  POS=(12,76),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL7812  DFLD  POS=(12,78),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
COL0213  DFLD  POS=(13,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL0413  DFLD  POS=(13,4),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL1113  DFLD  POS=(13,11),LTH=9,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2113  DFLD  POS=(13,21),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2913  DFLD  POS=(13,29),LTH=15,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
COL4513  DFLD  POS=(13,45),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL4713  DFLD  POS=(13,47),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL5013  DFLD  POS=(13,50),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL5713  DFLD  POS=(13,57),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
COL5913  DFLD  POS=(13,59),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL6113  DFLD  POS=(13,61),LTH=10,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
COL7213  DFLD  POS=(13,72),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
COL7613  DFLD  POS=(13,76),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL7813  DFLD  POS=(13,78),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
COL0214  DFLD  POS=(14,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL0414  DFLD  POS=(14,4),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL1114  DFLD  POS=(14,11),LTH=9,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2114  DFLD  POS=(14,21),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2914  DFLD  POS=(14,29),LTH=15,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
COL4514  DFLD  POS=(14,45),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL4714  DFLD  POS=(14,47),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL5014  DFLD  POS=(14,50),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL5714  DFLD  POS=(14,57),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
COL5914  DFLD  POS=(14,59),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL6114  DFLD  POS=(14,61),LTH=10,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
COL7214  DFLD  POS=(14,72),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
COL7614  DFLD  POS=(14,76),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL7814  DFLD  POS=(14,78),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
COL0215  DFLD  POS=(15,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL0415  DFLD  POS=(15,4),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL1115  DFLD  POS=(15,11),LTH=9,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2115  DFLD  POS=(15,21),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2915  DFLD  POS=(15,29),LTH=15,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
COL4515  DFLD  POS=(15,45),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL4715  DFLD  POS=(15,47),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL5015  DFLD  POS=(15,50),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL5715  DFLD  POS=(15,57),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
COL5915  DFLD  POS=(15,59),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL6115  DFLD  POS=(15,61),LTH=10,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
COL7215  DFLD  POS=(15,72),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
COL7615  DFLD  POS=(15,76),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL7815  DFLD  POS=(15,78),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
COL0216  DFLD  POS=(16,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL0416  DFLD  POS=(16,4),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL1116  DFLD  POS=(16,11),LTH=9,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2116  DFLD  POS=(16,21),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2916  DFLD  POS=(16,29),LTH=15,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
COL4516  DFLD  POS=(16,45),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL4716  DFLD  POS=(16,47),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL5016  DFLD  POS=(16,50),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL5716  DFLD  POS=(16,57),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
COL5916  DFLD  POS=(16,59),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL6116  DFLD  POS=(16,61),LTH=10,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
COL7216  DFLD  POS=(16,72),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
COL7616  DFLD  POS=(16,76),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL7816  DFLD  POS=(16,78),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
COL0217  DFLD  POS=(17,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL0417  DFLD  POS=(17,4),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL1117  DFLD  POS=(17,11),LTH=9,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2117  DFLD  POS=(17,21),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2917  DFLD  POS=(17,29),LTH=15,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
COL4517  DFLD  POS=(17,45),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL4717  DFLD  POS=(17,47),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL5017  DFLD  POS=(17,50),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL5717  DFLD  POS=(17,57),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
COL5917  DFLD  POS=(17,59),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL6117  DFLD  POS=(17,61),LTH=10,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
COL7217  DFLD  POS=(17,72),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
COL7617  DFLD  POS=(17,76),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL7817  DFLD  POS=(17,78),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
COL0218  DFLD  POS=(18,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL0418  DFLD  POS=(18,4),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL1118  DFLD  POS=(18,11),LTH=9,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2118  DFLD  POS=(18,21),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2918  DFLD  POS=(18,29),LTH=15,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
COL4518  DFLD  POS=(18,45),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL4718  DFLD  POS=(18,47),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL5018  DFLD  POS=(18,50),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL5718  DFLD  POS=(18,57),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
COL5918  DFLD  POS=(18,59),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL6118  DFLD  POS=(18,61),LTH=10,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
COL7218  DFLD  POS=(18,72),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
COL7618  DFLD  POS=(18,76),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL7818  DFLD  POS=(18,78),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
COL0219  DFLD  POS=(19,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL0419  DFLD  POS=(19,4),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL1119  DFLD  POS=(19,11),LTH=9,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2119  DFLD  POS=(19,21),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2919  DFLD  POS=(19,29),LTH=15,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
COL4519  DFLD  POS=(19,45),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL4719  DFLD  POS=(19,47),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL5019  DFLD  POS=(19,50),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL5719  DFLD  POS=(19,57),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
COL5919  DFLD  POS=(19,59),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL6119  DFLD  POS=(19,61),LTH=10,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
COL7219  DFLD  POS=(19,72),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
COL7619  DFLD  POS=(19,76),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL7819  DFLD  POS=(19,78),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD2002  DFLD  POS=(20,2),LTH=4,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD2007  DFLD  POS=(20,7),LTH=6,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
FLD2014  DFLD  POS=(20,14),LTH=9,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
FLD2024  DFLD  POS=(20,24),LTH=1,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
FLD2026  DFLD  POS=(20,26),LTH=3,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
FLD2030  DFLD  POS=(20,30),LTH=5,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
FLD2036  DFLD  POS=(20,36),LTH=1,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
FLD2038  DFLD  POS=(20,38),LTH=2,                                      +        
               ATTR=(ALPHA,PROT,NODISP,MOD)                                     
         DFLD  '13 Fråga ro    14 Uppdatera ro  15 Reserv. ro    16',  +        
               POS=(21,2),LTH=51,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,17),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,51),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(23,59),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4O57301 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4F573,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I57301,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0136,                                                +        
               LTH=40                                                           
         MFLD  FLD0208,                                                +        
               LTH=4                                                            
         MFLD  FLD0308,                                                +        
               LTH=4                                                            
         MFLD  FLD0218,                                                +        
               LTH=6                                                            
         MFLD  FLD0318,                                                +        
               LTH=6                                                            
         MFLD  FLD0233,                                                +        
               LTH=9                                                            
         MFLD  FLD0333,                                                +        
               LTH=9                                                            
         MFLD  FLD0246,                                                +        
               LTH=1                                                            
         MFLD  FLD0346,                                                +        
               LTH=1                                                            
         MFLD  FLD0252,                                                +        
               LTH=2                                                            
         MFLD  FLD0352,                                                +        
               LTH=2                                                            
         MFLD  FLD0261,                                                +        
               LTH=5                                                            
         MFLD  FLD0361,                                                +        
               LTH=5                                                            
         MFLD  FLD0271,                                                +        
               LTH=1                                                            
         MFLD  FLD0371,                                                +        
               LTH=1                                                            
         MFLD  FLD0276,                                                +        
               LTH=2                                                            
         MFLD  FLD0376,                                                +        
               LTH=2                                                            
         MFLD  FLD0402,                                                +        
               LTH=4                                                            
         MFLD  FLD0407,                                                +        
               LTH=6                                                            
         MFLD  FLD0414,                                                +        
               LTH=9                                                            
         MFLD  FLD0424,                                                +        
               LTH=1                                                            
         MFLD  FLD0426,                                                +        
               LTH=2                                                            
         MFLD  FLD0429,                                                +        
               LTH=5                                                            
         MFLD  FLD0435,                                                +        
               LTH=1                                                            
         MFLD  FLD0437,                                                +        
               LTH=6                                                            
         MFLD  FLD0444,                                                +        
               LTH=2                                                            
         MFLD  FLD0447,                                                +        
               LTH=2                                                            
         MFLD  FLD0450,                                                +        
               LTH=26                                                           
         MFLD  TEDDI,                                                  +        
               LTH=3                                                            
         MFLD  KDVALISO,                                               +        
               LTH=3                                                            
         MFLD  FLD0621,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0646,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0648,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0662,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL0207,                                                +        
               LTH=1                                                            
         MFLD  COL0407,                                                +        
               LTH=6                                                            
         MFLD  COL1107,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL2107,                                                +        
               LTH=7                                                            
         MFLD  COL2907,                                                +        
               LTH=15                                                           
         MFLD  COL4507,                                                +        
               LTH=1                                                            
         MFLD  COL4707,                                                +        
               LTH=2                                                            
         MFLD  COL5007,                                                +        
               LTH=5                                                            
         MFLD  COL5707,                                                +        
               LTH=1                                                            
         MFLD  COL5907,                                                +        
               LTH=1                                                            
         MFLD  COL6107,                                                +        
               LTH=10                                                           
         MFLD  COL7207,                                                +        
               LTH=1                                                            
         MFLD  COL7607,                                                +        
               LTH=1                                                            
         MFLD  COL7807,                                                +        
               LTH=2                                                            
         MFLD  COL0208,                                                +        
               LTH=1                                                            
         MFLD  COL0408,                                                +        
               LTH=6                                                            
         MFLD  COL1108,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL2108,                                                +        
               LTH=7                                                            
         MFLD  COL2908,                                                +        
               LTH=15                                                           
         MFLD  COL4508,                                                +        
               LTH=1                                                            
         MFLD  COL4708,                                                +        
               LTH=2                                                            
         MFLD  COL5008,                                                +        
               LTH=5                                                            
         MFLD  COL5708,                                                +        
               LTH=1                                                            
         MFLD  COL5908,                                                +        
               LTH=1                                                            
         MFLD  COL6108,                                                +        
               LTH=10                                                           
         MFLD  COL7208,                                                +        
               LTH=1                                                            
         MFLD  COL7608,                                                +        
               LTH=1                                                            
         MFLD  COL7808,                                                +        
               LTH=2                                                            
         MFLD  COL0209,                                                +        
               LTH=1                                                            
         MFLD  COL0409,                                                +        
               LTH=6                                                            
         MFLD  COL1109,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL2109,                                                +        
               LTH=7                                                            
         MFLD  COL2909,                                                +        
               LTH=15                                                           
         MFLD  COL4509,                                                +        
               LTH=1                                                            
         MFLD  COL4709,                                                +        
               LTH=2                                                            
         MFLD  COL5009,                                                +        
               LTH=5                                                            
         MFLD  COL5709,                                                +        
               LTH=1                                                            
         MFLD  COL5909,                                                +        
               LTH=1                                                            
         MFLD  COL6109,                                                +        
               LTH=10                                                           
         MFLD  COL7209,                                                +        
               LTH=1                                                            
         MFLD  COL7609,                                                +        
               LTH=1                                                            
         MFLD  COL7809,                                                +        
               LTH=2                                                            
         MFLD  COL0210,                                                +        
               LTH=1                                                            
         MFLD  COL0410,                                                +        
               LTH=6                                                            
         MFLD  COL1110,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL2110,                                                +        
               LTH=7                                                            
         MFLD  COL2910,                                                +        
               LTH=15                                                           
         MFLD  COL4510,                                                +        
               LTH=1                                                            
         MFLD  COL4710,                                                +        
               LTH=2                                                            
         MFLD  COL5010,                                                +        
               LTH=5                                                            
         MFLD  COL5710,                                                +        
               LTH=1                                                            
         MFLD  COL5910,                                                +        
               LTH=1                                                            
         MFLD  COL6110,                                                +        
               LTH=10                                                           
         MFLD  COL7210,                                                +        
               LTH=1                                                            
         MFLD  COL7610,                                                +        
               LTH=1                                                            
         MFLD  COL7810,                                                +        
               LTH=2                                                            
         MFLD  COL0211,                                                +        
               LTH=1                                                            
         MFLD  COL0411,                                                +        
               LTH=6                                                            
         MFLD  COL1111,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL2111,                                                +        
               LTH=7                                                            
         MFLD  COL2911,                                                +        
               LTH=15                                                           
         MFLD  COL4511,                                                +        
               LTH=1                                                            
         MFLD  COL4711,                                                +        
               LTH=2                                                            
         MFLD  COL5011,                                                +        
               LTH=5                                                            
         MFLD  COL5711,                                                +        
               LTH=1                                                            
         MFLD  COL5911,                                                +        
               LTH=1                                                            
         MFLD  COL6111,                                                +        
               LTH=10                                                           
         MFLD  COL7211,                                                +        
               LTH=1                                                            
         MFLD  COL7611,                                                +        
               LTH=1                                                            
         MFLD  COL7811,                                                +        
               LTH=2                                                            
         MFLD  COL0212,                                                +        
               LTH=1                                                            
         MFLD  COL0412,                                                +        
               LTH=6                                                            
         MFLD  COL1112,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL2112,                                                +        
               LTH=7                                                            
         MFLD  COL2912,                                                +        
               LTH=15                                                           
         MFLD  COL4512,                                                +        
               LTH=1                                                            
         MFLD  COL4712,                                                +        
               LTH=2                                                            
         MFLD  COL5012,                                                +        
               LTH=5                                                            
         MFLD  COL5712,                                                +        
               LTH=1                                                            
         MFLD  COL5912,                                                +        
               LTH=1                                                            
         MFLD  COL6112,                                                +        
               LTH=10                                                           
         MFLD  COL7212,                                                +        
               LTH=1                                                            
         MFLD  COL7612,                                                +        
               LTH=1                                                            
         MFLD  COL7812,                                                +        
               LTH=2                                                            
         MFLD  COL0213,                                                +        
               LTH=1                                                            
         MFLD  COL0413,                                                +        
               LTH=6                                                            
         MFLD  COL1113,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL2113,                                                +        
               LTH=7                                                            
         MFLD  COL2913,                                                +        
               LTH=15                                                           
         MFLD  COL4513,                                                +        
               LTH=1                                                            
         MFLD  COL4713,                                                +        
               LTH=2                                                            
         MFLD  COL5013,                                                +        
               LTH=5                                                            
         MFLD  COL5713,                                                +        
               LTH=1                                                            
         MFLD  COL5913,                                                +        
               LTH=1                                                            
         MFLD  COL6113,                                                +        
               LTH=10                                                           
         MFLD  COL7213,                                                +        
               LTH=1                                                            
         MFLD  COL7613,                                                +        
               LTH=1                                                            
         MFLD  COL7813,                                                +        
               LTH=2                                                            
         MFLD  COL0214,                                                +        
               LTH=1                                                            
         MFLD  COL0414,                                                +        
               LTH=6                                                            
         MFLD  COL1114,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL2114,                                                +        
               LTH=7                                                            
         MFLD  COL2914,                                                +        
               LTH=15                                                           
         MFLD  COL4514,                                                +        
               LTH=1                                                            
         MFLD  COL4714,                                                +        
               LTH=2                                                            
         MFLD  COL5014,                                                +        
               LTH=5                                                            
         MFLD  COL5714,                                                +        
               LTH=1                                                            
         MFLD  COL5914,                                                +        
               LTH=1                                                            
         MFLD  COL6114,                                                +        
               LTH=10                                                           
         MFLD  COL7214,                                                +        
               LTH=1                                                            
         MFLD  COL7614,                                                +        
               LTH=1                                                            
         MFLD  COL7814,                                                +        
               LTH=2                                                            
         MFLD  COL0215,                                                +        
               LTH=1                                                            
         MFLD  COL0415,                                                +        
               LTH=6                                                            
         MFLD  COL1115,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL2115,                                                +        
               LTH=7                                                            
         MFLD  COL2915,                                                +        
               LTH=15                                                           
         MFLD  COL4515,                                                +        
               LTH=1                                                            
         MFLD  COL4715,                                                +        
               LTH=2                                                            
         MFLD  COL5015,                                                +        
               LTH=5                                                            
         MFLD  COL5715,                                                +        
               LTH=1                                                            
         MFLD  COL5915,                                                +        
               LTH=1                                                            
         MFLD  COL6115,                                                +        
               LTH=10                                                           
         MFLD  COL7215,                                                +        
               LTH=1                                                            
         MFLD  COL7615,                                                +        
               LTH=1                                                            
         MFLD  COL7815,                                                +        
               LTH=2                                                            
         MFLD  COL0216,                                                +        
               LTH=1                                                            
         MFLD  COL0416,                                                +        
               LTH=6                                                            
         MFLD  COL1116,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL2116,                                                +        
               LTH=7                                                            
         MFLD  COL2916,                                                +        
               LTH=15                                                           
         MFLD  COL4516,                                                +        
               LTH=1                                                            
         MFLD  COL4716,                                                +        
               LTH=2                                                            
         MFLD  COL5016,                                                +        
               LTH=5                                                            
         MFLD  COL5716,                                                +        
               LTH=1                                                            
         MFLD  COL5916,                                                +        
               LTH=1                                                            
         MFLD  COL6116,                                                +        
               LTH=10                                                           
         MFLD  COL7216,                                                +        
               LTH=1                                                            
         MFLD  COL7616,                                                +        
               LTH=1                                                            
         MFLD  COL7816,                                                +        
               LTH=2                                                            
         MFLD  COL0217,                                                +        
               LTH=1                                                            
         MFLD  COL0417,                                                +        
               LTH=6                                                            
         MFLD  COL1117,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL2117,                                                +        
               LTH=7                                                            
         MFLD  COL2917,                                                +        
               LTH=15                                                           
         MFLD  COL4517,                                                +        
               LTH=1                                                            
         MFLD  COL4717,                                                +        
               LTH=2                                                            
         MFLD  COL5017,                                                +        
               LTH=5                                                            
         MFLD  COL5717,                                                +        
               LTH=1                                                            
         MFLD  COL5917,                                                +        
               LTH=1                                                            
         MFLD  COL6117,                                                +        
               LTH=10                                                           
         MFLD  COL7217,                                                +        
               LTH=1                                                            
         MFLD  COL7617,                                                +        
               LTH=1                                                            
         MFLD  COL7817,                                                +        
               LTH=2                                                            
         MFLD  COL0218,                                                +        
               LTH=1                                                            
         MFLD  COL0418,                                                +        
               LTH=6                                                            
         MFLD  COL1118,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL2118,                                                +        
               LTH=7                                                            
         MFLD  COL2918,                                                +        
               LTH=15                                                           
         MFLD  COL4518,                                                +        
               LTH=1                                                            
         MFLD  COL4718,                                                +        
               LTH=2                                                            
         MFLD  COL5018,                                                +        
               LTH=5                                                            
         MFLD  COL5718,                                                +        
               LTH=1                                                            
         MFLD  COL5918,                                                +        
               LTH=1                                                            
         MFLD  COL6118,                                                +        
               LTH=10                                                           
         MFLD  COL7218,                                                +        
               LTH=1                                                            
         MFLD  COL7618,                                                +        
               LTH=1                                                            
         MFLD  COL7818,                                                +        
               LTH=2                                                            
         MFLD  COL0219,                                                +        
               LTH=1                                                            
         MFLD  COL0419,                                                +        
               LTH=6                                                            
         MFLD  COL1119,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL2119,                                                +        
               LTH=7                                                            
         MFLD  COL2919,                                                +        
               LTH=15                                                           
         MFLD  COL4519,                                                +        
               LTH=1                                                            
         MFLD  COL4719,                                                +        
               LTH=2                                                            
         MFLD  COL5019,                                                +        
               LTH=5                                                            
         MFLD  COL5719,                                                +        
               LTH=1                                                            
         MFLD  COL5919,                                                +        
               LTH=1                                                            
         MFLD  COL6119,                                                +        
               LTH=10                                                           
         MFLD  COL7219,                                                +        
               LTH=1                                                            
         MFLD  COL7619,                                                +        
               LTH=1                                                            
         MFLD  COL7819,                                                +        
               LTH=2                                                            
         MFLD  FLD2002,                                                +        
               LTH=4                                                            
         MFLD  FLD2007,                                                +        
               LTH=6                                                            
         MFLD  FLD2014,                                                +        
               LTH=9                                                            
         MFLD  FLD2024,                                                +        
               LTH=1                                                            
         MFLD  FLD2026,                                                +        
               LTH=3                                                            
         MFLD  FLD2030,                                                +        
               LTH=5                                                            
         MFLD  FLD2036,                                                +        
               LTH=1                                                            
         MFLD  FLD2038,                                                +        
               LTH=2                                                            
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I57301 MSG   TYPE=INPUT,                                             +        
               SOR=(W4F573),                                           +        
               OPT=2,                                                  +        
               NXT=W4O57301                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F7'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '45731',                                                +        
               LTH=5                                                            
         MFLD  (FLD0208,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0308,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0218,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0318,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0233,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0333,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0246,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0346,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0252,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0352,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0261,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0361,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0271,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0371,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0276,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0376,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0402,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0407,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0414,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0424,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0426,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0429,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0435,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0437,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0444,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0447,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0450,                                                +        
               LTH=26,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0621,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0646,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0648,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0662,                                               +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL0207,                                                +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL0407,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1107,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2107,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2907,                                                +        
               LTH=15,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL4507,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL4707,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5007,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5707,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5907,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL6107,                                                +        
               LTH=10,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL7207,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7607,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7807,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL0208,                                                +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL0408,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1108,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2108,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2908,                                                +        
               LTH=15,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL4508,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL4708,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5008,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5708,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5908,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL6108,                                                +        
               LTH=10,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL7208,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7608,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7808,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL0209,                                                +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL0409,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1109,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2109,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2909,                                                +        
               LTH=15,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL4509,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL4709,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5009,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5709,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5909,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL6109,                                                +        
               LTH=10,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL7209,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7609,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7809,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL0210,                                                +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL0410,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1110,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2110,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2910,                                                +        
               LTH=15,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL4510,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL4710,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5010,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5710,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5910,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL6110,                                                +        
               LTH=10,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL7210,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7610,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7810,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL0211,                                                +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL0411,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1111,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2111,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2911,                                                +        
               LTH=15,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL4511,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL4711,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5011,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5711,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5911,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL6111,                                                +        
               LTH=10,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL7211,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7611,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7811,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL0212,                                                +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL0412,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1112,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2112,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2912,                                                +        
               LTH=15,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL4512,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL4712,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5012,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5712,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5912,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL6112,                                                +        
               LTH=10,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL7212,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7612,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7812,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL0213,                                                +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL0413,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1113,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2113,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2913,                                                +        
               LTH=15,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL4513,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL4713,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5013,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5713,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5913,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL6113,                                                +        
               LTH=10,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL7213,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7613,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7813,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL0214,                                                +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL0414,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1114,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2114,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2914,                                                +        
               LTH=15,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL4514,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL4714,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5014,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5714,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5914,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL6114,                                                +        
               LTH=10,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL7214,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7614,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7814,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL0215,                                                +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL0415,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1115,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2115,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2915,                                                +        
               LTH=15,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL4515,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL4715,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5015,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5715,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5915,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL6115,                                                +        
               LTH=10,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL7215,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7615,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7815,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL0216,                                                +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL0416,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1116,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2116,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2916,                                                +        
               LTH=15,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL4516,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL4716,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5016,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5716,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5916,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL6116,                                                +        
               LTH=10,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL7216,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7616,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7816,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL0217,                                                +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL0417,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1117,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2117,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2917,                                                +        
               LTH=15,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL4517,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL4717,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5017,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5717,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5917,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL6117,                                                +        
               LTH=10,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL7217,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7617,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7817,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL0218,                                                +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL0418,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1118,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2118,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2918,                                                +        
               LTH=15,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL4518,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL4718,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5018,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5718,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5918,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL6118,                                                +        
               LTH=10,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL7218,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7618,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7818,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL0219,                                                +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL0419,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1119,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2119,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2919,                                                +        
               LTH=15,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL4519,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL4719,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5019,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5719,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5919,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL6119,                                                +        
               LTH=10,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL7219,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7619,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7819,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD2002,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD2007,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD2014,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD2024,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD2026,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD2030,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD2036,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD2038,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
