***********************************************************************         
* CREATED BY PCC4448   ON 95/07/27  AT 13:37                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'FRÅGA PÅ DISTRIKT STATUS        '                               
W4F513   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W4T513 6',                                           +        
               7='W4T513 7',                                           +        
               8='W4T513 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T511  ',                                          +        
               14='W4T512  ',                                          +        
               15='W4T513  ',                                          +        
               16='W4T514  ',                                          +        
               17='W4T515  ',                                          +        
               18='W0T501  ',                                          +        
               19='W4T517  ',                                          +        
               20='W0T501  ',                                          +        
               21='W4T513 6',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((2,8)),                                         +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'FRÅGA DISTRIKT - STATUS',                              +        
               POS=(1,13),LTH=23,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Distr',                                                +        
               POS=(2,2),LTH=5,                                        +        
               ATTR=(ALPHA,PROT)                                                
IDDISTI  DFLD  POS=(2,8),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Kund',                                                 +        
               POS=(2,13),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
IDKUNDI  DFLD  POS=(2,18),LTH=6,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'DC',                                                   +        
               POS=(2,25),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
IDDCI    DFLD  POS=(2,28),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Kl',                                                   +        
               POS=(2,31),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
ORDKLI   DFLD  POS=(2,34),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Status',                                               +        
               POS=(2,43),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
STATUSI  DFLD  POS=(2,50),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
IDDISTU  DFLD  POS=(3,8),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
IDKUNDU  DFLD  POS=(3,18),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
IDDCU    DFLD  POS=(3,28),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
ORDKLU   DFLD  POS=(3,34),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
STATUSU  DFLD  POS=(3,50),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Bild   Kund   Order   DC  Regdat Kl    St',            +        
               POS=(5,2),LTH=41,                                       +        
               ATTR=(PROT)                                                      
IDBILD1  DFLD  POS=(6,2),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
DGIA0000 DFLD  POS=(6,7),LTH=6,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0014 DFLD  POS=(6,14),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0042 DFLD  POS=(6,24),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DGIA0028 DFLD  POS=(6,28),LTH=6,                                       +        
               ATTR=(PROT)                                                      
KLASS1   DFLD  POS=(6,35),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
STATUS1  DFLD  POS=(6,41),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
IDBILD2  DFLD  POS=(7,2),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
DGIA0001 DFLD  POS=(7,7),LTH=6,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0015 DFLD  POS=(7,14),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0043 DFLD  POS=(7,24),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DGIA0029 DFLD  POS=(7,28),LTH=6,                                       +        
               ATTR=(PROT)                                                      
KLASS2   DFLD  POS=(7,35),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
STATUS2  DFLD  POS=(7,41),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
IDBILD3  DFLD  POS=(8,2),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
DGIA0002 DFLD  POS=(8,7),LTH=6,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0016 DFLD  POS=(8,14),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0044 DFLD  POS=(8,24),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DGIA0030 DFLD  POS=(8,28),LTH=6,                                       +        
               ATTR=(PROT)                                                      
KLASS3   DFLD  POS=(8,35),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
STATUS3  DFLD  POS=(8,41),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
IDBILD4  DFLD  POS=(9,2),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
DGIA0003 DFLD  POS=(9,7),LTH=6,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0017 DFLD  POS=(9,14),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0045 DFLD  POS=(9,24),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DGIA0031 DFLD  POS=(9,28),LTH=6,                                       +        
               ATTR=(PROT)                                                      
KLASS4   DFLD  POS=(9,35),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
STATUS4  DFLD  POS=(9,41),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
IDBILD5  DFLD  POS=(10,2),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0004 DFLD  POS=(10,7),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0018 DFLD  POS=(10,14),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0046 DFLD  POS=(10,24),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0032 DFLD  POS=(10,28),LTH=6,                                      +        
               ATTR=(PROT)                                                      
KLASS5   DFLD  POS=(10,35),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
STATUS5  DFLD  POS=(10,41),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
IDBILD6  DFLD  POS=(11,2),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0005 DFLD  POS=(11,7),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0019 DFLD  POS=(11,14),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0047 DFLD  POS=(11,24),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0033 DFLD  POS=(11,28),LTH=6,                                      +        
               ATTR=(PROT)                                                      
KLASS6   DFLD  POS=(11,35),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
STATUS6  DFLD  POS=(11,41),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
IDBILD7  DFLD  POS=(12,2),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0006 DFLD  POS=(12,7),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0020 DFLD  POS=(12,14),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0048 DFLD  POS=(12,24),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0034 DFLD  POS=(12,28),LTH=6,                                      +        
               ATTR=(PROT)                                                      
KLASS7   DFLD  POS=(12,35),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
STATUS7  DFLD  POS=(12,41),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
IDBILD8  DFLD  POS=(13,2),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0007 DFLD  POS=(13,7),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0021 DFLD  POS=(13,14),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0049 DFLD  POS=(13,24),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0035 DFLD  POS=(13,28),LTH=6,                                      +        
               ATTR=(PROT)                                                      
KLASS8   DFLD  POS=(13,35),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
STATUS8  DFLD  POS=(13,41),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
IDBILD9  DFLD  POS=(14,2),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0008 DFLD  POS=(14,7),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0022 DFLD  POS=(14,14),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0050 DFLD  POS=(14,24),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0036 DFLD  POS=(14,28),LTH=6,                                      +        
               ATTR=(PROT)                                                      
KLASS9   DFLD  POS=(14,35),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
STATUS9  DFLD  POS=(14,41),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
IDBILD10 DFLD  POS=(15,2),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0009 DFLD  POS=(15,7),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0023 DFLD  POS=(15,14),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0051 DFLD  POS=(15,24),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0037 DFLD  POS=(15,28),LTH=6,                                      +        
               ATTR=(PROT)                                                      
KLASS10  DFLD  POS=(15,35),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
STATUS10 DFLD  POS=(15,41),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
IDBILD11 DFLD  POS=(16,2),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0010 DFLD  POS=(16,7),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0024 DFLD  POS=(16,14),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0052 DFLD  POS=(16,24),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0038 DFLD  POS=(16,28),LTH=6,                                      +        
               ATTR=(PROT)                                                      
KLASS11  DFLD  POS=(16,35),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
STATUS11 DFLD  POS=(16,41),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
IDBILD12 DFLD  POS=(17,2),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0011 DFLD  POS=(17,7),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0025 DFLD  POS=(17,14),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0053 DFLD  POS=(17,24),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0039 DFLD  POS=(17,28),LTH=6,                                      +        
               ATTR=(PROT)                                                      
KLASS12  DFLD  POS=(17,35),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
STATUS12 DFLD  POS=(17,41),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
IDBILD13 DFLD  POS=(18,2),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0012 DFLD  POS=(18,7),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0026 DFLD  POS=(18,14),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0054 DFLD  POS=(18,24),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0040 DFLD  POS=(18,28),LTH=6,                                      +        
               ATTR=(PROT)                                                      
KLASS13  DFLD  POS=(18,35),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
STATUS13 DFLD  POS=(18,41),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
IDBILD14 DFLD  POS=(19,2),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0013 DFLD  POS=(19,7),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0027 DFLD  POS=(19,14),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0055 DFLD  POS=(19,24),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0041 DFLD  POS=(19,28),LTH=6,                                      +        
               ATTR=(PROT)                                                      
KLASS14  DFLD  POS=(19,35),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
STATUS14 DFLD  POS=(19,41),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'PF6=Bakåt PF7=Första PF8=Framåt 13 Distr värde 14 Distr+        
                rader 15 Distr status',                                +        
               POS=(21,2),LTH=79,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16 Distr transp 17 Distr kollin 18 ',                  +        
               POS=(22,2),LTH=36,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '19 Distr tid  20  ',                                   +        
               POS=(22,39),LTH=18,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,58),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4I51301 MSG   TYPE=INPUT,                                             +        
               SOR=(W4F513),                                           +        
               OPT=2,                                                  +        
               NXT=W4O51301                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  ' ',                                                    +        
               LTH=2                                                            
         MFLD  '45131',                                                +        
               LTH=5                                                            
         MFLD  (IDDISTI,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDDISTU,                                                +        
               LTH=4                                                            
         MFLD  (IDKUNDI,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDKUNDU,                                                +        
               LTH=6                                                            
         MFLD  (IDDCI,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  IDDCU,                                                  +        
               LTH=2                                                            
         MFLD  (ORDKLI,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  ORDKLU,                                                 +        
               LTH=1                                                            
         MFLD  (STATUSI,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  STATUSU,                                                +        
               LTH=1                                                            
         MFLD  (IDBILD1,                                               +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  DGIA0000,                                               +        
               LTH=6                                                            
         MFLD  DGIA0014,                                               +        
               LTH=7                                                            
         MFLD  (IDBILD2,                                               +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  DGIA0001,                                               +        
               LTH=6                                                            
         MFLD  DGIA0015,                                               +        
               LTH=7                                                            
         MFLD  (IDBILD3,                                               +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  DGIA0002,                                               +        
               LTH=6                                                            
         MFLD  DGIA0016,                                               +        
               LTH=7                                                            
         MFLD  (IDBILD4,                                               +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  DGIA0003,                                               +        
               LTH=6                                                            
         MFLD  DGIA0017,                                               +        
               LTH=7                                                            
         MFLD  (IDBILD5,                                               +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  DGIA0004,                                               +        
               LTH=6                                                            
         MFLD  DGIA0018,                                               +        
               LTH=7                                                            
         MFLD  (IDBILD6,                                               +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  DGIA0005,                                               +        
               LTH=6                                                            
         MFLD  DGIA0019,                                               +        
               LTH=7                                                            
         MFLD  (IDBILD7,                                               +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  DGIA0006,                                               +        
               LTH=6                                                            
         MFLD  DGIA0020,                                               +        
               LTH=7                                                            
         MFLD  (IDBILD8,                                               +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  DGIA0007,                                               +        
               LTH=6                                                            
         MFLD  DGIA0021,                                               +        
               LTH=7                                                            
         MFLD  (IDBILD9,                                               +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  DGIA0008,                                               +        
               LTH=6                                                            
         MFLD  DGIA0022,                                               +        
               LTH=7                                                            
         MFLD  (IDBILD10,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  DGIA0009,                                               +        
               LTH=6                                                            
         MFLD  DGIA0023,                                               +        
               LTH=7                                                            
         MFLD  (IDBILD11,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  DGIA0010,                                               +        
               LTH=6                                                            
         MFLD  DGIA0024,                                               +        
               LTH=7                                                            
         MFLD  (IDBILD12,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  DGIA0011,                                               +        
               LTH=6                                                            
         MFLD  DGIA0025,                                               +        
               LTH=7                                                            
         MFLD  (IDBILD13,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  DGIA0012,                                               +        
               LTH=6                                                            
         MFLD  DGIA0026,                                               +        
               LTH=7                                                            
         MFLD  (IDBILD14,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  DGIA0013,                                               +        
               LTH=6                                                            
         MFLD  DGIA0027,                                               +        
               LTH=7                                                            
         MSGEND                                                                 
W4O51301 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4F513,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I51301,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDDISTI,                                                +        
               LTH=4                                                            
         MFLD  IDDISTU,                                                +        
               LTH=4                                                            
         MFLD  IDKUNDI,                                                +        
               LTH=6                                                            
         MFLD  IDKUNDU,                                                +        
               LTH=6                                                            
         MFLD  IDDCI,                                                  +        
               LTH=2                                                            
         MFLD  IDDCU,                                                  +        
               LTH=2                                                            
         MFLD  ORDKLI,                                                 +        
               LTH=1                                                            
         MFLD  ORDKLU,                                                 +        
               LTH=1                                                            
         MFLD  STATUSI,                                                +        
               LTH=1                                                            
         MFLD  STATUSU,                                                +        
               LTH=1                                                            
         MFLD  IDBILD1,                                                +        
               LTH=4                                                            
         MFLD  IDBILD2,                                                +        
               LTH=4                                                            
         MFLD  IDBILD3,                                                +        
               LTH=4                                                            
         MFLD  IDBILD4,                                                +        
               LTH=4                                                            
         MFLD  IDBILD5,                                                +        
               LTH=4                                                            
         MFLD  IDBILD6,                                                +        
               LTH=4                                                            
         MFLD  IDBILD7,                                                +        
               LTH=4                                                            
         MFLD  IDBILD8,                                                +        
               LTH=4                                                            
         MFLD  IDBILD9,                                                +        
               LTH=4                                                            
         MFLD  IDBILD10,                                               +        
               LTH=4                                                            
         MFLD  IDBILD11,                                               +        
               LTH=4                                                            
         MFLD  IDBILD12,                                               +        
               LTH=4                                                            
         MFLD  IDBILD13,                                               +        
               LTH=4                                                            
         MFLD  IDBILD14,                                               +        
               LTH=4                                                            
         MFLD  DGIA0000,                                               +        
               LTH=6                                                            
         MFLD  DGIA0001,                                               +        
               LTH=6                                                            
         MFLD  DGIA0002,                                               +        
               LTH=6                                                            
         MFLD  DGIA0003,                                               +        
               LTH=6                                                            
         MFLD  DGIA0004,                                               +        
               LTH=6                                                            
         MFLD  DGIA0005,                                               +        
               LTH=6                                                            
         MFLD  DGIA0006,                                               +        
               LTH=6                                                            
         MFLD  DGIA0007,                                               +        
               LTH=6                                                            
         MFLD  DGIA0008,                                               +        
               LTH=6                                                            
         MFLD  DGIA0009,                                               +        
               LTH=6                                                            
         MFLD  DGIA0010,                                               +        
               LTH=6                                                            
         MFLD  DGIA0011,                                               +        
               LTH=6                                                            
         MFLD  DGIA0012,                                               +        
               LTH=6                                                            
         MFLD  DGIA0013,                                               +        
               LTH=6                                                            
         MFLD  DGIA0014,                                               +        
               LTH=7                                                            
         MFLD  DGIA0015,                                               +        
               LTH=7                                                            
         MFLD  DGIA0016,                                               +        
               LTH=7                                                            
         MFLD  DGIA0017,                                               +        
               LTH=7                                                            
         MFLD  DGIA0018,                                               +        
               LTH=7                                                            
         MFLD  DGIA0019,                                               +        
               LTH=7                                                            
         MFLD  DGIA0020,                                               +        
               LTH=7                                                            
         MFLD  DGIA0021,                                               +        
               LTH=7                                                            
         MFLD  DGIA0022,                                               +        
               LTH=7                                                            
         MFLD  DGIA0023,                                               +        
               LTH=7                                                            
         MFLD  DGIA0024,                                               +        
               LTH=7                                                            
         MFLD  DGIA0025,                                               +        
               LTH=7                                                            
         MFLD  DGIA0026,                                               +        
               LTH=7                                                            
         MFLD  DGIA0027,                                               +        
               LTH=7                                                            
         MFLD  DGIA0042,                                               +        
               LTH=2                                                            
         MFLD  DGIA0043,                                               +        
               LTH=2                                                            
         MFLD  DGIA0044,                                               +        
               LTH=2                                                            
         MFLD  DGIA0045,                                               +        
               LTH=2                                                            
         MFLD  DGIA0046,                                               +        
               LTH=2                                                            
         MFLD  DGIA0047,                                               +        
               LTH=2                                                            
         MFLD  DGIA0048,                                               +        
               LTH=2                                                            
         MFLD  DGIA0049,                                               +        
               LTH=2                                                            
         MFLD  DGIA0050,                                               +        
               LTH=2                                                            
         MFLD  DGIA0051,                                               +        
               LTH=2                                                            
         MFLD  DGIA0052,                                               +        
               LTH=2                                                            
         MFLD  DGIA0053,                                               +        
               LTH=2                                                            
         MFLD  DGIA0054,                                               +        
               LTH=2                                                            
         MFLD  DGIA0055,                                               +        
               LTH=2                                                            
         MFLD  DGIA0028,                                               +        
               LTH=6                                                            
         MFLD  DGIA0029,                                               +        
               LTH=6                                                            
         MFLD  DGIA0030,                                               +        
               LTH=6                                                            
         MFLD  DGIA0031,                                               +        
               LTH=6                                                            
         MFLD  DGIA0032,                                               +        
               LTH=6                                                            
         MFLD  DGIA0033,                                               +        
               LTH=6                                                            
         MFLD  DGIA0034,                                               +        
               LTH=6                                                            
         MFLD  DGIA0035,                                               +        
               LTH=6                                                            
         MFLD  DGIA0036,                                               +        
               LTH=6                                                            
         MFLD  DGIA0037,                                               +        
               LTH=6                                                            
         MFLD  DGIA0038,                                               +        
               LTH=6                                                            
         MFLD  DGIA0039,                                               +        
               LTH=6                                                            
         MFLD  DGIA0040,                                               +        
               LTH=6                                                            
         MFLD  DGIA0041,                                               +        
               LTH=6                                                            
         MFLD  KLASS1,                                                 +        
               LTH=1                                                            
         MFLD  KLASS2,                                                 +        
               LTH=1                                                            
         MFLD  KLASS3,                                                 +        
               LTH=1                                                            
         MFLD  KLASS4,                                                 +        
               LTH=1                                                            
         MFLD  KLASS5,                                                 +        
               LTH=1                                                            
         MFLD  KLASS6,                                                 +        
               LTH=1                                                            
         MFLD  KLASS7,                                                 +        
               LTH=1                                                            
         MFLD  KLASS8,                                                 +        
               LTH=1                                                            
         MFLD  KLASS9,                                                 +        
               LTH=1                                                            
         MFLD  KLASS10,                                                +        
               LTH=1                                                            
         MFLD  KLASS11,                                                +        
               LTH=1                                                            
         MFLD  KLASS12,                                                +        
               LTH=1                                                            
         MFLD  KLASS13,                                                +        
               LTH=1                                                            
         MFLD  KLASS14,                                                +        
               LTH=1                                                            
         MFLD  STATUS1,                                                +        
               LTH=2                                                            
         MFLD  STATUS2,                                                +        
               LTH=2                                                            
         MFLD  STATUS3,                                                +        
               LTH=2                                                            
         MFLD  STATUS4,                                                +        
               LTH=2                                                            
         MFLD  STATUS5,                                                +        
               LTH=2                                                            
         MFLD  STATUS6,                                                +        
               LTH=2                                                            
         MFLD  STATUS7,                                                +        
               LTH=2                                                            
         MFLD  STATUS8,                                                +        
               LTH=2                                                            
         MFLD  STATUS9,                                                +        
               LTH=2                                                            
         MFLD  STATUS10,                                               +        
               LTH=2                                                            
         MFLD  STATUS11,                                               +        
               LTH=2                                                            
         MFLD  STATUS12,                                               +        
               LTH=2                                                            
         MFLD  STATUS13,                                               +        
               LTH=2                                                            
         MFLD  STATUS14,                                               +        
               LTH=2                                                            
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
