***********************************************************************         
* CREATED BY PC36147   ON 99/03/10  AT 08:58                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'FRÅGA PÅ ARTIKEL                '                               
W4F509   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W4T509 7',                                           +        
               8='W4T509 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T501  ',                                          +        
               14='W4T502  ',                                          +        
               15='W4T503  ',                                          +        
               16='W4T504  ',                                          +        
               17='W4T505  ',                                          +        
               18='W4T506  ',                                          +        
               19='W4T507  ',                                          +        
               20='W4T508  ',                                          +        
               21='W4T509  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((2,7)),                                         +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Fråga på artikel',                                     +        
               POS=(1,12),LTH=16,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Dist',                                                 +        
               POS=(2,2),LTH=4,                                        +        
               ATTR=(ALPHA,PROT)                                                
IDDISTRI DFLD  POS=(2,7),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Kund',                                                 +        
               POS=(2,12),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
IDKUNDNI DFLD  POS=(2,17),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Art',                                                  +        
               POS=(2,24),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
IDARTNRI DFLD  POS=(2,28),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DC',                                                   +        
               POS=(2,38),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
IDDCI    DFLD  POS=(2,41),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  '* Order',                                              +        
               POS=(2,44),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
IDORDNRI DFLD  POS=(2,52),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Kli',                                                  +        
               POS=(2,60),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
IDKOLLI  DFLD  POS=(2,64),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Pnr',                                                  +        
               POS=(2,70),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
IDPRODNI DFLD  POS=(2,74),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
IDDISTRU DFLD  POS=(3,7),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
IDKUNDNU DFLD  POS=(3,17),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
IDARTNRU DFLD  POS=(3,28),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
IDDCU    DFLD  POS=(3,41),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  '*',                                                    +        
               POS=(3,44),LTH=1,                                       +        
               ATTR=(ALPHA,PROT)                                                
IDORDNRU DFLD  POS=(3,52),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
IDKOLLU  DFLD  POS=(3,64),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
IDPRODNU DFLD  POS=(3,74),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
IDRADNRE DFLD  POS=(4,2),LTH=4,                                        +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
IDRADNRN DFLD  POS=(4,7),LTH=4,                                        +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
IDKUNDNE DFLD  POS=(4,12),LTH=7,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
IDKUNDNN DFLD  POS=(4,20),LTH=7,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
IDORDN7E DFLD  POS=(4,28),LTH=7,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
IDORDN7N DFLD  POS=(4,36),LTH=7,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
IDORDERE DFLD  POS=(4,44),LTH=7,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
IDORDERN DFLD  POS=(4,52),LTH=7,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
IDDCENTR DFLD  POS=(4,60),LTH=2,                                       +        
               ATTR=(ALPHA,PROT,NODISP,MOD)                                     
IDDCNEXT DFLD  POS=(4,63),LTH=2,                                       +        
               ATTR=(ALPHA,PROT,NODISP,MOD)                                     
ADLAGE   DFLD  POS=(4,66),LTH=3,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
ADLAGN   DFLD  POS=(4,70),LTH=3,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
         DFLD  'Dist    Kund Ordernr DC Fk Kl S    Antal  Datum  Dlev  +        
                 Oref Radreferens',                                    +        
               POS=(5,2),LTH=73,                                       +        
               ATTR=(PROT)                                                      
DGIA0042 DFLD  POS=(6,2),LTH=4,                                        +        
               ATTR=(PROT)                                                      
DGIA0056 DFLD  POS=(6,8),LTH=6,                                        +        
               ATTR=(PROT)                                                      
DGIA0084 DFLD  POS=(6,15),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0098 DFLD  POS=(6,23),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0112 DFLD  POS=(6,26),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0126 DFLD  POS=(6,29),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0140 DFLD  POS=(6,32),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DGIA0000 DFLD  POS=(6,36),LTH=6,                                       +        
               ATTR=(PROT)                                                      
DGIA0014 DFLD  POS=(6,43),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0028 DFLD  POS=(6,50),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0070 DFLD  POS=(6,56),LTH=7,                                       +        
               ATTR=(PROT)                                                      
DGIA0154 DFLD  POS=(6,64),LTH=17,                                      +        
               ATTR=(PROT)                                                      
DGIA0043 DFLD  POS=(7,2),LTH=4,                                        +        
               ATTR=(PROT)                                                      
DGIA0057 DFLD  POS=(7,8),LTH=6,                                        +        
               ATTR=(PROT)                                                      
DGIA0085 DFLD  POS=(7,15),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0099 DFLD  POS=(7,23),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0113 DFLD  POS=(7,26),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0127 DFLD  POS=(7,29),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0141 DFLD  POS=(7,32),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DGIA0001 DFLD  POS=(7,36),LTH=6,                                       +        
               ATTR=(PROT)                                                      
DGIA0015 DFLD  POS=(7,43),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0029 DFLD  POS=(7,50),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0071 DFLD  POS=(7,56),LTH=7,                                       +        
               ATTR=(PROT)                                                      
DGIA0155 DFLD  POS=(7,64),LTH=17,                                      +        
               ATTR=(PROT)                                                      
DGIA0044 DFLD  POS=(8,2),LTH=4,                                        +        
               ATTR=(PROT)                                                      
DGIA0058 DFLD  POS=(8,8),LTH=6,                                        +        
               ATTR=(PROT)                                                      
DGIA0086 DFLD  POS=(8,15),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0100 DFLD  POS=(8,23),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0114 DFLD  POS=(8,26),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0128 DFLD  POS=(8,29),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0142 DFLD  POS=(8,32),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DGIA0002 DFLD  POS=(8,36),LTH=6,                                       +        
               ATTR=(PROT)                                                      
DGIA0016 DFLD  POS=(8,43),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0030 DFLD  POS=(8,50),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0072 DFLD  POS=(8,56),LTH=7,                                       +        
               ATTR=(PROT)                                                      
DGIA0156 DFLD  POS=(8,64),LTH=17,                                      +        
               ATTR=(PROT)                                                      
DGIA0045 DFLD  POS=(9,2),LTH=4,                                        +        
               ATTR=(PROT)                                                      
DGIA0059 DFLD  POS=(9,8),LTH=6,                                        +        
               ATTR=(PROT)                                                      
DGIA0087 DFLD  POS=(9,15),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0101 DFLD  POS=(9,23),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0115 DFLD  POS=(9,26),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0129 DFLD  POS=(9,29),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0143 DFLD  POS=(9,32),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DGIA0003 DFLD  POS=(9,36),LTH=6,                                       +        
               ATTR=(PROT)                                                      
DGIA0017 DFLD  POS=(9,43),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0031 DFLD  POS=(9,50),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0073 DFLD  POS=(9,56),LTH=7,                                       +        
               ATTR=(PROT)                                                      
DGIA0157 DFLD  POS=(9,64),LTH=17,                                      +        
               ATTR=(PROT)                                                      
DGIA0046 DFLD  POS=(10,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0060 DFLD  POS=(10,8),LTH=6,                                       +        
               ATTR=(PROT)                                                      
DGIA0088 DFLD  POS=(10,15),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0102 DFLD  POS=(10,23),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0116 DFLD  POS=(10,26),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0130 DFLD  POS=(10,29),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0144 DFLD  POS=(10,32),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0004 DFLD  POS=(10,36),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0018 DFLD  POS=(10,43),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0032 DFLD  POS=(10,50),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0074 DFLD  POS=(10,56),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DGIA0158 DFLD  POS=(10,64),LTH=17,                                     +        
               ATTR=(PROT)                                                      
DGIA0047 DFLD  POS=(11,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0061 DFLD  POS=(11,8),LTH=6,                                       +        
               ATTR=(PROT)                                                      
DGIA0089 DFLD  POS=(11,15),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0103 DFLD  POS=(11,23),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0117 DFLD  POS=(11,26),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0131 DFLD  POS=(11,29),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0145 DFLD  POS=(11,32),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0005 DFLD  POS=(11,36),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0019 DFLD  POS=(11,43),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0033 DFLD  POS=(11,50),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0075 DFLD  POS=(11,56),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DGIA0159 DFLD  POS=(11,64),LTH=17,                                     +        
               ATTR=(PROT)                                                      
DGIA0048 DFLD  POS=(12,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0062 DFLD  POS=(12,8),LTH=6,                                       +        
               ATTR=(PROT)                                                      
DGIA0090 DFLD  POS=(12,15),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0104 DFLD  POS=(12,23),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0118 DFLD  POS=(12,26),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0132 DFLD  POS=(12,29),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0146 DFLD  POS=(12,32),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0006 DFLD  POS=(12,36),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0020 DFLD  POS=(12,43),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0034 DFLD  POS=(12,50),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0076 DFLD  POS=(12,56),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DGIA0160 DFLD  POS=(12,64),LTH=17,                                     +        
               ATTR=(PROT)                                                      
DGIA0049 DFLD  POS=(13,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0063 DFLD  POS=(13,8),LTH=6,                                       +        
               ATTR=(PROT)                                                      
DGIA0091 DFLD  POS=(13,15),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0105 DFLD  POS=(13,23),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0119 DFLD  POS=(13,26),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0133 DFLD  POS=(13,29),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0147 DFLD  POS=(13,32),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0007 DFLD  POS=(13,36),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0021 DFLD  POS=(13,43),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0035 DFLD  POS=(13,50),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0077 DFLD  POS=(13,56),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DGIA0161 DFLD  POS=(13,64),LTH=17,                                     +        
               ATTR=(PROT)                                                      
DGIA0050 DFLD  POS=(14,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0064 DFLD  POS=(14,8),LTH=6,                                       +        
               ATTR=(PROT)                                                      
DGIA0092 DFLD  POS=(14,15),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0106 DFLD  POS=(14,23),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0120 DFLD  POS=(14,26),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0134 DFLD  POS=(14,29),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0148 DFLD  POS=(14,32),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0008 DFLD  POS=(14,36),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0022 DFLD  POS=(14,43),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0036 DFLD  POS=(14,50),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0078 DFLD  POS=(14,56),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DGIA0162 DFLD  POS=(14,64),LTH=17,                                     +        
               ATTR=(PROT)                                                      
DGIA0051 DFLD  POS=(15,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0065 DFLD  POS=(15,8),LTH=6,                                       +        
               ATTR=(PROT)                                                      
DGIA0093 DFLD  POS=(15,15),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0107 DFLD  POS=(15,23),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0121 DFLD  POS=(15,26),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0135 DFLD  POS=(15,29),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0149 DFLD  POS=(15,32),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0009 DFLD  POS=(15,36),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0023 DFLD  POS=(15,43),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0037 DFLD  POS=(15,50),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0079 DFLD  POS=(15,56),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DGIA0163 DFLD  POS=(15,64),LTH=17,                                     +        
               ATTR=(PROT)                                                      
DGIA0052 DFLD  POS=(16,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0066 DFLD  POS=(16,8),LTH=6,                                       +        
               ATTR=(PROT)                                                      
DGIA0094 DFLD  POS=(16,15),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0108 DFLD  POS=(16,23),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0122 DFLD  POS=(16,26),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0136 DFLD  POS=(16,29),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0150 DFLD  POS=(16,32),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0010 DFLD  POS=(16,36),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0024 DFLD  POS=(16,43),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0038 DFLD  POS=(16,50),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0080 DFLD  POS=(16,56),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DGIA0164 DFLD  POS=(16,64),LTH=17,                                     +        
               ATTR=(PROT)                                                      
DGIA0053 DFLD  POS=(17,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0067 DFLD  POS=(17,8),LTH=6,                                       +        
               ATTR=(PROT)                                                      
DGIA0095 DFLD  POS=(17,15),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0109 DFLD  POS=(17,23),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0123 DFLD  POS=(17,26),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0137 DFLD  POS=(17,29),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0151 DFLD  POS=(17,32),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0011 DFLD  POS=(17,36),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0025 DFLD  POS=(17,43),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0039 DFLD  POS=(17,50),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0081 DFLD  POS=(17,56),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DGIA0165 DFLD  POS=(17,64),LTH=17,                                     +        
               ATTR=(PROT)                                                      
DGIA0054 DFLD  POS=(18,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0068 DFLD  POS=(18,8),LTH=6,                                       +        
               ATTR=(PROT)                                                      
DGIA0096 DFLD  POS=(18,15),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0110 DFLD  POS=(18,23),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0124 DFLD  POS=(18,26),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0138 DFLD  POS=(18,29),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0152 DFLD  POS=(18,32),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0012 DFLD  POS=(18,36),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0026 DFLD  POS=(18,43),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0040 DFLD  POS=(18,50),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0082 DFLD  POS=(18,56),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DGIA0166 DFLD  POS=(18,64),LTH=17,                                     +        
               ATTR=(PROT)                                                      
DGIA0055 DFLD  POS=(19,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0069 DFLD  POS=(19,8),LTH=6,                                       +        
               ATTR=(PROT)                                                      
DGIA0097 DFLD  POS=(19,15),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0111 DFLD  POS=(19,23),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0125 DFLD  POS=(19,26),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0139 DFLD  POS=(19,29),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0153 DFLD  POS=(19,32),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0013 DFLD  POS=(19,36),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0027 DFLD  POS=(19,43),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0041 DFLD  POS=(19,50),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0083 DFLD  POS=(19,56),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DGIA0167 DFLD  POS=(19,64),LTH=17,                                     +        
               ATTR=(PROT)                                                      
ADGANGE  DFLD  POS=(20,2),LTH=3,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
ADGANGN  DFLD  POS=(20,6),LTH=3,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
ADPLATSE DFLD  POS=(20,10),LTH=5,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
ADPLATSN DFLD  POS=(20,16),LTH=5,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
IDPRODNE DFLD  POS=(20,22),LTH=7,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
IDPRODNN DFLD  POS=(20,30),LTH=7,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
IDDBE    DFLD  POS=(20,38),LTH=6,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
IDDBN    DFLD  POS=(20,45),LTH=6,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
IDKOLLIE DFLD  POS=(20,52),LTH=5,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
IDKOLLIN DFLD  POS=(20,58),LTH=5,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
IDDISTRE DFLD  POS=(20,64),LTH=4,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
IDDISTRN DFLD  POS=(20,70),LTH=4,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  '13 Order allm. 14 Order artikel 15 Order värde 16 Order+        
                Kundinf 17 Pack  lastat',                              +        
               POS=(21,2),LTH=79,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18 Last. kolli 19 Arkiv PU',                           +        
               POS=(22,2),LTH=26,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20 Kollin',                                            +        
               POS=(22,34),LTH=9,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21 Fråga artikel 10 WHELP',                            +        
               POS=(22,49),LTH=25,                                     +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4I50901 MSG   TYPE=INPUT,                                             +        
               SOR=(W4F509),                                           +        
               OPT=2,                                                  +        
               NXT=W4O50901                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F9'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '45091',                                                +        
               LTH=5                                                            
         MFLD  (IDDISTRI,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDDISTRU,                                              +        
               '    '),                                                +        
               LTH=4                                                            
         MFLD  (IDKUNDNI,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDKUNDNU,                                              +        
               '      '),                                              +        
               LTH=6                                                            
         MFLD  (IDORDNRI,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDORDNRU,                                              +        
               '       '),                                             +        
               LTH=7                                                            
         MFLD  (IDARTNRI,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDARTNRU,                                              +        
               '         '),                                           +        
               LTH=9                                                            
         MFLD  (IDKOLLI,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDKOLLU,                                               +        
               '     '),                                               +        
               LTH=5                                                            
         MFLD  (IDPRODNI,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDPRODNU,                                              +        
               '       '),                                             +        
               LTH=7                                                            
         MFLD  (IDDCI,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDDCU,                                                 +        
               '  '),                                                  +        
               LTH=2                                                            
         MFLD  IDRADNRE,                                               +        
               LTH=4                                                            
         MFLD  IDRADNRN,                                               +        
               LTH=4                                                            
         MFLD  IDKUNDNE,                                               +        
               LTH=7                                                            
         MFLD  IDKUNDNN,                                               +        
               LTH=7                                                            
         MFLD  IDORDN7E,                                               +        
               LTH=7                                                            
         MFLD  IDORDN7N,                                               +        
               LTH=7                                                            
         MFLD  IDORDERE,                                               +        
               LTH=7                                                            
         MFLD  IDORDERN,                                               +        
               LTH=7                                                            
         MFLD  IDDCENTR,                                               +        
               LTH=2                                                            
         MFLD  IDDCNEXT,                                               +        
               LTH=2                                                            
         MFLD  ADLAGE,                                                 +        
               LTH=3                                                            
         MFLD  ADLAGN,                                                 +        
               LTH=3                                                            
         MFLD  ADGANGE,                                                +        
               LTH=3                                                            
         MFLD  ADGANGN,                                                +        
               LTH=3                                                            
         MFLD  ADPLATSE,                                               +        
               LTH=5                                                            
         MFLD  ADPLATSN,                                               +        
               LTH=5                                                            
         MFLD  IDPRODNE,                                               +        
               LTH=7                                                            
         MFLD  IDPRODNN,                                               +        
               LTH=7                                                            
         MFLD  IDDBE,                                                  +        
               LTH=6                                                            
         MFLD  IDDBN,                                                  +        
               LTH=6                                                            
         MFLD  IDKOLLIE,                                               +        
               LTH=5                                                            
         MFLD  IDKOLLIN,                                               +        
               LTH=5                                                            
         MFLD  IDDISTRE,                                               +        
               LTH=4                                                            
         MFLD  IDDISTRN,                                               +        
               LTH=4                                                            
         MSGEND                                                                 
W4O50901 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4F509,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I50901,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDDISTRI,                                               +        
               LTH=4                                                            
         MFLD  IDDISTRU,                                               +        
               LTH=4                                                            
         MFLD  IDKUNDNI,                                               +        
               LTH=6                                                            
         MFLD  IDKUNDNU,                                               +        
               LTH=6                                                            
         MFLD  IDARTNRI,                                               +        
               LTH=9                                                            
         MFLD  IDARTNRU,                                               +        
               LTH=9                                                            
         MFLD  IDDCI,                                                  +        
               LTH=2                                                            
         MFLD  IDDCU,                                                  +        
               LTH=2                                                            
         MFLD  IDORDNRI,                                               +        
               LTH=7                                                            
         MFLD  IDORDNRU,                                               +        
               LTH=7                                                            
         MFLD  IDKOLLI,                                                +        
               LTH=5                                                            
         MFLD  IDKOLLU,                                                +        
               LTH=5                                                            
         MFLD  IDPRODNI,                                               +        
               LTH=7                                                            
         MFLD  IDPRODNU,                                               +        
               LTH=7                                                            
         MFLD  IDRADNRE,                                               +        
               LTH=4                                                            
         MFLD  IDRADNRN,                                               +        
               LTH=4                                                            
         MFLD  IDKUNDNE,                                               +        
               LTH=7                                                            
         MFLD  IDKUNDNN,                                               +        
               LTH=7                                                            
         MFLD  IDORDN7E,                                               +        
               LTH=7                                                            
         MFLD  IDORDN7N,                                               +        
               LTH=7                                                            
         MFLD  IDORDERE,                                               +        
               LTH=7                                                            
         MFLD  IDORDERN,                                               +        
               LTH=7                                                            
         MFLD  IDDCENTR,                                               +        
               LTH=2                                                            
         MFLD  IDDCNEXT,                                               +        
               LTH=2                                                            
         MFLD  ADLAGE,                                                 +        
               LTH=3                                                            
         MFLD  ADLAGN,                                                 +        
               LTH=3                                                            
         MFLD  DGIA0042,                                               +        
               LTH=4                                                            
         MFLD  DGIA0043,                                               +        
               LTH=4                                                            
         MFLD  DGIA0044,                                               +        
               LTH=4                                                            
         MFLD  DGIA0045,                                               +        
               LTH=4                                                            
         MFLD  DGIA0046,                                               +        
               LTH=4                                                            
         MFLD  DGIA0047,                                               +        
               LTH=4                                                            
         MFLD  DGIA0048,                                               +        
               LTH=4                                                            
         MFLD  DGIA0049,                                               +        
               LTH=4                                                            
         MFLD  DGIA0050,                                               +        
               LTH=4                                                            
         MFLD  DGIA0051,                                               +        
               LTH=4                                                            
         MFLD  DGIA0052,                                               +        
               LTH=4                                                            
         MFLD  DGIA0053,                                               +        
               LTH=4                                                            
         MFLD  DGIA0054,                                               +        
               LTH=4                                                            
         MFLD  DGIA0055,                                               +        
               LTH=4                                                            
         MFLD  DGIA0056,                                               +        
               LTH=6                                                            
         MFLD  DGIA0057,                                               +        
               LTH=6                                                            
         MFLD  DGIA0058,                                               +        
               LTH=6                                                            
         MFLD  DGIA0059,                                               +        
               LTH=6                                                            
         MFLD  DGIA0060,                                               +        
               LTH=6                                                            
         MFLD  DGIA0061,                                               +        
               LTH=6                                                            
         MFLD  DGIA0062,                                               +        
               LTH=6                                                            
         MFLD  DGIA0063,                                               +        
               LTH=6                                                            
         MFLD  DGIA0064,                                               +        
               LTH=6                                                            
         MFLD  DGIA0065,                                               +        
               LTH=6                                                            
         MFLD  DGIA0066,                                               +        
               LTH=6                                                            
         MFLD  DGIA0067,                                               +        
               LTH=6                                                            
         MFLD  DGIA0068,                                               +        
               LTH=6                                                            
         MFLD  DGIA0069,                                               +        
               LTH=6                                                            
         MFLD  DGIA0084,                                               +        
               LTH=7                                                            
         MFLD  DGIA0085,                                               +        
               LTH=7                                                            
         MFLD  DGIA0086,                                               +        
               LTH=7                                                            
         MFLD  DGIA0087,                                               +        
               LTH=7                                                            
         MFLD  DGIA0088,                                               +        
               LTH=7                                                            
         MFLD  DGIA0089,                                               +        
               LTH=7                                                            
         MFLD  DGIA0090,                                               +        
               LTH=7                                                            
         MFLD  DGIA0091,                                               +        
               LTH=7                                                            
         MFLD  DGIA0092,                                               +        
               LTH=7                                                            
         MFLD  DGIA0093,                                               +        
               LTH=7                                                            
         MFLD  DGIA0094,                                               +        
               LTH=7                                                            
         MFLD  DGIA0095,                                               +        
               LTH=7                                                            
         MFLD  DGIA0096,                                               +        
               LTH=7                                                            
         MFLD  DGIA0097,                                               +        
               LTH=7                                                            
         MFLD  DGIA0098,                                               +        
               LTH=2                                                            
         MFLD  DGIA0099,                                               +        
               LTH=2                                                            
         MFLD  DGIA0100,                                               +        
               LTH=2                                                            
         MFLD  DGIA0101,                                               +        
               LTH=2                                                            
         MFLD  DGIA0102,                                               +        
               LTH=2                                                            
         MFLD  DGIA0103,                                               +        
               LTH=2                                                            
         MFLD  DGIA0104,                                               +        
               LTH=2                                                            
         MFLD  DGIA0105,                                               +        
               LTH=2                                                            
         MFLD  DGIA0106,                                               +        
               LTH=2                                                            
         MFLD  DGIA0107,                                               +        
               LTH=2                                                            
         MFLD  DGIA0108,                                               +        
               LTH=2                                                            
         MFLD  DGIA0109,                                               +        
               LTH=2                                                            
         MFLD  DGIA0110,                                               +        
               LTH=2                                                            
         MFLD  DGIA0111,                                               +        
               LTH=2                                                            
         MFLD  DGIA0112,                                               +        
               LTH=2                                                            
         MFLD  DGIA0113,                                               +        
               LTH=2                                                            
         MFLD  DGIA0114,                                               +        
               LTH=2                                                            
         MFLD  DGIA0115,                                               +        
               LTH=2                                                            
         MFLD  DGIA0116,                                               +        
               LTH=2                                                            
         MFLD  DGIA0117,                                               +        
               LTH=2                                                            
         MFLD  DGIA0118,                                               +        
               LTH=2                                                            
         MFLD  DGIA0119,                                               +        
               LTH=2                                                            
         MFLD  DGIA0120,                                               +        
               LTH=2                                                            
         MFLD  DGIA0121,                                               +        
               LTH=2                                                            
         MFLD  DGIA0122,                                               +        
               LTH=2                                                            
         MFLD  DGIA0123,                                               +        
               LTH=2                                                            
         MFLD  DGIA0124,                                               +        
               LTH=2                                                            
         MFLD  DGIA0125,                                               +        
               LTH=2                                                            
         MFLD  DGIA0126,                                               +        
               LTH=1                                                            
         MFLD  DGIA0127,                                               +        
               LTH=1                                                            
         MFLD  DGIA0128,                                               +        
               LTH=1                                                            
         MFLD  DGIA0129,                                               +        
               LTH=1                                                            
         MFLD  DGIA0130,                                               +        
               LTH=1                                                            
         MFLD  DGIA0131,                                               +        
               LTH=1                                                            
         MFLD  DGIA0132,                                               +        
               LTH=1                                                            
         MFLD  DGIA0133,                                               +        
               LTH=1                                                            
         MFLD  DGIA0134,                                               +        
               LTH=1                                                            
         MFLD  DGIA0135,                                               +        
               LTH=1                                                            
         MFLD  DGIA0136,                                               +        
               LTH=1                                                            
         MFLD  DGIA0137,                                               +        
               LTH=1                                                            
         MFLD  DGIA0138,                                               +        
               LTH=1                                                            
         MFLD  DGIA0139,                                               +        
               LTH=1                                                            
         MFLD  DGIA0140,                                               +        
               LTH=2                                                            
         MFLD  DGIA0141,                                               +        
               LTH=2                                                            
         MFLD  DGIA0142,                                               +        
               LTH=2                                                            
         MFLD  DGIA0143,                                               +        
               LTH=2                                                            
         MFLD  DGIA0144,                                               +        
               LTH=2                                                            
         MFLD  DGIA0145,                                               +        
               LTH=2                                                            
         MFLD  DGIA0146,                                               +        
               LTH=2                                                            
         MFLD  DGIA0147,                                               +        
               LTH=2                                                            
         MFLD  DGIA0148,                                               +        
               LTH=2                                                            
         MFLD  DGIA0149,                                               +        
               LTH=2                                                            
         MFLD  DGIA0150,                                               +        
               LTH=2                                                            
         MFLD  DGIA0151,                                               +        
               LTH=2                                                            
         MFLD  DGIA0152,                                               +        
               LTH=2                                                            
         MFLD  DGIA0153,                                               +        
               LTH=2                                                            
         MFLD  DGIA0000,                                               +        
               LTH=6                                                            
         MFLD  DGIA0001,                                               +        
               LTH=6                                                            
         MFLD  DGIA0002,                                               +        
               LTH=6                                                            
         MFLD  DGIA0003,                                               +        
               LTH=6                                                            
         MFLD  DGIA0004,                                               +        
               LTH=6                                                            
         MFLD  DGIA0005,                                               +        
               LTH=6                                                            
         MFLD  DGIA0006,                                               +        
               LTH=6                                                            
         MFLD  DGIA0007,                                               +        
               LTH=6                                                            
         MFLD  DGIA0008,                                               +        
               LTH=6                                                            
         MFLD  DGIA0009,                                               +        
               LTH=6                                                            
         MFLD  DGIA0010,                                               +        
               LTH=6                                                            
         MFLD  DGIA0011,                                               +        
               LTH=6                                                            
         MFLD  DGIA0012,                                               +        
               LTH=6                                                            
         MFLD  DGIA0013,                                               +        
               LTH=6                                                            
         MFLD  DGIA0014,                                               +        
               LTH=6                                                            
         MFLD  DGIA0015,                                               +        
               LTH=6                                                            
         MFLD  DGIA0016,                                               +        
               LTH=6                                                            
         MFLD  DGIA0017,                                               +        
               LTH=6                                                            
         MFLD  DGIA0018,                                               +        
               LTH=6                                                            
         MFLD  DGIA0019,                                               +        
               LTH=6                                                            
         MFLD  DGIA0020,                                               +        
               LTH=6                                                            
         MFLD  DGIA0021,                                               +        
               LTH=6                                                            
         MFLD  DGIA0022,                                               +        
               LTH=6                                                            
         MFLD  DGIA0023,                                               +        
               LTH=6                                                            
         MFLD  DGIA0024,                                               +        
               LTH=6                                                            
         MFLD  DGIA0025,                                               +        
               LTH=6                                                            
         MFLD  DGIA0026,                                               +        
               LTH=6                                                            
         MFLD  DGIA0027,                                               +        
               LTH=6                                                            
         MFLD  DGIA0028,                                               +        
               LTH=5                                                            
         MFLD  DGIA0029,                                               +        
               LTH=5                                                            
         MFLD  DGIA0030,                                               +        
               LTH=5                                                            
         MFLD  DGIA0031,                                               +        
               LTH=5                                                            
         MFLD  DGIA0032,                                               +        
               LTH=5                                                            
         MFLD  DGIA0033,                                               +        
               LTH=5                                                            
         MFLD  DGIA0034,                                               +        
               LTH=5                                                            
         MFLD  DGIA0035,                                               +        
               LTH=5                                                            
         MFLD  DGIA0036,                                               +        
               LTH=5                                                            
         MFLD  DGIA0037,                                               +        
               LTH=5                                                            
         MFLD  DGIA0038,                                               +        
               LTH=5                                                            
         MFLD  DGIA0039,                                               +        
               LTH=5                                                            
         MFLD  DGIA0040,                                               +        
               LTH=5                                                            
         MFLD  DGIA0041,                                               +        
               LTH=5                                                            
         MFLD  DGIA0070,                                               +        
               LTH=7                                                            
         MFLD  DGIA0071,                                               +        
               LTH=7                                                            
         MFLD  DGIA0072,                                               +        
               LTH=7                                                            
         MFLD  DGIA0073,                                               +        
               LTH=7                                                            
         MFLD  DGIA0074,                                               +        
               LTH=7                                                            
         MFLD  DGIA0075,                                               +        
               LTH=7                                                            
         MFLD  DGIA0076,                                               +        
               LTH=7                                                            
         MFLD  DGIA0077,                                               +        
               LTH=7                                                            
         MFLD  DGIA0078,                                               +        
               LTH=7                                                            
         MFLD  DGIA0079,                                               +        
               LTH=7                                                            
         MFLD  DGIA0080,                                               +        
               LTH=7                                                            
         MFLD  DGIA0081,                                               +        
               LTH=7                                                            
         MFLD  DGIA0082,                                               +        
               LTH=7                                                            
         MFLD  DGIA0083,                                               +        
               LTH=7                                                            
         MFLD  DGIA0154,                                               +        
               LTH=17                                                           
         MFLD  DGIA0155,                                               +        
               LTH=17                                                           
         MFLD  DGIA0156,                                               +        
               LTH=17                                                           
         MFLD  DGIA0157,                                               +        
               LTH=17                                                           
         MFLD  DGIA0158,                                               +        
               LTH=17                                                           
         MFLD  DGIA0159,                                               +        
               LTH=17                                                           
         MFLD  DGIA0160,                                               +        
               LTH=17                                                           
         MFLD  DGIA0161,                                               +        
               LTH=17                                                           
         MFLD  DGIA0162,                                               +        
               LTH=17                                                           
         MFLD  DGIA0163,                                               +        
               LTH=17                                                           
         MFLD  DGIA0164,                                               +        
               LTH=17                                                           
         MFLD  DGIA0165,                                               +        
               LTH=17                                                           
         MFLD  DGIA0166,                                               +        
               LTH=17                                                           
         MFLD  DGIA0167,                                               +        
               LTH=17                                                           
         MFLD  ADGANGE,                                                +        
               LTH=3                                                            
         MFLD  ADGANGN,                                                +        
               LTH=3                                                            
         MFLD  ADPLATSE,                                               +        
               LTH=5                                                            
         MFLD  ADPLATSN,                                               +        
               LTH=5                                                            
         MFLD  IDPRODNE,                                               +        
               LTH=7                                                            
         MFLD  IDPRODNN,                                               +        
               LTH=7                                                            
         MFLD  IDDBE,                                                  +        
               LTH=6                                                            
         MFLD  IDDBN,                                                  +        
               LTH=6                                                            
         MFLD  IDKOLLIE,                                               +        
               LTH=5                                                            
         MFLD  IDKOLLIN,                                               +        
               LTH=5                                                            
         MFLD  IDDISTRE,                                               +        
               LTH=4                                                            
         MFLD  IDDISTRN,                                               +        
               LTH=4                                                            
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
