***********************************************************************         
* CREATED BY PC38450  ON 94/12/19  AT 08:47                                     
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE '                                '                               
W4F571   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W4T571 7',                                           +        
               8='W4T571 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T571  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T571  ',                                          +        
               14='W4T572  ',                                          +        
               15='W4T573  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W4T571  ',                                          +        
               24='  RCL.  ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,8)),                                         +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'FRÅGA PÅ RO/TPO',                                      +        
               POS=(1,12),LTH=15,                                      +        
               ATTR=(PROT)                                                      
FLD0136  DFLD  POS=(1,36),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Distr',                                                +        
               POS=(2,2),LTH=5,                                        +        
               ATTR=(PROT)                                                      
FLD0208  DFLD  POS=(2,8),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Kund',                                                 +        
               POS=(2,13),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0218  DFLD  POS=(2,18),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Artikel',                                              +        
               POS=(2,25),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0233  DFLD  POS=(2,33),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Kl',                                                   +        
               POS=(2,43),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0246  DFLD  POS=(2,46),LTH=1,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Psl',                                                  +        
               POS=(2,48),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0252  DFLD  POS=(2,52),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Order',                                                +        
               POS=(2,55),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0261  DFLD  POS=(2,61),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'TPO',                                                  +        
               POS=(2,67),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0271  DFLD  POS=(2,71),LTH=1,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DC',                                                   +        
               POS=(2,73),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0276  DFLD  POS=(2,76),LTH=2,                                       +        
               ATTR=(ALPHA,NOPROT)                                              
FLD0308  DFLD  POS=(3,8),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
FLD0318  DFLD  POS=(3,18),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0333  DFLD  POS=(3,33),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0346  DFLD  POS=(3,46),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0352  DFLD  POS=(3,52),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0361  DFLD  POS=(3,61),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0371  DFLD  POS=(3,71),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0376  DFLD  POS=(3,76),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0402  DFLD  POS=(4,2),LTH=4,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0407  DFLD  POS=(4,7),LTH=6,                                        +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
FLD0415  DFLD  POS=(4,15),LTH=9,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0425  DFLD  POS=(4,25),LTH=1,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
FLD0427  DFLD  POS=(4,27),LTH=2,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
FLD0430  DFLD  POS=(4,30),LTH=5,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
FLD0436  DFLD  POS=(4,36),LTH=1,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
FLD0438  DFLD  POS=(4,38),LTH=2,                                       +        
               ATTR=(ALPHA,PROT,NODISP,MOD)                                     
FLD0441  DFLD  POS=(4,41),LTH=2,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
         DFLD  'Kund  Artikel   Antal Order',                          +        
               POS=(5,4),LTH=27,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Kl  Rodat Tpodat Pr Ans Dc',                           +        
               POS=(5,37),LTH=26,                                      +        
               ATTR=(PROT)                                                      
         DO 14,SUF=06                                                           
COL02    DFLD  POS=(06,02),LTH=0006,                                   +        
               ATTR=(PROT)                                                      
COL09    DFLD  POS=(06,09),LTH=0008,                                   +        
               ATTR=(NUM,PROT)                                                  
COL18    DFLD  POS=(06,18),LTH=0007,                                   +        
               ATTR=(NUM,PROT)                                                  
COL26    DFLD  POS=(06,26),LTH=0010,                                   +        
               ATTR=(NUM,PROT)                                                  
COL38    DFLD  POS=(06,38),LTH=0001,                                   +        
               ATTR=(PROT)                                                      
COL40    DFLD  POS=(06,40),LTH=0006,                                   +        
               ATTR=(NUM,PROT)                                                  
COL47    DFLD  POS=(06,47),LTH=0006,                                   +        
               ATTR=(NUM,PROT)                                                  
COL54    DFLD  POS=(06,54),LTH=0002,                                   +        
               ATTR=(NUM,PROT)                                                  
COL57    DFLD  POS=(06,57),LTH=0003,                                   +        
               ATTR=(NUM,PROT)                                                  
COL61    DFLD  POS=(06,61),LTH=0002,                                   +        
               ATTR=(ALPHA,PROT)                                                
         ENDDO                                                                  
FLD2002  DFLD  POS=(20,2),LTH=4,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD2007  DFLD  POS=(20,7),LTH=6,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
FLD2015  DFLD  POS=(20,15),LTH=9,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD2025  DFLD  POS=(20,25),LTH=1,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
FLD2027  DFLD  POS=(20,27),LTH=2,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
FLD2030  DFLD  POS=(20,30),LTH=5,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
FLD2036  DFLD  POS=(20,36),LTH=1,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
FLD2038  DFLD  POS=(20,38),LTH=2,                                      +        
               ATTR=(ALPHA,PROT,NODISP,MOD)                                     
         DFLD  '13 Fråga ro    14 Uppdatera ro  15 Reserv. ro    16',  +        
               POS=(21,2),LTH=51,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,17),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,51),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4O57101 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4F571,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I57101,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0136,                                                +        
               LTH=40                                                           
         MFLD  FLD0208,                                                +        
               LTH=4                                                            
         MFLD  FLD0308,                                                +        
               LTH=4                                                            
         MFLD  FLD0218,                                                +        
               LTH=6                                                            
         MFLD  FLD0318,                                                +        
               LTH=6                                                            
         MFLD  FLD0233,                                                +        
               LTH=9                                                            
         MFLD  FLD0333,                                                +        
               LTH=9                                                            
         MFLD  FLD0246,                                                +        
               LTH=1                                                            
         MFLD  FLD0346,                                                +        
               LTH=1                                                            
         MFLD  FLD0252,                                                +        
               LTH=2                                                            
         MFLD  FLD0352,                                                +        
               LTH=2                                                            
         MFLD  FLD0261,                                                +        
               LTH=5                                                            
         MFLD  FLD0361,                                                +        
               LTH=5                                                            
         MFLD  FLD0271,                                                +        
               LTH=1                                                            
         MFLD  FLD0371,                                                +        
               LTH=1                                                            
         MFLD  FLD0276,                                                +        
               LTH=2                                                            
         MFLD  FLD0376,                                                +        
               LTH=2                                                            
         MFLD  FLD0402,                                                +        
               LTH=4                                                            
         MFLD  FLD0407,                                                +        
               LTH=6                                                            
         MFLD  FLD0415,                                                +        
               LTH=9                                                            
         MFLD  FLD0425,                                                +        
               LTH=1                                                            
         MFLD  FLD0427,                                                +        
               LTH=2                                                            
         MFLD  FLD0430,                                                +        
               LTH=5                                                            
         MFLD  FLD0436,                                                +        
               LTH=1                                                            
         MFLD  FLD0438,                                                +        
               LTH=2                                                            
         MFLD  FLD0441,                                                +        
               LTH=2                                                            
         DO    14,SUF=06                                                        
         MFLD  COL02,                                                  +        
               LTH=6                                                            
         MFLD  COL09,                                                  +        
               LTH=8                                                            
         MFLD  COL18,                                                  +        
               LTH=7                                                            
         MFLD  COL26,                                                  +        
               LTH=5                                                            
         MFLD  COL38,                                                  +        
               LTH=1                                                            
         MFLD  COL40,                                                  +        
               LTH=6                                                            
         MFLD  COL47,                                                  +        
               LTH=6                                                            
         MFLD  COL54,                                                  +        
               LTH=2                                                            
         MFLD  COL57,                                                  +        
               LTH=3                                                            
         MFLD  COL61,                                                  +        
               LTH=2                                                            
         ENDDO                                                                  
         MFLD  FLD2002,                                                +        
               LTH=4                                                            
         MFLD  FLD2007,                                                +        
               LTH=6                                                            
         MFLD  FLD2015,                                                +        
               LTH=9                                                            
         MFLD  FLD2025,                                                +        
               LTH=1                                                            
         MFLD  FLD2027,                                                +        
               LTH=2                                                            
         MFLD  FLD2030,                                                +        
               LTH=5                                                            
         MFLD  FLD2036,                                                +        
               LTH=1                                                            
         MFLD  FLD2038,                                                +        
               LTH=2                                                            
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I57101 MSG   TYPE=INPUT,                                             +        
               SOR=(W4F571),                                           +        
               OPT=2,                                                  +        
               NXT=W4O57101                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F7'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '45711',                                                +        
               LTH=5                                                            
         MFLD  (FLD0208,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0308,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0218,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0318,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0233,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0333,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0246,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0346,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0252,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0352,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0261,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0361,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0271,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0371,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0276,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0376,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0402,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0407,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0415,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0425,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0427,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0430,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0436,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0438,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0441,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD2002,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD2007,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD2015,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD2025,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD2027,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD2030,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD2036,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD2038,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
