***********************************************************************         
* CREATED BY PCC4448   ON 95/07/28  AT 14:07                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'FRÅGA DISTR/KOLLI               '                               
W4F515   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W4T515 6',                                           +        
               7='W4T515 7',                                           +        
               8='W4T515 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T511  ',                                          +        
               14='W4T512  ',                                          +        
               15='W4T513  ',                                          +        
               16='W4T514  ',                                          +        
               17='W4T515  ',                                          +        
               18='W0T501  ',                                          +        
               19='W4T517  ',                                          +        
               20='W0T501  ',                                          +        
               21='W4T515 6',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W4F515   DPAGE CURSOR=((2,8)),                                         +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Fråga på distrikt/kollin',                             +        
               POS=(1,11),LTH=24,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Distr',                                                +        
               POS=(2,2),LTH=5,                                        +        
               ATTR=(ALPHA,PROT)                                                
DGIA0156 DFLD  POS=(2,8),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Kund',                                                 +        
               POS=(2,13),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0164 DFLD  POS=(2,18),LTH=6,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'DC',                                                   +        
               POS=(2,25),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0154 DFLD  POS=(2,28),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  '*Kl',                                                  +        
               POS=(2,32),LTH=3,                                       +        
               ATTR=(PROT)                                                      
DGIA0160 DFLD  POS=(2,36),LTH=1,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Fk',                                                   +        
               POS=(2,38),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0158 DFLD  POS=(2,41),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Status',                                               +        
               POS=(2,44),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0172 DFLD  POS=(2,51),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0157 DFLD  POS=(3,8),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
DGIA0165 DFLD  POS=(3,18),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0155 DFLD  POS=(3,28),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  '*',                                                    +        
               POS=(3,32),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DGIA0161 DFLD  POS=(3,36),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0159 DFLD  POS=(3,41),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0173 DFLD  POS=(3,51),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Bild  Kundnr Ordernr DC Fk Kl  S Kolli-P Kolli-F Kolli-+        
               L  Btovikt   Btovol',                                   +        
               POS=(5,2),LTH=74,                                       +        
               ATTR=(PROT)                                                      
IDBILD1  DFLD  POS=(6,2),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
DGIA0084 DFLD  POS=(6,8),LTH=6,                                        +        
               ATTR=(PROT,MOD)                                                  
DGIA0098 DFLD  POS=(6,15),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0000 DFLD  POS=(6,23),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0014 DFLD  POS=(6,26),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0028 DFLD  POS=(6,30),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DGIA0112 DFLD  POS=(6,32),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0070 DFLD  POS=(6,38),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0042 DFLD  POS=(6,46),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0056 DFLD  POS=(6,54),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0126 DFLD  POS=(6,59),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0140 DFLD  POS=(6,68),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
IDBILD2  DFLD  POS=(7,2),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
DGIA0085 DFLD  POS=(7,8),LTH=6,                                        +        
               ATTR=(PROT,MOD)                                                  
DGIA0099 DFLD  POS=(7,15),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0001 DFLD  POS=(7,23),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0015 DFLD  POS=(7,26),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0029 DFLD  POS=(7,30),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DGIA0113 DFLD  POS=(7,32),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0071 DFLD  POS=(7,38),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0043 DFLD  POS=(7,46),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0057 DFLD  POS=(7,54),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0127 DFLD  POS=(7,59),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0141 DFLD  POS=(7,68),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
IDBILD3  DFLD  POS=(8,2),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
DGIA0086 DFLD  POS=(8,8),LTH=6,                                        +        
               ATTR=(PROT,MOD)                                                  
DGIA0100 DFLD  POS=(8,15),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0002 DFLD  POS=(8,23),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0016 DFLD  POS=(8,26),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0030 DFLD  POS=(8,30),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DGIA0114 DFLD  POS=(8,32),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0072 DFLD  POS=(8,38),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0044 DFLD  POS=(8,46),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0058 DFLD  POS=(8,54),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0128 DFLD  POS=(8,59),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0142 DFLD  POS=(8,68),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
IDBILD4  DFLD  POS=(9,2),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
DGIA0087 DFLD  POS=(9,8),LTH=6,                                        +        
               ATTR=(PROT,MOD)                                                  
DGIA0101 DFLD  POS=(9,15),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0003 DFLD  POS=(9,23),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0017 DFLD  POS=(9,26),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0031 DFLD  POS=(9,30),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DGIA0115 DFLD  POS=(9,32),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0073 DFLD  POS=(9,38),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0045 DFLD  POS=(9,46),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0059 DFLD  POS=(9,54),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0129 DFLD  POS=(9,59),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0143 DFLD  POS=(9,68),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
IDBILD5  DFLD  POS=(10,2),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0088 DFLD  POS=(10,8),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0102 DFLD  POS=(10,15),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0004 DFLD  POS=(10,23),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0018 DFLD  POS=(10,26),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0032 DFLD  POS=(10,30),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0116 DFLD  POS=(10,32),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0074 DFLD  POS=(10,38),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0046 DFLD  POS=(10,46),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0060 DFLD  POS=(10,54),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0130 DFLD  POS=(10,59),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0144 DFLD  POS=(10,68),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
IDBILD6  DFLD  POS=(11,2),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0089 DFLD  POS=(11,8),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0103 DFLD  POS=(11,15),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0005 DFLD  POS=(11,23),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0019 DFLD  POS=(11,26),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0033 DFLD  POS=(11,30),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0117 DFLD  POS=(11,32),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0075 DFLD  POS=(11,38),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0047 DFLD  POS=(11,46),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0061 DFLD  POS=(11,54),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0131 DFLD  POS=(11,59),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0145 DFLD  POS=(11,68),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
IDBILD7  DFLD  POS=(12,2),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0090 DFLD  POS=(12,8),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0104 DFLD  POS=(12,15),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0006 DFLD  POS=(12,23),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0020 DFLD  POS=(12,26),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0034 DFLD  POS=(12,30),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0118 DFLD  POS=(12,32),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0076 DFLD  POS=(12,38),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0048 DFLD  POS=(12,46),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0062 DFLD  POS=(12,54),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0132 DFLD  POS=(12,59),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0146 DFLD  POS=(12,68),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
IDBILD8  DFLD  POS=(13,2),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0091 DFLD  POS=(13,8),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0105 DFLD  POS=(13,15),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0007 DFLD  POS=(13,23),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0021 DFLD  POS=(13,26),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0035 DFLD  POS=(13,30),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0119 DFLD  POS=(13,32),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0077 DFLD  POS=(13,38),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0049 DFLD  POS=(13,46),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0063 DFLD  POS=(13,54),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0133 DFLD  POS=(13,59),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0147 DFLD  POS=(13,68),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
IDBILD9  DFLD  POS=(14,2),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0092 DFLD  POS=(14,8),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0106 DFLD  POS=(14,15),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0008 DFLD  POS=(14,23),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0022 DFLD  POS=(14,26),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0036 DFLD  POS=(14,30),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0120 DFLD  POS=(14,32),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0078 DFLD  POS=(14,38),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0050 DFLD  POS=(14,46),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0064 DFLD  POS=(14,54),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0134 DFLD  POS=(14,59),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0148 DFLD  POS=(14,68),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
IDBILD10 DFLD  POS=(15,2),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0093 DFLD  POS=(15,8),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0107 DFLD  POS=(15,15),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0009 DFLD  POS=(15,23),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0023 DFLD  POS=(15,26),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0037 DFLD  POS=(15,30),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0121 DFLD  POS=(15,32),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0079 DFLD  POS=(15,38),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0051 DFLD  POS=(15,46),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0065 DFLD  POS=(15,54),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0135 DFLD  POS=(15,59),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0149 DFLD  POS=(15,68),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
IDBILD11 DFLD  POS=(16,2),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0094 DFLD  POS=(16,8),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0108 DFLD  POS=(16,15),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0010 DFLD  POS=(16,23),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0024 DFLD  POS=(16,26),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0038 DFLD  POS=(16,30),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0122 DFLD  POS=(16,32),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0080 DFLD  POS=(16,38),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0052 DFLD  POS=(16,46),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0066 DFLD  POS=(16,54),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0136 DFLD  POS=(16,59),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0150 DFLD  POS=(16,68),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
IDBILD12 DFLD  POS=(17,2),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0095 DFLD  POS=(17,8),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0109 DFLD  POS=(17,15),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0011 DFLD  POS=(17,23),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0025 DFLD  POS=(17,26),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0039 DFLD  POS=(17,30),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0123 DFLD  POS=(17,32),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0081 DFLD  POS=(17,38),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0053 DFLD  POS=(17,46),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0067 DFLD  POS=(17,54),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0137 DFLD  POS=(17,59),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0151 DFLD  POS=(17,68),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
IDBILD13 DFLD  POS=(18,2),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0096 DFLD  POS=(18,8),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0110 DFLD  POS=(18,15),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0012 DFLD  POS=(18,23),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0026 DFLD  POS=(18,26),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0040 DFLD  POS=(18,30),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0124 DFLD  POS=(18,32),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0082 DFLD  POS=(18,38),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0054 DFLD  POS=(18,46),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0068 DFLD  POS=(18,54),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0138 DFLD  POS=(18,59),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0152 DFLD  POS=(18,68),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
IDBILD14 DFLD  POS=(19,2),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0097 DFLD  POS=(19,8),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0111 DFLD  POS=(19,15),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DGIA0013 DFLD  POS=(19,23),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0027 DFLD  POS=(19,26),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0041 DFLD  POS=(19,30),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0125 DFLD  POS=(19,32),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0083 DFLD  POS=(19,38),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0055 DFLD  POS=(19,46),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0069 DFLD  POS=(19,54),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0139 DFLD  POS=(19,59),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0153 DFLD  POS=(19,68),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'PF6=Bakåt PF7=Första PF8=Framåt 13 Distr värde 14 Distr+        
                rader 15 Distr status',                                +        
               POS=(21,2),LTH=79,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16 Distr transp 17 Distr kollin 18 ',                  +        
               POS=(22,2),LTH=36,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '19 Distr tid  20  ',                                   +        
               POS=(22,39),LTH=18,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,58),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2374  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4I51501 MSG   TYPE=INPUT,                                             +        
               SOR=(W4F515),                                           +        
               OPT=2,                                                  +        
               NXT=W4O51501                                                     
MID      LPAGE SOR=(W4F515)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  ' ',                                                    +        
               LTH=2                                                            
         MFLD  '45151',                                                +        
               LTH=5                                                            
         MFLD  (DGIA0156,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0157,                                               +        
               LTH=4                                                            
         MFLD  (DGIA0164,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0165,                                               +        
               LTH=6                                                            
         MFLD  (DGIA0154,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  DGIA0155,                                               +        
               LTH=2                                                            
         MFLD  (DGIA0160,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0161,                                               +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0158,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  DGIA0159,                                               +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0172,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  DGIA0173,                                               +        
               LTH=1                                                            
         MFLD  (IDBILD1,                                               +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  DGIA0084,                                               +        
               LTH=6                                                            
         MFLD  DGIA0098,                                               +        
               LTH=7                                                            
         MFLD  (IDBILD2,                                               +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  DGIA0085,                                               +        
               LTH=6                                                            
         MFLD  DGIA0099,                                               +        
               LTH=7                                                            
         MFLD  (IDBILD3,                                               +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  DGIA0086,                                               +        
               LTH=6                                                            
         MFLD  DGIA0100,                                               +        
               LTH=7                                                            
         MFLD  (IDBILD4,                                               +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  DGIA0087,                                               +        
               LTH=6                                                            
         MFLD  DGIA0101,                                               +        
               LTH=7                                                            
         MFLD  (IDBILD5,                                               +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  DGIA0088,                                               +        
               LTH=6                                                            
         MFLD  DGIA0102,                                               +        
               LTH=7                                                            
         MFLD  (IDBILD6,                                               +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  DGIA0089,                                               +        
               LTH=6                                                            
         MFLD  DGIA0103,                                               +        
               LTH=7                                                            
         MFLD  (IDBILD7,                                               +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  DGIA0090,                                               +        
               LTH=6                                                            
         MFLD  DGIA0104,                                               +        
               LTH=7                                                            
         MFLD  (IDBILD8,                                               +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  DGIA0091,                                               +        
               LTH=6                                                            
         MFLD  DGIA0105,                                               +        
               LTH=7                                                            
         MFLD  (IDBILD9,                                               +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  DGIA0092,                                               +        
               LTH=6                                                            
         MFLD  DGIA0106,                                               +        
               LTH=7                                                            
         MFLD  (IDBILD10,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  DGIA0093,                                               +        
               LTH=6                                                            
         MFLD  DGIA0107,                                               +        
               LTH=7                                                            
         MFLD  (IDBILD11,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  DGIA0094,                                               +        
               LTH=6                                                            
         MFLD  DGIA0108,                                               +        
               LTH=7                                                            
         MFLD  (IDBILD12,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  DGIA0095,                                               +        
               LTH=6                                                            
         MFLD  DGIA0109,                                               +        
               LTH=7                                                            
         MFLD  (IDBILD13,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  DGIA0096,                                               +        
               LTH=6                                                            
         MFLD  DGIA0110,                                               +        
               LTH=7                                                            
         MFLD  (IDBILD14,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  DGIA0097,                                               +        
               LTH=6                                                            
         MFLD  DGIA0111,                                               +        
               LTH=7                                                            
         MSGEND                                                                 
W4O51501 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4F515,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I51501,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W4F515                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  DGIA0156,                                               +        
               LTH=2                                                            
         MFLD  DGIA0157,                                               +        
               LTH=4                                                            
         MFLD  DGIA0164,                                               +        
               LTH=2                                                            
         MFLD  DGIA0165,                                               +        
               LTH=6                                                            
         MFLD  DGIA0154,                                               +        
               LTH=2                                                            
         MFLD  DGIA0155,                                               +        
               LTH=2                                                            
         MFLD  DGIA0160,                                               +        
               LTH=1                                                            
         MFLD  DGIA0161,                                               +        
               LTH=1                                                            
         MFLD  DGIA0158,                                               +        
               LTH=2                                                            
         MFLD  DGIA0159,                                               +        
               LTH=2                                                            
         MFLD  DGIA0172,                                               +        
               LTH=1                                                            
         MFLD  DGIA0173,                                               +        
               LTH=1                                                            
         MFLD  IDBILD1,                                                +        
               LTH=4                                                            
         MFLD  IDBILD2,                                                +        
               LTH=4                                                            
         MFLD  IDBILD3,                                                +        
               LTH=4                                                            
         MFLD  IDBILD4,                                                +        
               LTH=4                                                            
         MFLD  IDBILD5,                                                +        
               LTH=4                                                            
         MFLD  IDBILD6,                                                +        
               LTH=4                                                            
         MFLD  IDBILD7,                                                +        
               LTH=4                                                            
         MFLD  IDBILD8,                                                +        
               LTH=4                                                            
         MFLD  IDBILD9,                                                +        
               LTH=4                                                            
         MFLD  IDBILD10,                                               +        
               LTH=4                                                            
         MFLD  IDBILD11,                                               +        
               LTH=4                                                            
         MFLD  IDBILD12,                                               +        
               LTH=4                                                            
         MFLD  IDBILD13,                                               +        
               LTH=4                                                            
         MFLD  IDBILD14,                                               +        
               LTH=4                                                            
         MFLD  DGIA0084,                                               +        
               LTH=6                                                            
         MFLD  DGIA0085,                                               +        
               LTH=6                                                            
         MFLD  DGIA0086,                                               +        
               LTH=6                                                            
         MFLD  DGIA0087,                                               +        
               LTH=6                                                            
         MFLD  DGIA0088,                                               +        
               LTH=6                                                            
         MFLD  DGIA0089,                                               +        
               LTH=6                                                            
         MFLD  DGIA0090,                                               +        
               LTH=6                                                            
         MFLD  DGIA0091,                                               +        
               LTH=6                                                            
         MFLD  DGIA0092,                                               +        
               LTH=6                                                            
         MFLD  DGIA0093,                                               +        
               LTH=6                                                            
         MFLD  DGIA0094,                                               +        
               LTH=6                                                            
         MFLD  DGIA0095,                                               +        
               LTH=6                                                            
         MFLD  DGIA0096,                                               +        
               LTH=6                                                            
         MFLD  DGIA0097,                                               +        
               LTH=6                                                            
         MFLD  DGIA0098,                                               +        
               LTH=7                                                            
         MFLD  DGIA0099,                                               +        
               LTH=7                                                            
         MFLD  DGIA0100,                                               +        
               LTH=7                                                            
         MFLD  DGIA0101,                                               +        
               LTH=7                                                            
         MFLD  DGIA0102,                                               +        
               LTH=7                                                            
         MFLD  DGIA0103,                                               +        
               LTH=7                                                            
         MFLD  DGIA0104,                                               +        
               LTH=7                                                            
         MFLD  DGIA0105,                                               +        
               LTH=7                                                            
         MFLD  DGIA0106,                                               +        
               LTH=7                                                            
         MFLD  DGIA0107,                                               +        
               LTH=7                                                            
         MFLD  DGIA0108,                                               +        
               LTH=7                                                            
         MFLD  DGIA0109,                                               +        
               LTH=7                                                            
         MFLD  DGIA0110,                                               +        
               LTH=7                                                            
         MFLD  DGIA0111,                                               +        
               LTH=7                                                            
         MFLD  DGIA0000,                                               +        
               LTH=2                                                            
         MFLD  DGIA0001,                                               +        
               LTH=2                                                            
         MFLD  DGIA0002,                                               +        
               LTH=2                                                            
         MFLD  DGIA0003,                                               +        
               LTH=2                                                            
         MFLD  DGIA0004,                                               +        
               LTH=2                                                            
         MFLD  DGIA0005,                                               +        
               LTH=2                                                            
         MFLD  DGIA0006,                                               +        
               LTH=2                                                            
         MFLD  DGIA0007,                                               +        
               LTH=2                                                            
         MFLD  DGIA0008,                                               +        
               LTH=2                                                            
         MFLD  DGIA0009,                                               +        
               LTH=2                                                            
         MFLD  DGIA0010,                                               +        
               LTH=2                                                            
         MFLD  DGIA0011,                                               +        
               LTH=2                                                            
         MFLD  DGIA0012,                                               +        
               LTH=2                                                            
         MFLD  DGIA0013,                                               +        
               LTH=2                                                            
         MFLD  DGIA0014,                                               +        
               LTH=2                                                            
         MFLD  DGIA0015,                                               +        
               LTH=2                                                            
         MFLD  DGIA0016,                                               +        
               LTH=2                                                            
         MFLD  DGIA0017,                                               +        
               LTH=2                                                            
         MFLD  DGIA0018,                                               +        
               LTH=2                                                            
         MFLD  DGIA0019,                                               +        
               LTH=2                                                            
         MFLD  DGIA0020,                                               +        
               LTH=2                                                            
         MFLD  DGIA0021,                                               +        
               LTH=2                                                            
         MFLD  DGIA0022,                                               +        
               LTH=2                                                            
         MFLD  DGIA0023,                                               +        
               LTH=2                                                            
         MFLD  DGIA0024,                                               +        
               LTH=2                                                            
         MFLD  DGIA0025,                                               +        
               LTH=2                                                            
         MFLD  DGIA0026,                                               +        
               LTH=2                                                            
         MFLD  DGIA0027,                                               +        
               LTH=2                                                            
         MFLD  DGIA0028,                                               +        
               LTH=1                                                            
         MFLD  DGIA0029,                                               +        
               LTH=1                                                            
         MFLD  DGIA0030,                                               +        
               LTH=1                                                            
         MFLD  DGIA0031,                                               +        
               LTH=1                                                            
         MFLD  DGIA0032,                                               +        
               LTH=1                                                            
         MFLD  DGIA0033,                                               +        
               LTH=1                                                            
         MFLD  DGIA0034,                                               +        
               LTH=1                                                            
         MFLD  DGIA0035,                                               +        
               LTH=1                                                            
         MFLD  DGIA0036,                                               +        
               LTH=1                                                            
         MFLD  DGIA0037,                                               +        
               LTH=1                                                            
         MFLD  DGIA0038,                                               +        
               LTH=1                                                            
         MFLD  DGIA0039,                                               +        
               LTH=1                                                            
         MFLD  DGIA0040,                                               +        
               LTH=1                                                            
         MFLD  DGIA0041,                                               +        
               LTH=1                                                            
         MFLD  DGIA0112,                                               +        
               LTH=2                                                            
         MFLD  DGIA0113,                                               +        
               LTH=2                                                            
         MFLD  DGIA0114,                                               +        
               LTH=2                                                            
         MFLD  DGIA0115,                                               +        
               LTH=2                                                            
         MFLD  DGIA0116,                                               +        
               LTH=2                                                            
         MFLD  DGIA0117,                                               +        
               LTH=2                                                            
         MFLD  DGIA0118,                                               +        
               LTH=2                                                            
         MFLD  DGIA0119,                                               +        
               LTH=2                                                            
         MFLD  DGIA0120,                                               +        
               LTH=2                                                            
         MFLD  DGIA0121,                                               +        
               LTH=2                                                            
         MFLD  DGIA0122,                                               +        
               LTH=2                                                            
         MFLD  DGIA0123,                                               +        
               LTH=2                                                            
         MFLD  DGIA0124,                                               +        
               LTH=2                                                            
         MFLD  DGIA0125,                                               +        
               LTH=2                                                            
         MFLD  DGIA0070,                                               +        
               LTH=4                                                            
         MFLD  DGIA0071,                                               +        
               LTH=4                                                            
         MFLD  DGIA0072,                                               +        
               LTH=4                                                            
         MFLD  DGIA0073,                                               +        
               LTH=4                                                            
         MFLD  DGIA0074,                                               +        
               LTH=4                                                            
         MFLD  DGIA0075,                                               +        
               LTH=4                                                            
         MFLD  DGIA0076,                                               +        
               LTH=4                                                            
         MFLD  DGIA0077,                                               +        
               LTH=4                                                            
         MFLD  DGIA0078,                                               +        
               LTH=4                                                            
         MFLD  DGIA0079,                                               +        
               LTH=4                                                            
         MFLD  DGIA0080,                                               +        
               LTH=4                                                            
         MFLD  DGIA0081,                                               +        
               LTH=4                                                            
         MFLD  DGIA0082,                                               +        
               LTH=4                                                            
         MFLD  DGIA0083,                                               +        
               LTH=4                                                            
         MFLD  DGIA0042,                                               +        
               LTH=4                                                            
         MFLD  DGIA0043,                                               +        
               LTH=4                                                            
         MFLD  DGIA0044,                                               +        
               LTH=4                                                            
         MFLD  DGIA0045,                                               +        
               LTH=4                                                            
         MFLD  DGIA0046,                                               +        
               LTH=4                                                            
         MFLD  DGIA0047,                                               +        
               LTH=4                                                            
         MFLD  DGIA0048,                                               +        
               LTH=4                                                            
         MFLD  DGIA0049,                                               +        
               LTH=4                                                            
         MFLD  DGIA0050,                                               +        
               LTH=4                                                            
         MFLD  DGIA0051,                                               +        
               LTH=4                                                            
         MFLD  DGIA0052,                                               +        
               LTH=4                                                            
         MFLD  DGIA0053,                                               +        
               LTH=4                                                            
         MFLD  DGIA0054,                                               +        
               LTH=4                                                            
         MFLD  DGIA0055,                                               +        
               LTH=4                                                            
         MFLD  DGIA0056,                                               +        
               LTH=4                                                            
         MFLD  DGIA0057,                                               +        
               LTH=4                                                            
         MFLD  DGIA0058,                                               +        
               LTH=4                                                            
         MFLD  DGIA0059,                                               +        
               LTH=4                                                            
         MFLD  DGIA0060,                                               +        
               LTH=4                                                            
         MFLD  DGIA0061,                                               +        
               LTH=4                                                            
         MFLD  DGIA0062,                                               +        
               LTH=4                                                            
         MFLD  DGIA0063,                                               +        
               LTH=4                                                            
         MFLD  DGIA0064,                                               +        
               LTH=4                                                            
         MFLD  DGIA0065,                                               +        
               LTH=4                                                            
         MFLD  DGIA0066,                                               +        
               LTH=4                                                            
         MFLD  DGIA0067,                                               +        
               LTH=4                                                            
         MFLD  DGIA0068,                                               +        
               LTH=4                                                            
         MFLD  DGIA0069,                                               +        
               LTH=4                                                            
         MFLD  DGIA0126,                                               +        
               LTH=8                                                            
         MFLD  DGIA0127,                                               +        
               LTH=8                                                            
         MFLD  DGIA0128,                                               +        
               LTH=8                                                            
         MFLD  DGIA0129,                                               +        
               LTH=8                                                            
         MFLD  DGIA0130,                                               +        
               LTH=8                                                            
         MFLD  DGIA0131,                                               +        
               LTH=8                                                            
         MFLD  DGIA0132,                                               +        
               LTH=8                                                            
         MFLD  DGIA0133,                                               +        
               LTH=8                                                            
         MFLD  DGIA0134,                                               +        
               LTH=8                                                            
         MFLD  DGIA0135,                                               +        
               LTH=8                                                            
         MFLD  DGIA0136,                                               +        
               LTH=8                                                            
         MFLD  DGIA0137,                                               +        
               LTH=8                                                            
         MFLD  DGIA0138,                                               +        
               LTH=8                                                            
         MFLD  DGIA0139,                                               +        
               LTH=8                                                            
         MFLD  DGIA0140,                                               +        
               LTH=8                                                            
         MFLD  DGIA0141,                                               +        
               LTH=8                                                            
         MFLD  DGIA0142,                                               +        
               LTH=8                                                            
         MFLD  DGIA0143,                                               +        
               LTH=8                                                            
         MFLD  DGIA0144,                                               +        
               LTH=8                                                            
         MFLD  DGIA0145,                                               +        
               LTH=8                                                            
         MFLD  DGIA0146,                                               +        
               LTH=8                                                            
         MFLD  DGIA0147,                                               +        
               LTH=8                                                            
         MFLD  DGIA0148,                                               +        
               LTH=8                                                            
         MFLD  DGIA0149,                                               +        
               LTH=8                                                            
         MFLD  DGIA0150,                                               +        
               LTH=8                                                            
         MFLD  DGIA0151,                                               +        
               LTH=8                                                            
         MFLD  DGIA0152,                                               +        
               LTH=8                                                            
         MFLD  DGIA0153,                                               +        
               LTH=8                                                            
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2374,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
