***********************************************************************         
* CREATED BY PCC4448   ON 95/03/08  AT 09:21                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE '                                '                               
W4F534   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W4T531  ',                                           +        
               2='W4T532  ',                                           +        
               3='W4T533  ',                                           +        
               4='W4T534  ',                                           +        
               5='W4T535  ',                                           +        
               6='W4T536  ',                                           +        
               7='W4T537  ',                                           +        
               8='W4T538  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T531  ',                                          +        
               14='W4T532  ',                                          +        
               15='W4T533  ',                                          +        
               16='W4T534  ',                                          +        
               17='W4T535  ',                                          +        
               18='W4T536  ',                                          +        
               19='W4T537  ',                                          +        
               20='W4T538  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((2,11)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'LASTNINGSRELEASE ÅTERSTART',                           +        
               POS=(1,11),LTH=26,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Distrikt',                                             +        
               POS=(2,2),LTH=8,                                        +        
               ATTR=(NUM,PROT)                                                  
FLD0211  DFLD  POS=(2,11),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Kundnr',                                               +        
               POS=(2,17),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0224  DFLD  POS=(2,24),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Fk',                                                   +        
               POS=(2,32),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FLD0235  DFLD  POS=(2,35),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Skeppnr',                                              +        
               POS=(2,39),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FLD0247  DFLD  POS=(2,47),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DC',                                                   +        
               POS=(2,56),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDDCIN   DFLD  POS=(2,59),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
FLD0311  DFLD  POS=(3,11),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0324  DFLD  POS=(3,24),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0335  DFLD  POS=(3,35),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0347  DFLD  POS=(3,47),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
IDDCUT   DFLD  POS=(3,59),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'För lastning',                                         +        
               POS=(5,11),LTH=12,                                      +        
               ATTR=(PROT)                                                      
FLD0524  DFLD  POS=(5,24),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'har tidigare valts:',                                  +        
               POS=(5,32),LTH=19,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Antal kolli',                                          +        
               POS=(7,11),LTH=11,                                      +        
               ATTR=(PROT)                                                      
FLD0728  DFLD  POS=(7,28),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Brutto kg',                                            +        
               POS=(8,11),LTH=9,                                       +        
               ATTR=(PROT)                                                      
FLD0826  DFLD  POS=(8,24),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Brutto m3',                                            +        
               POS=(9,11),LTH=9,                                       +        
               ATTR=(PROT)                                                      
FLD0928  DFLD  POS=(9,24),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'I lastningen ingår även distrikt:',                    +        
               POS=(11,11),LTH=33,                                     +        
               ATTR=(PROT)                                                      
FLD1145  DFLD  POS=(11,45),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD1150  DFLD  POS=(11,50),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1155  DFLD  POS=(11,55),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1160  DFLD  POS=(11,60),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1165  DFLD  POS=(11,65),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1170  DFLD  POS=(11,70),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1175  DFLD  POS=(11,75),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1245  DFLD  POS=(12,45),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD1250  DFLD  POS=(12,50),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1255  DFLD  POS=(12,55),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1260  DFLD  POS=(12,60),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1265  DFLD  POS=(12,65),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1270  DFLD  POS=(12,70),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1275  DFLD  POS=(12,75),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1345  DFLD  POS=(13,45),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD1350  DFLD  POS=(13,50),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1355  DFLD  POS=(13,55),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1360  DFLD  POS=(13,60),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1365  DFLD  POS=(13,65),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1370  DFLD  POS=(13,70),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1375  DFLD  POS=(13,75),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1445  DFLD  POS=(14,45),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD1450  DFLD  POS=(14,50),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1455  DFLD  POS=(14,55),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1460  DFLD  POS=(14,60),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1465  DFLD  POS=(14,65),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1470  DFLD  POS=(14,70),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1475  DFLD  POS=(14,75),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Skriv  JA = backa tillbaka   ===>',                    +        
               POS=(17,11),LTH=33,                                     +        
               ATTR=(PROT)                                                      
FLD1745  DFLD  POS=(17,45),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  '1 Fråga p kli   2 Cross p kli   3 Last-rel',           +        
               POS=(21,2),LTH=42,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '4 Å-st last-rel 5 Fakt-rel',                           +        
               POS=(21,50),LTH=26,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '6 Å-st fakt-rel 7 Fr.kost komp  8 Tull-id val   9',    +        
               POS=(22,2),LTH=49,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4O53401 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4F534,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I53401,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  FLD0211,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0311,                                                +        
               LTH=4                                                            
         MFLD  FLD0224,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0324,                                                +        
               LTH=6                                                            
         MFLD  FLD0235,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0335,                                                +        
               LTH=2                                                            
         MFLD  FLD0247,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0347,                                                +        
               LTH=7                                                            
         MFLD  IDDCIN,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  FLD0524,                                                +        
               LTH=7                                                            
         MFLD  FLD0728,                                                +        
               LTH=4                                                            
         MFLD  FLD0826,                                                +        
               LTH=8                                                            
         MFLD  FLD0928,                                                +        
               LTH=8                                                            
         MFLD  FLD1145,                                                +        
               LTH=4                                                            
         MFLD  FLD1150,                                                +        
               LTH=4                                                            
         MFLD  FLD1155,                                                +        
               LTH=4                                                            
         MFLD  FLD1160,                                                +        
               LTH=4                                                            
         MFLD  FLD1165,                                                +        
               LTH=4                                                            
         MFLD  FLD1170,                                                +        
               LTH=4                                                            
         MFLD  FLD1175,                                                +        
               LTH=4                                                            
         MFLD  FLD1245,                                                +        
               LTH=4                                                            
         MFLD  FLD1250,                                                +        
               LTH=4                                                            
         MFLD  FLD1255,                                                +        
               LTH=4                                                            
         MFLD  FLD1260,                                                +        
               LTH=4                                                            
         MFLD  FLD1265,                                                +        
               LTH=4                                                            
         MFLD  FLD1270,                                                +        
               LTH=4                                                            
         MFLD  FLD1275,                                                +        
               LTH=4                                                            
         MFLD  FLD1345,                                                +        
               LTH=4                                                            
         MFLD  FLD1350,                                                +        
               LTH=4                                                            
         MFLD  FLD1355,                                                +        
               LTH=4                                                            
         MFLD  FLD1360,                                                +        
               LTH=4                                                            
         MFLD  FLD1365,                                                +        
               LTH=4                                                            
         MFLD  FLD1370,                                                +        
               LTH=4                                                            
         MFLD  FLD1375,                                                +        
               LTH=4                                                            
         MFLD  FLD1445,                                                +        
               LTH=4                                                            
         MFLD  FLD1450,                                                +        
               LTH=4                                                            
         MFLD  FLD1455,                                                +        
               LTH=4                                                            
         MFLD  FLD1460,                                                +        
               LTH=4                                                            
         MFLD  FLD1465,                                                +        
               LTH=4                                                            
         MFLD  FLD1470,                                                +        
               LTH=4                                                            
         MFLD  FLD1475,                                                +        
               LTH=4                                                            
         MFLD  FLD1745,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I53401 MSG   TYPE=INPUT,                                             +        
               SOR=(W4F534),                                           +        
               OPT=2,                                                  +        
               NXT=W4O53401                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '45341',                                                +        
               LTH=5                                                            
         MFLD  (FLD0211,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0311,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0224,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0324,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0235,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0335,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0247,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0347,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (IDDCIN,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDDCUT,                                                 +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  '4534',                                                 +        
               LTH=4                                                            
         MFLD  FLD0524,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD1745,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
