***********************************************************************         
* CREATED BY PC35324   ON 97/05/13  AT 10:09                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'TRANSPORT INFO - BILL OF LADING '                               
W4F668   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W4T662  ',                                           +        
               3='W4T663  ',                                           +        
               4='W4T664  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W4T668 7',                                           +        
               8='W4T668 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T668U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T661  ',                                          +        
               14='W4T662  ',                                          +        
               15='W4T663  ',                                          +        
               16='W4T664  ',                                          +        
               17='W4T666  ',                                          +        
               18='W4T667  ',                                          +        
               19='W4T668  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W4F668   DPAGE CURSOR=((2,8)),                                         +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'TRANSPORT INFORMATION - NDC',                          +        
               POS=(1,11),LTH=27,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Datum',                                                +        
               POS=(2,2),LTH=5,                                        +        
               ATTR=(NUM,PROT)                                                  
DGIA0000 DFLD  POS=(2,8),LTH=6,                                        +        
               ATTR=(NUM,NOPROT)                                                
DGIA0001 DFLD  POS=(3,8),LTH=6,                                        +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'S  Transp  Lastbärare  ',                              +        
               POS=(5,3),LTH=23,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'S  Transp  Lastbärare  ',                              +        
               POS=(5,29),LTH=23,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'S  Transp  Lastbärare  ',                              +        
               POS=(5,55),LTH=23,                                      +        
               ATTR=(PROT)                                                      
SELECT1  DFLD  POS=(6,3),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDTRPNR1 DFLD  POS=(6,07),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
IDLBBET1 DFLD  POS=(6,14),LTH=12,                                      +        
               ATTR=(PROT,MOD)                                                  
SEL15    DFLD  POS=(6,29),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDTRP15  DFLD  POS=(6,33),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
IDLBB15  DFLD  POS=(6,40),LTH=12,                                      +        
               ATTR=(PROT,MOD)                                                  
SEL29    DFLD  POS=(6,55),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDTRP29  DFLD  POS=(6,59),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
IDLBB29  DFLD  POS=(6,66),LTH=12,                                      +        
               ATTR=(PROT,MOD)                                                  
SELECT2  DFLD  POS=(7,3),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDTRPNR2 DFLD  POS=(7,07),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
IDLBBET2 DFLD  POS=(7,14),LTH=12,                                      +        
               ATTR=(PROT,MOD)                                                  
SEL16    DFLD  POS=(7,29),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDTRP16  DFLD  POS=(7,33),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
IDLBB16  DFLD  POS=(7,40),LTH=12,                                      +        
               ATTR=(PROT,MOD)                                                  
SEL30    DFLD  POS=(7,55),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDTRP30  DFLD  POS=(7,59),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
IDLBB30  DFLD  POS=(7,66),LTH=12,                                      +        
               ATTR=(PROT,MOD)                                                  
SELECT3  DFLD  POS=(8,3),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDTRPNR3 DFLD  POS=(8,07),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
IDLBBET3 DFLD  POS=(8,14),LTH=12,                                      +        
               ATTR=(PROT,MOD)                                                  
SEL17    DFLD  POS=(8,29),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDTRP17  DFLD  POS=(8,33),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
IDLBB17  DFLD  POS=(8,40),LTH=12,                                      +        
               ATTR=(PROT,MOD)                                                  
SEL31    DFLD  POS=(8,55),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDTRP31  DFLD  POS=(8,59),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
IDLBB31  DFLD  POS=(8,66),LTH=12,                                      +        
               ATTR=(PROT,MOD)                                                  
SELECT4  DFLD  POS=(9,3),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDTRPNR4 DFLD  POS=(9,07),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
IDLBBET4 DFLD  POS=(9,14),LTH=12,                                      +        
               ATTR=(PROT,MOD)                                                  
SEL18    DFLD  POS=(9,29),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDTRP18  DFLD  POS=(9,33),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
IDLBB18  DFLD  POS=(9,40),LTH=12,                                      +        
               ATTR=(PROT,MOD)                                                  
SEL32    DFLD  POS=(9,55),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDTRP32  DFLD  POS=(9,59),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
IDLBB32  DFLD  POS=(9,66),LTH=12,                                      +        
               ATTR=(PROT,MOD)                                                  
SELECT5  DFLD  POS=(10,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDTRPNR5 DFLD  POS=(10,07),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
IDLBBET5 DFLD  POS=(10,14),LTH=12,                                     +        
               ATTR=(PROT,MOD)                                                  
SEL19    DFLD  POS=(10,29),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
IDTRP19  DFLD  POS=(10,33),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
IDLBB19  DFLD  POS=(10,40),LTH=12,                                     +        
               ATTR=(PROT,MOD)                                                  
SEL33    DFLD  POS=(10,55),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
IDTRP33  DFLD  POS=(10,59),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
IDLBB33  DFLD  POS=(10,66),LTH=12,                                     +        
               ATTR=(PROT,MOD)                                                  
SELECT6  DFLD  POS=(11,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDTRPNR6 DFLD  POS=(11,07),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
IDLBBET6 DFLD  POS=(11,14),LTH=12,                                     +        
               ATTR=(PROT,MOD)                                                  
SEL20    DFLD  POS=(11,29),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
IDTRP20  DFLD  POS=(11,33),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
IDLBB20  DFLD  POS=(11,40),LTH=12,                                     +        
               ATTR=(PROT,MOD)                                                  
SEL34    DFLD  POS=(11,55),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
IDTRP34  DFLD  POS=(11,59),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
IDLBB34  DFLD  POS=(11,66),LTH=12,                                     +        
               ATTR=(PROT,MOD)                                                  
SELECT7  DFLD  POS=(12,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDTRPNR7 DFLD  POS=(12,07),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
IDLBBET7 DFLD  POS=(12,14),LTH=12,                                     +        
               ATTR=(PROT,MOD)                                                  
SEL21    DFLD  POS=(12,29),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
IDTRP21  DFLD  POS=(12,33),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
IDLBB21  DFLD  POS=(12,40),LTH=12,                                     +        
               ATTR=(PROT,MOD)                                                  
SEL35    DFLD  POS=(12,55),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
IDTRP35  DFLD  POS=(12,59),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
IDLBB35  DFLD  POS=(12,66),LTH=12,                                     +        
               ATTR=(PROT,MOD)                                                  
SELECT8  DFLD  POS=(13,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDTRPNR8 DFLD  POS=(13,07),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
IDLBBET8 DFLD  POS=(13,14),LTH=12,                                     +        
               ATTR=(PROT,MOD)                                                  
SEL22    DFLD  POS=(13,29),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
IDTRP22  DFLD  POS=(13,33),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
IDLBB22  DFLD  POS=(13,40),LTH=12,                                     +        
               ATTR=(PROT,MOD)                                                  
SEL36    DFLD  POS=(13,55),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
IDTRP36  DFLD  POS=(13,59),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
IDLBB36  DFLD  POS=(13,66),LTH=12,                                     +        
               ATTR=(PROT,MOD)                                                  
SELECT9  DFLD  POS=(14,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDTRPNR9 DFLD  POS=(14,07),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
IDLBBET9 DFLD  POS=(14,14),LTH=12,                                     +        
               ATTR=(PROT,MOD)                                                  
SEL23    DFLD  POS=(14,29),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
IDTRP23  DFLD  POS=(14,33),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
IDLBB23  DFLD  POS=(14,40),LTH=12,                                     +        
               ATTR=(PROT,MOD)                                                  
SEL37    DFLD  POS=(14,55),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
IDTRP37  DFLD  POS=(14,59),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
IDLBB37  DFLD  POS=(14,66),LTH=12,                                     +        
               ATTR=(PROT,MOD)                                                  
SELECT10 DFLD  POS=(15,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDTRP10  DFLD  POS=(15,07),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
IDLBB10  DFLD  POS=(15,14),LTH=12,                                     +        
               ATTR=(PROT,MOD)                                                  
SEL24    DFLD  POS=(15,29),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
IDTRP24  DFLD  POS=(15,33),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
IDLBB24  DFLD  POS=(15,40),LTH=12,                                     +        
               ATTR=(PROT,MOD)                                                  
SEL38    DFLD  POS=(15,55),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
IDTRP38  DFLD  POS=(15,59),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
IDLBB38  DFLD  POS=(15,66),LTH=12,                                     +        
               ATTR=(PROT,MOD)                                                  
SELECT11 DFLD  POS=(16,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDTRP11  DFLD  POS=(16,07),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
IDLBB11  DFLD  POS=(16,14),LTH=12,                                     +        
               ATTR=(PROT,MOD)                                                  
SEL25    DFLD  POS=(16,29),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
IDTRP25  DFLD  POS=(16,33),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
IDLBB25  DFLD  POS=(16,40),LTH=12,                                     +        
               ATTR=(PROT,MOD)                                                  
SEL39    DFLD  POS=(16,55),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
IDTRP39  DFLD  POS=(16,59),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
IDLBB39  DFLD  POS=(16,66),LTH=12,                                     +        
               ATTR=(PROT,MOD)                                                  
SELECT12 DFLD  POS=(17,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDTRP12  DFLD  POS=(17,07),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
IDLBB12  DFLD  POS=(17,14),LTH=12,                                     +        
               ATTR=(PROT,MOD)                                                  
SEL26    DFLD  POS=(17,29),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
IDTRP26  DFLD  POS=(17,33),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
IDLBB26  DFLD  POS=(17,40),LTH=12,                                     +        
               ATTR=(PROT,MOD)                                                  
SEL40    DFLD  POS=(17,55),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
IDTRP40  DFLD  POS=(17,59),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
IDLBB40  DFLD  POS=(17,66),LTH=12,                                     +        
               ATTR=(PROT,MOD)                                                  
SELECT13 DFLD  POS=(18,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDTRP13  DFLD  POS=(18,07),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
IDLBB13  DFLD  POS=(18,14),LTH=12,                                     +        
               ATTR=(PROT,MOD)                                                  
SEL27    DFLD  POS=(18,29),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
IDTRP27  DFLD  POS=(18,33),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
IDLBB27  DFLD  POS=(18,40),LTH=12,                                     +        
               ATTR=(PROT,MOD)                                                  
SEL41    DFLD  POS=(18,55),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
IDTRP41  DFLD  POS=(18,59),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
IDLBB41  DFLD  POS=(18,66),LTH=12,                                     +        
               ATTR=(PROT,MOD)                                                  
SELECT14 DFLD  POS=(19,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDTRP14  DFLD  POS=(19,07),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
IDLBB14  DFLD  POS=(19,14),LTH=12,                                     +        
               ATTR=(PROT,MOD)                                                  
SEL28    DFLD  POS=(19,29),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
IDTRP28  DFLD  POS=(19,33),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
IDLBB28  DFLD  POS=(19,40),LTH=12,                                     +        
               ATTR=(PROT,MOD)                                                  
SEL42    DFLD  POS=(19,55),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
IDTRP42  DFLD  POS=(19,59),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
IDLBB42  DFLD  POS=(19,66),LTH=12,                                     +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'F7=First        F10=WHELP     F11=Update',             +        
               POS=(22,2),LTH=40,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'F12=Logoff',                                           +        
               POS=(22,47),LTH=10,                                     +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4O66801 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4F668,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I66801,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W4F668,                                             +        
               NXT=W4I66801                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  DGIA0000,                                               +        
               LTH=6                                                            
         MFLD  DGIA0001,                                               +        
               LTH=6                                                            
         MFLD  SELECT1,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTRPNR1,                                               +        
               LTH=3                                                            
         MFLD  IDLBBET1,                                               +        
               LTH=12                                                           
         MFLD  SELECT2,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTRPNR2,                                               +        
               LTH=3                                                            
         MFLD  IDLBBET2,                                               +        
               LTH=12                                                           
         MFLD  SELECT3,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTRPNR3,                                               +        
               LTH=3                                                            
         MFLD  IDLBBET3,                                               +        
               LTH=12                                                           
         MFLD  SELECT4,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTRPNR4,                                               +        
               LTH=3                                                            
         MFLD  IDLBBET4,                                               +        
               LTH=12                                                           
         MFLD  SELECT5,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTRPNR5,                                               +        
               LTH=3                                                            
         MFLD  IDLBBET5,                                               +        
               LTH=12                                                           
         MFLD  SELECT6,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTRPNR6,                                               +        
               LTH=3                                                            
         MFLD  IDLBBET6,                                               +        
               LTH=12                                                           
         MFLD  SELECT7,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTRPNR7,                                               +        
               LTH=3                                                            
         MFLD  IDLBBET7,                                               +        
               LTH=12                                                           
         MFLD  SELECT8,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTRPNR8,                                               +        
               LTH=3                                                            
         MFLD  IDLBBET8,                                               +        
               LTH=12                                                           
         MFLD  SELECT9,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTRPNR9,                                               +        
               LTH=3                                                            
         MFLD  IDLBBET9,                                               +        
               LTH=12                                                           
         MFLD  SELECT10,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTRP10,                                                +        
               LTH=3                                                            
         MFLD  IDLBB10,                                                +        
               LTH=12                                                           
         MFLD  SELECT11,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTRP11,                                                +        
               LTH=3                                                            
         MFLD  IDLBB11,                                                +        
               LTH=12                                                           
         MFLD  SELECT12,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTRP12,                                                +        
               LTH=3                                                            
         MFLD  IDLBB12,                                                +        
               LTH=12                                                           
         MFLD  SELECT13,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTRP13,                                                +        
               LTH=3                                                            
         MFLD  IDLBB13,                                                +        
               LTH=12                                                           
         MFLD  SELECT14,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTRP14,                                                +        
               LTH=3                                                            
         MFLD  IDLBB14,                                                +        
               LTH=12                                                           
         MFLD  SEL15,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTRP15,                                                +        
               LTH=3                                                            
         MFLD  IDLBB15,                                                +        
               LTH=12                                                           
         MFLD  SEL16,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTRP16,                                                +        
               LTH=3                                                            
         MFLD  IDLBB16,                                                +        
               LTH=12                                                           
         MFLD  SEL17,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTRP17,                                                +        
               LTH=3                                                            
         MFLD  IDLBB17,                                                +        
               LTH=12                                                           
         MFLD  SEL18,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTRP18,                                                +        
               LTH=3                                                            
         MFLD  IDLBB18,                                                +        
               LTH=12                                                           
         MFLD  SEL19,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTRP19,                                                +        
               LTH=3                                                            
         MFLD  IDLBB19,                                                +        
               LTH=12                                                           
         MFLD  SEL20,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTRP20,                                                +        
               LTH=3                                                            
         MFLD  IDLBB20,                                                +        
               LTH=12                                                           
         MFLD  SEL21,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTRP21,                                                +        
               LTH=3                                                            
         MFLD  IDLBB21,                                                +        
               LTH=12                                                           
         MFLD  SEL22,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTRP22,                                                +        
               LTH=3                                                            
         MFLD  IDLBB22,                                                +        
               LTH=12                                                           
         MFLD  SEL23,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTRP23,                                                +        
               LTH=3                                                            
         MFLD  IDLBB23,                                                +        
               LTH=12                                                           
         MFLD  SEL24,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTRP24,                                                +        
               LTH=3                                                            
         MFLD  IDLBB24,                                                +        
               LTH=12                                                           
         MFLD  SEL25,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTRP25,                                                +        
               LTH=3                                                            
         MFLD  IDLBB25,                                                +        
               LTH=12                                                           
         MFLD  SEL26,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTRP26,                                                +        
               LTH=3                                                            
         MFLD  IDLBB26,                                                +        
               LTH=12                                                           
         MFLD  SEL27,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTRP27,                                                +        
               LTH=3                                                            
         MFLD  IDLBB27,                                                +        
               LTH=12                                                           
         MFLD  SEL28,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTRP28,                                                +        
               LTH=3                                                            
         MFLD  IDLBB28,                                                +        
               LTH=12                                                           
         MFLD  SEL29,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTRP29,                                                +        
               LTH=3                                                            
         MFLD  IDLBB29,                                                +        
               LTH=12                                                           
         MFLD  SEL30,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTRP30,                                                +        
               LTH=3                                                            
         MFLD  IDLBB30,                                                +        
               LTH=12                                                           
         MFLD  SEL31,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTRP31,                                                +        
               LTH=3                                                            
         MFLD  IDLBB31,                                                +        
               LTH=12                                                           
         MFLD  SEL32,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTRP32,                                                +        
               LTH=3                                                            
         MFLD  IDLBB32,                                                +        
               LTH=12                                                           
         MFLD  SEL33,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTRP33,                                                +        
               LTH=3                                                            
         MFLD  IDLBB33,                                                +        
               LTH=12                                                           
         MFLD  SEL34,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTRP34,                                                +        
               LTH=3                                                            
         MFLD  IDLBB34,                                                +        
               LTH=12                                                           
         MFLD  SEL35,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTRP35,                                                +        
               LTH=3                                                            
         MFLD  IDLBB35,                                                +        
               LTH=12                                                           
         MFLD  SEL36,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTRP36,                                                +        
               LTH=3                                                            
         MFLD  IDLBB36,                                                +        
               LTH=12                                                           
         MFLD  SEL37,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTRP37,                                                +        
               LTH=3                                                            
         MFLD  IDLBB37,                                                +        
               LTH=12                                                           
         MFLD  SEL38,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTRP38,                                                +        
               LTH=3                                                            
         MFLD  IDLBB38,                                                +        
               LTH=12                                                           
         MFLD  SEL39,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTRP39,                                                +        
               LTH=3                                                            
         MFLD  IDLBB39,                                                +        
               LTH=12                                                           
         MFLD  SEL40,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTRP40,                                                +        
               LTH=3                                                            
         MFLD  IDLBB40,                                                +        
               LTH=12                                                           
         MFLD  SEL41,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTRP41,                                                +        
               LTH=3                                                            
         MFLD  IDLBB41,                                                +        
               LTH=12                                                           
         MFLD  SEL42,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTRP42,                                                +        
               LTH=3                                                            
         MFLD  IDLBB42,                                                +        
               LTH=12                                                           
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I66801 MSG   TYPE=INPUT,                                             +        
               SOR=(W4F668),                                           +        
               OPT=2,                                                  +        
               NXT=W4O66801                                                     
MID      LPAGE SOR=(W4F668),                                           +        
               NXT=W4O66801                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F8'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '46681',                                                +        
               LTH=5                                                            
         MFLD  (DGIA0000,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0001,                                               +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (SELECT1,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDTRPNR1,                                               +        
               LTH=3                                                            
         MFLD  IDLBBET1,                                               +        
               LTH=12                                                           
         MFLD  (SELECT2,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDTRPNR2,                                               +        
               LTH=3                                                            
         MFLD  IDLBBET2,                                               +        
               LTH=12                                                           
         MFLD  (SELECT3,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDTRPNR3,                                               +        
               LTH=3                                                            
         MFLD  IDLBBET3,                                               +        
               LTH=12                                                           
         MFLD  (SELECT4,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDTRPNR4,                                               +        
               LTH=3                                                            
         MFLD  IDLBBET4,                                               +        
               LTH=12                                                           
         MFLD  (SELECT5,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDTRPNR5,                                               +        
               LTH=3                                                            
         MFLD  IDLBBET5,                                               +        
               LTH=12                                                           
         MFLD  (SELECT6,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDTRPNR6,                                               +        
               LTH=3                                                            
         MFLD  IDLBBET6,                                               +        
               LTH=12                                                           
         MFLD  (SELECT7,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDTRPNR7,                                               +        
               LTH=3                                                            
         MFLD  IDLBBET7,                                               +        
               LTH=12                                                           
         MFLD  (SELECT8,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDTRPNR8,                                               +        
               LTH=3                                                            
         MFLD  IDLBBET8,                                               +        
               LTH=12                                                           
         MFLD  (SELECT9,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDTRPNR9,                                               +        
               LTH=3                                                            
         MFLD  IDLBBET9,                                               +        
               LTH=12                                                           
         MFLD  (SELECT10,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDTRP10,                                                +        
               LTH=3                                                            
         MFLD  IDLBB10,                                                +        
               LTH=12                                                           
         MFLD  (SELECT11,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDTRP11,                                                +        
               LTH=3                                                            
         MFLD  IDLBB11,                                                +        
               LTH=12                                                           
         MFLD  (SELECT12,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDTRP12,                                                +        
               LTH=3                                                            
         MFLD  IDLBB12,                                                +        
               LTH=12                                                           
         MFLD  (SELECT13,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDTRP13,                                                +        
               LTH=3                                                            
         MFLD  IDLBB13,                                                +        
               LTH=12                                                           
         MFLD  (SELECT14,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDTRP14,                                                +        
               LTH=3                                                            
         MFLD  IDLBB14,                                                +        
               LTH=12                                                           
         MFLD  (SEL15,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDTRP15,                                                +        
               LTH=3                                                            
         MFLD  IDLBB15,                                                +        
               LTH=12                                                           
         MFLD  (SEL16,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDTRP16,                                                +        
               LTH=3                                                            
         MFLD  IDLBB16,                                                +        
               LTH=12                                                           
         MFLD  (SEL17,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDTRP17,                                                +        
               LTH=3                                                            
         MFLD  IDLBB17,                                                +        
               LTH=12                                                           
         MFLD  (SEL18,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDTRP18,                                                +        
               LTH=3                                                            
         MFLD  IDLBB18,                                                +        
               LTH=12                                                           
         MFLD  (SEL19,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDTRP19,                                                +        
               LTH=3                                                            
         MFLD  IDLBB19,                                                +        
               LTH=12                                                           
         MFLD  (SEL20,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDTRP20,                                                +        
               LTH=3                                                            
         MFLD  IDLBB20,                                                +        
               LTH=12                                                           
         MFLD  (SEL21,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDTRP21,                                                +        
               LTH=3                                                            
         MFLD  IDLBB21,                                                +        
               LTH=12                                                           
         MFLD  (SEL22,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDTRP22,                                                +        
               LTH=3                                                            
         MFLD  IDLBB22,                                                +        
               LTH=12                                                           
         MFLD  (SEL23,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDTRP23,                                                +        
               LTH=3                                                            
         MFLD  IDLBB23,                                                +        
               LTH=12                                                           
         MFLD  (SEL24,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDTRP24,                                                +        
               LTH=3                                                            
         MFLD  IDLBB24,                                                +        
               LTH=12                                                           
         MFLD  (SEL25,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDTRP25,                                                +        
               LTH=3                                                            
         MFLD  IDLBB25,                                                +        
               LTH=12                                                           
         MFLD  (SEL26,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDTRP26,                                                +        
               LTH=3                                                            
         MFLD  IDLBB26,                                                +        
               LTH=12                                                           
         MFLD  (SEL27,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDTRP27,                                                +        
               LTH=3                                                            
         MFLD  IDLBB27,                                                +        
               LTH=12                                                           
         MFLD  (SEL28,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDTRP28,                                                +        
               LTH=3                                                            
         MFLD  IDLBB28,                                                +        
               LTH=12                                                           
         MFLD  (SEL29,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDTRP29,                                                +        
               LTH=3                                                            
         MFLD  IDLBB29,                                                +        
               LTH=12                                                           
         MFLD  (SEL30,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDTRP30,                                                +        
               LTH=3                                                            
         MFLD  IDLBB30,                                                +        
               LTH=12                                                           
         MFLD  (SEL31,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDTRP31,                                                +        
               LTH=3                                                            
         MFLD  IDLBB31,                                                +        
               LTH=12                                                           
         MFLD  (SEL32,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDTRP32,                                                +        
               LTH=3                                                            
         MFLD  IDLBB32,                                                +        
               LTH=12                                                           
         MFLD  (SEL33,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDTRP33,                                                +        
               LTH=3                                                            
         MFLD  IDLBB33,                                                +        
               LTH=12                                                           
         MFLD  (SEL34,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDTRP34,                                                +        
               LTH=3                                                            
         MFLD  IDLBB34,                                                +        
               LTH=12                                                           
         MFLD  (SEL35,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDTRP35,                                                +        
               LTH=3                                                            
         MFLD  IDLBB35,                                                +        
               LTH=12                                                           
         MFLD  (SEL36,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDTRP36,                                                +        
               LTH=3                                                            
         MFLD  IDLBB36,                                                +        
               LTH=12                                                           
         MFLD  (SEL37,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDTRP37,                                                +        
               LTH=3                                                            
         MFLD  IDLBB37,                                                +        
               LTH=12                                                           
         MFLD  (SEL38,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDTRP38,                                                +        
               LTH=3                                                            
         MFLD  IDLBB38,                                                +        
               LTH=12                                                           
         MFLD  (SEL39,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDTRP39,                                                +        
               LTH=3                                                            
         MFLD  IDLBB39,                                                +        
               LTH=12                                                           
         MFLD  (SEL40,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDTRP40,                                                +        
               LTH=3                                                            
         MFLD  IDLBB40,                                                +        
               LTH=12                                                           
         MFLD  (SEL41,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDTRP41,                                                +        
               LTH=3                                                            
         MFLD  IDLBB41,                                                +        
               LTH=12                                                           
         MFLD  (SEL42,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDTRP42,                                                +        
               LTH=3                                                            
         MFLD  IDLBB42,                                                +        
               LTH=12                                                           
         MSGEND                                                                 
         END                                                                    
