*          DATA SET W4F651FII0 AT LEVEL 003 AS OF 87/09/04                      
*                                                                               
         PRINT NOGEN                                                            
W4F651   FMT                                                                    
         DEV   TYPE=(3270,2),                                          *        
               FEAT=IGNORE,                                            *        
               PFK=(FLDPFK,'W0T501  ','W0T501  ','W0T501  ','W0T501  ',*        
               'W0T501  ','W0T501  ','W4T651 7','W4T651 8','W0T501  ', *        
               'WHELP   ','W4T651U ','/RCL.   ','W4T651  ','W4T652  ', *        
               'W0T501  ','W0T501  ','W0T501  ','W0T501  ','W0T501  ', *        
               'W0T501  ','W0T501  ','WHELP   ','W4T651U ','/RCL.   '),*        
               DSCA=X'0080',SYSMSG=FSYSMSG                                      
         DIV   TYPE=INOUT                                                       
         DPAGE CURSOR=((02,12)),                                       *        
               FILL=NONE                                                        
         ALPHA 'abcdefghijklmnopqrstuvwxyzåäö'                                  
FLD0102  DFLD  POS=(01,02),LTH=0001,ATTR=(ALPHA,NOPROT,MOD)                     
FLD0104  DFLD  POS=(01,04),LTH=0001,ATTR=(NUM,MOD)                              
FLD0106  DFLD  POS=(01,06),LTH=0001,ATTR=(NUM,MOD)                              
FLD0108  DFLD  POS=(01,08),LTH=0001,ATTR=(NUM,MOD)                              
         DFLD  '  DEFINIERA LASTOMR/STÄLL',                            *        
               POS=(01,12),LTH=0025,ATTR=(NUM,PROT)                             
FLD0141  DFLD  POS=(01,41),LTH=0040,ATTR=(NUM,PROT,HI)                          
         DFLD  'GEOGR OMR',                                            *        
               POS=(02,02),LTH=0009,ATTR=(NUM,PROT)                             
FLD0212  DFLD  POS=(02,12),LTH=0003,ATTR=(ALPHA)                                
         DFLD  'LASTOMR/STÄLL',                                        *        
               POS=(02,18),LTH=0013,ATTR=(NUM,PROT)                             
FLD0232  DFLD  POS=(02,32),LTH=0003,ATTR=(NUM)                                  
         DFLD  'NIVÅ/RUTA',                                            *        
               POS=(02,38),LTH=0009,ATTR=(NUM,PROT)                             
FLD0248  DFLD  POS=(02,48),LTH=0003,ATTR=(NUM)                                  
         DFLD  'DC',                                                   *        
               POS=(02,54),LTH=0002,ATTR=(NUM,PROT)                             
DCI      DFLD  POS=(02,58),LTH=0002,ATTR=(ALPHA,NOPROT)                         
FLD0312  DFLD  POS=(03,12),LTH=0003,ATTR=(NUM,PROT,MOD)                         
FLD0332  DFLD  POS=(03,32),LTH=0003,ATTR=(NUM,PROT,MOD)                         
FLD0348  DFLD  POS=(03,48),LTH=0003,ATTR=(NUM,PROT,MOD)                         
DCO      DFLD  POS=(03,58),LTH=0002,ATTR=(ALPHA,PROT,MOD)                       
FLD0412  DFLD  POS=(04,12),LTH=0003,ATTR=(NUM,PROT,MOD,NODISP)                  
FLD0416  DFLD  POS=(04,16),LTH=0003,ATTR=(NUM,PROT,MOD,NODISP)                  
FLD0420  DFLD  POS=(04,20),LTH=0003,ATTR=(NUM,PROT,MOD,NODISP)                  
FLD0424  DFLD  POS=(04,24),LTH=0003,ATTR=(NUM,PROT,MOD,NODISP)                  
FLD0428  DFLD  POS=(04,28),LTH=0003,ATTR=(NUM,PROT,MOD,NODISP)                  
FLD0432  DFLD  POS=(04,32),LTH=0003,ATTR=(NUM,PROT,MOD,NODISP)                  
FLD0436  DFLD  POS=(04,36),LTH=0003,ATTR=(NUM,PROT,MOD,NODISP)                  
FLD0440  DFLD  POS=(04,40),LTH=0003,ATTR=(NUM,PROT,MOD,NODISP)                  
FLD0444  DFLD  POS=(04,44),LTH=0003,ATTR=(NUM,PROT,MOD,NODISP)                  
FLD0448  DFLD  POS=(04,48),LTH=0003,ATTR=(NUM,PROT,MOD,NODISP)                  
         DFLD  'KOD  NIVÅ/RUTA  DJUP  HÖJD  V-MODUL  H-MODUL  VOLYM  SP*        
               ÄRRTEXT         ',                                      *        
               POS=(05,02),LTH=0072,ATTR=(NUM,PROT)                             
         DO    13,SUF=06                                                        
COL03    DFLD  POS=(06,03),LTH=0001,ATTR=(ALPHA)                                
COL13    DFLD  POS=(06,13),LTH=0003,ATTR=(NUM,PROT,MOD)                         
COL19    DFLD  POS=(06,19),LTH=0003,ATTR=(NUM,PROT,MOD)                         
COL25    DFLD  POS=(06,25),LTH=0003,ATTR=(NUM,PROT,MOD)                         
COL34    DFLD  POS=(06,34),LTH=0003,ATTR=(NUM,PROT,MOD)                         
COL43    DFLD  POS=(06,43),LTH=0003,ATTR=(NUM,PROT,MOD)                         
COL50    DFLD  POS=(06,50),LTH=0003,ATTR=(NUM)                                  
COL55    DFLD  POS=(06,55),LTH=0020,ATTR=(ALPHA)                                
COL76    DFLD  POS=(06,76),LTH=0003,ATTR=(NUM,PROT,MOD,NODISP)                  
COL80    DFLD  POS=(06,80),LTH=0001,ATTR=(ALPHA,PROT,MOD,NODISP)                
         ENDDO                                                                  
         DFLD  'N',                                                    *        
               POS=(19,03),LTH=0001,ATTR=(NUM,PROT)                             
FLD1913  DFLD  POS=(19,13),LTH=0003,ATTR=(NUM)                                  
FLD1919  DFLD  POS=(19,19),LTH=0003,ATTR=(NUM)                                  
FLD1925  DFLD  POS=(19,25),LTH=0003,ATTR=(NUM)                                  
FLD1934  DFLD  POS=(19,34),LTH=0003,ATTR=(NUM)                                  
FLD1943  DFLD  POS=(19,43),LTH=0003,ATTR=(NUM)                                  
FLD1950  DFLD  POS=(19,50),LTH=0003,ATTR=(NUM)                                  
FLD1955  DFLD  POS=(19,55),LTH=0020,ATTR=(ALPHA)                                
         DFLD  '13 DEF OMR/ST.  14 RUTA FULL    15              16     *        
                        17              18              19             *        
                20              21              10 WHELP',             *        
               POS=(21,02),LTH=0152,ATTR=(NUM,PROT)                             
FLD2302  DFLD  POS=(23,02),LTH=0055,ATTR=(NUM,PROT,HI)                          
         DFLD  ' VCP ',POS=(23,58)                                              
FLD2364  DFLD  POS=(23,64),LTH=0008,ATTR=(NUM,PROT)                             
FLD2373  DFLD  POS=(23,73),LTH=0008,ATTR=(NUM,PROT)                             
FSYSMSG  DFLD  POS=(24,02),LTH=0079,ATTR=(NUM,PROT,HI)                          
         FMTEND                                                                 
         EJECT                                                                  
W4O65101 MSG   TYPE=OUTPUT,                                            *        
               SOR=(W4F651,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W4I65101,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  FLD0102,LTH=0001                                                 
         MFLD  FLD0104,LTH=0001                                                 
         MFLD  FLD0106,LTH=0001                                                 
         MFLD  FLD0108,LTH=0001                                                 
         MFLD  FLD0141,LTH=0040                                                 
         MFLD  FLD0212,LTH=0002                                                 
         MFLD  FLD0312,LTH=0003                                                 
         MFLD  FLD0232,LTH=0002                                                 
         MFLD  FLD0332,LTH=0003                                                 
         MFLD  FLD0248,LTH=0002                                                 
         MFLD  FLD0348,LTH=0003                                                 
         MFLD  DCI,LTH=0002                                                     
         MFLD  DCO,LTH=0002                                                     
         MFLD  FLD0412,LTH=0003                                                 
         MFLD  FLD0416,LTH=0003                                                 
         MFLD  FLD0420,LTH=0003                                                 
         MFLD  FLD0424,LTH=0003                                                 
         MFLD  FLD0428,LTH=0003                                                 
         MFLD  FLD0432,LTH=0003                                                 
         MFLD  FLD0436,LTH=0003                                                 
         MFLD  FLD0440,LTH=0003                                                 
         MFLD  FLD0444,LTH=0003                                                 
         MFLD  FLD0448,LTH=0003                                                 
         DO    13,SUF=06                                                        
         MFLD  COL03,LTH=0004,ATTR=YES                                          
         MFLD  COL13,LTH=0003                                                   
         MFLD  COL19,LTH=0003                                                   
         MFLD  COL25,LTH=0003                                                   
         MFLD  COL34,LTH=0003                                                   
         MFLD  COL43,LTH=0003                                                   
         MFLD  COL50,LTH=0005,ATTR=YES                                          
         MFLD  COL55,LTH=0022,ATTR=YES                                          
         MFLD  COL76,LTH=0003                                                   
         MFLD  COL80,LTH=0001                                                   
         ENDDO                                                                  
         MFLD  FLD1913,LTH=0004,ATTR=YES                                        
         MFLD  FLD1919,LTH=0004,ATTR=YES                                        
         MFLD  FLD1925,LTH=0004,ATTR=YES                                        
         MFLD  FLD1934,LTH=0004,ATTR=YES                                        
         MFLD  FLD1943,LTH=0004,ATTR=YES                                        
         MFLD  FLD1950,LTH=0004,ATTR=YES                                        
         MFLD  FLD1955,LTH=0004,ATTR=YES                                        
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W4I65101 MSG   TYPE=INPUT,                                             *        
               SOR=W4F651,                                             *        
               OPT=2,                                                  *        
               NXT=W4O65101                                                     
         SEG                                                                    
         MFLD  FLDPFK,LTH=008,FILL=NULL                                         
         MFLD  'W',LTH=0001                                                     
         MFLD  FLD0102,LTH=0001,FILL=C'4'                                       
         MFLD  'T',LTH=0001                                                     
         MFLD  FLD0104,LTH=0001,FILL=C'6'                                       
         MFLD  FLD0106,LTH=0001,FILL=C'5'                                       
         MFLD  FLD0108,LTH=0001,FILL=C'1'                                       
         MFLD  '  ',LTH=002                                                     
         MFLD  '46511',LTH=0005                                                 
         MFLD  (FLD0212,'+++'),LTH=0003,FILL=C'0',JUST=R                        
         MFLD  FLD0312,LTH=0003,FILL=C'0'                                       
         MFLD  (FLD0232,'+++'),LTH=0003,FILL=C'0',JUST=R                        
         MFLD  FLD0332,LTH=0003,FILL=C'0'                                       
         MFLD  (FLD0248,'+++'),LTH=0003,FILL=C'0',JUST=R                        
         MFLD  FLD0348,LTH=0003,FILL=C'0'                                       
         MFLD  (DCI,'++'),LTH=0002,FILL=X'40'                                   
         MFLD  DCO,LTH=0002,FILL=X'40'                                          
         MFLD  FLD0412,LTH=0003,FILL=C'0'                                       
         MFLD  FLD0416,LTH=0003,FILL=C'0'                                       
         MFLD  FLD0420,LTH=0003,FILL=C'0'                                       
         MFLD  FLD0424,LTH=0003,FILL=C'0'                                       
         MFLD  FLD0428,LTH=0003,FILL=C'0'                                       
         MFLD  FLD0432,LTH=0003,FILL=C'0'                                       
         MFLD  FLD0436,LTH=0003,FILL=C'0'                                       
         MFLD  FLD0440,LTH=0003,FILL=C'0'                                       
         MFLD  FLD0444,LTH=0003,FILL=C'0'                                       
         MFLD  FLD0448,LTH=0003,FILL=C'0'                                       
         DO    13,SUF=06                                                        
         MFLD  (COL03,'+'),LTH=0001,FILL=C' '                                   
         MFLD  COL13,LTH=0003,FILL=C'0'                                         
         MFLD  COL19,LTH=0003,FILL=C'0'                                         
         MFLD  COL25,LTH=0003,FILL=C'0'                                         
         MFLD  COL34,LTH=0003,FILL=C'0'                                         
         MFLD  COL43,LTH=0003,FILL=C'0'                                         
         MFLD  (COL50,'+++'),LTH=0003,FILL=C'0',JUST=R                          
         MFLD  (COL55,'++++++++++++++++++++'),LTH=0020,FILL=C' '                
         MFLD  COL76,LTH=0003,FILL=C'0'                                         
         MFLD  COL80,LTH=0001,FILL=C' '                                         
         ENDDO                                                                  
         MFLD  (FLD1913,'+++'),LTH=0003,FILL=C'0',JUST=R                        
         MFLD  (FLD1919,'+++'),LTH=0003,FILL=C'0',JUST=R                        
         MFLD  (FLD1925,'+++'),LTH=0003,FILL=C'0',JUST=R                        
         MFLD  (FLD1934,'+++'),LTH=0003,FILL=C'0',JUST=R                        
         MFLD  (FLD1943,'+++'),LTH=0003,FILL=C'0',JUST=R                        
         MFLD  (FLD1950,'+++'),LTH=0003,FILL=C'0',JUST=R                        
         MFLD  (FLD1955,'++++++++++++++++++++'),LTH=0020,FILL=C' '              
         MSGEND                                                                 
         EJECT                                                                  
         END                                                                    
