*          DATA SET W4F672FII0 AT LEVEL 001 AS OF 86/08/28                      
*                                                                               
         PRINT NOGEN                                                            
W4F672   FMT                                                                    
         DEV   TYPE=(3270,2),                                          *        
               FEAT=IGNORE,                                            *        
               PFK=(FLDPFK,'W0T501  ','W0T501  ','W0T501  ','W0T501  ',*        
               'W0T501  ','W0T501  ','W0T501  ','W0T501  ','W0T501  ', *        
               'WHELP   ','W0T501  ','/RCL.   ','W4T671  ','W4T672  ', *        
               'W0T501  ','W0T501  ','W0T501  ','W0T501  ','W0T501  ', *        
               'W0T501  ','W0T501  ','WHELP   ','W0T501  ','/RCL.   '),*        
               DSCA=X'0080',SYSMSG=FSYSMSG                                      
         DIV   TYPE=INOUT                                                       
         DPAGE CURSOR=((02,15)),                                       *        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(01,02),LTH=0001,ATTR=(ALPHA,NOPROT,MOD)                     
FLD0104  DFLD  POS=(01,04),LTH=0001,ATTR=(NUM,MOD)                              
FLD0106  DFLD  POS=(01,06),LTH=0001,ATTR=(NUM,MOD)                              
FLD0108  DFLD  POS=(01,08),LTH=0001,ATTR=(NUM,MOD)                              
         DFLD  'EJ ÅTERRAPP LASTNINGAR 2',                             *        
               POS=(01,11),LTH=0024,ATTR=(NUM,PROT)                             
FLD0141  DFLD  POS=(01,41),LTH=0040,ATTR=(NUM,PROT,HI)                          
         DFLD  'DESTINATION',                                          *        
               POS=(02,02),LTH=0011,ATTR=(NUM,PROT)                             
FLD0215  DFLD  POS=(02,15),LTH=0025,ATTR=(ALPHA)                                
         DFLD  'TRP-NAMN',                                             *        
               POS=(02,42),LTH=0008,ATTR=(NUM,PROT)                             
FLD0252  DFLD  POS=(02,52),LTH=0015,ATTR=(ALPHA)                                
FLD0315  DFLD  POS=(03,15),LTH=0025,ATTR=(NUM,PROT,MOD)                         
FLD0352  DFLD  POS=(03,52),LTH=0015,ATTR=(NUM,PROT,MOD)                         
         DFLD  'ANTAL KOLLI',                                          *        
               POS=(05,02),LTH=0011,ATTR=(NUM,PROT)                             
         DFLD  'BR.VIKT',                                              *        
               POS=(05,15),LTH=0007,ATTR=(NUM,PROT)                             
         DFLD  'BR.VOLYM',                                             *        
               POS=(05,24),LTH=0008,ATTR=(NUM,PROT)                             
         DFLD  'GEOGR.OMR',                                            *        
               POS=(05,34),LTH=0009,ATTR=(NUM,PROT)                             
         DFLD  'LAST.OMR',                                             *        
               POS=(05,45),LTH=0008,ATTR=(NUM,PROT)                             
         DFLD  'RUTA',                                                 *        
               POS=(05,55),LTH=0004,ATTR=(NUM,PROT)                             
FLD0605  DFLD  POS=(06,05),LTH=0004,ATTR=(NUM,PROT)                             
FLD0614  DFLD  POS=(06,14),LTH=0008,ATTR=(NUM,PROT)                             
FLD0624  DFLD  POS=(06,24),LTH=0008,ATTR=(NUM,PROT)                             
FLD0637  DFLD  POS=(06,37),LTH=0003,ATTR=(NUM,PROT)                             
FLD0648  DFLD  POS=(06,48),LTH=0003,ATTR=(NUM,PROT)                             
FLD0656  DFLD  POS=(06,56),LTH=0003,ATTR=(NUM,PROT)                             
         DFLD  '13 EJ ÅTERRAPP 1 14 EJ ÅTERRAPP 2 15             16    *        
                         17             18               19            *        
                  20             21              10 WHELP',            *        
               POS=(21,02),LTH=0153,ATTR=(NUM,PROT)                             
FLD2302  DFLD  POS=(23,02),LTH=0055,ATTR=(NUM,PROT,HI)                          
         DFLD  ' VCP ',POS=(23,58)                                              
FLD2364  DFLD  POS=(23,64),LTH=0008,ATTR=(NUM,PROT)                             
FLD2373  DFLD  POS=(23,73),LTH=0008,ATTR=(NUM,PROT)                             
FSYSMSG  DFLD  POS=(24,02),LTH=0079,ATTR=(NUM,PROT,HI)                          
         FMTEND                                                                 
         EJECT                                                                  
W4O67201 MSG   TYPE=OUTPUT,                                            *        
               SOR=(W4F672,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W4I67201,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  FLD0102,LTH=0001                                                 
         MFLD  FLD0104,LTH=0001                                                 
         MFLD  FLD0106,LTH=0001                                                 
         MFLD  FLD0108,LTH=0001                                                 
         MFLD  FLD0141,LTH=0040                                                 
         MFLD  FLD0215,LTH=0002                                                 
         MFLD  FLD0315,LTH=0025                                                 
         MFLD  FLD0252,LTH=0002                                                 
         MFLD  FLD0352,LTH=0015                                                 
         MFLD  FLD0605,LTH=0004                                                 
         MFLD  FLD0614,LTH=0008                                                 
         MFLD  FLD0624,LTH=0008                                                 
         MFLD  FLD0637,LTH=0003                                                 
         MFLD  FLD0648,LTH=0003                                                 
         MFLD  FLD0656,LTH=0003                                                 
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=1                                              
         MSGEND                                                                 
         EJECT                                                                  
W4I67201 MSG   TYPE=INPUT,                                             *        
               SOR=W4F672,                                             *        
               OPT=2,                                                  *        
               NXT=W4O67201                                                     
         SEG                                                                    
         MFLD  FLDPFK,LTH=0008,FILL=NULL                                        
         MFLD  'W',LTH=1                                                        
         MFLD  FLD0102,LTH=0001,FILL=C'4'                                       
         MFLD  'T',LTH=1                                                        
         MFLD  FLD0104,LTH=0001,FILL=C'6'                                       
         MFLD  FLD0106,LTH=0001,FILL=C'7'                                       
         MFLD  FLD0108,LTH=0001,FILL=C'2'                                       
         MFLD  '  ',LTH=2                                                       
         MFLD  '46721',LTH=5                                                    
         MFLD  (FLD0215,'+++++++++++++++++++++++++'),LTH=0025,FILL=C' '         
         MFLD  FLD0315,LTH=0025,FILL=C' '                                       
         MFLD  (FLD0252,'+++++++++++++++'),LTH=0015,FILL=C' '                   
         MFLD  FLD0352,LTH=0015,FILL=C' '                                       
         MSGEND                                                                 
         EJECT                                                                  
         END                                                                    
