*          DATA SET W4F661FII0 AT LEVEL 001 AS OF 86/07/02                      
*                                                                               
         PRINT NOGEN                                                            
W4F661   FMT                                                                    
         DEV   TYPE=(3270,2),                                          *        
               FEAT=IGNORE,                                            *        
               PFK=(FLDPFK,'W0T501  ','W0T501  ','W0T501  ','W0T501  ',*        
               'W0T501  ','W4T661 6','W4T661 7','W4T661 8','W0T501  ', *        
               'WHELP   ','W4T661U ','/RCL.   ','W4T661  ','W4T662  ', *        
               'W0T501  ','W0T501  ','W0T501  ','W0T501  ','W0T501  ', *        
               'W0T501  ','W0T501  ','WHELP   ','W4T661U ','/RCL.   '),*        
               DSCA=X'0080',SYSMSG=FSYSMSG                                      
         DIV   TYPE=INOUT                                                       
         DPAGE CURSOR=((02,12)),                                       *        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(01,02),LTH=0001,ATTR=(ALPHA,NOPROT,MOD)                     
FLD0104  DFLD  POS=(01,04),LTH=0001,ATTR=(NUM)                                  
FLD0106  DFLD  POS=(01,06),LTH=0001,ATTR=(NUM)                                  
FLD0108  DFLD  POS=(01,08),LTH=0001,ATTR=(NUM)                                  
         DFLD  'DEFINIERA TRANSPORT LASTOMR.',                         *        
               POS=(01,11),LTH=0028,ATTR=(NUM,PROT)                             
FLD0141  DFLD  POS=(01,41),LTH=0040,ATTR=(NUM,PROT,HI)                          
         DFLD  'TRANSPORT',                                            *        
               POS=(02,02),LTH=0009,ATTR=(NUM,PROT)                             
FLD0212  DFLD  POS=(02,12),LTH=0003,ATTR=(NUM)                                  
         DFLD  'GEOGR OMR',                                            *        
               POS=(02,17),LTH=0009,ATTR=(NUM,PROT)                             
FLD0227  DFLD  POS=(02,27),LTH=0003,ATTR=(ALPHA)                                
         DFLD  'LAST OMR',                                             *        
               POS=(02,32),LTH=0008,ATTR=(NUM,PROT)                             
FLD0241  DFLD  POS=(02,41),LTH=0003,ATTR=(NUM)                                  
         DFLD  'DC',                                                   *        
               POS=(02,46),LTH=0002,ATTR=(NUM,PROT)                             
DCI      DFLD  POS=(02,50),LTH=0002,ATTR=(ALPHA,NOPROT)                         
FLD0312  DFLD  POS=(03,12),LTH=0003,ATTR=(NUM,PROT,MOD)                         
FLD0327  DFLD  POS=(03,27),LTH=0003,ATTR=(NUM,PROT,MOD)                         
FLD0341  DFLD  POS=(03,41),LTH=0003,ATTR=(NUM,PROT,MOD)                         
DCO      DFLD  POS=(03,50),LTH=0002,ATTR=(ALPHA,PROT,MOD)                       
FLD0402  DFLD  POS=(04,02),LTH=0004,ATTR=(NUM,PROT,MOD,NODISP)                  
FLD0409  DFLD  POS=(04,09),LTH=0006,ATTR=(NUM,PROT,MOD,NODISP)                  
FLD0418  DFLD  POS=(04,18),LTH=0002,ATTR=(NUM,PROT,MOD,NODISP)                  
FLD0423  DFLD  POS=(04,23),LTH=0001,ATTR=(NUM,PROT,MOD,NODISP)                  
FLD0435  DFLD  POS=(04,35),LTH=0004,ATTR=(NUM,PROT,MOD,NODISP)                  
FLD0442  DFLD  POS=(04,42),LTH=0006,ATTR=(NUM,PROT,MOD,NODISP)                  
FLD0451  DFLD  POS=(04,51),LTH=0002,ATTR=(NUM,PROT,MOD,NODISP)                  
FLD0456  DFLD  POS=(04,56),LTH=0001,ATTR=(NUM,PROT,MOD,NODISP)                  
         DFLD  'UTLASTN LAGER',                                        *        
               POS=(05,02),LTH=0013,ATTR=(NUM,PROT)                             
FLD0516  DFLD  POS=(05,16),LTH=0001,ATTR=(ALPHA)                                
         DFLD  'GEOGR OMR',                                            *        
               POS=(05,19),LTH=0009,ATTR=(NUM,PROT)                             
FLD0530  DFLD  POS=(05,30),LTH=0003,ATTR=(NUM,PROT,HI)                          
         DFLD  'LAST OMR',                                             *        
               POS=(05,35),LTH=0008,ATTR=(NUM,PROT)                             
FLD0545  DFLD  POS=(05,45),LTH=0003,ATTR=(NUM,PROT,HI)                          
         DFLD  'RUTA',                                                 *        
               POS=(05,50),LTH=0004,ATTR=(NUM,PROT)                             
FLD0556  DFLD  POS=(05,56),LTH=0003,ATTR=(NUM,PROT,HI)                          
         DFLD  'SEND TO TMS',                                          *        
               POS=(05,61),LTH=0011,ATTR=(NUM,PROT)                             
FLD0574  DFLD  POS=(05,74),LTH=0001,ATTR=(ALPHA)                                
         DFLD  'KOD  DISTR FOM  TOM KUND FOM    TOM  FK  KL  DCC VALFRI*        
                 TEXT',                                                *        
               POS=(06,02),LTH=0060,ATTR=(NUM,PROT)                             
         DO    12,SUF=07                                                        
COL03    DFLD  POS=(07,03),LTH=0001,ATTR=(ALPHA,PROT)                           
COL12    DFLD  POS=(07,12),LTH=0004,ATTR=(NUM,PROT,MOD)                         
COL17    DFLD  POS=(07,17),LTH=0004,ATTR=(NUM,PROT,MOD)                         
COL24    DFLD  POS=(07,24),LTH=0006,ATTR=(NUM,PROT,MOD)                         
COL31    DFLD  POS=(07,31),LTH=0006,ATTR=(NUM,PROT,MOD)                         
COL39    DFLD  POS=(07,39),LTH=0002,ATTR=(NUM,PROT,MOD)                         
COL44    DFLD  POS=(07,44),LTH=0001,ATTR=(NUM,PROT,MOD)                         
COL47    DFLD  POS=(07,47),LTH=0002,ATTR=(NUM,PROT,MOD)                         
COL51    DFLD  POS=(07,51),LTH=0020,ATTR=(ALPHA,PROT)                           
         ENDDO                                                                  
         DFLD  'N',                                                    *        
               POS=(19,03),LTH=0001,ATTR=(NUM,PROT)                             
FLD1912  DFLD  POS=(19,12),LTH=0004,ATTR=(NUM)                                  
FLD1917  DFLD  POS=(19,17),LTH=0004,ATTR=(NUM)                                  
FLD1924  DFLD  POS=(19,24),LTH=0006,ATTR=(NUM)                                  
FLD1931  DFLD  POS=(19,31),LTH=0006,ATTR=(NUM)                                  
FLD1939  DFLD  POS=(19,39),LTH=0002,ATTR=(NUM)                                  
FLD1944  DFLD  POS=(19,44),LTH=0001,ATTR=(ALPHA)                                
FLD1947  DFLD  POS=(19,47),LTH=0002,ATTR=(ALPHA)                                
FLD1951  DFLD  POS=(19,51),LTH=0020,ATTR=(ALPHA)                                
         DFLD  '13 DEF TRANSP   14 LASTREL TRPT 15              16     *        
                        17              18              19             *        
                20              21              10 WHELP',             *        
               POS=(21,02),LTH=0152,ATTR=(NUM,PROT)                             
FLD2302  DFLD  POS=(23,02),LTH=0055,ATTR=(NUM,PROT,HI)                          
         DFLD  ' VCP ',POS=(23,58)                                              
FLD2364  DFLD  POS=(23,64),LTH=0008,ATTR=(NUM,PROT)                             
FLD2373  DFLD  POS=(23,73),LTH=0008,ATTR=(NUM,PROT)                             
FSYSMSG  DFLD  POS=(24,02),LTH=0079,ATTR=(NUM,PROT,HI)                          
         FMTEND                                                                 
         EJECT                                                                  
W4O66101 MSG   TYPE=OUTPUT,                                            *        
               SOR=(W4F661,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W4I66101,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  FLD0102,LTH=0001                                                 
         MFLD  FLD0104,LTH=0001                                                 
         MFLD  FLD0106,LTH=0001                                                 
         MFLD  FLD0108,LTH=0001                                                 
         MFLD  FLD0141,LTH=0040                                                 
         MFLD  FLD0212,LTH=0002                                                 
         MFLD  FLD0312,LTH=0003                                                 
         MFLD  FLD0227,LTH=0002                                                 
         MFLD  FLD0327,LTH=0003                                                 
         MFLD  FLD0241,LTH=0002                                                 
         MFLD  FLD0341,LTH=0003                                                 
         MFLD  DCI,LTH=0002                                                     
         MFLD  DCO,LTH=0002                                                     
         MFLD  FLD0402,LTH=0004                                                 
         MFLD  FLD0409,LTH=0006                                                 
         MFLD  FLD0418,LTH=0002                                                 
         MFLD  FLD0423,LTH=0001                                                 
         MFLD  FLD0435,LTH=0004                                                 
         MFLD  FLD0442,LTH=0006                                                 
         MFLD  FLD0451,LTH=0002                                                 
         MFLD  FLD0456,LTH=0001                                                 
         MFLD  FLD0516,LTH=0004,ATTR=YES                                        
         MFLD  FLD0530,LTH=0003                                                 
         MFLD  FLD0545,LTH=0003                                                 
         MFLD  FLD0556,LTH=0003                                                 
         MFLD  FLD0574,LTH=0003,ATTR=YES                                        
         DO    12,SUF=07                                                        
         MFLD  COL03,LTH=0004,ATTR=YES                                          
         MFLD  COL12,LTH=0004                                                   
         MFLD  COL17,LTH=0004                                                   
         MFLD  COL24,LTH=0006                                                   
         MFLD  COL31,LTH=0006                                                   
         MFLD  COL39,LTH=0002                                                   
         MFLD  COL44,LTH=0001                                                   
         MFLD  COL47,LTH=0002                                                   
         MFLD  COL51,LTH=0022,ATTR=YES                                          
         ENDDO                                                                  
         MFLD  FLD1912,LTH=0004,ATTR=YES                                        
         MFLD  FLD1917,LTH=0004,ATTR=YES                                        
         MFLD  FLD1924,LTH=0004,ATTR=YES                                        
         MFLD  FLD1931,LTH=0004,ATTR=YES                                        
         MFLD  FLD1939,LTH=0004,ATTR=YES                                        
         MFLD  FLD1944,LTH=0004,ATTR=YES                                        
         MFLD  FLD1947,LTH=0004,ATTR=YES                                        
         MFLD  FLD1951,LTH=0004,ATTR=YES                                        
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=1                                              
         MSGEND                                                                 
         EJECT                                                                  
W4I66101 MSG   TYPE=INPUT,                                             *        
               SOR=W4F661,                                             *        
               OPT=2,                                                  *        
               NXT=W4O66101                                                     
         SEG                                                                    
         MFLD  FLDPFK,LTH=0008,FILL=NULL                                        
         MFLD  'W',LTH=1                                                        
         MFLD  FLD0102,LTH=0001,FILL=C'4'                                       
         MFLD  'T',LTH=1                                                        
         MFLD  FLD0104,LTH=0001,FILL=C'6'                                       
         MFLD  FLD0106,LTH=0001,FILL=C'6'                                       
         MFLD  FLD0108,LTH=0001,FILL=C'1'                                       
         MFLD  '  ',LTH=2                                                       
         MFLD  '46611',LTH=5                                                    
         MFLD  (FLD0212,'+++'),LTH=0003,FILL=C'0',JUST=R                        
         MFLD  FLD0312,LTH=0003,FILL=C'0'                                       
         MFLD  (FLD0227,'+++'),LTH=0003,FILL=C' '                               
         MFLD  FLD0327,LTH=0003,FILL=C' '                                       
         MFLD  (FLD0241,'+++'),LTH=0003,FILL=C'0',JUST=R                        
         MFLD  FLD0341,LTH=0003,FILL=C'0'                                       
         MFLD  (DCI,'++'),LTH=0002,FILL=X'40'                                   
         MFLD  DCO,LTH=0002,FILL=X'40'                                          
         MFLD  FLD0402,LTH=0004,FILL=C'0'                                       
         MFLD  FLD0409,LTH=0006,FILL=C'0'                                       
         MFLD  FLD0418,LTH=0002,FILL=C'0'                                       
         MFLD  FLD0423,LTH=0001,FILL=C'0'                                       
         MFLD  FLD0435,LTH=0004,FILL=C'0'                                       
         MFLD  FLD0442,LTH=0006,FILL=C'0'                                       
         MFLD  FLD0451,LTH=0002,FILL=C'0'                                       
         MFLD  FLD0456,LTH=0001,FILL=C'0'                                       
         MFLD  (FLD0516,'+'),LTH=0001,FILL=C' '                                 
         MFLD  (FLD0574,'+'),LTH=0001,FILL=C' '                                 
         DO    12,SUF=07                                                        
         MFLD  (COL03,'+'),LTH=0001,FILL=C' '                                   
         MFLD  (COL12,'++++'),LTH=0004,FILL=C'0',JUST=R                         
         MFLD  (COL17,'++++'),LTH=0004,FILL=C'0',JUST=R                         
         MFLD  (COL24,'++++++'),LTH=0006,FILL=C'0',JUST=R                       
         MFLD  (COL31,'++++++'),LTH=0006,FILL=C'0',JUST=R                       
         MFLD  (COL39,'++'),LTH=0002,FILL=C'0',JUST=R                           
         MFLD  (COL44,'+'),LTH=0001,FILL=C'0',JUST=R                            
         MFLD  (COL47,'++'),LTH=0002,FILL=C' '                                  
         MFLD  (COL51,'++++++++++++++++++++'),LTH=0020,FILL=C' '                
         ENDDO                                                                  
         MFLD  (FLD1912,'++++'),LTH=0004,FILL=C'0',JUST=R                       
         MFLD  (FLD1917,'++++'),LTH=0004,FILL=C'0',JUST=R                       
         MFLD  (FLD1924,'++++++'),LTH=0006,FILL=C'0',JUST=R                     
         MFLD  (FLD1931,'++++++'),LTH=0006,FILL=C'0',JUST=R                     
         MFLD  (FLD1939,'++'),LTH=0002,FILL=C'0',JUST=R                         
         MFLD  (FLD1944,'+'),LTH=0001,FILL=C'0',JUST=R                          
         MFLD  (FLD1947,'++'),LTH=0002,FILL=C' '                                
         MFLD  (FLD1951,'++++++++++++++++++++'),LTH=0020,FILL=C' '              
         MSGEND                                                                 
         EJECT                                                                  
         END                                                                    
