***********************************************************************         
* CREATED BY V086941   ON 02/10/31  AT 16:07                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'LASTNINGSRELEASE 2 PER TRANSPORT'                               
W4F663   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W4T662  ',                                           +        
               3='W4T663  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W4T663 7',                                           +        
               8='W4T663 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T663U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T661  ',                                          +        
               14='W4T662  ',                                          +        
               15='W4T663  ',                                          +        
               16='W4T664  ',                                          +        
               17='W4T666  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W4F663   DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'LASTNINGSRELEASE 2 TRANSPORT',                         +        
               POS=(1,11),LTH=28,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Transport',                                            +        
               POS=(2,2),LTH=9,                                        +        
               ATTR=(NUM,PROT)                                                  
DGIA0059 DFLD  POS=(2,12),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Lastbärare',                                           +        
               POS=(2,17),LTH=10,                                      +        
               ATTR=(PROT)                                                      
DGIA0038 DFLD  POS=(2,28),LTH=12,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Farligt gods',                                         +        
               POS=(2,42),LTH=12,                                      +        
               ATTR=(PROT)                                                      
DGIA0004 DFLD  POS=(2,55),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'DC',                                                   +        
               POS=(2,58),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDDCIN   DFLD  POS=(2,61),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0060 DFLD  POS=(3,12),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0039 DFLD  POS=(3,28),LTH=12,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0005 DFLD  POS=(3,55),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
IDDCUT   DFLD  POS=(3,61),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Sida Kli',                                             +        
               POS=(5,2),LTH=8,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'Br Kg',                                                +        
               POS=(5,15),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Br m3',                                                +        
               POS=(5,25),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Totalt Kli',                                           +        
               POS=(5,41),LTH=10,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Br Kg',                                                +        
               POS=(5,56),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Br m3',                                                +        
               POS=(5,66),LTH=5,                                       +        
               ATTR=(PROT)                                                      
KVKOLLIS DFLD  POS=(6,6),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
DGIA0077 DFLD  POS=(6,12),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0087 DFLD  POS=(6,22),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
KVKOLLIT DFLD  POS=(6,47),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
VKRDBTOT DFLD  POS=(6,52),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
VLRDBTOT DFLD  POS=(6,62),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Valt hittills totalt :',                               +        
               POS=(7,2),LTH=22,                                       +        
               ATTR=(PROT)                                                      
KVKOLLIV DFLD  POS=(7,47),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0078 DFLD  POS=(7,53),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0088 DFLD  POS=(7,63),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Lasta hela sidan',                                     +        
               POS=(8,2),LTH=16,                                       +        
               ATTR=(PROT)                                                      
DGIA0006 DFLD  POS=(8,19),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'L Dist    Kund   Order Kolli',                         +        
               POS=(9,2),LTH=28,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'RFS Kollikod    Br Kg    Br m3  PSN',                  +        
               POS=(9,38),LTH=35,                                      +        
               ATTR=(PROT)                                                      
         DO    10,SUF=10                                                        
FLLASTA  DFLD  POS=(10,2),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDDIST   DFLD  POS=(10,4),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
IDKUND   DFLD  POS=(10,10),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
IDORDNR  DFLD  POS=(10,17),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
IDKOLLI  DFLD  POS=(10,25),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
TIRFS    DFLD  POS=(10,31),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
KDKOLLI  DFLD  POS=(10,42),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
BRVIKT   DFLD  POS=(10,51),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
BRVOLYM  DFLD  POS=(10,60),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
IDPSN    DFLD  POS=(10,69),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
IDPRODNR DFLD  POS=(10,74),LTH=7,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
         ENDDO                                                                  
         DFLD  '13 DEF TRPT',                                          +        
               POS=(21,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '14 LASTREL TRPT 15',                                   +        
               POS=(21,18),LTH=18,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '16',                                                   +        
               POS=(21,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(23,59),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4O66301 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4F663,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I66301,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W4F663                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  DGIA0059,                                               +        
               LTH=3                                                            
         MFLD  DGIA0060,                                               +        
               LTH=3                                                            
         MFLD  DGIA0038,                                               +        
               LTH=12                                                           
         MFLD  DGIA0039,                                               +        
               LTH=12                                                           
         MFLD  DGIA0004,                                               +        
               LTH=1                                                            
         MFLD  DGIA0005,                                               +        
               LTH=1                                                            
         MFLD  IDDCIN,                                                 +        
               LTH=2                                                            
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  KVKOLLIS,                                               +        
               LTH=4                                                            
         MFLD  DGIA0077,                                               +        
               LTH=8                                                            
         MFLD  DGIA0087,                                               +        
               LTH=8                                                            
         MFLD  KVKOLLIT,                                               +        
               LTH=4                                                            
         MFLD  VKRDBTOT,                                               +        
               LTH=9                                                            
         MFLD  VLRDBTOT,                                               +        
               LTH=9                                                            
         MFLD  KVKOLLIV,                                               +        
               LTH=4                                                            
         MFLD  DGIA0078,                                               +        
               LTH=8                                                            
         MFLD  DGIA0088,                                               +        
               LTH=8                                                            
         MFLD  DGIA0006,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         DO    10,SUF=10                                                        
         MFLD  FLLASTA,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDDIST,                                                 +        
               LTH=4                                                            
         MFLD  IDKUND,                                                 +        
               LTH=6                                                            
         MFLD  IDORDNR,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDKOLLI,                                                +        
               LTH=5                                                            
         MFLD  TIRFS,                                                  +        
               LTH=10                                                           
         MFLD  KDKOLLI,                                                +        
               LTH=8                                                            
         MFLD  BRVIKT,                                                 +        
               LTH=8                                                            
         MFLD  BRVOLYM,                                                +        
               LTH=8                                                            
         MFLD  IDPSN,                                                  +        
               LTH=4                                                            
         MFLD  IDPRODNR,                                               +        
               LTH=7                                                            
         ENDDO                                                                  
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I66301 MSG   TYPE=INPUT,                                             +        
               SOR=(W4F663),                                           +        
               OPT=2,                                                  +        
               NXT=W4O66201                                                     
MID      LPAGE SOR=(W4F663)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '46631',                                                +        
               LTH=5                                                            
         MFLD  (DGIA0059,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0060,                                              +        
               '   '),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0038,                                              +        
               '++++++++++++'),                                        +        
               LTH=12,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0039,                                              +        
               '            '),                                        +        
               LTH=12,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0004,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0005,                                              +        
               ' '),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDDCIN,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDDCUT,                                                +        
               '  '),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0006,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         DO    10,SUF=10                                                        
         MFLD  (FLLASTA,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  IDDIST,                                                 +        
               LTH=4                                                            
         MFLD  IDKUND,                                                 +        
               LTH=6                                                            
         MFLD  IDORDNR,                                                +        
               LTH=7                                                            
         MFLD  IDKOLLI,                                                +        
               LTH=5                                                            
         MFLD  IDPRODNR,                                               +        
               LTH=7                                                            
         ENDDO                                                                  
         MSGEND                                                                 
         END                                                                    
