***********************************************************************         
* CREATED BY V036147   ON 00/06/14  AT 09:04                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'Utskrift fraktsedlar            '                               
W4F611   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W4T611 4',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W4T611 7',                                           +        
               8='W4T611 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T611 4',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T611  ',                                          +        
               14='W4T612  ',                                          +        
               15='W4T613  ',                                          +        
               16='W4T614  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W4T611 B',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((2,8)),                                         +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'UTSKRIFT FRAKTSEDEL',                                  +        
               POS=(1,13),LTH=19,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'DISTR',                                                +        
               POS=(2,2),LTH=5,                                        +        
               ATTR=(ALPHA,PROT)                                                
FLD0208  DFLD  POS=(2,8),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'KUND',                                                 +        
               POS=(2,14),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FLD0219  DFLD  POS=(2,19),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'FK',                                                   +        
               POS=(2,27),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FLD0230  DFLD  POS=(2,30),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DC',                                                   +        
               POS=(2,34),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DGIA0000 DFLD  POS=(2,37),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0308  DFLD  POS=(3,8),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
FLD0319  DFLD  POS=(3,19),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0330  DFLD  POS=(3,30),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0001 DFLD  POS=(3,37),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0402  DFLD  POS=(4,2),LTH=26,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'HELA SIDAN J/N:',                                      +        
               POS=(5,4),LTH=15,                                       +        
               ATTR=(PROT)                                                      
FLD0520  DFLD  POS=(5,20),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'CONT',                                                 +        
               POS=(5,37),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'BUNT',                                                 +        
               POS=(5,48),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'DISTR KUNDNR FK ORDER KL PRODNR  LÅDA PAKET STYCK  HÄCK+        
                 PALL  BTOVIKT',                                       +        
               POS=(6,4),LTH=70,                                       +        
               ATTR=(PROT)                                                      
COL0207  DFLD  POS=(7,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
COL0507  DFLD  POS=(7,5),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
COL1007  DFLD  POS=(7,10),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1707  DFLD  POS=(7,17),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
COL2007  DFLD  POS=(7,20),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
COL2607  DFLD  POS=(7,26),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
COL2807  DFLD  POS=(7,28),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
COL3607  DFLD  POS=(7,36),LTH=5,                                       +        
               ATTR=(PROT)                                                      
COL4207  DFLD  POS=(7,42),LTH=5,                                       +        
               ATTR=(PROT)                                                      
COL4807  DFLD  POS=(7,48),LTH=5,                                       +        
               ATTR=(PROT)                                                      
COL5407  DFLD  POS=(7,54),LTH=5,                                       +        
               ATTR=(PROT)                                                      
COL6007  DFLD  POS=(7,60),LTH=5,                                       +        
               ATTR=(PROT)                                                      
COL6607  DFLD  POS=(7,66),LTH=8,                                       +        
               ATTR=(PROT)                                                      
COL7507  DFLD  POS=(7,75),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
COL0208  DFLD  POS=(8,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
COL0508  DFLD  POS=(8,5),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
COL1008  DFLD  POS=(8,10),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1708  DFLD  POS=(8,17),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
COL2008  DFLD  POS=(8,20),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
COL2608  DFLD  POS=(8,26),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
COL2808  DFLD  POS=(8,28),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
COL3608  DFLD  POS=(8,36),LTH=5,                                       +        
               ATTR=(PROT)                                                      
COL4208  DFLD  POS=(8,42),LTH=5,                                       +        
               ATTR=(PROT)                                                      
COL4808  DFLD  POS=(8,48),LTH=5,                                       +        
               ATTR=(PROT)                                                      
COL5408  DFLD  POS=(8,54),LTH=5,                                       +        
               ATTR=(PROT)                                                      
COL6008  DFLD  POS=(8,60),LTH=5,                                       +        
               ATTR=(PROT)                                                      
COL6608  DFLD  POS=(8,66),LTH=8,                                       +        
               ATTR=(PROT)                                                      
COL7508  DFLD  POS=(8,75),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
COL0209  DFLD  POS=(9,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
COL0509  DFLD  POS=(9,5),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
COL1009  DFLD  POS=(9,10),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1709  DFLD  POS=(9,17),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
COL2009  DFLD  POS=(9,20),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
COL2609  DFLD  POS=(9,26),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
COL2809  DFLD  POS=(9,28),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
COL3609  DFLD  POS=(9,36),LTH=5,                                       +        
               ATTR=(PROT)                                                      
COL4209  DFLD  POS=(9,42),LTH=5,                                       +        
               ATTR=(PROT)                                                      
COL4809  DFLD  POS=(9,48),LTH=5,                                       +        
               ATTR=(PROT)                                                      
COL5409  DFLD  POS=(9,54),LTH=5,                                       +        
               ATTR=(PROT)                                                      
COL6009  DFLD  POS=(9,60),LTH=5,                                       +        
               ATTR=(PROT)                                                      
COL6609  DFLD  POS=(9,66),LTH=8,                                       +        
               ATTR=(PROT)                                                      
COL7509  DFLD  POS=(9,75),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
COL0210  DFLD  POS=(10,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL0510  DFLD  POS=(10,5),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1010  DFLD  POS=(10,10),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL1710  DFLD  POS=(10,17),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
COL2010  DFLD  POS=(10,20),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
COL2610  DFLD  POS=(10,26),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
COL2810  DFLD  POS=(10,28),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
COL3610  DFLD  POS=(10,36),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL4210  DFLD  POS=(10,42),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL4810  DFLD  POS=(10,48),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL5410  DFLD  POS=(10,54),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL6010  DFLD  POS=(10,60),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL6610  DFLD  POS=(10,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
COL7510  DFLD  POS=(10,75),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
COL0211  DFLD  POS=(11,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL0511  DFLD  POS=(11,5),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1011  DFLD  POS=(11,10),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL1711  DFLD  POS=(11,17),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
COL2011  DFLD  POS=(11,20),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
COL2611  DFLD  POS=(11,26),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
COL2811  DFLD  POS=(11,28),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
COL3611  DFLD  POS=(11,36),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL4211  DFLD  POS=(11,42),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL4811  DFLD  POS=(11,48),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL5411  DFLD  POS=(11,54),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL6011  DFLD  POS=(11,60),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL6611  DFLD  POS=(11,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
COL7511  DFLD  POS=(11,75),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
COL0212  DFLD  POS=(12,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL0512  DFLD  POS=(12,5),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1012  DFLD  POS=(12,10),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL1712  DFLD  POS=(12,17),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
COL2012  DFLD  POS=(12,20),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
COL2612  DFLD  POS=(12,26),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
COL2812  DFLD  POS=(12,28),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
COL3612  DFLD  POS=(12,36),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL4212  DFLD  POS=(12,42),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL4812  DFLD  POS=(12,48),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL5412  DFLD  POS=(12,54),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL6012  DFLD  POS=(12,60),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL6612  DFLD  POS=(12,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
COL7512  DFLD  POS=(12,75),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
COL0213  DFLD  POS=(13,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL0513  DFLD  POS=(13,5),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1013  DFLD  POS=(13,10),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL1713  DFLD  POS=(13,17),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
COL2013  DFLD  POS=(13,20),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
COL2613  DFLD  POS=(13,26),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
COL2813  DFLD  POS=(13,28),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
COL3613  DFLD  POS=(13,36),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL4213  DFLD  POS=(13,42),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL4813  DFLD  POS=(13,48),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL5413  DFLD  POS=(13,54),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL6013  DFLD  POS=(13,60),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL6613  DFLD  POS=(13,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
COL7513  DFLD  POS=(13,75),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
COL0214  DFLD  POS=(14,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL0514  DFLD  POS=(14,5),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1014  DFLD  POS=(14,10),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL1714  DFLD  POS=(14,17),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
COL2014  DFLD  POS=(14,20),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
COL2614  DFLD  POS=(14,26),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
COL2814  DFLD  POS=(14,28),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
COL3614  DFLD  POS=(14,36),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL4214  DFLD  POS=(14,42),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL4814  DFLD  POS=(14,48),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL5414  DFLD  POS=(14,54),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL6014  DFLD  POS=(14,60),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL6614  DFLD  POS=(14,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
COL7514  DFLD  POS=(14,75),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
COL0215  DFLD  POS=(15,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL0515  DFLD  POS=(15,5),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1015  DFLD  POS=(15,10),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL1715  DFLD  POS=(15,17),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
COL2015  DFLD  POS=(15,20),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
COL2615  DFLD  POS=(15,26),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
COL2815  DFLD  POS=(15,28),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
COL3615  DFLD  POS=(15,36),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL4215  DFLD  POS=(15,42),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL4815  DFLD  POS=(15,48),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL5415  DFLD  POS=(15,54),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL6015  DFLD  POS=(15,60),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL6615  DFLD  POS=(15,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
COL7515  DFLD  POS=(15,75),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
COL0216  DFLD  POS=(16,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL0516  DFLD  POS=(16,5),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1016  DFLD  POS=(16,10),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL1716  DFLD  POS=(16,17),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
COL2016  DFLD  POS=(16,20),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
COL2616  DFLD  POS=(16,26),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
COL2816  DFLD  POS=(16,28),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
COL3616  DFLD  POS=(16,36),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL4216  DFLD  POS=(16,42),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL4816  DFLD  POS=(16,48),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL5416  DFLD  POS=(16,54),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL6016  DFLD  POS=(16,60),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL6616  DFLD  POS=(16,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
COL7516  DFLD  POS=(16,75),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
COL0217  DFLD  POS=(17,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL0517  DFLD  POS=(17,5),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1017  DFLD  POS=(17,10),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL1717  DFLD  POS=(17,17),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
COL2017  DFLD  POS=(17,20),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
COL2617  DFLD  POS=(17,26),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
COL2817  DFLD  POS=(17,28),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
COL3617  DFLD  POS=(17,36),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL4217  DFLD  POS=(17,42),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL4817  DFLD  POS=(17,48),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL5417  DFLD  POS=(17,54),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL6017  DFLD  POS=(17,60),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL6617  DFLD  POS=(17,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
COL7517  DFLD  POS=(17,75),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
COL0218  DFLD  POS=(18,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL0518  DFLD  POS=(18,5),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1018  DFLD  POS=(18,10),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL1718  DFLD  POS=(18,17),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
COL2018  DFLD  POS=(18,20),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
COL2618  DFLD  POS=(18,26),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
COL2818  DFLD  POS=(18,28),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
COL3618  DFLD  POS=(18,36),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL4218  DFLD  POS=(18,42),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL4818  DFLD  POS=(18,48),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL5418  DFLD  POS=(18,54),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL6018  DFLD  POS=(18,60),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL6618  DFLD  POS=(18,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
COL7518  DFLD  POS=(18,75),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
COL0219  DFLD  POS=(19,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL0519  DFLD  POS=(19,5),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1019  DFLD  POS=(19,10),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL1719  DFLD  POS=(19,17),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
COL2019  DFLD  POS=(19,20),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
COL2619  DFLD  POS=(19,26),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
COL2819  DFLD  POS=(19,28),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
COL3619  DFLD  POS=(19,36),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL4219  DFLD  POS=(19,42),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL4819  DFLD  POS=(19,48),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL5419  DFLD  POS=(19,54),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL6019  DFLD  POS=(19,60),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL6619  DFLD  POS=(19,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
COL7519  DFLD  POS=(19,75),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  '13 FRAKTS REL   14 UTSKR FS SVE 15 UTSKR FS-TOT 16 FS R+        
               EL KL 4  17',                                           +        
               POS=(21,2),LTH=66,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(23,59),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W4O61101 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4F611,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I61101,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  FLD0208,                                                +        
               LTH=4                                                            
         MFLD  FLD0308,                                                +        
               LTH=4                                                            
         MFLD  FLD0219,                                                +        
               LTH=6                                                            
         MFLD  FLD0319,                                                +        
               LTH=6                                                            
         MFLD  FLD0230,                                                +        
               LTH=2                                                            
         MFLD  FLD0330,                                                +        
               LTH=2                                                            
         MFLD  DGIA0000,                                               +        
               LTH=2                                                            
         MFLD  DGIA0001,                                               +        
               LTH=2                                                            
         MFLD  FLD0402,                                                +        
               LTH=19                                                           
         MFLD  FLD0520,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0207,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0507,                                                +        
               LTH=4                                                            
         MFLD  COL1007,                                                +        
               LTH=6                                                            
         MFLD  COL1707,                                                +        
               LTH=2                                                            
         MFLD  COL2007,                                                +        
               LTH=5                                                            
         MFLD  COL2607,                                                +        
               LTH=1                                                            
         MFLD  COL2807,                                                +        
               LTH=7                                                            
         MFLD  COL3607,                                                +        
               LTH=5                                                            
         MFLD  COL4207,                                                +        
               LTH=5                                                            
         MFLD  COL4807,                                                +        
               LTH=5                                                            
         MFLD  COL5407,                                                +        
               LTH=5                                                            
         MFLD  COL6007,                                                +        
               LTH=5                                                            
         MFLD  COL6607,                                                +        
               LTH=8                                                            
         MFLD  COL7507,                                                +        
               LTH=4                                                            
         MFLD  COL0208,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0508,                                                +        
               LTH=4                                                            
         MFLD  COL1008,                                                +        
               LTH=6                                                            
         MFLD  COL1708,                                                +        
               LTH=2                                                            
         MFLD  COL2008,                                                +        
               LTH=5                                                            
         MFLD  COL2608,                                                +        
               LTH=1                                                            
         MFLD  COL2808,                                                +        
               LTH=7                                                            
         MFLD  COL3608,                                                +        
               LTH=5                                                            
         MFLD  COL4208,                                                +        
               LTH=5                                                            
         MFLD  COL4808,                                                +        
               LTH=5                                                            
         MFLD  COL5408,                                                +        
               LTH=5                                                            
         MFLD  COL6008,                                                +        
               LTH=5                                                            
         MFLD  COL6608,                                                +        
               LTH=8                                                            
         MFLD  COL7508,                                                +        
               LTH=4                                                            
         MFLD  COL0209,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0509,                                                +        
               LTH=4                                                            
         MFLD  COL1009,                                                +        
               LTH=6                                                            
         MFLD  COL1709,                                                +        
               LTH=2                                                            
         MFLD  COL2009,                                                +        
               LTH=5                                                            
         MFLD  COL2609,                                                +        
               LTH=1                                                            
         MFLD  COL2809,                                                +        
               LTH=7                                                            
         MFLD  COL3609,                                                +        
               LTH=5                                                            
         MFLD  COL4209,                                                +        
               LTH=5                                                            
         MFLD  COL4809,                                                +        
               LTH=5                                                            
         MFLD  COL5409,                                                +        
               LTH=5                                                            
         MFLD  COL6009,                                                +        
               LTH=5                                                            
         MFLD  COL6609,                                                +        
               LTH=8                                                            
         MFLD  COL7509,                                                +        
               LTH=4                                                            
         MFLD  COL0210,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0510,                                                +        
               LTH=4                                                            
         MFLD  COL1010,                                                +        
               LTH=6                                                            
         MFLD  COL1710,                                                +        
               LTH=2                                                            
         MFLD  COL2010,                                                +        
               LTH=5                                                            
         MFLD  COL2610,                                                +        
               LTH=1                                                            
         MFLD  COL2810,                                                +        
               LTH=7                                                            
         MFLD  COL3610,                                                +        
               LTH=5                                                            
         MFLD  COL4210,                                                +        
               LTH=5                                                            
         MFLD  COL4810,                                                +        
               LTH=5                                                            
         MFLD  COL5410,                                                +        
               LTH=5                                                            
         MFLD  COL6010,                                                +        
               LTH=5                                                            
         MFLD  COL6610,                                                +        
               LTH=8                                                            
         MFLD  COL7510,                                                +        
               LTH=4                                                            
         MFLD  COL0211,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0511,                                                +        
               LTH=4                                                            
         MFLD  COL1011,                                                +        
               LTH=6                                                            
         MFLD  COL1711,                                                +        
               LTH=2                                                            
         MFLD  COL2011,                                                +        
               LTH=5                                                            
         MFLD  COL2611,                                                +        
               LTH=1                                                            
         MFLD  COL2811,                                                +        
               LTH=7                                                            
         MFLD  COL3611,                                                +        
               LTH=5                                                            
         MFLD  COL4211,                                                +        
               LTH=5                                                            
         MFLD  COL4811,                                                +        
               LTH=5                                                            
         MFLD  COL5411,                                                +        
               LTH=5                                                            
         MFLD  COL6011,                                                +        
               LTH=5                                                            
         MFLD  COL6611,                                                +        
               LTH=8                                                            
         MFLD  COL7511,                                                +        
               LTH=4                                                            
         MFLD  COL0212,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0512,                                                +        
               LTH=4                                                            
         MFLD  COL1012,                                                +        
               LTH=6                                                            
         MFLD  COL1712,                                                +        
               LTH=2                                                            
         MFLD  COL2012,                                                +        
               LTH=5                                                            
         MFLD  COL2612,                                                +        
               LTH=1                                                            
         MFLD  COL2812,                                                +        
               LTH=7                                                            
         MFLD  COL3612,                                                +        
               LTH=5                                                            
         MFLD  COL4212,                                                +        
               LTH=5                                                            
         MFLD  COL4812,                                                +        
               LTH=5                                                            
         MFLD  COL5412,                                                +        
               LTH=5                                                            
         MFLD  COL6012,                                                +        
               LTH=5                                                            
         MFLD  COL6612,                                                +        
               LTH=8                                                            
         MFLD  COL7512,                                                +        
               LTH=4                                                            
         MFLD  COL0213,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0513,                                                +        
               LTH=4                                                            
         MFLD  COL1013,                                                +        
               LTH=6                                                            
         MFLD  COL1713,                                                +        
               LTH=2                                                            
         MFLD  COL2013,                                                +        
               LTH=5                                                            
         MFLD  COL2613,                                                +        
               LTH=1                                                            
         MFLD  COL2813,                                                +        
               LTH=7                                                            
         MFLD  COL3613,                                                +        
               LTH=5                                                            
         MFLD  COL4213,                                                +        
               LTH=5                                                            
         MFLD  COL4813,                                                +        
               LTH=5                                                            
         MFLD  COL5413,                                                +        
               LTH=5                                                            
         MFLD  COL6013,                                                +        
               LTH=5                                                            
         MFLD  COL6613,                                                +        
               LTH=8                                                            
         MFLD  COL7513,                                                +        
               LTH=4                                                            
         MFLD  COL0214,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0514,                                                +        
               LTH=4                                                            
         MFLD  COL1014,                                                +        
               LTH=6                                                            
         MFLD  COL1714,                                                +        
               LTH=2                                                            
         MFLD  COL2014,                                                +        
               LTH=5                                                            
         MFLD  COL2614,                                                +        
               LTH=1                                                            
         MFLD  COL2814,                                                +        
               LTH=7                                                            
         MFLD  COL3614,                                                +        
               LTH=5                                                            
         MFLD  COL4214,                                                +        
               LTH=5                                                            
         MFLD  COL4814,                                                +        
               LTH=5                                                            
         MFLD  COL5414,                                                +        
               LTH=5                                                            
         MFLD  COL6014,                                                +        
               LTH=5                                                            
         MFLD  COL6614,                                                +        
               LTH=8                                                            
         MFLD  COL7514,                                                +        
               LTH=4                                                            
         MFLD  COL0215,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0515,                                                +        
               LTH=4                                                            
         MFLD  COL1015,                                                +        
               LTH=6                                                            
         MFLD  COL1715,                                                +        
               LTH=2                                                            
         MFLD  COL2015,                                                +        
               LTH=5                                                            
         MFLD  COL2615,                                                +        
               LTH=1                                                            
         MFLD  COL2815,                                                +        
               LTH=7                                                            
         MFLD  COL3615,                                                +        
               LTH=5                                                            
         MFLD  COL4215,                                                +        
               LTH=5                                                            
         MFLD  COL4815,                                                +        
               LTH=5                                                            
         MFLD  COL5415,                                                +        
               LTH=5                                                            
         MFLD  COL6015,                                                +        
               LTH=5                                                            
         MFLD  COL6615,                                                +        
               LTH=8                                                            
         MFLD  COL7515,                                                +        
               LTH=4                                                            
         MFLD  COL0216,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0516,                                                +        
               LTH=4                                                            
         MFLD  COL1016,                                                +        
               LTH=6                                                            
         MFLD  COL1716,                                                +        
               LTH=2                                                            
         MFLD  COL2016,                                                +        
               LTH=5                                                            
         MFLD  COL2616,                                                +        
               LTH=1                                                            
         MFLD  COL2816,                                                +        
               LTH=7                                                            
         MFLD  COL3616,                                                +        
               LTH=5                                                            
         MFLD  COL4216,                                                +        
               LTH=5                                                            
         MFLD  COL4816,                                                +        
               LTH=5                                                            
         MFLD  COL5416,                                                +        
               LTH=5                                                            
         MFLD  COL6016,                                                +        
               LTH=5                                                            
         MFLD  COL6616,                                                +        
               LTH=8                                                            
         MFLD  COL7516,                                                +        
               LTH=4                                                            
         MFLD  COL0217,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0517,                                                +        
               LTH=4                                                            
         MFLD  COL1017,                                                +        
               LTH=6                                                            
         MFLD  COL1717,                                                +        
               LTH=2                                                            
         MFLD  COL2017,                                                +        
               LTH=5                                                            
         MFLD  COL2617,                                                +        
               LTH=1                                                            
         MFLD  COL2817,                                                +        
               LTH=7                                                            
         MFLD  COL3617,                                                +        
               LTH=5                                                            
         MFLD  COL4217,                                                +        
               LTH=5                                                            
         MFLD  COL4817,                                                +        
               LTH=5                                                            
         MFLD  COL5417,                                                +        
               LTH=5                                                            
         MFLD  COL6017,                                                +        
               LTH=5                                                            
         MFLD  COL6617,                                                +        
               LTH=8                                                            
         MFLD  COL7517,                                                +        
               LTH=4                                                            
         MFLD  COL0218,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0518,                                                +        
               LTH=4                                                            
         MFLD  COL1018,                                                +        
               LTH=6                                                            
         MFLD  COL1718,                                                +        
               LTH=2                                                            
         MFLD  COL2018,                                                +        
               LTH=5                                                            
         MFLD  COL2618,                                                +        
               LTH=1                                                            
         MFLD  COL2818,                                                +        
               LTH=7                                                            
         MFLD  COL3618,                                                +        
               LTH=5                                                            
         MFLD  COL4218,                                                +        
               LTH=5                                                            
         MFLD  COL4818,                                                +        
               LTH=5                                                            
         MFLD  COL5418,                                                +        
               LTH=5                                                            
         MFLD  COL6018,                                                +        
               LTH=5                                                            
         MFLD  COL6618,                                                +        
               LTH=8                                                            
         MFLD  COL7518,                                                +        
               LTH=4                                                            
         MFLD  COL0219,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0519,                                                +        
               LTH=4                                                            
         MFLD  COL1019,                                                +        
               LTH=6                                                            
         MFLD  COL1719,                                                +        
               LTH=2                                                            
         MFLD  COL2019,                                                +        
               LTH=5                                                            
         MFLD  COL2619,                                                +        
               LTH=1                                                            
         MFLD  COL2819,                                                +        
               LTH=7                                                            
         MFLD  COL3619,                                                +        
               LTH=5                                                            
         MFLD  COL4219,                                                +        
               LTH=5                                                            
         MFLD  COL4819,                                                +        
               LTH=5                                                            
         MFLD  COL5419,                                                +        
               LTH=5                                                            
         MFLD  COL6019,                                                +        
               LTH=5                                                            
         MFLD  COL6619,                                                +        
               LTH=8                                                            
         MFLD  COL7519,                                                +        
               LTH=4                                                            
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I61101 MSG   TYPE=INPUT,                                             +        
               SOR=(W4F611),                                           +        
               OPT=2,                                                  +        
               NXT=W4O61101                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '46111',                                                +        
               LTH=5                                                            
         MFLD  (FLD0208,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0308,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0219,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0319,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0230,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0330,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0000,                                              +        
               '++'),                                                  +        
               LTH=2                                                            
         MFLD  DGIA0001,                                               +        
               LTH=2                                                            
         MFLD  FLD0402,                                                +        
               LTH=19                                                           
         MFLD  (FLD0520,                                               +        
               'N'),                                                   +        
               LTH=1                                                            
         MFLD  (COL0207,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  COL0507,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1007,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1707,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2007,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2607,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2807,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7507,                                                +        
               LTH=4                                                            
         MFLD  (COL0208,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  COL0508,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1008,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1708,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2008,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2608,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2808,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7508,                                                +        
               LTH=4                                                            
         MFLD  (COL0209,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  COL0509,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1009,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1709,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2009,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2609,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2809,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7509,                                                +        
               LTH=4                                                            
         MFLD  (COL0210,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  COL0510,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1010,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1710,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2010,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2610,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2810,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7510,                                                +        
               LTH=4                                                            
         MFLD  (COL0211,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  COL0511,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1011,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1711,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2011,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2611,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2811,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7511,                                                +        
               LTH=4                                                            
         MFLD  (COL0212,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  COL0512,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1012,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1712,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2012,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2612,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2812,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7512,                                                +        
               LTH=4                                                            
         MFLD  (COL0213,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  COL0513,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1013,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1713,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2013,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2613,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2813,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7513,                                                +        
               LTH=4                                                            
         MFLD  (COL0214,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  COL0514,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1014,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1714,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2014,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2614,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2814,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7514,                                                +        
               LTH=4                                                            
         MFLD  (COL0215,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  COL0515,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1015,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1715,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2015,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2615,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2815,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7515,                                                +        
               LTH=4                                                            
         MFLD  (COL0216,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  COL0516,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1016,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1716,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2016,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2616,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2816,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7516,                                                +        
               LTH=4                                                            
         MFLD  (COL0217,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  COL0517,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1017,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1717,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2017,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2617,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2817,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7517,                                                +        
               LTH=4                                                            
         MFLD  (COL0218,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  COL0518,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1018,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1718,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2018,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2618,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2818,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7518,                                                +        
               LTH=4                                                            
         MFLD  (COL0219,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  COL0519,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1019,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1719,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2019,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2619,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2819,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7519,                                                +        
               LTH=4                                                            
         MSGEND                                                                 
         END                                                                    
