***********************************************************************         
* CREATED BY PC36149   ON 96/11/15  AT 14:12                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE '                                '                               
W4F703   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W4T703 4',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T703  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T701  ',                                          +        
               14='W4T702  ',                                          +        
               15='W4T703  ',                                          +        
               16='W4T704  ',                                          +        
               17='W4T705  ',                                          +        
               18='W4T706  ',                                          +        
               19='W4T707  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W4T703  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,10)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Listutskrift - Levanm-art',                            +        
               POS=(1,11),LTH=25,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Artikel',                                              +        
               POS=(2,2),LTH=7,                                        +        
               ATTR=(NUM,PROT)                                                  
ARTNRIN  DFLD  POS=(2,10),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DC',                                                   +        
               POS=(2,20),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DCIN     DFLD  POS=(2,23),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
ARTNRUT  DFLD  POS=(3,10),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
DCUT     DFLD  POS=(3,23),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Distrikt:',                                            +        
               POS=(6,2),LTH=9,                                        +        
               ATTR=(PROT)                                                      
DISTRIN  DFLD  POS=(6,12),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Kund',                                                 +        
               POS=(6,18),LTH=4,                                       +        
               ATTR=(PROT)                                                      
KUNDIN   DFLD  POS=(6,23),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Kod',                                                  +        
               POS=(6,31),LTH=3,                                       +        
               ATTR=(PROT)                                                      
KODIN    DFLD  POS=(6,35),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
DISTUT   DFLD  POS=(7,12),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
KUNDUT   DFLD  POS=(7,23),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
KODUT    DFLD  POS=(7,35),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'LISTA (bara ett val)',                                 +        
               POS=(9,2),LTH=20,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '-HISTORIK',                                            +        
               POS=(11,2),LTH=9,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Datum   fom',                                          +        
               POS=(11,33),LTH=11,                                     +        
               ATTR=(PROT)                                                      
DGIA0000 DFLD  POS=(11,45),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'tom',                                                  +        
               POS=(11,54),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0001 DFLD  POS=(11,58),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-SUMMA RULLANDE 12 PERIODER:   Period',                +        
               POS=(13,2),LTH=37,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'tom',                                                  +        
               POS=(13,54),LTH=3,                                      +        
               ATTR=(PROT)                                                      
AAPPINV  DFLD  POS=(13,58),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Printer:',                                             +        
               POS=(16,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
IDNODE   DFLD  POS=(16,11),LTH=8,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  '13 Ansvarig-tab 14 Analysnummer 15 Listutskrift 16 Reg.+        
                Levanm  17 Reg. Int.upp',                              +        
               POS=(20,2),LTH=79,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18 Tidsgränser  19 Styrparamet. 20',                   +        
               POS=(21,2),LTH=34,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(21,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(21,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(22,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(22,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(22,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(22,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(23,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4O70301 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4F703,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I70301,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  ARTNRIN,                                                +        
               LTH=9                                                            
         MFLD  ARTNRUT,                                                +        
               LTH=9                                                            
         MFLD  DCIN,                                                   +        
               LTH=2                                                            
         MFLD  DCUT,                                                   +        
               LTH=2                                                            
         MFLD  DISTRIN,                                                +        
               LTH=4                                                            
         MFLD  DISTUT,                                                 +        
               LTH=4                                                            
         MFLD  KUNDIN,                                                 +        
               LTH=6                                                            
         MFLD  KUNDUT,                                                 +        
               LTH=6                                                            
         MFLD  KODIN,                                                  +        
               LTH=2                                                            
         MFLD  KODUT,                                                  +        
               LTH=2                                                            
         MFLD  DGIA0000,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0001,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AAPPINV,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDNODE,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  FSYSMSG,                                                +        
               LTH=1                                                            
         MSGEND                                                                 
W4I70301 MSG   TYPE=INPUT,                                             +        
               SOR=(W4F703),                                           +        
               OPT=2,                                                  +        
               NXT=W4O70301                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F7'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '47031',                                                +        
               LTH=5                                                            
         MFLD  (ARTNRIN,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  ARTNRUT,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (DCIN,                                                  +        
               '++'),                                                  +        
               LTH=2                                                            
         MFLD  DCUT,                                                   +        
               LTH=2                                                            
         MFLD  (DISTRIN,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DISTUT,                                                 +        
               LTH=4                                                            
         MFLD  (KUNDIN,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KUNDUT,                                                 +        
               LTH=6                                                            
         MFLD  (KODIN,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KODUT,                                                  +        
               LTH=2                                                            
         MFLD  (DGIA0000,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0001,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AAPPINV,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDNODE,                                                +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
