***********************************************************************         
* CREATED BY PC22543   ON 95/12/06  AT 15:14                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'REG. MOTT. RETURER - CDC        '                               
W4F733   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T733U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T731  ',                                          +        
               14='W4T732  ',                                          +        
               15='W4T733  ',                                          +        
               16='W4T734  ',                                          +        
               17='W4T735  ',                                          +        
               18='W4T736  ',                                          +        
               19='W4T737  ',                                          +        
               20='W4T738  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W4T733U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W4F733   DPAGE CURSOR=((2,8)),                                         +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'REGISTRERA SÄNDNING',                                  +        
               POS=(1,11),LTH=19,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Sändn',                                                +        
               POS=(2,2),LTH=5,                                        +        
               ATTR=(NUM,PROT)                                                  
IDRETSNI DFLD  POS=(2,8),LTH=6,                                        +        
               ATTR=(NOPROT)                                                    
IDRETSNU DFLD  POS=(3,8),LTH=6,                                        +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Ny sändn:',                                            +        
               POS=(5,2),LTH=9,                                        +        
               ATTR=(PROT)                                                      
FLNYSND  DFLD  POS=(5,12),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Ant kolli  Anstnr',                                    +        
               POS=(5,14),LTH=17,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Plac',                                                 +        
               POS=(5,37),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Fraktsedel',                                           +        
               POS=(5,47),LTH=10,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Godsmott:',                                            +        
               POS=(6,3),LTH=9,                                        +        
               ATTR=(PROT)                                                      
KVKOLLIL DFLD  POS=(6,14),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
KVKOLLUL DFLD  POS=(6,19),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
IDANSTIL DFLD  POS=(6,25),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
IDANSTUL DFLD  POS=(6,31),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
ADINLOIL DFLD  POS=(6,37),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
ADINLOUL DFLD  POS=(6,42),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
IDFRASIL DFLD  POS=(6,47),LTH=15,                                      +        
               ATTR=(NOPROT)                                                    
IDFRASUL DFLD  POS=(6,63),LTH=15,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Returen:',                                             +        
               POS=(7,3),LTH=8,                                        +        
               ATTR=(PROT)                                                      
KVKOLLIM DFLD  POS=(7,14),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
KVKOLLUM DFLD  POS=(7,19),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
IDANSTIM DFLD  POS=(7,25),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
IDANSTUM DFLD  POS=(7,31),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
ADINLOIM DFLD  POS=(7,37),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
ADINLOUM DFLD  POS=(7,42),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
IDFRASIM DFLD  POS=(7,47),LTH=15,                                      +        
               ATTR=(NOPROT)                                                    
IDFRASUM DFLD  POS=(7,63),LTH=15,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Kolli-innehåll (returen):',                            +        
               POS=(9,2),LTH=25,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Kollinr',                                              +        
               POS=(10,3),LTH=7,                                       +        
               ATTR=(PROT)                                                      
IDKOLLI  DFLD  POS=(10,11),LTH=5,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Distr',                                                +        
               POS=(10,18),LTH=5,                                      +        
               ATTR=(PROT)                                                      
IDDISTR  DFLD  POS=(10,24),LTH=4,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Kolli from',                                           +        
               POS=(10,41),LTH=10,                                     +        
               ATTR=(PROT)                                                      
KOLLIFOM DFLD  POS=(10,52),LTH=5,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'tom',                                                  +        
               POS=(10,58),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
KOLLITOM DFLD  POS=(10,62),LTH=5,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Kund   Rappnr  Ant åf-kli   Fraktsedel',               +        
               POS=(11,2),LTH=38,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Kommentar',                                            +        
               POS=(11,48),LTH=9,                                      +        
               ATTR=(PROT)                                                      
KUND1    DFLD  POS=(12,2),LTH=6,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
RAPP1    DFLD  POS=(12,9),LTH=7,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
ANT1     DFLD  POS=(12,24),LTH=4,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FRAKT1   DFLD  POS=(12,30),LTH=15,                                     +        
               ATTR=(NOPROT)                                                    
KOM1     DFLD  POS=(12,48),LTH=20,                                     +        
               ATTR=(NOPROT)                                                    
KUND2    DFLD  POS=(13,2),LTH=6,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
RAPP2    DFLD  POS=(13,9),LTH=7,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
ANT2     DFLD  POS=(13,24),LTH=4,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FRAKT2   DFLD  POS=(13,30),LTH=15,                                     +        
               ATTR=(NOPROT)                                                    
KOM2     DFLD  POS=(13,48),LTH=20,                                     +        
               ATTR=(NOPROT)                                                    
KUND3    DFLD  POS=(14,2),LTH=6,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
RAPP3    DFLD  POS=(14,9),LTH=7,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
ANT3     DFLD  POS=(14,24),LTH=4,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FRAKT3   DFLD  POS=(14,30),LTH=15,                                     +        
               ATTR=(NOPROT)                                                    
KOM3     DFLD  POS=(14,48),LTH=20,                                     +        
               ATTR=(NOPROT)                                                    
KUND4    DFLD  POS=(15,2),LTH=6,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
RAPP4    DFLD  POS=(15,9),LTH=7,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
ANT4     DFLD  POS=(15,24),LTH=4,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FRAKT4   DFLD  POS=(15,30),LTH=15,                                     +        
               ATTR=(NOPROT)                                                    
KOM4     DFLD  POS=(15,48),LTH=20,                                     +        
               ATTR=(NOPROT)                                                    
KUND5    DFLD  POS=(16,2),LTH=6,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
RAPP5    DFLD  POS=(16,9),LTH=7,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
ANT5     DFLD  POS=(16,24),LTH=4,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FRAKT5   DFLD  POS=(16,30),LTH=15,                                     +        
               ATTR=(NOPROT)                                                    
KOM5     DFLD  POS=(16,48),LTH=20,                                     +        
               ATTR=(NOPROT)                                                    
KUND6    DFLD  POS=(17,2),LTH=6,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
RAPP6    DFLD  POS=(17,9),LTH=7,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
ANT6     DFLD  POS=(17,24),LTH=4,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FRAKT6   DFLD  POS=(17,30),LTH=15,                                     +        
               ATTR=(NOPROT)                                                    
KOM6     DFLD  POS=(17,48),LTH=20,                                     +        
               ATTR=(NOPROT)                                                    
KUND7    DFLD  POS=(18,2),LTH=6,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
RAPP7    DFLD  POS=(18,9),LTH=7,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
ANT7     DFLD  POS=(18,24),LTH=4,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FRAKT7   DFLD  POS=(18,30),LTH=15,                                     +        
               ATTR=(NOPROT)                                                    
KOM7     DFLD  POS=(18,48),LTH=20,                                     +        
               ATTR=(NOPROT)                                                    
KUND8    DFLD  POS=(19,2),LTH=6,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
RAPP8    DFLD  POS=(19,9),LTH=7,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
ANT8     DFLD  POS=(19,24),LTH=4,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FRAKT8   DFLD  POS=(19,30),LTH=15,                                     +        
               ATTR=(NOPROT)                                                    
KOM8     DFLD  POS=(19,48),LTH=20,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  '13 Visa sändnkö 14 Visa sändning  15 Reg sändning 16 Vi+        
               sa kollikö 17 Visa kolli',                              +        
               POS=(21,2),LTH=79,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18 Visa RT-kö   19 Visa RT',                           +        
               POS=(22,2),LTH=26,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20 Rapp ilista  21',                                   +        
               POS=(22,36),LTH=18,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '10 whelp',                                             +        
               POS=(22,68),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4O73301 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4F733,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I73301,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W4F733                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDRETSNI,                                               +        
               LTH=6                                                            
         MFLD  IDRETSNU,                                               +        
               LTH=6                                                            
         MFLD  KVKOLLUL,                                               +        
               LTH=4                                                            
         MFLD  IDANSTUL,                                               +        
               LTH=5                                                            
         MFLD  ADINLOUL,                                               +        
               LTH=4                                                            
         MFLD  IDFRASUL,                                               +        
               LTH=15                                                           
         MFLD  KVKOLLUM,                                               +        
               LTH=4                                                            
         MFLD  IDANSTUM,                                               +        
               LTH=5                                                            
         MFLD  ADINLOUM,                                               +        
               LTH=4                                                            
         MFLD  IDFRASUM,                                               +        
               LTH=15                                                           
         MFLD  FLNYSND,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVKOLLIL,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDANSTIL,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ADINLOIL,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDFRASIL,                                               +        
               LTH=17,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVKOLLIM,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDANSTIM,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ADINLOIM,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDFRASIM,                                               +        
               LTH=17,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDKOLLI,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDDISTR,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLIFOM,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLITOM,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KUND1,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RAPP1,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANT1,                                                   +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FRAKT1,                                                 +        
               LTH=17,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KOM1,                                                   +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KUND2,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RAPP2,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANT2,                                                   +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FRAKT2,                                                 +        
               LTH=17,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KOM2,                                                   +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KUND3,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RAPP3,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANT3,                                                   +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FRAKT3,                                                 +        
               LTH=17,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KOM3,                                                   +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KUND4,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RAPP4,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANT4,                                                   +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FRAKT4,                                                 +        
               LTH=17,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KOM4,                                                   +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KUND5,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RAPP5,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANT5,                                                   +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FRAKT5,                                                 +        
               LTH=17,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KOM5,                                                   +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KUND6,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RAPP6,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANT6,                                                   +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FRAKT6,                                                 +        
               LTH=17,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KOM6,                                                   +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KUND7,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RAPP7,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANT7,                                                   +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FRAKT7,                                                 +        
               LTH=17,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KOM7,                                                   +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KUND8,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RAPP8,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANT8,                                                   +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FRAKT8,                                                 +        
               LTH=17,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KOM8,                                                   +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I73301 MSG   TYPE=INPUT,                                             +        
               SOR=(W4F733),                                           +        
               OPT=2,                                                  +        
               NXT=W4O73301                                                     
MID      LPAGE SOR=(W4F733)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F7'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '47331',                                                +        
               LTH=5                                                            
         MFLD  (IDRETSNI,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDRETSNU,                                               +        
               LTH=6                                                            
         MFLD  (FLNYSND,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (KVKOLLIL,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDANSTIL,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ADINLOIL,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (IDFRASIL,                                              +        
               '+++++++++++++++'),                                     +        
               LTH=15                                                           
         MFLD  (KVKOLLIM,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDANSTIM,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ADINLOIM,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (IDFRASIM,                                              +        
               '+++++++++++++++'),                                     +        
               LTH=15                                                           
         MFLD  (IDKOLLI,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDDISTR,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOLLIFOM,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOLLITOM,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KUND1,                                                 +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RAPP1,                                                 +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANT1,                                                  +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FRAKT1,                                                +        
               '+++++++++++++++'),                                     +        
               LTH=15                                                           
         MFLD  (KOM1,                                                  +        
               '++++++++++++++++++++'),                                +        
               LTH=20                                                           
         MFLD  (KUND2,                                                 +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RAPP2,                                                 +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANT2,                                                  +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FRAKT2,                                                +        
               '+++++++++++++++'),                                     +        
               LTH=15                                                           
         MFLD  (KOM2,                                                  +        
               '++++++++++++++++++++'),                                +        
               LTH=20                                                           
         MFLD  (KUND3,                                                 +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RAPP3,                                                 +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANT3,                                                  +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FRAKT3,                                                +        
               '+++++++++++++++'),                                     +        
               LTH=15                                                           
         MFLD  (KOM3,                                                  +        
               '++++++++++++++++++++'),                                +        
               LTH=20                                                           
         MFLD  (KUND4,                                                 +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RAPP4,                                                 +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANT4,                                                  +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FRAKT4,                                                +        
               '+++++++++++++++'),                                     +        
               LTH=15                                                           
         MFLD  (KOM4,                                                  +        
               '++++++++++++++++++++'),                                +        
               LTH=20                                                           
         MFLD  (KUND5,                                                 +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RAPP5,                                                 +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANT5,                                                  +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FRAKT5,                                                +        
               '+++++++++++++++'),                                     +        
               LTH=15                                                           
         MFLD  (KOM5,                                                  +        
               '++++++++++++++++++++'),                                +        
               LTH=20                                                           
         MFLD  (KUND6,                                                 +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RAPP6,                                                 +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANT6,                                                  +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FRAKT6,                                                +        
               '+++++++++++++++'),                                     +        
               LTH=15                                                           
         MFLD  (KOM6,                                                  +        
               '++++++++++++++++++++'),                                +        
               LTH=20                                                           
         MFLD  (KUND7,                                                 +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RAPP7,                                                 +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANT7,                                                  +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FRAKT7,                                                +        
               '+++++++++++++++'),                                     +        
               LTH=15                                                           
         MFLD  (KOM7,                                                  +        
               '++++++++++++++++++++'),                                +        
               LTH=20                                                           
         MFLD  (KUND8,                                                 +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RAPP8,                                                 +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANT8,                                                  +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FRAKT8,                                                +        
               '+++++++++++++++'),                                     +        
               LTH=15                                                           
         MFLD  (KOM8,                                                  +        
               '++++++++++++++++++++'),                                +        
               LTH=20                                                           
         MSGEND                                                                 
         END                                                                    
