***********************************************************************         
* CREATED BY PCC4448   ON 95/08/04  AT 12:48                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'LASTNINGSRELEASE - RETURTERM    '                               
W4F743   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W4T743 7',                                           +        
               8='W4T743 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T743U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T741  ',                                          +        
               14='W4T742  ',                                          +        
               15='W4T743  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W4T743U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W4F743   DPAGE CURSOR=((2,10)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'LASTNINGSRELEASE',                                     +        
               POS=(1,11),LTH=16,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Sändnnr',                                              +        
               POS=(2,2),LTH=7,                                        +        
               ATTR=(ALPHA,PROT)                                                
DGIA0003 DFLD  POS=(2,10),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Visa sändningsinnehåll',                               +        
               POS=(2,15),LTH=22,                                      +        
               ATTR=(PROT)                                                      
FLVISAI  DFLD  POS=(2,38),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0004 DFLD  POS=(3,10),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
FLVISAU  DFLD  POS=(3,38),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
IDDCSPAR DFLD  POS=(4,4),LTH=2,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
IDRTSPAR DFLD  POS=(4,8),LTH=3,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
IDRTLOPS DFLD  POS=(4,13),LTH=3,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
IDKOLLIS DFLD  POS=(4,18),LTH=5,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
DAREGDAT DFLD  POS=(4,25),LTH=8,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
TIKLOCK  DFLD  POS=(4,35),LTH=8,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'Nytt sändnnr (J)',                                     +        
               POS=(5,2),LTH=16,                                       +        
               ATTR=(PROT)                                                      
DGIA0000 DFLD  POS=(5,19),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Åtg   Kolli  Farligt gods',                            +        
               POS=(6,3),LTH=25,                                       +        
               ATTR=(PROT)                                                      
KDCMD1   DFLD  POS=(7,4),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
IDKOLLI1 DFLD  POS=(7,9),LTH=5,                                        +        
               ATTR=(PROT,MOD)                                                  
FLFARL1  DFLD  POS=(7,16),LTH=1,                                       +        
               ATTR=(PROT)                                                      
KDCMD2   DFLD  POS=(8,4),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
IDKOLLI2 DFLD  POS=(8,9),LTH=5,                                        +        
               ATTR=(PROT,MOD)                                                  
FLFARL2  DFLD  POS=(8,16),LTH=1,                                       +        
               ATTR=(PROT)                                                      
KDCMD3   DFLD  POS=(9,4),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
IDKOLLI3 DFLD  POS=(9,9),LTH=5,                                        +        
               ATTR=(PROT,MOD)                                                  
FLFARL3  DFLD  POS=(9,16),LTH=1,                                       +        
               ATTR=(PROT)                                                      
KDCMD4   DFLD  POS=(10,4),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
IDKOLLI4 DFLD  POS=(10,9),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
FLFARL4  DFLD  POS=(10,16),LTH=1,                                      +        
               ATTR=(PROT)                                                      
KDCMD5   DFLD  POS=(11,4),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
IDKOLLI5 DFLD  POS=(11,9),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
FLFARL5  DFLD  POS=(11,16),LTH=1,                                      +        
               ATTR=(PROT)                                                      
KDCMD6   DFLD  POS=(12,4),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
IDKOLLI6 DFLD  POS=(12,9),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
FLFARL6  DFLD  POS=(12,16),LTH=1,                                      +        
               ATTR=(PROT)                                                      
KDCMD7   DFLD  POS=(13,4),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
IDKOLLI7 DFLD  POS=(13,9),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
FLFARL7  DFLD  POS=(13,16),LTH=1,                                      +        
               ATTR=(PROT)                                                      
KDCMD8   DFLD  POS=(14,4),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
IDKOLLI8 DFLD  POS=(14,9),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
FLFARL8  DFLD  POS=(14,16),LTH=1,                                      +        
               ATTR=(PROT)                                                      
KDCMD9   DFLD  POS=(15,4),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
IDKOLLI9 DFLD  POS=(15,9),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
FLFARL9  DFLD  POS=(15,16),LTH=1,                                      +        
               ATTR=(PROT)                                                      
KDCMD10  DFLD  POS=(16,4),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0001 DFLD  POS=(16,9),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
FLFARL10 DFLD  POS=(16,16),LTH=1,                                      +        
               ATTR=(PROT)                                                      
KDCMD11  DFLD  POS=(17,4),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0002 DFLD  POS=(17,9),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
FLFARL11 DFLD  POS=(17,16),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Sändningsdokument (J):',                               +        
               POS=(19,2),LTH=22,                                      +        
               ATTR=(PROT)                                                      
FLSAND   DFLD  POS=(19,25),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  '13 Reg returer  14 Skapa/fyll kli 15 Last release 16', +        
               POS=(21,2),LTH=52,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,68),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,36),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,52),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 whelp',                                             +        
               POS=(22,68),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W4O74301 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4F743,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I74301,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W4F743                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  DGIA0003,                                               +        
               LTH=3                                                            
         MFLD  FLVISAI,                                                +        
               LTH=1                                                            
         MFLD  DGIA0004,                                               +        
               LTH=3                                                            
         MFLD  FLVISAU,                                                +        
               LTH=1                                                            
         MFLD  IDDCSPAR,                                               +        
               LTH=2                                                            
         MFLD  IDRTSPAR,                                               +        
               LTH=3                                                            
         MFLD  IDRTLOPS,                                               +        
               LTH=3                                                            
         MFLD  IDKOLLIS,                                               +        
               LTH=5                                                            
         MFLD  DAREGDAT,                                               +        
               LTH=8                                                            
         MFLD  TIKLOCK,                                                +        
               LTH=8                                                            
         MFLD  DGIA0000,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDCMD1,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDKOLLI1,                                               +        
               LTH=5                                                            
         MFLD  FLFARL1,                                                +        
               LTH=1                                                            
         MFLD  KDCMD2,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDKOLLI2,                                               +        
               LTH=5                                                            
         MFLD  FLFARL2,                                                +        
               LTH=1                                                            
         MFLD  KDCMD3,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDKOLLI3,                                               +        
               LTH=5                                                            
         MFLD  FLFARL3,                                                +        
               LTH=1                                                            
         MFLD  KDCMD4,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDKOLLI4,                                               +        
               LTH=5                                                            
         MFLD  FLFARL4,                                                +        
               LTH=1                                                            
         MFLD  KDCMD5,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDKOLLI5,                                               +        
               LTH=5                                                            
         MFLD  FLFARL5,                                                +        
               LTH=1                                                            
         MFLD  KDCMD6,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDKOLLI6,                                               +        
               LTH=5                                                            
         MFLD  FLFARL6,                                                +        
               LTH=1                                                            
         MFLD  KDCMD7,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDKOLLI7,                                               +        
               LTH=5                                                            
         MFLD  FLFARL7,                                                +        
               LTH=1                                                            
         MFLD  KDCMD8,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDKOLLI8,                                               +        
               LTH=5                                                            
         MFLD  FLFARL8,                                                +        
               LTH=1                                                            
         MFLD  KDCMD9,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDKOLLI9,                                               +        
               LTH=5                                                            
         MFLD  FLFARL9,                                                +        
               LTH=1                                                            
         MFLD  KDCMD10,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0001,                                               +        
               LTH=5                                                            
         MFLD  FLFARL10,                                               +        
               LTH=1                                                            
         MFLD  KDCMD11,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0002,                                               +        
               LTH=5                                                            
         MFLD  FLFARL11,                                               +        
               LTH=1                                                            
         MFLD  FLSAND,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I74301 MSG   TYPE=INPUT,                                             +        
               SOR=(W4F743),                                           +        
               OPT=2,                                                  +        
               NXT=W4O74301                                                     
MID      LPAGE SOR=(W4F743)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F7'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '47431',                                                +        
               LTH=5                                                            
         MFLD  (DGIA0003,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0004,                                               +        
               LTH=3                                                            
         MFLD  (FLVISAI,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  FLVISAU,                                                +        
               LTH=1                                                            
         MFLD  (IDDCSPAR,                                              +        
               '++'),                                                  +        
               LTH=2                                                            
         MFLD  (IDRTSPAR,                                              +        
               '+++'),                                                 +        
               LTH=3                                                            
         MFLD  (IDRTLOPS,                                              +        
               '+++'),                                                 +        
               LTH=3                                                            
         MFLD  (IDKOLLIS,                                              +        
               '+++++'),                                               +        
               LTH=5                                                            
         MFLD  (DAREGDAT,                                              +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (TIKLOCK,                                               +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (DGIA0000,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (KDCMD1,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (KDCMD2,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (KDCMD3,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (KDCMD4,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (KDCMD5,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (KDCMD6,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (KDCMD7,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (KDCMD8,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (KDCMD9,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (KDCMD10,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (KDCMD11,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (FLSAND,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  IDKOLLI1,                                               +        
               LTH=5                                                            
         MFLD  IDKOLLI2,                                               +        
               LTH=5                                                            
         MFLD  IDKOLLI3,                                               +        
               LTH=5                                                            
         MFLD  IDKOLLI4,                                               +        
               LTH=5                                                            
         MFLD  IDKOLLI5,                                               +        
               LTH=5                                                            
         MFLD  IDKOLLI6,                                               +        
               LTH=5                                                            
         MFLD  IDKOLLI7,                                               +        
               LTH=5                                                            
         MFLD  IDKOLLI8,                                               +        
               LTH=5                                                            
         MFLD  IDKOLLI9,                                               +        
               LTH=5                                                            
         MFLD  DGIA0001,                                               +        
               LTH=5                                                            
         MFLD  DGIA0002,                                               +        
               LTH=5                                                            
         MSGEND                                                                 
         END                                                                    
