***********************************************************************         
* CREATED BY PC70375   ON 98/03/24  AT 10:00                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'KREDITERAT - LEVANM.            '                               
W4F726   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W4F726   DPAGE CURSOR=((2,16)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'FRÅGA KREDITNOTA',                                     +        
               POS=(1,11),LTH=16,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Kreditnotsnr.',                                        +        
               POS=(2,2),LTH=13,                                       +        
               ATTR=(ALPHA,PROT)                                                
DGIA0000 DFLD  POS=(2,16),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0001 DFLD  POS=(3,16),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Levanm.',                                              +        
               POS=(6,28),LTH=7,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Åtg  Distr   Kund  Rappnr  datum',                     +        
               POS=(7,2),LTH=32,                                       +        
               ATTR=(PROT)                                                      
KDCMD1   DFLD  POS=(8,2),LTH=4,                                        +        
               ATTR=(NOPROT)                                                    
DISTR1   DFLD  POS=(8,7),LTH=4,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
KUND1    DFLD  POS=(8,13),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
RAPPNR1  DFLD  POS=(8,20),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
TILEV1   DFLD  POS=(8,28),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KDCMD2   DFLD  POS=(9,2),LTH=4,                                        +        
               ATTR=(NOPROT)                                                    
DISTR2   DFLD  POS=(9,7),LTH=4,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
KUND2    DFLD  POS=(9,13),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
RAPPNR2  DFLD  POS=(9,20),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
TILEV2   DFLD  POS=(9,28),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KDCMD3   DFLD  POS=(10,2),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
DISTR3   DFLD  POS=(10,7),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KUND3    DFLD  POS=(10,13),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
RAPPNR3  DFLD  POS=(10,20),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
TILEV3   DFLD  POS=(10,28),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KDCMD4   DFLD  POS=(11,2),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
DISTR4   DFLD  POS=(11,7),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KUND4    DFLD  POS=(11,13),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
RAPPNR4  DFLD  POS=(11,20),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
TILEV4   DFLD  POS=(11,28),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  '13',                                                   +        
               POS=(21,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '14',                                                   +        
               POS=(21,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '15',                                                   +        
               POS=(21,36),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16',                                                   +        
               POS=(21,52),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,68),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,36),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,52),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 Whelp',                                             +        
               POS=(22,68),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4O72601 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4F726,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I72601,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W4F726                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  DGIA0000,                                               +        
               LTH=7                                                            
         MFLD  DGIA0001,                                               +        
               LTH=7                                                            
         MFLD  KDCMD1,                                                 +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DISTR1,                                                 +        
               LTH=4                                                            
         MFLD  KUND1,                                                  +        
               LTH=6                                                            
         MFLD  RAPPNR1,                                                +        
               LTH=7                                                            
         MFLD  TILEV1,                                                 +        
               LTH=6                                                            
         MFLD  KDCMD2,                                                 +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DISTR2,                                                 +        
               LTH=4                                                            
         MFLD  KUND2,                                                  +        
               LTH=6                                                            
         MFLD  RAPPNR2,                                                +        
               LTH=7                                                            
         MFLD  TILEV2,                                                 +        
               LTH=6                                                            
         MFLD  KDCMD3,                                                 +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DISTR3,                                                 +        
               LTH=4                                                            
         MFLD  KUND3,                                                  +        
               LTH=6                                                            
         MFLD  RAPPNR3,                                                +        
               LTH=7                                                            
         MFLD  TILEV3,                                                 +        
               LTH=6                                                            
         MFLD  KDCMD4,                                                 +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DISTR4,                                                 +        
               LTH=4                                                            
         MFLD  KUND4,                                                  +        
               LTH=6                                                            
         MFLD  RAPPNR4,                                                +        
               LTH=7                                                            
         MFLD  TILEV4,                                                 +        
               LTH=6                                                            
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I72601 MSG   TYPE=INPUT,                                             +        
               SOR=(W4F726),                                           +        
               OPT=2,                                                  +        
               NXT=W4O72601                                                     
MID      LPAGE SOR=(W4F726)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F7'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '47261',                                                +        
               LTH=5                                                            
         MFLD  (DGIA0000,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0001,                                               +        
               LTH=7                                                            
         MFLD  (KDCMD1,                                                +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDCMD2,                                                +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDCMD3,                                                +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDCMD4,                                                +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DISTR1,                                                 +        
               LTH=4                                                            
         MFLD  KUND1,                                                  +        
               LTH=6                                                            
         MFLD  RAPPNR1,                                                +        
               LTH=7                                                            
         MFLD  DISTR2,                                                 +        
               LTH=4                                                            
         MFLD  KUND2,                                                  +        
               LTH=6                                                            
         MFLD  RAPPNR2,                                                +        
               LTH=7                                                            
         MFLD  DISTR3,                                                 +        
               LTH=4                                                            
         MFLD  KUND3,                                                  +        
               LTH=6                                                            
         MFLD  RAPPNR3,                                                +        
               LTH=7                                                            
         MFLD  DISTR4,                                                 +        
               LTH=4                                                            
         MFLD  KUND4,                                                  +        
               LTH=6                                                            
         MFLD  RAPPNR4,                                                +        
               LTH=7                                                            
         MSGEND                                                                 
         END                                                                    
