***********************************************************************         
* CREATED BY PC70375   ON 98/09/25  AT 08:17                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'VISA RETURTILLSTÅNDSKÖ          '                               
W4F744   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W4T744 7',                                           +        
               8='W4T744 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T744U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T741  ',                                          +        
               14='W4T742  ',                                          +        
               15='W4T743  ',                                          +        
               16='W4T744  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W4T744U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W4F744   DPAGE CURSOR=((2,7)),                                         +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'VISA RETURTILLSTÅNDSKÖ',                               +        
               POS=(1,11),LTH=22,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Ansv',                                                 +        
               POS=(2,2),LTH=4,                                        +        
               ATTR=(ALPHA,PROT)                                                
IDANSVI  DFLD  POS=(2,7),LTH=6,                                        +        
               ATTR=(NOPROT)                                                    
         DFLD  'Distr',                                                +        
               POS=(2,14),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
IDDISTRI DFLD  POS=(2,20),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Kund',                                                 +        
               POS=(2,26),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0002 DFLD  POS=(2,31),LTH=6,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Status',                                               +        
               POS=(2,39),LTH=6,                                       +        
               ATTR=(PROT)                                                      
DGIA0028 DFLD  POS=(2,46),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Summera kö',                                           +        
               POS=(2,49),LTH=10,                                      +        
               ATTR=(PROT)                                                      
FLSUMI   DFLD  POS=(2,60),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
IDANSVU  DFLD  POS=(3,7),LTH=6,                                        +        
               ATTR=(PROT,MOD)                                                  
IDDISTRU DFLD  POS=(3,20),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0003 DFLD  POS=(3,31),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0029 DFLD  POS=(3,46),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
FLSUMU   DFLD  POS=(3,60),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Antal RT',                                             +        
               POS=(5,2),LTH=8,                                        +        
               ATTR=(PROT)                                                      
KVRT     DFLD  POS=(5,11),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Antal RT-rader',                                       +        
               POS=(5,18),LTH=14,                                      +        
               ATTR=(PROT)                                                      
KVRTRAD  DFLD  POS=(5,33),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Ansv',                                                 +        
               POS=(7,6),LTH=4,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'Term Sändn. TR  TR-reg TR-sänd',                       +        
               POS=(7,19),LTH=30,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Ant',                                                  +        
               POS=(7,70),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Ant',                                                  +        
               POS=(7,77),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Åtg RET Sändnnr datum datum  Id  datum  datum',        +        
               POS=(8,2),LTH=45,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Distr   Kund  Rappnr rad åf-kli',                      +        
               POS=(8,49),LTH=31,                                      +        
               ATTR=(PROT)                                                      
KDCMD1   DFLD  POS=(9,3),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
IDANSV1  DFLD  POS=(9,6),LTH=3,                                        +        
               ATTR=(PROT)                                                      
IDSNDNR1 DFLD  POS=(9,10),LTH=6,                                       +        
               ATTR=(PROT)                                                      
DGIA0032 DFLD  POS=(9,17),LTH=6,                                       +        
               ATTR=(PROT)                                                      
TISNDN1  DFLD  POS=(9,24),LTH=6,                                       +        
               ATTR=(PROT)                                                      
IDRTTR1  DFLD  POS=(9,31),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
TIREGTR1 DFLD  POS=(9,35),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
TISHITR1 DFLD  POS=(9,42),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
IDDISTR1 DFLD  POS=(9,50),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0004 DFLD  POS=(9,55),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0015 DFLD  POS=(9,62),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
KVRAD1   DFLD  POS=(9,70),LTH=5,                                       +        
               ATTR=(PROT)                                                      
KVKLIAF1 DFLD  POS=(9,76),LTH=4,                                       +        
               ATTR=(PROT)                                                      
KDCMD2   DFLD  POS=(10,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
IDANSV2  DFLD  POS=(10,6),LTH=3,                                       +        
               ATTR=(PROT)                                                      
IDSNDNR2 DFLD  POS=(10,10),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0033 DFLD  POS=(10,17),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TISNDN2  DFLD  POS=(10,24),LTH=6,                                      +        
               ATTR=(PROT)                                                      
IDRTTR2  DFLD  POS=(10,31),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
TIREGTR2 DFLD  POS=(10,35),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
TISHITR2 DFLD  POS=(10,42),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
IDDISTR2 DFLD  POS=(10,50),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0005 DFLD  POS=(10,55),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0016 DFLD  POS=(10,62),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
KVRAD2   DFLD  POS=(10,70),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVKLIAF2 DFLD  POS=(10,76),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KDCMD3   DFLD  POS=(11,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
IDANSV3  DFLD  POS=(11,6),LTH=3,                                       +        
               ATTR=(PROT)                                                      
IDSNDNR3 DFLD  POS=(11,10),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0034 DFLD  POS=(11,17),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TISNDN3  DFLD  POS=(11,24),LTH=6,                                      +        
               ATTR=(PROT)                                                      
IDRTTR3  DFLD  POS=(11,31),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
TIREGTR3 DFLD  POS=(11,35),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
TISHITR3 DFLD  POS=(11,42),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
IDDISTR3 DFLD  POS=(11,50),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0006 DFLD  POS=(11,55),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0017 DFLD  POS=(11,62),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
KVRAD3   DFLD  POS=(11,70),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVKLIAF3 DFLD  POS=(11,76),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KDCMD4   DFLD  POS=(12,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
IDANSV4  DFLD  POS=(12,6),LTH=3,                                       +        
               ATTR=(PROT)                                                      
IDSNDNR4 DFLD  POS=(12,10),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0035 DFLD  POS=(12,17),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TISNDN4  DFLD  POS=(12,24),LTH=6,                                      +        
               ATTR=(PROT)                                                      
IDRTTR4  DFLD  POS=(12,31),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
TIREGTR4 DFLD  POS=(12,35),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
TISHITR4 DFLD  POS=(12,42),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
IDDISTR4 DFLD  POS=(12,50),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0007 DFLD  POS=(12,55),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0018 DFLD  POS=(12,62),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
KVRAD4   DFLD  POS=(12,70),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVKLIAF4 DFLD  POS=(12,76),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KDCMD5   DFLD  POS=(13,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
IDANSV5  DFLD  POS=(13,6),LTH=3,                                       +        
               ATTR=(PROT)                                                      
IDSNDNR5 DFLD  POS=(13,10),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0036 DFLD  POS=(13,17),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TISNDN5  DFLD  POS=(13,24),LTH=6,                                      +        
               ATTR=(PROT)                                                      
IDRTTR5  DFLD  POS=(13,31),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
TIREGTR5 DFLD  POS=(13,35),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
TISHITR5 DFLD  POS=(13,42),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
IDDISTR5 DFLD  POS=(13,50),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0008 DFLD  POS=(13,55),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0019 DFLD  POS=(13,62),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
KVRAD5   DFLD  POS=(13,70),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVKLIAF5 DFLD  POS=(13,76),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KDCMD6   DFLD  POS=(14,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
IDANSV6  DFLD  POS=(14,6),LTH=3,                                       +        
               ATTR=(PROT)                                                      
IDSNDNR6 DFLD  POS=(14,10),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0037 DFLD  POS=(14,17),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TISNDN6  DFLD  POS=(14,24),LTH=6,                                      +        
               ATTR=(PROT)                                                      
IDRTTR6  DFLD  POS=(14,31),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
TIREGTR6 DFLD  POS=(14,35),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
TISHITR6 DFLD  POS=(14,42),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
IDDISTR6 DFLD  POS=(14,50),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0009 DFLD  POS=(14,55),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0020 DFLD  POS=(14,62),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
KVRAD6   DFLD  POS=(14,70),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVKLIAF6 DFLD  POS=(14,76),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KDCMD7   DFLD  POS=(15,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
IDANSV7  DFLD  POS=(15,6),LTH=3,                                       +        
               ATTR=(PROT)                                                      
IDSNDNR7 DFLD  POS=(15,10),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0038 DFLD  POS=(15,17),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TISNDN7  DFLD  POS=(15,24),LTH=6,                                      +        
               ATTR=(PROT)                                                      
IDRTTR7  DFLD  POS=(15,31),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
TIREGTR7 DFLD  POS=(15,35),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
TISHITR7 DFLD  POS=(15,42),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
IDDISTR7 DFLD  POS=(15,50),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0010 DFLD  POS=(15,55),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0021 DFLD  POS=(15,62),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
KVRAD7   DFLD  POS=(15,70),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVKLIAF7 DFLD  POS=(15,76),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KDCMD8   DFLD  POS=(16,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
IDANSV8  DFLD  POS=(16,6),LTH=3,                                       +        
               ATTR=(PROT)                                                      
IDSNDNR8 DFLD  POS=(16,10),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0039 DFLD  POS=(16,17),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TISNDN8  DFLD  POS=(16,24),LTH=6,                                      +        
               ATTR=(PROT)                                                      
IDRTTR8  DFLD  POS=(16,31),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
TIREGTR8 DFLD  POS=(16,35),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
TISHITR8 DFLD  POS=(16,42),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
IDDISTR8 DFLD  POS=(16,50),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0011 DFLD  POS=(16,55),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0022 DFLD  POS=(16,62),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
KVRAD8   DFLD  POS=(16,70),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVKLIAF8 DFLD  POS=(16,76),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KDCMD9   DFLD  POS=(17,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
IDANSV9  DFLD  POS=(17,6),LTH=3,                                       +        
               ATTR=(PROT)                                                      
IDSNDNR9 DFLD  POS=(17,10),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0040 DFLD  POS=(17,17),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TISNDN9  DFLD  POS=(17,24),LTH=6,                                      +        
               ATTR=(PROT)                                                      
IDRTTR9  DFLD  POS=(17,31),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
TIREGTR9 DFLD  POS=(17,35),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
TISHITR9 DFLD  POS=(17,42),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
IDDISTR9 DFLD  POS=(17,50),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0012 DFLD  POS=(17,55),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0023 DFLD  POS=(17,62),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
KVRAD9   DFLD  POS=(17,70),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVKLIAF9 DFLD  POS=(17,76),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KDCMD10  DFLD  POS=(18,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
IDANS10  DFLD  POS=(18,6),LTH=3,                                       +        
               ATTR=(PROT)                                                      
DGIA0026 DFLD  POS=(18,10),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0041 DFLD  POS=(18,17),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TISNDN10 DFLD  POS=(18,24),LTH=6,                                      +        
               ATTR=(PROT)                                                      
IDRTTR10 DFLD  POS=(18,31),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
TIREGT10 DFLD  POS=(18,35),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
TISHIT10 DFLD  POS=(18,42),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0000 DFLD  POS=(18,50),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0013 DFLD  POS=(18,55),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0024 DFLD  POS=(18,62),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
KVRAD10  DFLD  POS=(18,70),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0030 DFLD  POS=(18,76),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KDCMD11  DFLD  POS=(19,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
IDANS11  DFLD  POS=(19,6),LTH=3,                                       +        
               ATTR=(PROT)                                                      
DGIA0027 DFLD  POS=(19,10),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0042 DFLD  POS=(19,17),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TISNDN11 DFLD  POS=(19,24),LTH=6,                                      +        
               ATTR=(PROT)                                                      
IDRTTR11 DFLD  POS=(19,31),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
TIREGT11 DFLD  POS=(19,35),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
TISHIT11 DFLD  POS=(19,42),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0001 DFLD  POS=(19,50),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0014 DFLD  POS=(19,55),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0025 DFLD  POS=(19,62),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
KVRAD11  DFLD  POS=(19,70),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0031 DFLD  POS=(19,76),LTH=4,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '13 Reg returer  14 Skapa/fyll kli 15 Last release 16 Vi+        
               sa RT-kö   17',                                         +        
               POS=(21,2),LTH=68,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,36),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,52),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 whelp',                                             +        
               POS=(22,68),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(23,59),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4O74401 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4F744,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I74401,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W4F744                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDANSVI,                                                +        
               LTH=6                                                            
         MFLD  IDDISTRI,                                               +        
               LTH=4                                                            
         MFLD  DGIA0002,                                               +        
               LTH=6                                                            
         MFLD  DGIA0028,                                               +        
               LTH=1                                                            
         MFLD  FLSUMI,                                                 +        
               LTH=1                                                            
         MFLD  IDANSVU,                                                +        
               LTH=6                                                            
         MFLD  IDDISTRU,                                               +        
               LTH=4                                                            
         MFLD  DGIA0003,                                               +        
               LTH=6                                                            
         MFLD  DGIA0029,                                               +        
               LTH=1                                                            
         MFLD  FLSUMU,                                                 +        
               LTH=1                                                            
         MFLD  KVRT,                                                   +        
               LTH=5                                                            
         MFLD  KVRTRAD,                                                +        
               LTH=5                                                            
         MFLD  KDCMD1,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDANSV1,                                                +        
               LTH=3                                                            
         MFLD  IDSNDNR1,                                               +        
               LTH=6                                                            
         MFLD  DGIA0032,                                               +        
               LTH=6                                                            
         MFLD  TISNDN1,                                                +        
               LTH=6                                                            
         MFLD  IDRTTR1,                                                +        
               LTH=3                                                            
         MFLD  TIREGTR1,                                               +        
               LTH=6                                                            
         MFLD  TISHITR1,                                               +        
               LTH=6                                                            
         MFLD  IDDISTR1,                                               +        
               LTH=4                                                            
         MFLD  DGIA0004,                                               +        
               LTH=6                                                            
         MFLD  DGIA0015,                                               +        
               LTH=7                                                            
         MFLD  KVRAD1,                                                 +        
               LTH=5                                                            
         MFLD  KVKLIAF1,                                               +        
               LTH=4                                                            
         MFLD  KDCMD2,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDANSV2,                                                +        
               LTH=3                                                            
         MFLD  IDSNDNR2,                                               +        
               LTH=6                                                            
         MFLD  DGIA0033,                                               +        
               LTH=6                                                            
         MFLD  TISNDN2,                                                +        
               LTH=6                                                            
         MFLD  IDRTTR2,                                                +        
               LTH=3                                                            
         MFLD  TIREGTR2,                                               +        
               LTH=6                                                            
         MFLD  TISHITR2,                                               +        
               LTH=6                                                            
         MFLD  IDDISTR2,                                               +        
               LTH=4                                                            
         MFLD  DGIA0005,                                               +        
               LTH=6                                                            
         MFLD  DGIA0016,                                               +        
               LTH=7                                                            
         MFLD  KVRAD2,                                                 +        
               LTH=5                                                            
         MFLD  KVKLIAF2,                                               +        
               LTH=4                                                            
         MFLD  KDCMD3,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDANSV3,                                                +        
               LTH=3                                                            
         MFLD  IDSNDNR3,                                               +        
               LTH=6                                                            
         MFLD  DGIA0034,                                               +        
               LTH=6                                                            
         MFLD  TISNDN3,                                                +        
               LTH=6                                                            
         MFLD  IDRTTR3,                                                +        
               LTH=3                                                            
         MFLD  TIREGTR3,                                               +        
               LTH=6                                                            
         MFLD  TISHITR3,                                               +        
               LTH=6                                                            
         MFLD  IDDISTR3,                                               +        
               LTH=4                                                            
         MFLD  DGIA0006,                                               +        
               LTH=6                                                            
         MFLD  DGIA0017,                                               +        
               LTH=7                                                            
         MFLD  KVRAD3,                                                 +        
               LTH=5                                                            
         MFLD  KVKLIAF3,                                               +        
               LTH=4                                                            
         MFLD  KDCMD4,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDANSV4,                                                +        
               LTH=3                                                            
         MFLD  IDSNDNR4,                                               +        
               LTH=6                                                            
         MFLD  DGIA0035,                                               +        
               LTH=6                                                            
         MFLD  TISNDN4,                                                +        
               LTH=6                                                            
         MFLD  IDRTTR4,                                                +        
               LTH=3                                                            
         MFLD  TIREGTR4,                                               +        
               LTH=6                                                            
         MFLD  TISHITR4,                                               +        
               LTH=6                                                            
         MFLD  IDDISTR4,                                               +        
               LTH=4                                                            
         MFLD  DGIA0007,                                               +        
               LTH=6                                                            
         MFLD  DGIA0018,                                               +        
               LTH=7                                                            
         MFLD  KVRAD4,                                                 +        
               LTH=5                                                            
         MFLD  KVKLIAF4,                                               +        
               LTH=4                                                            
         MFLD  KDCMD5,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDANSV5,                                                +        
               LTH=3                                                            
         MFLD  IDSNDNR5,                                               +        
               LTH=6                                                            
         MFLD  DGIA0036,                                               +        
               LTH=6                                                            
         MFLD  TISNDN5,                                                +        
               LTH=6                                                            
         MFLD  IDRTTR5,                                                +        
               LTH=3                                                            
         MFLD  TIREGTR5,                                               +        
               LTH=6                                                            
         MFLD  TISHITR5,                                               +        
               LTH=6                                                            
         MFLD  IDDISTR5,                                               +        
               LTH=4                                                            
         MFLD  DGIA0008,                                               +        
               LTH=6                                                            
         MFLD  DGIA0019,                                               +        
               LTH=7                                                            
         MFLD  KVRAD5,                                                 +        
               LTH=5                                                            
         MFLD  KVKLIAF5,                                               +        
               LTH=4                                                            
         MFLD  KDCMD6,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDANSV6,                                                +        
               LTH=3                                                            
         MFLD  IDSNDNR6,                                               +        
               LTH=6                                                            
         MFLD  DGIA0037,                                               +        
               LTH=6                                                            
         MFLD  TISNDN6,                                                +        
               LTH=6                                                            
         MFLD  IDRTTR6,                                                +        
               LTH=3                                                            
         MFLD  TIREGTR6,                                               +        
               LTH=6                                                            
         MFLD  TISHITR6,                                               +        
               LTH=6                                                            
         MFLD  IDDISTR6,                                               +        
               LTH=4                                                            
         MFLD  DGIA0009,                                               +        
               LTH=6                                                            
         MFLD  DGIA0020,                                               +        
               LTH=7                                                            
         MFLD  KVRAD6,                                                 +        
               LTH=5                                                            
         MFLD  KVKLIAF6,                                               +        
               LTH=4                                                            
         MFLD  KDCMD7,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDANSV7,                                                +        
               LTH=3                                                            
         MFLD  IDSNDNR7,                                               +        
               LTH=6                                                            
         MFLD  DGIA0038,                                               +        
               LTH=6                                                            
         MFLD  TISNDN7,                                                +        
               LTH=6                                                            
         MFLD  IDRTTR7,                                                +        
               LTH=3                                                            
         MFLD  TIREGTR7,                                               +        
               LTH=6                                                            
         MFLD  TISHITR7,                                               +        
               LTH=6                                                            
         MFLD  IDDISTR7,                                               +        
               LTH=4                                                            
         MFLD  DGIA0010,                                               +        
               LTH=6                                                            
         MFLD  DGIA0021,                                               +        
               LTH=7                                                            
         MFLD  KVRAD7,                                                 +        
               LTH=5                                                            
         MFLD  KVKLIAF7,                                               +        
               LTH=4                                                            
         MFLD  KDCMD8,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDANSV8,                                                +        
               LTH=3                                                            
         MFLD  IDSNDNR8,                                               +        
               LTH=6                                                            
         MFLD  DGIA0039,                                               +        
               LTH=6                                                            
         MFLD  TISNDN8,                                                +        
               LTH=6                                                            
         MFLD  IDRTTR8,                                                +        
               LTH=3                                                            
         MFLD  TIREGTR8,                                               +        
               LTH=6                                                            
         MFLD  TISHITR8,                                               +        
               LTH=6                                                            
         MFLD  IDDISTR8,                                               +        
               LTH=4                                                            
         MFLD  DGIA0011,                                               +        
               LTH=6                                                            
         MFLD  DGIA0022,                                               +        
               LTH=7                                                            
         MFLD  KVRAD8,                                                 +        
               LTH=5                                                            
         MFLD  KVKLIAF8,                                               +        
               LTH=4                                                            
         MFLD  KDCMD9,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDANSV9,                                                +        
               LTH=3                                                            
         MFLD  IDSNDNR9,                                               +        
               LTH=6                                                            
         MFLD  DGIA0040,                                               +        
               LTH=6                                                            
         MFLD  TISNDN9,                                                +        
               LTH=6                                                            
         MFLD  IDRTTR9,                                                +        
               LTH=3                                                            
         MFLD  TIREGTR9,                                               +        
               LTH=6                                                            
         MFLD  TISHITR9,                                               +        
               LTH=6                                                            
         MFLD  IDDISTR9,                                               +        
               LTH=4                                                            
         MFLD  DGIA0012,                                               +        
               LTH=6                                                            
         MFLD  DGIA0023,                                               +        
               LTH=7                                                            
         MFLD  KVRAD9,                                                 +        
               LTH=5                                                            
         MFLD  KVKLIAF9,                                               +        
               LTH=4                                                            
         MFLD  KDCMD10,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDANS10,                                                +        
               LTH=3                                                            
         MFLD  DGIA0026,                                               +        
               LTH=6                                                            
         MFLD  DGIA0041,                                               +        
               LTH=6                                                            
         MFLD  TISNDN10,                                               +        
               LTH=6                                                            
         MFLD  IDRTTR10,                                               +        
               LTH=3                                                            
         MFLD  TIREGT10,                                               +        
               LTH=6                                                            
         MFLD  TISHIT10,                                               +        
               LTH=6                                                            
         MFLD  DGIA0000,                                               +        
               LTH=4                                                            
         MFLD  DGIA0013,                                               +        
               LTH=6                                                            
         MFLD  DGIA0024,                                               +        
               LTH=7                                                            
         MFLD  KVRAD10,                                                +        
               LTH=5                                                            
         MFLD  DGIA0030,                                               +        
               LTH=4                                                            
         MFLD  KDCMD11,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDANS11,                                                +        
               LTH=3                                                            
         MFLD  DGIA0027,                                               +        
               LTH=6                                                            
         MFLD  DGIA0042,                                               +        
               LTH=6                                                            
         MFLD  TISNDN11,                                               +        
               LTH=6                                                            
         MFLD  IDRTTR11,                                               +        
               LTH=3                                                            
         MFLD  TIREGT11,                                               +        
               LTH=6                                                            
         MFLD  TISHIT11,                                               +        
               LTH=6                                                            
         MFLD  DGIA0001,                                               +        
               LTH=4                                                            
         MFLD  DGIA0014,                                               +        
               LTH=6                                                            
         MFLD  DGIA0025,                                               +        
               LTH=7                                                            
         MFLD  KVRAD11,                                                +        
               LTH=5                                                            
         MFLD  DGIA0031,                                               +        
               LTH=4                                                            
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I74401 MSG   TYPE=INPUT,                                             +        
               SOR=(W4F744),                                           +        
               OPT=2,                                                  +        
               NXT=W4O74401                                                     
MID      LPAGE SOR=(W4F744)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F7'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '47441',                                                +        
               LTH=5                                                            
         MFLD  (IDANSVI,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  IDANSVU,                                                +        
               LTH=6                                                            
         MFLD  (IDDISTRI,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDDISTRU,                                               +        
               LTH=4                                                            
         MFLD  (DGIA0002,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0003,                                               +        
               LTH=6                                                            
         MFLD  (DGIA0028,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  DGIA0029,                                               +        
               LTH=1                                                            
         MFLD  (FLSUMI,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  FLSUMU,                                                 +        
               LTH=1                                                            
         MFLD  (KDCMD1,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (KDCMD2,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (KDCMD3,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (KDCMD4,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (KDCMD5,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (KDCMD6,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (KDCMD7,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (KDCMD8,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (KDCMD9,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (KDCMD10,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (KDCMD11,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  IDDISTR1,                                               +        
               LTH=4                                                            
         MFLD  DGIA0004,                                               +        
               LTH=6                                                            
         MFLD  DGIA0015,                                               +        
               LTH=7                                                            
         MFLD  IDDISTR2,                                               +        
               LTH=4                                                            
         MFLD  DGIA0005,                                               +        
               LTH=6                                                            
         MFLD  DGIA0016,                                               +        
               LTH=7                                                            
         MFLD  IDDISTR3,                                               +        
               LTH=4                                                            
         MFLD  DGIA0006,                                               +        
               LTH=6                                                            
         MFLD  DGIA0017,                                               +        
               LTH=7                                                            
         MFLD  IDDISTR4,                                               +        
               LTH=4                                                            
         MFLD  DGIA0007,                                               +        
               LTH=6                                                            
         MFLD  DGIA0018,                                               +        
               LTH=7                                                            
         MFLD  IDDISTR5,                                               +        
               LTH=4                                                            
         MFLD  DGIA0008,                                               +        
               LTH=6                                                            
         MFLD  DGIA0019,                                               +        
               LTH=7                                                            
         MFLD  IDDISTR6,                                               +        
               LTH=4                                                            
         MFLD  DGIA0009,                                               +        
               LTH=6                                                            
         MFLD  DGIA0020,                                               +        
               LTH=7                                                            
         MFLD  IDDISTR7,                                               +        
               LTH=4                                                            
         MFLD  DGIA0010,                                               +        
               LTH=6                                                            
         MFLD  DGIA0021,                                               +        
               LTH=7                                                            
         MFLD  IDDISTR8,                                               +        
               LTH=4                                                            
         MFLD  DGIA0011,                                               +        
               LTH=6                                                            
         MFLD  DGIA0022,                                               +        
               LTH=7                                                            
         MFLD  IDDISTR9,                                               +        
               LTH=4                                                            
         MFLD  DGIA0012,                                               +        
               LTH=6                                                            
         MFLD  DGIA0023,                                               +        
               LTH=7                                                            
         MFLD  DGIA0000,                                               +        
               LTH=4                                                            
         MFLD  DGIA0013,                                               +        
               LTH=6                                                            
         MFLD  DGIA0024,                                               +        
               LTH=7                                                            
         MFLD  DGIA0001,                                               +        
               LTH=4                                                            
         MFLD  DGIA0014,                                               +        
               LTH=6                                                            
         MFLD  DGIA0025,                                               +        
               LTH=7                                                            
         MSGEND                                                                 
         END                                                                    
