***********************************************************************         
* CREATED BY PC59009   ON 98/10/07  AT 16:23                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'ANALYSNR.REG.                   '                               
W4F702   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W4T702 7',                                           +        
               8='W4T702 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T702U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T701  ',                                          +        
               14='W4T702  ',                                          +        
               15='W4T703  ',                                          +        
               16='W4T704  ',                                          +        
               17='W4T705  ',                                          +        
               18='W4T706  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W4T702V ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W4F702   DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Analysnummer',                                         +        
               POS=(1,11),LTH=12,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Artikelnr',                                            +        
               POS=(2,2),LTH=9,                                        +        
               ATTR=(ALPHA,PROT)                                                
DGIA0002 DFLD  POS=(2,12),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Ftg',                                                  +        
               POS=(2,23),LTH=3,                                       +        
               ATTR=(PROT)                                                      
FTGIN    DFLD  POS=(2,27),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0003 DFLD  POS=(3,12),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
FTGUT    DFLD  POS=(3,27),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0000 DFLD  POS=(4,2),LTH=9,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0004 DFLD  POS=(4,12),LTH=6,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
KDANENTE DFLD  POS=(4,19),LTH=2,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0001 DFLD  POS=(4,23),LTH=9,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0006 DFLD  POS=(4,33),LTH=6,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
KDANNEXT DFLD  POS=(4,40),LTH=2,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
         DFLD  'D a t u m',                                            +        
               POS=(5,14),LTH=9,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Antal',                                                +        
               POS=(5,72),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Artikelnr Fr.o.m  T.o.m Fg Kd   Analysnr',             +        
               POS=(6,2),LTH=40,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Kontonr Kost Ställ Ref    art',                        +        
               POS=(6,48),LTH=29,                                      +        
               ATTR=(PROT)                                                      
ARTIKE01 DFLD  POS=(7,2),LTH=9,                                        +        
               ATTR=(PROT)                                                      
DATFRO01 DFLD  POS=(7,12),LTH=6,                                       +        
               ATTR=(PROT)                                                      
DATTOM01 DFLD  POS=(7,19),LTH=6,                                       +        
               ATTR=(PROT)                                                      
IDFTG01  DFLD  POS=(7,26),LTH=2,                                       +        
               ATTR=(PROT)                                                      
KDANM01  DFLD  POS=(7,29),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDANAL01 DFLD  POS=(7,32),LTH=12,                                      +        
               ATTR=(PROT)                                                      
IDKONT01 DFLD  POS=(7,45),LTH=10,                                      +        
               ATTR=(PROT)                                                      
IDKST01  DFLD  POS=(7,56),LTH=10,                                      +        
               ATTR=(PROT)                                                      
REF01    DFLD  POS=(7,67),LTH=2,                                       +        
               ATTR=(PROT)                                                      
KVART01  DFLD  POS=(7,70),LTH=7,                                       +        
               ATTR=(PROT)                                                      
ARTIKE02 DFLD  POS=(8,2),LTH=9,                                        +        
               ATTR=(PROT)                                                      
DATFRO02 DFLD  POS=(8,12),LTH=6,                                       +        
               ATTR=(PROT)                                                      
DATTOM02 DFLD  POS=(8,19),LTH=6,                                       +        
               ATTR=(PROT)                                                      
IDFTG02  DFLD  POS=(8,26),LTH=2,                                       +        
               ATTR=(PROT)                                                      
KDANM02  DFLD  POS=(8,29),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDANAL02 DFLD  POS=(8,32),LTH=12,                                      +        
               ATTR=(PROT)                                                      
IDKONT02 DFLD  POS=(8,45),LTH=10,                                      +        
               ATTR=(PROT)                                                      
IDKST02  DFLD  POS=(8,56),LTH=10,                                      +        
               ATTR=(PROT)                                                      
REF02    DFLD  POS=(8,67),LTH=2,                                       +        
               ATTR=(PROT)                                                      
KVART02  DFLD  POS=(8,70),LTH=7,                                       +        
               ATTR=(PROT)                                                      
ARTIKE03 DFLD  POS=(9,2),LTH=9,                                        +        
               ATTR=(PROT)                                                      
DATFRO03 DFLD  POS=(9,12),LTH=6,                                       +        
               ATTR=(PROT)                                                      
DATTOM03 DFLD  POS=(9,19),LTH=6,                                       +        
               ATTR=(PROT)                                                      
IDFTG03  DFLD  POS=(9,26),LTH=2,                                       +        
               ATTR=(PROT)                                                      
KDANM03  DFLD  POS=(9,29),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDANAL03 DFLD  POS=(9,32),LTH=12,                                      +        
               ATTR=(PROT)                                                      
IDKONT03 DFLD  POS=(9,45),LTH=10,                                      +        
               ATTR=(PROT)                                                      
IDKST03  DFLD  POS=(9,56),LTH=10,                                      +        
               ATTR=(PROT)                                                      
REF03    DFLD  POS=(9,67),LTH=2,                                       +        
               ATTR=(PROT)                                                      
KVART03  DFLD  POS=(9,70),LTH=7,                                       +        
               ATTR=(PROT)                                                      
ARTIKE04 DFLD  POS=(10,2),LTH=9,                                       +        
               ATTR=(PROT)                                                      
DATFRO04 DFLD  POS=(10,12),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DATTOM04 DFLD  POS=(10,19),LTH=6,                                      +        
               ATTR=(PROT)                                                      
IDFTG04  DFLD  POS=(10,26),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KDANM04  DFLD  POS=(10,29),LTH=2,                                      +        
               ATTR=(PROT)                                                      
IDANAL04 DFLD  POS=(10,32),LTH=12,                                     +        
               ATTR=(PROT)                                                      
IDKONT04 DFLD  POS=(10,45),LTH=10,                                     +        
               ATTR=(PROT)                                                      
IDKST04  DFLD  POS=(10,56),LTH=10,                                     +        
               ATTR=(PROT)                                                      
REF04    DFLD  POS=(10,67),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KVART04  DFLD  POS=(10,70),LTH=7,                                      +        
               ATTR=(PROT)                                                      
ARTIKE05 DFLD  POS=(11,2),LTH=9,                                       +        
               ATTR=(PROT)                                                      
DATFRO05 DFLD  POS=(11,12),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DATTOM05 DFLD  POS=(11,19),LTH=6,                                      +        
               ATTR=(PROT)                                                      
IDFTG05  DFLD  POS=(11,26),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KDANM05  DFLD  POS=(11,29),LTH=2,                                      +        
               ATTR=(PROT)                                                      
IDANAL05 DFLD  POS=(11,32),LTH=12,                                     +        
               ATTR=(PROT)                                                      
IDKONT05 DFLD  POS=(11,45),LTH=10,                                     +        
               ATTR=(PROT)                                                      
IDKST05  DFLD  POS=(11,56),LTH=10,                                     +        
               ATTR=(PROT)                                                      
REF05    DFLD  POS=(11,67),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KVART05  DFLD  POS=(11,70),LTH=7,                                      +        
               ATTR=(PROT)                                                      
ARTIKE06 DFLD  POS=(12,2),LTH=9,                                       +        
               ATTR=(PROT)                                                      
DATFRO06 DFLD  POS=(12,12),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DATTOM06 DFLD  POS=(12,19),LTH=6,                                      +        
               ATTR=(PROT)                                                      
IDFTG06  DFLD  POS=(12,26),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KDANM06  DFLD  POS=(12,29),LTH=2,                                      +        
               ATTR=(PROT)                                                      
IDANAL06 DFLD  POS=(12,32),LTH=12,                                     +        
               ATTR=(PROT)                                                      
IDKONT06 DFLD  POS=(12,45),LTH=10,                                     +        
               ATTR=(PROT)                                                      
IDKST06  DFLD  POS=(12,56),LTH=10,                                     +        
               ATTR=(PROT)                                                      
REF06    DFLD  POS=(12,67),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KVART06  DFLD  POS=(12,70),LTH=7,                                      +        
               ATTR=(PROT)                                                      
ARTIKE07 DFLD  POS=(13,2),LTH=9,                                       +        
               ATTR=(PROT)                                                      
DATFRO07 DFLD  POS=(13,12),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DATTOM07 DFLD  POS=(13,19),LTH=6,                                      +        
               ATTR=(PROT)                                                      
IDFTG07  DFLD  POS=(13,26),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KDANM07  DFLD  POS=(13,29),LTH=2,                                      +        
               ATTR=(PROT)                                                      
IDANAL07 DFLD  POS=(13,32),LTH=12,                                     +        
               ATTR=(PROT)                                                      
IDKONT07 DFLD  POS=(13,45),LTH=10,                                     +        
               ATTR=(PROT)                                                      
IDKST07  DFLD  POS=(13,56),LTH=10,                                     +        
               ATTR=(PROT)                                                      
REF07    DFLD  POS=(13,67),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KVART07  DFLD  POS=(13,70),LTH=7,                                      +        
               ATTR=(PROT)                                                      
ARTIKE08 DFLD  POS=(14,2),LTH=9,                                       +        
               ATTR=(PROT)                                                      
DATFRO08 DFLD  POS=(14,12),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DATTOM08 DFLD  POS=(14,19),LTH=6,                                      +        
               ATTR=(PROT)                                                      
IDFTG08  DFLD  POS=(14,26),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KDANM08  DFLD  POS=(14,29),LTH=2,                                      +        
               ATTR=(PROT)                                                      
IDANAL08 DFLD  POS=(14,32),LTH=12,                                     +        
               ATTR=(PROT)                                                      
IDKONT08 DFLD  POS=(14,45),LTH=10,                                     +        
               ATTR=(PROT)                                                      
IDKST08  DFLD  POS=(14,56),LTH=10,                                     +        
               ATTR=(PROT)                                                      
REF08    DFLD  POS=(14,67),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KVART08  DFLD  POS=(14,70),LTH=7,                                      +        
               ATTR=(PROT)                                                      
ARTIKE09 DFLD  POS=(15,2),LTH=9,                                       +        
               ATTR=(PROT)                                                      
DATFRO09 DFLD  POS=(15,12),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DATTOM09 DFLD  POS=(15,19),LTH=6,                                      +        
               ATTR=(PROT)                                                      
IDFTG09  DFLD  POS=(15,26),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KDANM09  DFLD  POS=(15,29),LTH=2,                                      +        
               ATTR=(PROT)                                                      
IDANAL09 DFLD  POS=(15,32),LTH=12,                                     +        
               ATTR=(PROT)                                                      
IDKONT09 DFLD  POS=(15,45),LTH=10,                                     +        
               ATTR=(PROT)                                                      
IDKST09  DFLD  POS=(15,56),LTH=10,                                     +        
               ATTR=(PROT)                                                      
REF09    DFLD  POS=(15,67),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KVART09  DFLD  POS=(15,70),LTH=7,                                      +        
               ATTR=(PROT)                                                      
ARTIKE10 DFLD  POS=(16,2),LTH=9,                                       +        
               ATTR=(PROT)                                                      
DATFRO10 DFLD  POS=(16,12),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DATTOM10 DFLD  POS=(16,19),LTH=6,                                      +        
               ATTR=(PROT)                                                      
IDFTG10  DFLD  POS=(16,26),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KDANM10  DFLD  POS=(16,29),LTH=2,                                      +        
               ATTR=(PROT)                                                      
IDANAL10 DFLD  POS=(16,32),LTH=12,                                     +        
               ATTR=(PROT)                                                      
IDKONT10 DFLD  POS=(16,45),LTH=10,                                     +        
               ATTR=(PROT)                                                      
IDKST10  DFLD  POS=(16,56),LTH=10,                                     +        
               ATTR=(PROT)                                                      
REF10    DFLD  POS=(16,67),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KVART10  DFLD  POS=(16,70),LTH=7,                                      +        
               ATTR=(PROT)                                                      
ARTIKE11 DFLD  POS=(17,2),LTH=9,                                       +        
               ATTR=(PROT)                                                      
DATFRO11 DFLD  POS=(17,12),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DATTOM11 DFLD  POS=(17,19),LTH=6,                                      +        
               ATTR=(PROT)                                                      
IDFTG11  DFLD  POS=(17,26),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KDANM11  DFLD  POS=(17,29),LTH=2,                                      +        
               ATTR=(PROT)                                                      
IDANAL11 DFLD  POS=(17,32),LTH=12,                                     +        
               ATTR=(PROT)                                                      
IDKONT11 DFLD  POS=(17,45),LTH=10,                                     +        
               ATTR=(PROT)                                                      
IDKST11  DFLD  POS=(17,56),LTH=10,                                     +        
               ATTR=(PROT)                                                      
REF11    DFLD  POS=(17,67),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KVART11  DFLD  POS=(17,70),LTH=7,                                      +        
               ATTR=(PROT)                                                      
ARTIKEL  DFLD  POS=(19,2),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0005 DFLD  POS=(19,12),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0007 DFLD  POS=(19,19),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
IDFTG    DFLD  POS=(19,26),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
KDANMORS DFLD  POS=(19,29),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
IDANALYS DFLD  POS=(19,32),LTH=12,                                     +        
               ATTR=(NUM,NOPROT)                                                
IDKONTO  DFLD  POS=(19,45),LTH=10,                                     +        
               ATTR=(NUM,NOPROT)                                                
IDKST    DFLD  POS=(19,56),LTH=10,                                     +        
               ATTR=(NUM,NOPROT)                                                
REF      DFLD  POS=(19,67),LTH=2,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Bort?',                                                +        
               POS=(19,70),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLBORT   DFLD  POS=(19,76),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  '13 Ansvarig-tab 14 Analysnummer 15 Listutskrift 16 Reg.+        
                Levanm  17 Reg. Int.upp',                              +        
               POS=(21,2),LTH=79,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18 Tidsgränser  19 Styrparamet. 20',                   +        
               POS=(22,2),LTH=34,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '22 whelp',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(23,59),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W4O70201 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4F702,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I70201,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W4F702                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  DGIA0002,                                               +        
               LTH=9                                                            
         MFLD  FTGIN,                                                  +        
               LTH=2                                                            
         MFLD  DGIA0003,                                               +        
               LTH=9                                                            
         MFLD  FTGUT,                                                  +        
               LTH=2                                                            
         MFLD  DGIA0000,                                               +        
               LTH=9                                                            
         MFLD  DGIA0004,                                               +        
               LTH=6                                                            
         MFLD  KDANENTE,                                               +        
               LTH=2                                                            
         MFLD  DGIA0001,                                               +        
               LTH=9                                                            
         MFLD  DGIA0006,                                               +        
               LTH=6                                                            
         MFLD  KDANNEXT,                                               +        
               LTH=2                                                            
         MFLD  ARTIKE01,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DATFRO01,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DATTOM01,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDFTG01,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDANM01,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDANAL01,                                               +        
               LTH=14,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDKONT01,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDKST01,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  REF01,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVART01,                                                +        
               LTH=7                                                            
         MFLD  ARTIKE02,                                               +        
               LTH=9                                                            
         MFLD  DATFRO02,                                               +        
               LTH=6                                                            
         MFLD  DATTOM02,                                               +        
               LTH=6                                                            
         MFLD  IDFTG02,                                                +        
               LTH=2                                                            
         MFLD  KDANM02,                                                +        
               LTH=2                                                            
         MFLD  IDANAL02,                                               +        
               LTH=12                                                           
         MFLD  IDKONT02,                                               +        
               LTH=10                                                           
         MFLD  IDKST02,                                                +        
               LTH=10                                                           
         MFLD  REF02,                                                  +        
               LTH=2                                                            
         MFLD  KVART02,                                                +        
               LTH=7                                                            
         MFLD  ARTIKE03,                                               +        
               LTH=9                                                            
         MFLD  DATFRO03,                                               +        
               LTH=6                                                            
         MFLD  DATTOM03,                                               +        
               LTH=6                                                            
         MFLD  IDFTG03,                                                +        
               LTH=2                                                            
         MFLD  KDANM03,                                                +        
               LTH=2                                                            
         MFLD  IDANAL03,                                               +        
               LTH=12                                                           
         MFLD  IDKONT03,                                               +        
               LTH=10                                                           
         MFLD  IDKST03,                                                +        
               LTH=10                                                           
         MFLD  REF03,                                                  +        
               LTH=2                                                            
         MFLD  KVART03,                                                +        
               LTH=7                                                            
         MFLD  ARTIKE04,                                               +        
               LTH=9                                                            
         MFLD  DATFRO04,                                               +        
               LTH=6                                                            
         MFLD  DATTOM04,                                               +        
               LTH=6                                                            
         MFLD  IDFTG04,                                                +        
               LTH=2                                                            
         MFLD  KDANM04,                                                +        
               LTH=2                                                            
         MFLD  IDANAL04,                                               +        
               LTH=12                                                           
         MFLD  IDKONT04,                                               +        
               LTH=10                                                           
         MFLD  IDKST04,                                                +        
               LTH=10                                                           
         MFLD  REF04,                                                  +        
               LTH=2                                                            
         MFLD  KVART04,                                                +        
               LTH=7                                                            
         MFLD  ARTIKE05,                                               +        
               LTH=9                                                            
         MFLD  DATFRO05,                                               +        
               LTH=6                                                            
         MFLD  DATTOM05,                                               +        
               LTH=6                                                            
         MFLD  IDFTG05,                                                +        
               LTH=2                                                            
         MFLD  KDANM05,                                                +        
               LTH=2                                                            
         MFLD  IDANAL05,                                               +        
               LTH=12                                                           
         MFLD  IDKONT05,                                               +        
               LTH=10                                                           
         MFLD  IDKST05,                                                +        
               LTH=10                                                           
         MFLD  REF05,                                                  +        
               LTH=2                                                            
         MFLD  KVART05,                                                +        
               LTH=7                                                            
         MFLD  ARTIKE06,                                               +        
               LTH=9                                                            
         MFLD  DATFRO06,                                               +        
               LTH=6                                                            
         MFLD  DATTOM06,                                               +        
               LTH=6                                                            
         MFLD  IDFTG06,                                                +        
               LTH=2                                                            
         MFLD  KDANM06,                                                +        
               LTH=2                                                            
         MFLD  IDANAL06,                                               +        
               LTH=12                                                           
         MFLD  IDKONT06,                                               +        
               LTH=10                                                           
         MFLD  IDKST06,                                                +        
               LTH=10                                                           
         MFLD  REF06,                                                  +        
               LTH=2                                                            
         MFLD  KVART06,                                                +        
               LTH=7                                                            
         MFLD  ARTIKE07,                                               +        
               LTH=9                                                            
         MFLD  DATFRO07,                                               +        
               LTH=6                                                            
         MFLD  DATTOM07,                                               +        
               LTH=6                                                            
         MFLD  IDFTG07,                                                +        
               LTH=2                                                            
         MFLD  KDANM07,                                                +        
               LTH=2                                                            
         MFLD  IDANAL07,                                               +        
               LTH=12                                                           
         MFLD  IDKONT07,                                               +        
               LTH=10                                                           
         MFLD  IDKST07,                                                +        
               LTH=10                                                           
         MFLD  REF07,                                                  +        
               LTH=2                                                            
         MFLD  KVART07,                                                +        
               LTH=7                                                            
         MFLD  ARTIKE08,                                               +        
               LTH=9                                                            
         MFLD  DATFRO08,                                               +        
               LTH=6                                                            
         MFLD  DATTOM08,                                               +        
               LTH=6                                                            
         MFLD  IDFTG08,                                                +        
               LTH=2                                                            
         MFLD  KDANM08,                                                +        
               LTH=2                                                            
         MFLD  IDANAL08,                                               +        
               LTH=12                                                           
         MFLD  IDKONT08,                                               +        
               LTH=10                                                           
         MFLD  IDKST08,                                                +        
               LTH=10                                                           
         MFLD  REF08,                                                  +        
               LTH=2                                                            
         MFLD  KVART08,                                                +        
               LTH=7                                                            
         MFLD  ARTIKE09,                                               +        
               LTH=9                                                            
         MFLD  DATFRO09,                                               +        
               LTH=6                                                            
         MFLD  DATTOM09,                                               +        
               LTH=6                                                            
         MFLD  IDFTG09,                                                +        
               LTH=2                                                            
         MFLD  KDANM09,                                                +        
               LTH=2                                                            
         MFLD  IDANAL09,                                               +        
               LTH=12                                                           
         MFLD  IDKONT09,                                               +        
               LTH=10                                                           
         MFLD  IDKST09,                                                +        
               LTH=10                                                           
         MFLD  REF09,                                                  +        
               LTH=2                                                            
         MFLD  KVART09,                                                +        
               LTH=7                                                            
         MFLD  ARTIKE10,                                               +        
               LTH=9                                                            
         MFLD  DATFRO10,                                               +        
               LTH=6                                                            
         MFLD  DATTOM10,                                               +        
               LTH=6                                                            
         MFLD  IDFTG10,                                                +        
               LTH=2                                                            
         MFLD  KDANM10,                                                +        
               LTH=2                                                            
         MFLD  IDANAL10,                                               +        
               LTH=12                                                           
         MFLD  IDKONT10,                                               +        
               LTH=10                                                           
         MFLD  IDKST10,                                                +        
               LTH=10                                                           
         MFLD  REF10,                                                  +        
               LTH=2                                                            
         MFLD  KVART10,                                                +        
               LTH=7                                                            
         MFLD  ARTIKE11,                                               +        
               LTH=9                                                            
         MFLD  DATFRO11,                                               +        
               LTH=6                                                            
         MFLD  DATTOM11,                                               +        
               LTH=6                                                            
         MFLD  IDFTG11,                                                +        
               LTH=2                                                            
         MFLD  KDANM11,                                                +        
               LTH=2                                                            
         MFLD  IDANAL11,                                               +        
               LTH=12                                                           
         MFLD  IDKONT11,                                               +        
               LTH=10                                                           
         MFLD  IDKST11,                                                +        
               LTH=10                                                           
         MFLD  REF11,                                                  +        
               LTH=2                                                            
         MFLD  KVART11,                                                +        
               LTH=7                                                            
         MFLD  ARTIKEL,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0005,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0007,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDFTG,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDANMORS,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDANALYS,                                               +        
               LTH=14,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDKONTO,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDKST,                                                  +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  REF,                                                    +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLBORT,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I70201 MSG   TYPE=INPUT,                                             +        
               SOR=(W4F702),                                           +        
               OPT=2,                                                  +        
               NXT=W4O70201                                                     
MID      LPAGE SOR=(W4F702)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  (FLD0102,                                               +        
               '4'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  (FLD0104,                                               +        
               '7'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F7'                                                       
         MFLD  (FLD0106,                                               +        
               '0'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0108,                                               +        
               '2'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '47021',                                                +        
               LTH=5                                                            
         MFLD  (DGIA0002,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FTGIN,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0003,                                               +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FTGUT,                                                  +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  DGIA0000,                                               +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  DGIA0004,                                               +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  KDANENTE,                                               +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  DGIA0001,                                               +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  DGIA0006,                                               +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  KDANNEXT,                                               +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (ARTIKEL,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0005,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0007,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDFTG,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDANMORS,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDANALYS,                                              +        
               '++++++++++++'),                                        +        
               LTH=12,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDKONTO,                                               +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDKST,                                                 +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (REF,                                                   +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLBORT,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
