***********************************************************************         
* CREATED BY PCC4448   ON 95/06/15  AT 10:16                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'SKAPA/FYLL PÅ KLI - RETURTERM   '                               
W4F742   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W4T742 7',                                           +        
               8='W4T742 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T742U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T741  ',                                          +        
               14='W4T742  ',                                          +        
               15='W4T743  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W4T742U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W4F742   DPAGE CURSOR=((2,8)),                                         +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'SKAPA/FYLLA PÅ KOLLI',                                 +        
               POS=(1,11),LTH=20,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Kolli',                                                +        
               POS=(2,2),LTH=5,                                        +        
               ATTR=(ALPHA,PROT)                                                
IDKOLLII DFLD  POS=(2,8),LTH=5,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Visa kolliinnehåll',                                   +        
               POS=(2,15),LTH=18,                                      +        
               ATTR=(PROT)                                                      
FLVISAI  DFLD  POS=(2,34),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
IDKOLLIU DFLD  POS=(3,8),LTH=5,                                        +        
               ATTR=(PROT,MOD)                                                  
FLVISAU  DFLD  POS=(3,34),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Nytt kolli (J)',                                       +        
               POS=(5,2),LTH=14,                                       +        
               ATTR=(PROT)                                                      
FLNYKLI  DFLD  POS=(5,18),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
IDKOLLI  DFLD  POS=(5,21),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Antal kolli',                                          +        
               POS=(5,28),LTH=11,                                      +        
               ATTR=(PROT)                                                      
KVKOLLI  DFLD  POS=(5,40),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Kolli fom',                                            +        
               POS=(5,46),LTH=9,                                       +        
               ATTR=(PROT)                                                      
IDKOLLIF DFLD  POS=(5,56),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'tom',                                                  +        
               POS=(5,63),LTH=3,                                       +        
               ATTR=(PROT)                                                      
IDKOLLIT DFLD  POS=(5,67),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Farligt gods i kollit',                                +        
               POS=(6,2),LTH=21,                                       +        
               ATTR=(PROT)                                                      
FLFARLIG DFLD  POS=(6,24),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Åtg   Distr    Kund   Rappnr  Ant åf-kolli  Farligt god+        
               s',                                                     +        
               POS=(7,3),LTH=56,                                       +        
               ATTR=(PROT)                                                      
KDCMD1   DFLD  POS=(8,4),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
IDDIST1  DFLD  POS=(8,10),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
IDKUND1  DFLD  POS=(8,16),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
IDRAPP1  DFLD  POS=(8,24),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
KVKLIA1  DFLD  POS=(8,41),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FLFARL1  DFLD  POS=(8,47),LTH=1,                                       +        
               ATTR=(PROT)                                                      
KDCMD2   DFLD  POS=(9,4),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
IDDIST2  DFLD  POS=(9,10),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
IDKUND2  DFLD  POS=(9,16),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
IDRAPP2  DFLD  POS=(9,24),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
KVKLIA2  DFLD  POS=(9,41),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FLFARL2  DFLD  POS=(9,47),LTH=1,                                       +        
               ATTR=(PROT)                                                      
KDCMD3   DFLD  POS=(10,4),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
IDDIST3  DFLD  POS=(10,10),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
IDKUND3  DFLD  POS=(10,16),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
IDRAPP3  DFLD  POS=(10,24),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
KVKLIA3  DFLD  POS=(10,41),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLFARL3  DFLD  POS=(10,47),LTH=1,                                      +        
               ATTR=(PROT)                                                      
KDCMD4   DFLD  POS=(11,4),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
IDDIST4  DFLD  POS=(11,10),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
IDKUND4  DFLD  POS=(11,16),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
IDRAPP4  DFLD  POS=(11,24),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
KVKLIA4  DFLD  POS=(11,41),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLFARL4  DFLD  POS=(11,47),LTH=1,                                      +        
               ATTR=(PROT)                                                      
KDCMD5   DFLD  POS=(12,4),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
IDDIST5  DFLD  POS=(12,10),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
IDKUND5  DFLD  POS=(12,16),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
IDRAPP5  DFLD  POS=(12,24),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
KVKLIA5  DFLD  POS=(12,41),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLFARL5  DFLD  POS=(12,47),LTH=1,                                      +        
               ATTR=(PROT)                                                      
KDCMD6   DFLD  POS=(13,4),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
IDDIST6  DFLD  POS=(13,10),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
IDKUND6  DFLD  POS=(13,16),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
IDRAPP6  DFLD  POS=(13,24),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
KVKLIA6  DFLD  POS=(13,41),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLFARL6  DFLD  POS=(13,47),LTH=1,                                      +        
               ATTR=(PROT)                                                      
KDCMD7   DFLD  POS=(14,4),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
IDDIST7  DFLD  POS=(14,10),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
IDKUND7  DFLD  POS=(14,16),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
IDRAPP7  DFLD  POS=(14,24),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
KVKLIA7  DFLD  POS=(14,41),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLFARL7  DFLD  POS=(14,47),LTH=1,                                      +        
               ATTR=(PROT)                                                      
KDCMD8   DFLD  POS=(15,4),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
IDDIST8  DFLD  POS=(15,10),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
IDKUND8  DFLD  POS=(15,16),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
IDRAPP8  DFLD  POS=(15,24),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
KVKLIA8  DFLD  POS=(15,41),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLFARL8  DFLD  POS=(15,47),LTH=1,                                      +        
               ATTR=(PROT)                                                      
KDCMD9   DFLD  POS=(16,4),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
IDDIST9  DFLD  POS=(16,10),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
IDKUND9  DFLD  POS=(16,16),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
IDRAPP9  DFLD  POS=(16,24),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
KVKLIA9  DFLD  POS=(16,41),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLFARL9  DFLD  POS=(16,47),LTH=1,                                      +        
               ATTR=(PROT)                                                      
KDCMD10  DFLD  POS=(17,4),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
IDDIST10 DFLD  POS=(17,10),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
IDKUND10 DFLD  POS=(17,16),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
IDRAPP10 DFLD  POS=(17,24),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
KVKLIA10 DFLD  POS=(17,41),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLFARL10 DFLD  POS=(17,47),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Distr',                                                +        
               POS=(19,2),LTH=5,                                       +        
               ATTR=(PROT)                                                      
IDDISTU  DFLD  POS=(19,8),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Kund',                                                 +        
               POS=(19,14),LTH=4,                                      +        
               ATTR=(PROT)                                                      
IDKUNDU  DFLD  POS=(19,19),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Rapportnr',                                            +        
               POS=(19,27),LTH=9,                                      +        
               ATTR=(PROT)                                                      
IDRAPPU  DFLD  POS=(19,37),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '13 Reg returer  14 Skapa/fyll kli 15 Last release 16', +        
               POS=(21,2),LTH=52,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,68),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,36),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,52),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 whelp',                                             +        
               POS=(22,68),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W4O74201 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4F742,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I74201,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W4F742                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDKOLLII,                                               +        
               LTH=5                                                            
         MFLD  FLVISAI,                                                +        
               LTH=1                                                            
         MFLD  IDKOLLIU,                                               +        
               LTH=5                                                            
         MFLD  FLVISAU,                                                +        
               LTH=1                                                            
         MFLD  IDKOLLI,                                                +        
               LTH=5                                                            
         MFLD  IDKOLLIF,                                               +        
               LTH=5                                                            
         MFLD  IDKOLLIT,                                               +        
               LTH=5                                                            
         MFLD  FLFARLIG,                                               +        
               LTH=1                                                            
         MFLD  IDDIST1,                                                +        
               LTH=4                                                            
         MFLD  IDKUND1,                                                +        
               LTH=6                                                            
         MFLD  IDRAPP1,                                                +        
               LTH=7                                                            
         MFLD  KVKLIA1,                                                +        
               LTH=4                                                            
         MFLD  FLFARL1,                                                +        
               LTH=1                                                            
         MFLD  IDDIST2,                                                +        
               LTH=4                                                            
         MFLD  IDKUND2,                                                +        
               LTH=6                                                            
         MFLD  IDRAPP2,                                                +        
               LTH=7                                                            
         MFLD  KVKLIA2,                                                +        
               LTH=4                                                            
         MFLD  FLFARL2,                                                +        
               LTH=1                                                            
         MFLD  IDDIST3,                                                +        
               LTH=4                                                            
         MFLD  IDKUND3,                                                +        
               LTH=6                                                            
         MFLD  IDRAPP3,                                                +        
               LTH=7                                                            
         MFLD  KVKLIA3,                                                +        
               LTH=4                                                            
         MFLD  FLFARL3,                                                +        
               LTH=1                                                            
         MFLD  IDDIST4,                                                +        
               LTH=4                                                            
         MFLD  IDKUND4,                                                +        
               LTH=6                                                            
         MFLD  IDRAPP4,                                                +        
               LTH=7                                                            
         MFLD  KVKLIA4,                                                +        
               LTH=4                                                            
         MFLD  FLFARL4,                                                +        
               LTH=1                                                            
         MFLD  IDDIST5,                                                +        
               LTH=4                                                            
         MFLD  IDKUND5,                                                +        
               LTH=6                                                            
         MFLD  IDRAPP5,                                                +        
               LTH=7                                                            
         MFLD  KVKLIA5,                                                +        
               LTH=4                                                            
         MFLD  FLFARL5,                                                +        
               LTH=1                                                            
         MFLD  IDDIST6,                                                +        
               LTH=4                                                            
         MFLD  IDKUND6,                                                +        
               LTH=6                                                            
         MFLD  IDRAPP6,                                                +        
               LTH=7                                                            
         MFLD  KVKLIA6,                                                +        
               LTH=4                                                            
         MFLD  FLFARL6,                                                +        
               LTH=1                                                            
         MFLD  IDDIST7,                                                +        
               LTH=4                                                            
         MFLD  IDKUND7,                                                +        
               LTH=6                                                            
         MFLD  IDRAPP7,                                                +        
               LTH=7                                                            
         MFLD  KVKLIA7,                                                +        
               LTH=4                                                            
         MFLD  FLFARL7,                                                +        
               LTH=1                                                            
         MFLD  IDDIST8,                                                +        
               LTH=4                                                            
         MFLD  IDKUND8,                                                +        
               LTH=6                                                            
         MFLD  IDRAPP8,                                                +        
               LTH=7                                                            
         MFLD  KVKLIA8,                                                +        
               LTH=4                                                            
         MFLD  FLFARL8,                                                +        
               LTH=1                                                            
         MFLD  IDDIST9,                                                +        
               LTH=4                                                            
         MFLD  IDKUND9,                                                +        
               LTH=6                                                            
         MFLD  IDRAPP9,                                                +        
               LTH=7                                                            
         MFLD  KVKLIA9,                                                +        
               LTH=4                                                            
         MFLD  FLFARL9,                                                +        
               LTH=1                                                            
         MFLD  IDDIST10,                                               +        
               LTH=4                                                            
         MFLD  IDKUND10,                                               +        
               LTH=6                                                            
         MFLD  IDRAPP10,                                               +        
               LTH=7                                                            
         MFLD  KVKLIA10,                                               +        
               LTH=4                                                            
         MFLD  FLFARL10,                                               +        
               LTH=1                                                            
         MFLD  FLNYKLI,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVKOLLI,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDCMD1,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDCMD2,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDCMD3,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDCMD4,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDCMD5,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDCMD6,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDCMD7,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDCMD8,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDCMD9,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDCMD10,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDDISTU,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDKUNDU,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDRAPPU,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I74201 MSG   TYPE=INPUT,                                             +        
               SOR=(W4F742),                                           +        
               OPT=2,                                                  +        
               NXT=W4O74201                                                     
MID      LPAGE SOR=(W4F742)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F7'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '47421',                                                +        
               LTH=5                                                            
         MFLD  (IDKOLLII,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDKOLLIU,                                               +        
               LTH=5                                                            
         MFLD  (FLVISAI,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  FLVISAU,                                                +        
               LTH=1                                                            
         MFLD  (FLNYKLI,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (KVKOLLI,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDCMD1,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (KDCMD2,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (KDCMD3,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (KDCMD4,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (KDCMD5,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (KDCMD6,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (KDCMD7,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (KDCMD8,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (KDCMD9,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (KDCMD10,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (IDDISTU,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDKUNDU,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDRAPPU,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDKOLLIF,                                               +        
               LTH=5                                                            
         MFLD  IDKOLLIT,                                               +        
               LTH=5                                                            
         MFLD  IDDIST1,                                                +        
               LTH=4                                                            
         MFLD  IDKUND1,                                                +        
               LTH=6                                                            
         MFLD  IDRAPP1,                                                +        
               LTH=7                                                            
         MFLD  IDDIST2,                                                +        
               LTH=4                                                            
         MFLD  IDKUND2,                                                +        
               LTH=6                                                            
         MFLD  IDRAPP2,                                                +        
               LTH=7                                                            
         MFLD  IDDIST3,                                                +        
               LTH=4                                                            
         MFLD  IDKUND3,                                                +        
               LTH=6                                                            
         MFLD  IDRAPP3,                                                +        
               LTH=7                                                            
         MFLD  IDDIST4,                                                +        
               LTH=4                                                            
         MFLD  IDKUND4,                                                +        
               LTH=6                                                            
         MFLD  IDRAPP4,                                                +        
               LTH=7                                                            
         MFLD  IDDIST5,                                                +        
               LTH=4                                                            
         MFLD  IDKUND5,                                                +        
               LTH=6                                                            
         MFLD  IDRAPP5,                                                +        
               LTH=7                                                            
         MFLD  IDDIST6,                                                +        
               LTH=4                                                            
         MFLD  IDKUND6,                                                +        
               LTH=6                                                            
         MFLD  IDRAPP6,                                                +        
               LTH=7                                                            
         MFLD  IDDIST7,                                                +        
               LTH=4                                                            
         MFLD  IDKUND7,                                                +        
               LTH=6                                                            
         MFLD  IDRAPP7,                                                +        
               LTH=7                                                            
         MFLD  IDDIST8,                                                +        
               LTH=4                                                            
         MFLD  IDKUND8,                                                +        
               LTH=6                                                            
         MFLD  IDRAPP8,                                                +        
               LTH=7                                                            
         MFLD  IDDIST9,                                                +        
               LTH=4                                                            
         MFLD  IDKUND9,                                                +        
               LTH=6                                                            
         MFLD  IDRAPP9,                                                +        
               LTH=7                                                            
         MFLD  IDDIST10,                                               +        
               LTH=4                                                            
         MFLD  IDKUND10,                                               +        
               LTH=6                                                            
         MFLD  IDRAPP10,                                               +        
               LTH=7                                                            
         MFLD  FLNYKLI,                                                +        
               LTH=3,                                                  +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  KVKOLLI,                                                +        
               LTH=6,                                                  +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  KDCMD1,                                                 +        
               LTH=3,                                                  +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  KDCMD2,                                                 +        
               LTH=3,                                                  +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  KDCMD3,                                                 +        
               LTH=3,                                                  +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  KDCMD4,                                                 +        
               LTH=3,                                                  +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  KDCMD5,                                                 +        
               LTH=3,                                                  +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  KDCMD6,                                                 +        
               LTH=3,                                                  +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  KDCMD7,                                                 +        
               LTH=3,                                                  +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  KDCMD8,                                                 +        
               LTH=3,                                                  +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  KDCMD9,                                                 +        
               LTH=3,                                                  +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  KDCMD10,                                                +        
               LTH=3,                                                  +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  IDDISTU,                                                +        
               LTH=6,                                                  +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  IDKUNDU,                                                +        
               LTH=8,                                                  +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  IDRAPPU,                                                +        
               LTH=9,                                                  +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MSGEND                                                                 
         END                                                                    
