***********************************************************************         
* CREATED BY R036149   ON 90/10/10  AT 14:53 *                                  
***********************************************************************         
         TITLE '                                '                               
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyzöéüäåÉ'                               
W4F901   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W4T901 7',                                           +        
               8='W4T901 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T901  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T901  ',                                          +        
               14='W4T902  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W4T901  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,11)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(ALPHA,NOPROT,MOD)                                          
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'AKTIVA ORDER',                                         +        
               POS=(1,13),LTH=12,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'DISTRIKT',                                             +        
               POS=(2,2),LTH=8,                                        +        
               ATTR=(ALPHA,PROT)                                                
FLD0211  DFLD  POS=(2,11),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'KUND',                                                 +        
               POS=(2,17),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FLD0224  DFLD  POS=(2,24),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'ORDERNO',                                              +        
               POS=(2,32),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FLD0240  DFLD  POS=(2,40),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'VÄLJ  <=>',                                            +        
               POS=(2,49),LTH=9,                                       +        
               ATTR=(PROT)                                                      
FLD0260  DFLD  POS=(2,60),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'DAT.',                                                 +        
               POS=(2,62),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0268  DFLD  POS=(2,68),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
FLD0311  DFLD  POS=(3,11),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0324  DFLD  POS=(3,24),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0340  DFLD  POS=(3,40),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0360  DFLD  POS=(3,60),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0368  DFLD  POS=(3,68),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0411  DFLD  POS=(4,11),LTH=4,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0424  DFLD  POS=(4,24),LTH=6,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0440  DFLD  POS=(4,40),LTH=7,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0468  DFLD  POS=(4,68),LTH=6,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'ORD-KLASS',                                            +        
               POS=(5,50),LTH=9,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'KUND    ORDERNO  DATUM  KUND-REF    IMPORT-REF',       +        
               POS=(6,2),LTH=46,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'RS',                                                   +        
               POS=(6,55),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FLD0702  DFLD  POS=(7,2),LTH=55,                                       +        
               ATTR=(PROT)                                                      
FLD0802  DFLD  POS=(8,2),LTH=55,                                       +        
               ATTR=(PROT)                                                      
FLD0902  DFLD  POS=(9,2),LTH=55,                                       +        
               ATTR=(PROT)                                                      
FLD1002  DFLD  POS=(10,2),LTH=55,                                      +        
               ATTR=(PROT)                                                      
FLD1102  DFLD  POS=(11,2),LTH=55,                                      +        
               ATTR=(PROT)                                                      
FLD1202  DFLD  POS=(12,2),LTH=55,                                      +        
               ATTR=(PROT)                                                      
FLD1302  DFLD  POS=(13,2),LTH=55,                                      +        
               ATTR=(PROT)                                                      
FLD1402  DFLD  POS=(14,2),LTH=55,                                      +        
               ATTR=(PROT)                                                      
FLD1502  DFLD  POS=(15,2),LTH=55,                                      +        
               ATTR=(PROT)                                                      
FLD1602  DFLD  POS=(16,2),LTH=55,                                      +        
               ATTR=(PROT)                                                      
FLD1702  DFLD  POS=(17,2),LTH=55,                                      +        
               ATTR=(PROT)                                                      
FLD1802  DFLD  POS=(18,2),LTH=55,                                      +        
               ATTR=(PROT)                                                      
FLD1902  DFLD  POS=(19,2),LTH=55,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '13 AKTIVA ORDER 14 FYSISKA AVV. 15',                   +        
               POS=(21,2),LTH=34,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16',                                                   +        
               POS=(21,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  ' VCP ',POS=(23,58)                                              
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W4O90101 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4F901,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I90101,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  FLD0211,                                                +        
               LTH=4                                                            
         MFLD  FLD0311,                                                +        
               LTH=4                                                            
         MFLD  FLD0224,                                                +        
               LTH=6                                                            
         MFLD  FLD0324,                                                +        
               LTH=6                                                            
         MFLD  FLD0240,                                                +        
               LTH=7                                                            
         MFLD  FLD0340,                                                +        
               LTH=7                                                            
         MFLD  FLD0260,                                                +        
               LTH=1                                                            
         MFLD  FLD0360,                                                +        
               LTH=1                                                            
         MFLD  FLD0268,                                                +        
               LTH=6                                                            
         MFLD  FLD0368,                                                +        
               LTH=6                                                            
         MFLD  FLD0411,                                                +        
               LTH=4                                                            
         MFLD  FLD0424,                                                +        
               LTH=6                                                            
         MFLD  FLD0440,                                                +        
               LTH=7                                                            
         MFLD  FLD0468,                                                +        
               LTH=6                                                            
         MFLD  FLD0702,                                                +        
               LTH=55                                                           
         MFLD  FLD0802,                                                +        
               LTH=55                                                           
         MFLD  FLD0902,                                                +        
               LTH=55                                                           
         MFLD  FLD1002,                                                +        
               LTH=55                                                           
         MFLD  FLD1102,                                                +        
               LTH=55                                                           
         MFLD  FLD1202,                                                +        
               LTH=55                                                           
         MFLD  FLD1302,                                                +        
               LTH=55                                                           
         MFLD  FLD1402,                                                +        
               LTH=55                                                           
         MFLD  FLD1502,                                                +        
               LTH=55                                                           
         MFLD  FLD1602,                                                +        
               LTH=55                                                           
         MFLD  FLD1702,                                                +        
               LTH=55                                                           
         MFLD  FLD1802,                                                +        
               LTH=55                                                           
         MFLD  FLD1902,                                                +        
               LTH=55                                                           
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I90101 MSG   TYPE=INPUT,                                             +        
               SOR=(W4F901),                                           +        
               OPT=2,                                                  +        
               NXT=W4O90101                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  (FLD0102,                                               +        
               '4'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  (FLD0104,                                               +        
               '9'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F9'                                                       
         MFLD  (FLD0106,                                               +        
               '0'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0108,                                               +        
               '1'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '49011',                                                +        
               LTH=5                                                            
         MFLD  (FLD0211,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0311,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0224,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0324,                                                +        
               LTH=6,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0240,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0340,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0260,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0360,                                                +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0268,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0368,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0411,                                                +        
               LTH=4,                                                  +        
               FILL=X'40'                                                       
         MFLD  FLD0424,                                                +        
               LTH=6,                                                  +        
               FILL=X'40'                                                       
         MFLD  FLD0440,                                                +        
               LTH=7,                                                  +        
               FILL=X'40'                                                       
         MFLD  FLD0468,                                                +        
               LTH=6,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
