***********************************************************************         
* CREATED BY PCC4448   ON 95/05/08  AT 11:01                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'ARTIKELFRÅGA VOR                '                               
W4N131   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W4T131 7',                                           +        
               8='W4T131 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((2,10)),                                        +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'PART QUERY VOR',                                       +        
               POS=(1,15),LTH=14,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Part No',                                              +        
               POS=(2,2),LTH=7,                                        +        
               ATTR=(ALPHA,PROT)                                                
DGIA0002 DFLD  POS=(2,10),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0003 DFLD  POS=(3,10),LTH=11,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0000 DFLD  POS=(4,2),LTH=9,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0004 DFLD  POS=(4,12),LTH=3,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0018 DFLD  POS=(4,16),LTH=6,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0001 DFLD  POS=(4,43),LTH=9,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0005 DFLD  POS=(4,53),LTH=3,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0019 DFLD  POS=(4,57),LTH=6,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
FLAGGA   DFLD  POS=(4,68),LTH=1,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'Descript:',                                            +        
               POS=(5,2),LTH=9,                                        +        
               ATTR=(PROT)                                                      
BEARTSVE DFLD  POS=(5,12),LTH=20,                                      +        
               ATTR=(PROT)                                                      
BEARTENG DFLD  POS=(5,34),LTH=20,                                      +        
               ATTR=(PROT)                                                      
BEARTTY  DFLD  POS=(5,56),LTH=20,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'CDC   Tot-SDC',                                        +        
               POS=(6,19),LTH=13,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Stock Bal.',                                           +        
               POS=(7,2),LTH=10,                                       +        
               ATTR=(PROT)                                                      
DISPLAG1 DFLD  POS=(7,14),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DISPLAG2 DFLD  POS=(7,24),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Wareh.adr',                                            +        
               POS=(7,34),LTH=9,                                       +        
               ATTR=(PROT)                                                      
ADLAGOMR DFLD  POS=(7,44),LTH=2,                                       +        
               ATTR=(PROT)                                                      
ADGANG   DFLD  POS=(7,47),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
ADPLATS  DFLD  POS=(7,50),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'FOB price',                                            +        
               POS=(7,56),LTH=9,                                       +        
               ATTR=(ALPHA,PROT)                                                
PRARTFOB DFLD  POS=(7,67),LTH=10,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Res.  Qty',                                            +        
               POS=(8,2),LTH=9,                                        +        
               ATTR=(PROT)                                                      
RESKVAN1 DFLD  POS=(8,14),LTH=8,                                       +        
               ATTR=(PROT)                                                      
RESKVAN2 DFLD  POS=(8,24),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'More adr',                                             +        
               POS=(8,34),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FLERPL   DFLD  POS=(8,44),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Weight',                                               +        
               POS=(8,56),LTH=6,                                       +        
               ATTR=(PROT)                                                      
VKART    DFLD  POS=(8,67),LTH=7,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'OKS',                                                  +        
               POS=(9,2),LTH=3,                                        +        
               ATTR=(PROT)                                                      
OKS1     DFLD  POS=(9,14),LTH=8,                                       +        
               ATTR=(PROT)                                                      
OKS2     DFLD  POS=(9,24),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Suppl',                                                +        
               POS=(9,34),LTH=5,                                       +        
               ATTR=(PROT)                                                      
IDLEVNR  DFLD  POS=(9,44),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Volume',                                               +        
               POS=(9,56),LTH=6,                                       +        
               ATTR=(PROT)                                                      
VLARTNTO DFLD  POS=(9,67),LTH=10,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'EFR',                                                  +        
               POS=(10,2),LTH=3,                                       +        
               ATTR=(PROT)                                                      
EFR1     DFLD  POS=(10,14),LTH=8,                                      +        
               ATTR=(PROT)                                                      
EFR2     DFLD  POS=(10,24),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Proc',                                                 +        
               POS=(10,34),LTH=4,                                      +        
               ATTR=(PROT)                                                      
IDANSK   DFLD  POS=(10,44),LTH=3,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Dang.goods',                                           +        
               POS=(10,56),LTH=10,                                     +        
               ATTR=(PROT)                                                      
KDFARLIG DFLD  POS=(10,67),LTH=1,                                      +        
               ATTR=(PROT)                                                      
BEFARLIG DFLD  POS=(10,69),LTH=12,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'AK in stock',                                          +        
               POS=(11,2),LTH=11,                                      +        
               ATTR=(ALPHA,PROT)                                                
DISPAK1  DFLD  POS=(11,14),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DISPAK2  DFLD  POS=(11,24),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Planner',                                              +        
               POS=(11,34),LTH=7,                                      +        
               ATTR=(PROT)                                                      
IDBERED  DFLD  POS=(11,44),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Repl.code',                                            +        
               POS=(11,56),LTH=9,                                      +        
               ATTR=(PROT)                                                      
KDERS    DFLD  POS=(11,67),LTH=3,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'AK on way',                                            +        
               POS=(12,2),LTH=9,                                       +        
               ATTR=(PROT)                                                      
KVAKS1   DFLD  POS=(12,14),LTH=8,                                      +        
               ATTR=(PROT)                                                      
KVAKS2   DFLD  POS=(12,24),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Func.grp',                                             +        
               POS=(12,34),LTH=8,                                      +        
               ATTR=(PROT)                                                      
IDFNKGRP DFLD  POS=(12,44),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Repl. by',                                             +        
               POS=(12,56),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DGIA0020 DFLD  POS=(12,67),LTH=8,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Inves.Bal.',                                           +        
               POS=(13,2),LTH=10,                                      +        
               ATTR=(PROT)                                                      
KVUTRS1  DFLD  POS=(13,14),LTH=8,                                      +        
               ATTR=(PROT)                                                      
KVUTRS2  DFLD  POS=(13,24),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Bl. code',                                             +        
               POS=(13,34),LTH=8,                                      +        
               ATTR=(PROT)                                                      
SPARRKOD DFLD  POS=(13,44),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0021 DFLD  POS=(13,67),LTH=8,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Blocked Qty',                                          +        
               POS=(14,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
KVSPC1   DFLD  POS=(14,14),LTH=8,                                      +        
               ATTR=(PROT)                                                      
KVSPC2   DFLD  POS=(14,24),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Origin',                                               +        
               POS=(14,34),LTH=6,                                      +        
               ATTR=(PROT)                                                      
KDARTUR1 DFLD  POS=(14,44),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0022 DFLD  POS=(14,67),LTH=8,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Vehicle belongs',                                      +        
               POS=(15,2),LTH=15,                                      +        
               ATTR=(PROT)                                                      
DGIA0006 DFLD  POS=(15,19),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0007 DFLD  POS=(15,25),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0008 DFLD  POS=(15,31),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0009 DFLD  POS=(15,37),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0010 DFLD  POS=(15,43),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0011 DFLD  POS=(15,49),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0012 DFLD  POS=(15,55),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0013 DFLD  POS=(15,61),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0014 DFLD  POS=(15,67),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0015 DFLD  POS=(15,73),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Plan del. due',                                        +        
               POS=(16,2),LTH=13,                                      +        
               ATTR=(PROT)                                                      
DGIA0016 DFLD  POS=(16,19),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0017 DFLD  POS=(16,27),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Del. date CDC',                                        +        
               POS=(16,34),LTH=13,                                     +        
               ATTR=(NUM,PROT)                                                  
TILEVBSK DFLD  POS=(16,49),LTH=5,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Quant.',                                               +        
               POS=(16,56),LTH=6,                                      +        
               ATTR=(PROT)                                                      
KVAVIS   DFLD  POS=(16,63),LTH=6,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'OKS VOR',                                              +        
               POS=(17,2),LTH=7,                                       +        
               ATTR=(PROT)                                                      
OKSVOR   DFLD  POS=(17,14),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Note 1',                                               +        
               POS=(18,2),LTH=6,                                       +        
               ATTR=(PROT)                                                      
TEARTN1  DFLD  POS=(18,19),LTH=40,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Note 2',                                               +        
               POS=(19,2),LTH=6,                                       +        
               ATTR=(PROT)                                                      
TEARTN2  DFLD  POS=(19,19),LTH=40,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '13',                                                   +        
               POS=(21,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '14',                                                   +        
               POS=(21,17),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '15',                                                   +        
               POS=(21,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16',                                                   +        
               POS=(21,49),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,17),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,49),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4I131N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N131),                                           +        
               OPT=2,                                                  +        
               NXT=W4O131N1                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  (IDTRANS1,                                              +        
               '4'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  (IDTRANS2,                                              +        
               '1'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  (IDTRANS3,                                              +        
               '3'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  (IDTRANS4,                                              +        
               '1'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '41312',                                                +        
               LTH=5                                                            
         MFLD  (DGIA0002,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0003,                                               +        
               LTH=11                                                           
         MFLD  DGIA0000,                                               +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0004,                                               +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0018,                                               +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0001,                                               +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0005,                                               +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0019,                                               +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLAGGA,                                                 +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
W4O131N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N131,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I131N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  DGIA0002,                                               +        
               LTH=9                                                            
         MFLD  DGIA0003,                                               +        
               LTH=11                                                           
         MFLD  DGIA0000,                                               +        
               LTH=9                                                            
         MFLD  DGIA0004,                                               +        
               LTH=3                                                            
         MFLD  DGIA0018,                                               +        
               LTH=6                                                            
         MFLD  DGIA0001,                                               +        
               LTH=9                                                            
         MFLD  DGIA0005,                                               +        
               LTH=3                                                            
         MFLD  DGIA0019,                                               +        
               LTH=6                                                            
         MFLD  FLAGGA,                                                 +        
               LTH=1                                                            
         MFLD  BEARTSVE,                                               +        
               LTH=20                                                           
         MFLD  BEARTENG,                                               +        
               LTH=20                                                           
         MFLD  BEARTTY,                                                +        
               LTH=20                                                           
         MFLD  DISPLAG1,                                               +        
               LTH=8                                                            
         MFLD  DISPLAG2,                                               +        
               LTH=8                                                            
         MFLD  ADLAGOMR,                                               +        
               LTH=2                                                            
         MFLD  ADGANG,                                                 +        
               LTH=2                                                            
         MFLD  ADPLATS,                                                +        
               LTH=5                                                            
         MFLD  FLERPL,                                                 +        
               LTH=1                                                            
         MFLD  PRARTFOB,                                               +        
               LTH=10                                                           
         MFLD  RESKVAN1,                                               +        
               LTH=8                                                            
         MFLD  RESKVAN2,                                               +        
               LTH=8                                                            
         MFLD  IDLEVNR,                                                +        
               LTH=5                                                            
         MFLD  VKART,                                                  +        
               LTH=7                                                            
         MFLD  OKS1,                                                   +        
               LTH=8                                                            
         MFLD  OKS2,                                                   +        
               LTH=8                                                            
         MFLD  OKSVOR,                                                 +        
               LTH=8                                                            
         MFLD  IDANSK,                                                 +        
               LTH=3                                                            
         MFLD  VLARTNTO,                                               +        
               LTH=10                                                           
         MFLD  EFR1,                                                   +        
               LTH=8                                                            
         MFLD  EFR2,                                                   +        
               LTH=8                                                            
         MFLD  IDBERED,                                                +        
               LTH=2                                                            
         MFLD  KDFARLIG,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BEFARLIG,                                               +        
               LTH=14,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DISPAK1,                                                +        
               LTH=8                                                            
         MFLD  DISPAK2,                                                +        
               LTH=8                                                            
         MFLD  IDFNKGRP,                                               +        
               LTH=5                                                            
         MFLD  KDERS,                                                  +        
               LTH=3                                                            
         MFLD  KVAKS1,                                                 +        
               LTH=8                                                            
         MFLD  KVAKS2,                                                 +        
               LTH=8                                                            
         MFLD  SPARRKOD,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVUTRS1,                                                +        
               LTH=8                                                            
         MFLD  KVUTRS2,                                                +        
               LTH=8                                                            
         MFLD  KVSPC1,                                                 +        
               LTH=8                                                            
         MFLD  KVSPC2,                                                 +        
               LTH=8                                                            
         MFLD  KDARTUR1,                                               +        
               LTH=2                                                            
         MFLD  DGIA0006,                                               +        
               LTH=5                                                            
         MFLD  DGIA0007,                                               +        
               LTH=5                                                            
         MFLD  DGIA0008,                                               +        
               LTH=5                                                            
         MFLD  DGIA0009,                                               +        
               LTH=5                                                            
         MFLD  DGIA0010,                                               +        
               LTH=5                                                            
         MFLD  DGIA0011,                                               +        
               LTH=5                                                            
         MFLD  DGIA0012,                                               +        
               LTH=5                                                            
         MFLD  DGIA0013,                                               +        
               LTH=5                                                            
         MFLD  DGIA0014,                                               +        
               LTH=5                                                            
         MFLD  DGIA0015,                                               +        
               LTH=5                                                            
         MFLD  DGIA0016,                                               +        
               LTH=6                                                            
         MFLD  DGIA0017,                                               +        
               LTH=6                                                            
         MFLD  TEARTN1,                                                +        
               LTH=40                                                           
         MFLD  TEARTN2,                                                +        
               LTH=40                                                           
         MFLD  DGIA0020,                                               +        
               LTH=8                                                            
         MFLD  DGIA0021,                                               +        
               LTH=8                                                            
         MFLD  DGIA0022,                                               +        
               LTH=8                                                            
         MFLD  TILEVBSK,                                               +        
               LTH=5                                                            
         MFLD  KVAVIS,                                                 +        
               LTH=6                                                            
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
