***********************************************************************         
* CREATED BY R038449   ON 93/01/14  AT 13:16                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE '                                '                               
W4N107   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W4T101  ',                                           +        
               2='W4T102  ',                                           +        
               3='W4T103  ',                                           +        
               4='W4T104  ',                                           +        
               5='W4T105  ',                                           +        
               6='W4T106  ',                                           +        
               7='W4T107  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T101  ',                                          +        
               14='W4T102  ',                                          +        
               15='W4T103  ',                                          +        
               16='W4T104  ',                                          +        
               17='W4T105  ',                                          +        
               18='W4T106  ',                                          +        
               19='W4T107  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'TREATMENT INFO',                                       +        
               POS=(1,12),LTH=14,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Part No',                                              +        
               POS=(2,2),LTH=7,                                        +        
               ATTR=(NUM,PROT)                                                  
FLD0212  DFLD  POS=(2,12),LTH=9,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'DC',                                                   +        
               POS=(02,24),LTH=0002,ATTR=(ALPHA,PROT)                           
FLD0228  DFLD  POS=(02,28),LTH=0002,ATTR=(ALPHA,NOPROT)                         
FLD0312  DFLD  POS=(3,12),LTH=11,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD0328  DFLD  POS=(03,28),LTH=0002,ATTR=(PROT,MOD)                             
FLD0340  DFLD  POS=(3,40),LTH=3,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'Description',                                          +        
               POS=(5,2),LTH=11,                                       +        
               ATTR=(PROT)                                                      
FLD0521  DFLD  POS=(5,21),LTH=25,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Supplier desc. ',                                      +        
               POS=(6,2),LTH=15,                                       +        
               ATTR=(PROT)                                                      
FLD0621  DFLD  POS=(6,21),LTH=30,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Prep. material 0',                                     +        
               POS=(8,2),LTH=16,                                       +        
               ATTR=(PROT)                                                      
FLD0822  DFLD  POS=(8,22),LTH=9,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Qty Qpack  0',                                         +        
               POS=(8,42),LTH=12,                                      +        
               ATTR=(PROT)                                                      
FLD0858  DFLD  POS=(8,58),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Prep. material 1',                                     +        
               POS=(9,2),LTH=16,                                       +        
               ATTR=(PROT)                                                      
FLD0922  DFLD  POS=(9,22),LTH=9,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Qty Qpack  1',                                         +        
               POS=(9,42),LTH=12,                                      +        
               ATTR=(PROT)                                                      
FLD0958  DFLD  POS=(9,58),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Prep. material 2',                                     +        
               POS=(10,2),LTH=16,                                      +        
               ATTR=(PROT)                                                      
FLD1022  DFLD  POS=(10,22),LTH=9,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Qty Qpack  2',                                         +        
               POS=(10,42),LTH=12,                                     +        
               ATTR=(PROT)                                                      
FLD1058  DFLD  POS=(10,58),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Prep. material 3',                                     +        
               POS=(11,2),LTH=16,                                      +        
               ATTR=(PROT)                                                      
FLD1122  DFLD  POS=(11,22),LTH=9,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Qty Qpack  3',                                         +        
               POS=(11,42),LTH=12,                                     +        
               ATTR=(PROT)                                                      
FLD1158  DFLD  POS=(11,58),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Prep. material 4',                                     +        
               POS=(12,2),LTH=16,                                      +        
               ATTR=(PROT)                                                      
FLD1222  DFLD  POS=(12,22),LTH=9,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Qty Qpack  4',                                         +        
               POS=(12,42),LTH=12,                                     +        
               ATTR=(PROT)                                                      
FLD1258  DFLD  POS=(12,58),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Prepacking type',                                      +        
               POS=(13,2),LTH=15,                                      +        
               ATTR=(PROT)                                                      
FLD1328  DFLD  POS=(13,28),LTH=3,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Vehicle type',                                         +        
               POS=(13,42),LTH=12,                                     +        
               ATTR=(PROT)                                                      
FLD1357  DFLD  POS=(13,57),LTH=24,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'CDC',                                                  +        
               POS=(15,17),LTH=3,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'DC',                                                   +        
               POS=(15,30),LTH=2,                                      +        
               ATTR=(PROT,HI)                                                   
FLD1457  DFLD  POS=(14,57),LTH=24,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Type of assortment',                                   +        
               POS=(14,2),LTH=18,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1428  DFLD  POS=(14,28),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD1557  DFLD  POS=(15,57),LTH=24,                                     +        
               ATTR=(PROT)                                                      
FLD1657  DFLD  POS=(16,57),LTH=24,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Weight',                                               +        
               POS=(16,2),LTH=6,                                       +        
               ATTR=(PROT)                                                      
WEIGHTCD DFLD  POS=(16,10),LTH=10,                                     +        
               ATTR=(PROT)                                                      
WEIGHTDC DFLD  POS=(16,22),LTH=10,                                     +        
               ATTR=(PROT)                                                      
BESORTVK DFLD  POS=(16,34),LTH=6,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Volume',                                               +        
               POS=(17,2),LTH=6,                                       +        
               ATTR=(PROT)                                                      
VOLUMECD DFLD  POS=(17,10),LTH=10,                                     +        
               ATTR=(PROT)                                                      
VOLUMEDC DFLD  POS=(17,22),LTH=10,                                     +        
               ATTR=(PROT)                                                      
BESORTVL DFLD  POS=(17,34),LTH=6,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Origin',                                               +        
               POS=(18,2),LTH=6,                                       +        
               ATTR=(PROT)                                                      
KDARUSCD DFLD  POS=(18,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KDARUSDC DFLD  POS=(18,30),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Design change notice',                                 +        
               POS=(19,2),LTH=20,                                      +        
               ATTR=(PROT)                                                      
FLD1924  DFLD  POS=(19,24),LTH=55,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '13 Stock info   14 Pack. info   15 Balance info 16 Part+        
                No. info17 SDC info     18 SDC info     19 SDC info    +        
                20 Buffer info  21              22 WHELP',             +        
               POS=(21,02),LTH=0152,ATTR=(NUM,PROT)                             
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  ' VCP ',POS=(23,58)                                              
FLD2364  DFLD  POS=(23,64),LTH=8,ATTR=(NUM,PROT)                                
FLD2373  DFLD  POS=(23,73),LTH=8,ATTR=(NUM,PROT)                                
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W4O107N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N107,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I107N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  FLD0340,                                                +        
               LTH=3                                                            
         MFLD  FLD0212,                                                +        
               LTH=9                                                            
         MFLD  FLD0312,                                                +        
               LTH=11                                                           
         MFLD  FLD0228,                                                +        
               LTH=0002                                                         
         MFLD  FLD0328,                                                +        
               LTH=0002                                                         
         MFLD  FLD0521,                                                +        
               LTH=25                                                           
         MFLD  FLD0621,                                                +        
               LTH=30                                                           
         MFLD  FLD0822,                                                +        
               LTH=9                                                            
         MFLD  FLD0858,                                                +        
               LTH=5                                                            
         MFLD  FLD0922,                                                +        
               LTH=9                                                            
         MFLD  FLD0958,                                                +        
               LTH=5                                                            
         MFLD  FLD1022,                                                +        
               LTH=9                                                            
         MFLD  FLD1058,                                                +        
               LTH=5                                                            
         MFLD  FLD1122,                                                +        
               LTH=9                                                            
         MFLD  FLD1158,                                                +        
               LTH=5                                                            
         MFLD  FLD1222,                                                +        
               LTH=9                                                            
         MFLD  FLD1258,                                                +        
               LTH=5                                                            
         MFLD  FLD1328,                                                +        
               LTH=3                                                            
         MFLD  FLD1357,                                                +        
               LTH=24                                                           
         MFLD  FLD1457,                                                +        
               LTH=24                                                           
         MFLD  FLD1557,                                                +        
               LTH=24                                                           
         MFLD  FLD1657,                                                +        
               LTH=24                                                           
         MFLD  FLD1428,                                                +        
               LTH=3                                                            
         MFLD  WEIGHTCD,                                               +        
               LTH=10                                                           
         MFLD  WEIGHTDC,                                               +        
               LTH=10                                                           
         MFLD  BESORTVK,                                               +        
               LTH=6                                                            
         MFLD  VOLUMECD,                                               +        
               LTH=10                                                           
         MFLD  VOLUMEDC,                                               +        
               LTH=10                                                           
         MFLD  BESORTVL,                                               +        
               LTH=6                                                            
         MFLD  KDARUSCD,                                               +        
               LTH=2                                                            
         MFLD  KDARUSDC,                                               +        
               LTH=2                                                            
         MFLD  FLD1924,                                                +        
               LTH=55                                                           
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I107N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N107),                                           +        
               OPT=2,                                                  +        
               NXT=W4O107N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F7'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '41072',                                                +        
               LTH=5                                                            
         MFLD  (FLD0212,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0312,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0228,'++'),LTH=0002,FILL=X'40',JUST=R                        
         MFLD  FLD0328,LTH=0002                                                 
         MFLD  (FLD0340,                                               +        
               '   '),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
