***********************************************************************         
* CREATED BY R030178   ON 90/09/11  AT 08:25                                    
***********************************************************************         
         TITLE '                                '                               
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyzˆÈ¸‰Â…'                               
W4N106   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W4T101  ',                                           +        
               2='W4T102  ',                                           +        
               3='W4T103  ',                                           +        
               4='W4T104  ',                                           +        
               5='W4T105  ',                                           +        
               6='W4T106  ',                                           +        
               7='W4T107  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T101  ',                                          +        
               14='W4T102  ',                                          +        
               15='W4T103  ',                                          +        
               16='W4T104  ',                                          +        
               17='W4T105  ',                                          +        
               18='W4T106  ',                                          +        
               19='W4T107  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,14)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(ALPHA,NOPROT,MOD)                                          
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'BALANCE INFO',                                         +        
               POS=(1,12),LTH=12,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Part number',                                          +        
               POS=(2,2),LTH=11,                                       +        
               ATTR=(ALPHA,PROT)                                                
FLD0214  DFLD  POS=(2,14),LTH=9,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'DC',                                                   +        
               POS=(02,26),LTH=0002,ATTR=(ALPHA,PROT)                           
FLD0230  DFLD  POS=(02,30),LTH=0002,ATTR=(ALPHA,NOPROT)                         
FLD0314  DFLD  POS=(3,14),LTH=11,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD0330  DFLD  POS=(03,30),LTH=0002,ATTR=(PROT,MOD)                             
         DFLD  'Part address',                                         +        
               POS=(5,2),LTH=12,                                       +        
               ATTR=(PROT)                                                      
FLD0522  DFLD  POS=(5,19),LTH=11,                                      +        
               ATTR=(PROT)                                                      
FLD0531  DFLD  POS=(5,31),LTH=11,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Date of scrapping',                                    +        
               POS=(5,46),LTH=17,                                      +        
               ATTR=(PROT)                                                      
FLD0564  DFLD  POS=(5,69),LTH=7,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Maximum point',                                        +        
               POS=(6,2),LTH=13,                                       +        
               ATTR=(PROT)                                                      
FLD0622  DFLD  POS=(6,22),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Quantity scrapped',                                    +        
               POS=(6,46),LTH=17,                                      +        
               ATTR=(PROT)                                                      
FLD0663  DFLD  POS=(6,68),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Period req sep',                                       +        
               POS=(7,2),LTH=14,                                       +        
               ATTR=(PROT)                                                      
FLD0722  DFLD  POS=(7,22),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Period req kits',                                      +        
               POS=(8,2),LTH=15,                                       +        
               ATTR=(PROT)                                                      
FLD0822  DFLD  POS=(8,22),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Supplier notify No.',                                  +        
               POS=(8,46),LTH=19,                                      +        
               ATTR=(PROT)                                                      
FLD0864  DFLD  POS=(8,69),LTH=7,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Stock balance',                                        +        
               POS=(9,2),LTH=13,                                       +        
               ATTR=(PROT)                                                      
FLD0922  DFLD  POS=(9,22),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FLD0931  DFLD  POS=(9,34),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Quantity notified',                                    +        
               POS=(9,46),LTH=17,                                      +        
               ATTR=(PROT)                                                      
FLD0963  DFLD  POS=(9,68),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Res. quantity',                                        +        
               POS=(10,2),LTH=13,                                      +        
               ATTR=(PROT)                                                      
FLD1022  DFLD  POS=(10,22),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Buffer stock',                                         +        
               POS=(11,2),LTH=12,                                      +        
               ATTR=(PROT)                                                      
FLD1122  DFLD  POS=(11,22),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Advice balance T',                                     +        
               POS=(12,2),LTH=16,                                      +        
               ATTR=(PROT)                                                      
FLD1222  DFLD  POS=(12,22),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Advice bal. DC   ',                                    +        
               POS=(13,2),LTH=17,                                      +        
               ATTR=(PROT)                                                      
FLD1322  DFLD  POS=(13,22),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1331  DFLD  POS=(13,34),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Advice bal. PAV',                                      +        
               POS=(14,2),LTH=15,                                      +        
               ATTR=(PROT)                                                      
FLD1422  DFLD  POS=(14,22),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1431  DFLD  POS=(14,34),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Not invoiced items',                                   +        
               POS=(15,2),LTH=18,                                      +        
               ATTR=(PROT)                                                      
FLD1522  DFLD  POS=(15,22),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1531  DFLD  POS=(15,34),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Inves. balance',                                       +        
               POS=(16,2),LTH=14,                                      +        
               ATTR=(PROT)                                                      
FLD1622  DFLD  POS=(16,22),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1631  DFLD  POS=(16,34),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Back order balance',                                   +        
               POS=(17,2),LTH=18,                                      +        
               ATTR=(PROT)                                                      
FLD1722  DFLD  POS=(17,22),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'TPO balance',                                          +        
               POS=(18,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
FLD1823  DFLD  POS=(18,23),LTH=7,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'On order',                                             +        
               POS=(19,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FLD1922  DFLD  POS=(19,22),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '13 Stock info   14 Pack. info   15 Balance info 16 Part+        
                No. info17 SDC info     18 SDC info     19 SDC info    +        
                20 Buffer info  21              22 WHELP',             +        
               POS=(21,02),LTH=0152,ATTR=(NUM,PROT)                             
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  ' VCP ',POS=(23,58)                                              
FLD2364  DFLD  POS=(23,64),LTH=8,ATTR=(NUM,PROT)                                
FLD2373  DFLD  POS=(23,73),LTH=8,ATTR=(NUM,PROT)                                
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W4O106N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N106,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I106N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  FLD0214,                                                +        
               LTH=9                                                            
         MFLD  FLD0314,                                                +        
               LTH=11                                                           
         MFLD  FLD0230,                                                +        
               LTH=0002                                                         
         MFLD  FLD0330,                                                +        
               LTH=0002                                                         
         MFLD  FLD0522,                                                +        
               LTH=11                                                           
         MFLD  FLD0531,                                                +        
               LTH=11                                                           
         MFLD  FLD0564,                                                +        
               LTH=7                                                            
         MFLD  FLD0622,                                                +        
               LTH=8                                                            
         MFLD  FLD0663,                                                +        
               LTH=8                                                            
         MFLD  FLD0722,                                                +        
               LTH=8                                                            
         MFLD  FLD0822,                                                +        
               LTH=8                                                            
         MFLD  FLD0864,                                                +        
               LTH=7                                                            
         MFLD  FLD0922,                                                +        
               LTH=8                                                            
         MFLD  FLD0931,                                                +        
               LTH=8                                                            
         MFLD  FLD0963,                                                +        
               LTH=8                                                            
         MFLD  FLD1022,                                                +        
               LTH=8                                                            
         MFLD  FLD1122,                                                +        
               LTH=8                                                            
         MFLD  FLD1222,                                                +        
               LTH=8                                                            
         MFLD  FLD1322,                                                +        
               LTH=8                                                            
         MFLD  FLD1331,                                                +        
               LTH=8                                                            
         MFLD  FLD1422,                                                +        
               LTH=8                                                            
         MFLD  FLD1431,                                                +        
               LTH=8                                                            
         MFLD  FLD1522,                                                +        
               LTH=8                                                            
         MFLD  FLD1531,                                                +        
               LTH=8                                                            
         MFLD  FLD1622,                                                +        
               LTH=8                                                            
         MFLD  FLD1631,                                                +        
               LTH=8                                                            
         MFLD  FLD1722,                                                +        
               LTH=8                                                            
         MFLD  FLD1823,                                                +        
               LTH=7                                                            
         MFLD  FLD1922,                                                +        
               LTH=8                                                            
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I106N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N106),                                           +        
               OPT=2,                                                  +        
               NXT=W4O106N1                                                     
MID      LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '41062',                                                +        
               LTH=5                                                            
         MFLD  (FLD0214,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0314,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0230,'++'),                                         +        
               LTH=0002,                                               +        
               FILL=X'40',JUST=R                                                
         MFLD  FLD0330,                                                +        
               LTH=0002,                                               +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
