*          DATA SET W4N111FII0 AT LEVEL 001 AS OF 86/08/13                      
         PRINT NOGEN                                                            
         ALPHA 'abcdefghijklmnopqrstuvwxyzˆÈ¸‰Â…'                               
W4N111   FMT                                                                    
         DEV   TYPE=(3270,2),                                          *        
               FEAT=IGNORE,                                            *        
               PFK=(FLDPFK,'W4T111  ','W0T501  ','W0T501  ','W0T501  ',*        
               'W0T501  ','W0T501  ','W4T111 7','W4T111 8','W0T501  ', *        
               'WHELP   ','W4T111U ','/RCL.   ','W4T111  ','W0T501  ', *        
               'W0T501  ','W0T501  ','W0T501  ','W0T501  ','W0T501  ', *        
               'W0T501  ','W0T501  ','WHELP   ','W4T111U ','/RCL.   '),*        
               DSCA=X'0080',SYSMSG=FSYSMSG                                      
         DIV   TYPE=INOUT                                                       
         DPAGE CURSOR=((02,12)),                                       *        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(01,02),LTH=0001,ATTR=(ALPHA,NOPROT,MOD)                     
FLD0104  DFLD  POS=(01,04),LTH=0001,ATTR=(NUM)                                  
FLD0106  DFLD  POS=(01,06),LTH=0001,ATTR=(NUM)                                  
FLD0108  DFLD  POS=(01,08),LTH=0001,ATTR=(NUM)                                  
         DFLD  'CASE CODES INFO AND UPDATING',                         *        
               POS=(01,11),LTH=0028,ATTR=(NUM,PROT)                             
FLD0141  DFLD  POS=(01,41),LTH=0040,ATTR=(NUM,PROT,HI)                          
         DFLD  'Case code',                                            *        
               POS=(02,02),LTH=0009,ATTR=(NUM,PROT)                             
FLD0211  DFLD  POS=(02,12),LTH=0008,ATTR=(ALPHA)                                
FLD0311  DFLD  POS=(03,12),LTH=0008,ATTR=(NUM,PROT,MOD)                         
FLD0402  DFLD  POS=(04,02),LTH=0008,ATTR=(NUM,PROT,MOD,NODISP)                  
         DFLD  'Case-code Type  L     W    H     Tare   D   Pall Fra Sp*        
               ac Top Int.pall Prof Ch.',                              *        
               POS=(05,02),LTH=0079,ATTR=(NUM,PROT)                             
FLD0602  DFLD  POS=(06,02),LTH=0008,ATTR=(ALPHA)                                
FLD0613  DFLD  POS=(06,13),LTH=0001,ATTR=(NUM)                                  
FLD0616  DFLD  POS=(06,16),LTH=0004,ATTR=(NUM)                                  
FLD0623  DFLD  POS=(06,23),LTH=0003,ATTR=(NUM)                                  
FLD0628  DFLD  POS=(06,28),LTH=0003,ATTR=(NUM)                                  
FLD0634  DFLD  POS=(06,34),LTH=0006,ATTR=(ALPHA)                                
FLD0642  DFLD  POS=(06,42),LTH=0001,ATTR=(ALPHA)                                
FLD0647  DFLD  POS=(06,47),LTH=0002,ATTR=(NUM)                                  
FLD0651  DFLD  POS=(06,51),LTH=0003,ATTR=(NUM)                                  
FLD0656  DFLD  POS=(06,56),LTH=0001,ATTR=(NUM)                                  
FLD0660  DFLD  POS=(06,60),LTH=0003,ATTR=(NUM)                                  
FLD0665  DFLD  POS=(06,65),LTH=0003,ATTR=(NUM)                                  
FLD0677  DFLD  POS=(06,77),LTH=0001,ATTR=(ALPHA)                                
FLD0702  DFLD  POS=(07,02),LTH=0070,ATTR=(NUM,PROT)                             
FLD0802  DFLD  POS=(08,02),LTH=0070,ATTR=(NUM,PROT)                             
FLD0902  DFLD  POS=(09,02),LTH=0070,ATTR=(NUM,PROT)                             
FLD1002  DFLD  POS=(10,02),LTH=0070,ATTR=(NUM,PROT)                             
FLD1102  DFLD  POS=(11,02),LTH=0070,ATTR=(NUM,PROT)                             
FLD1202  DFLD  POS=(12,02),LTH=0070,ATTR=(NUM,PROT)                             
FLD1302  DFLD  POS=(13,02),LTH=0070,ATTR=(NUM,PROT)                             
FLD1402  DFLD  POS=(14,02),LTH=0070,ATTR=(NUM,PROT)                             
FLD1502  DFLD  POS=(15,02),LTH=0070,ATTR=(NUM,PROT)                             
FLD1602  DFLD  POS=(16,02),LTH=0070,ATTR=(NUM,PROT)                             
FLD1702  DFLD  POS=(17,02),LTH=0070,ATTR=(NUM,PROT)                             
FLD1802  DFLD  POS=(18,02),LTH=0070,ATTR=(NUM,PROT)                             
FLD1902  DFLD  POS=(19,02),LTH=0070,ATTR=(NUM,PROT)                             
         DFLD  '13 Case code    14              15              16     *        
                        17              18              19             *        
                20              21              10 WHELP',             *        
               POS=(21,02),LTH=0152,ATTR=(NUM,PROT)                             
FLD2302  DFLD  POS=(23,02),LTH=0055,ATTR=(NUM,PROT,HI)                          
         DFLD  ' VCP ',POS=(23,58)                                              
FLD2364  DFLD  POS=(23,64),LTH=0008,ATTR=(NUM,PROT)                             
FLD2373  DFLD  POS=(23,73),LTH=0008,ATTR=(NUM,PROT)                             
FSYSMSG  DFLD  POS=(24,02),LTH=0079,ATTR=(NUM,PROT,HI)                          
         FMTEND                                                                 
         EJECT                                                                  
W4O111N1 MSG   TYPE=OUTPUT,                                            *        
               SOR=(W4N111,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W4I111N1,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  FLD0102,LTH=0001                                                 
         MFLD  FLD0104,LTH=0001                                                 
         MFLD  FLD0106,LTH=0001                                                 
         MFLD  FLD0108,LTH=0001                                                 
         MFLD  FLD0141,LTH=0040                                                 
         MFLD  FLD0211,LTH=0008                                                 
         MFLD  FLD0311,LTH=0008                                                 
         MFLD  FLD0402,LTH=0008                                                 
         MFLD  FLD0602,LTH=0004,ATTR=YES                                        
         MFLD  FLD0613,LTH=0004,ATTR=YES                                        
         MFLD  FLD0616,LTH=0004,ATTR=YES                                        
         MFLD  FLD0623,LTH=0004,ATTR=YES                                        
         MFLD  FLD0628,LTH=0004,ATTR=YES                                        
         MFLD  FLD0634,LTH=0004,ATTR=YES                                        
         MFLD  FLD0642,LTH=0004,ATTR=YES                                        
         MFLD  FLD0647,LTH=0004,ATTR=YES                                        
         MFLD  FLD0651,LTH=0004,ATTR=YES                                        
         MFLD  FLD0656,LTH=0004,ATTR=YES                                        
         MFLD  FLD0660,LTH=0004,ATTR=YES                                        
         MFLD  FLD0665,LTH=0004,ATTR=YES                                        
         MFLD  FLD0677,LTH=0004,ATTR=YES                                        
         MFLD  FLD0702,LTH=0070                                                 
         MFLD  FLD0802,LTH=0070                                                 
         MFLD  FLD0902,LTH=0070                                                 
         MFLD  FLD1002,LTH=0070                                                 
         MFLD  FLD1102,LTH=0070                                                 
         MFLD  FLD1202,LTH=0070                                                 
         MFLD  FLD1302,LTH=0070                                                 
         MFLD  FLD1402,LTH=0070                                                 
         MFLD  FLD1502,LTH=0070                                                 
         MFLD  FLD1602,LTH=0070                                                 
         MFLD  FLD1702,LTH=0070                                                 
         MFLD  FLD1802,LTH=0070                                                 
         MFLD  FLD1902,LTH=0070                                                 
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=1                                              
         MSGEND                                                                 
         EJECT                                                                  
W4I111N1 MSG   TYPE=INPUT,                                             *        
               SOR=W4N111,                                             *        
               OPT=2,                                                  *        
               NXT=W4O111N1                                                     
         SEG                                                                    
         MFLD  FLDPFK,LTH=0008,FILL=NULL                                        
         MFLD  'W',LTH=1                                                        
         MFLD  FLD0102,LTH=0001,FILL=C'4'                                       
         MFLD  'T',LTH=1                                                        
         MFLD  FLD0104,LTH=0001,FILL=C'1'                                       
         MFLD  FLD0106,LTH=0001,FILL=C'1'                                       
         MFLD  FLD0108,LTH=0001,FILL=C'1'                                       
         MFLD  '  ',LTH=2                                                       
         MFLD  '41112',LTH=5                                                    
         MFLD  (FLD0211,'++++++++'),LTH=0008,FILL=C' '                          
         MFLD  FLD0311,LTH=0008,FILL=C' '                                       
         MFLD  FLD0402,LTH=0008,FILL=C' '                                       
         MFLD  (FLD0602,'++++++++'),LTH=0008,FILL=C' '                          
         MFLD  (FLD0613,'+'),LTH=0001,FILL=C'0',JUST=R                          
         MFLD  (FLD0616,'++++'),LTH=0004,FILL=C'0',JUST=R                       
         MFLD  (FLD0623,'+++'),LTH=0003,FILL=C'0',JUST=R                        
         MFLD  (FLD0628,'+++'),LTH=0003,FILL=C'0',JUST=R                        
         MFLD  (FLD0634,'++++++'),LTH=0006,FILL=C' '                            
         MFLD  (FLD0642,'+'),LTH=0001,FILL=C' '                                 
         MFLD  (FLD0647,'++'),LTH=0002,FILL=C'0',JUST=R                         
         MFLD  (FLD0651,'+++'),LTH=0003,FILL=C'0',JUST=R                        
         MFLD  (FLD0656,'+'),LTH=0001,FILL=C'0',JUST=R                          
         MFLD  (FLD0660,'+++'),LTH=0003,FILL=C'0',JUST=R                        
         MFLD  (FLD0665,'+++'),LTH=0003,FILL=C'0',JUST=R                        
         MFLD  (FLD0677,'+'),LTH=0001,FILL=C' '                                 
         MSGEND                                                                 
         EJECT                                                                  
         END                                                                    
