***********************************************************************         
* CREATED BY PC28439   ON 95/01/31  AT 11:13                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'DEFECTIVE PARTS                 '                               
W4N123   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W4T123 7',                                           +        
               8='W4T123 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T123U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T121  ',                                          +        
               14='W4T122  ',                                          +        
               15='W4T123  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((2,13)),                                        +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
         DFLD  ' ',                                                    +        
               POS=(1,10),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
         DFLD  'QUALITY DEFECTIVE PARTS',                              +        
               POS=(1,12),LTH=23,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Insp.area:',                                           +        
               POS=(2,2),LTH=10,                                       +        
               ATTR=(ALPHA,PROT)                                                
DGIA0006 DFLD  POS=(2,13),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Insp.grp:',                                            +        
               POS=(2,15),LTH=9,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0004 DFLD  POS=(2,25),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Period:',                                              +        
               POS=(2,29),LTH=7,                                       +        
               ATTR=(PROT)                                                      
TIAARPI  DFLD  POS=(2,37),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DC:',                                                  +        
               POS=(2,43),LTH=3,                                       +        
               ATTR=(PROT)                                                      
IDDCIN   DFLD  POS=(2,47),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0007 DFLD  POS=(3,13),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0005 DFLD  POS=(3,25),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
TIAARPU  DFLD  POS=(3,37),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
IDDCUT   DFLD  POS=(3,47),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0000 DFLD  POS=(4,2),LTH=8,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0002 DFLD  POS=(4,11),LTH=2,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0001 DFLD  POS=(4,14),LTH=8,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0003 DFLD  POS=(4,23),LTH=2,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
         DFLD  'Partno.  Err. Del. Partno.  Err. Del. Partno.  Err. Del+        
               . Partno.  Err. Del.',                                  +        
               POS=(5,2),LTH=75,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'code',                                                 +        
               POS=(6,11),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'code',                                                 +        
               POS=(6,30),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'code',                                                 +        
               POS=(6,49),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'code',                                                 +        
               POS=(6,68),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FLD0702  DFLD  POS=(7,2),LTH=8,                                        +        
               ATTR=(PROT)                                                      
FLD0712  DFLD  POS=(7,12),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FLD0716  DFLD  POS=(7,16),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0721  DFLD  POS=(7,21),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FLD0731  DFLD  POS=(7,31),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FLD0735  DFLD  POS=(7,35),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0740  DFLD  POS=(7,40),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FLD0750  DFLD  POS=(7,50),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FLD0754  DFLD  POS=(7,54),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0759  DFLD  POS=(7,59),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FLD0769  DFLD  POS=(7,69),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FLD0773  DFLD  POS=(7,73),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0802  DFLD  POS=(8,2),LTH=8,                                        +        
               ATTR=(PROT)                                                      
FLD0812  DFLD  POS=(8,12),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FLD0816  DFLD  POS=(8,16),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0821  DFLD  POS=(8,21),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FLD0831  DFLD  POS=(8,31),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FLD0835  DFLD  POS=(8,35),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0840  DFLD  POS=(8,40),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FLD0850  DFLD  POS=(8,50),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FLD0854  DFLD  POS=(8,54),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0859  DFLD  POS=(8,59),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FLD0869  DFLD  POS=(8,69),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FLD0873  DFLD  POS=(8,73),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0902  DFLD  POS=(9,2),LTH=8,                                        +        
               ATTR=(PROT)                                                      
FLD0912  DFLD  POS=(9,12),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FLD0916  DFLD  POS=(9,16),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0921  DFLD  POS=(9,21),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FLD0931  DFLD  POS=(9,31),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FLD0935  DFLD  POS=(9,35),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0940  DFLD  POS=(9,40),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FLD0950  DFLD  POS=(9,50),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FLD0954  DFLD  POS=(9,54),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0959  DFLD  POS=(9,59),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FLD0969  DFLD  POS=(9,69),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FLD0973  DFLD  POS=(9,73),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD1002  DFLD  POS=(10,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FLD1012  DFLD  POS=(10,12),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1016  DFLD  POS=(10,16),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1021  DFLD  POS=(10,21),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1031  DFLD  POS=(10,31),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1035  DFLD  POS=(10,35),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1040  DFLD  POS=(10,40),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1050  DFLD  POS=(10,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1054  DFLD  POS=(10,54),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1059  DFLD  POS=(10,59),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1069  DFLD  POS=(10,69),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1073  DFLD  POS=(10,73),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1102  DFLD  POS=(11,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FLD1112  DFLD  POS=(11,12),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1116  DFLD  POS=(11,16),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1121  DFLD  POS=(11,21),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1131  DFLD  POS=(11,31),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1135  DFLD  POS=(11,35),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1140  DFLD  POS=(11,40),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1150  DFLD  POS=(11,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1154  DFLD  POS=(11,54),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1159  DFLD  POS=(11,59),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1169  DFLD  POS=(11,69),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1173  DFLD  POS=(11,73),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1202  DFLD  POS=(12,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FLD1212  DFLD  POS=(12,12),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1216  DFLD  POS=(12,16),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1221  DFLD  POS=(12,21),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1231  DFLD  POS=(12,31),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1235  DFLD  POS=(12,35),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1240  DFLD  POS=(12,40),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1250  DFLD  POS=(12,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1254  DFLD  POS=(12,54),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1259  DFLD  POS=(12,59),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1269  DFLD  POS=(12,69),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1273  DFLD  POS=(12,73),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1302  DFLD  POS=(13,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FLD1312  DFLD  POS=(13,12),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1316  DFLD  POS=(13,16),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1321  DFLD  POS=(13,21),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1331  DFLD  POS=(13,31),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1335  DFLD  POS=(13,35),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1340  DFLD  POS=(13,40),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1350  DFLD  POS=(13,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1354  DFLD  POS=(13,54),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1359  DFLD  POS=(13,59),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1369  DFLD  POS=(13,69),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1373  DFLD  POS=(13,73),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1402  DFLD  POS=(14,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FLD1412  DFLD  POS=(14,12),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1416  DFLD  POS=(14,16),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1421  DFLD  POS=(14,21),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1431  DFLD  POS=(14,31),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1435  DFLD  POS=(14,35),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1440  DFLD  POS=(14,40),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1450  DFLD  POS=(14,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1454  DFLD  POS=(14,54),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1459  DFLD  POS=(14,59),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1469  DFLD  POS=(14,69),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1473  DFLD  POS=(14,73),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1502  DFLD  POS=(15,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FLD1512  DFLD  POS=(15,12),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1516  DFLD  POS=(15,16),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1521  DFLD  POS=(15,21),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1531  DFLD  POS=(15,31),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1535  DFLD  POS=(15,35),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1540  DFLD  POS=(15,40),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1550  DFLD  POS=(15,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1554  DFLD  POS=(15,54),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1559  DFLD  POS=(15,59),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1569  DFLD  POS=(15,69),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1573  DFLD  POS=(15,73),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1602  DFLD  POS=(16,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FLD1612  DFLD  POS=(16,12),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1616  DFLD  POS=(16,16),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1621  DFLD  POS=(16,21),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1631  DFLD  POS=(16,31),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1635  DFLD  POS=(16,35),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1640  DFLD  POS=(16,40),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1650  DFLD  POS=(16,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1654  DFLD  POS=(16,54),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1659  DFLD  POS=(16,59),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1669  DFLD  POS=(16,69),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1673  DFLD  POS=(16,73),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1702  DFLD  POS=(17,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FLD1712  DFLD  POS=(17,12),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1716  DFLD  POS=(17,16),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1721  DFLD  POS=(17,21),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1731  DFLD  POS=(17,31),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1735  DFLD  POS=(17,35),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1740  DFLD  POS=(17,40),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1750  DFLD  POS=(17,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1754  DFLD  POS=(17,54),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1759  DFLD  POS=(17,59),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1769  DFLD  POS=(17,69),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1773  DFLD  POS=(17,73),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1802  DFLD  POS=(18,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FLD1812  DFLD  POS=(18,12),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1816  DFLD  POS=(18,16),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1821  DFLD  POS=(18,21),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1831  DFLD  POS=(18,31),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1835  DFLD  POS=(18,35),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1840  DFLD  POS=(18,40),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1850  DFLD  POS=(18,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1854  DFLD  POS=(18,54),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1859  DFLD  POS=(18,59),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1869  DFLD  POS=(18,69),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1873  DFLD  POS=(18,73),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1902  DFLD  POS=(19,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FLD1912  DFLD  POS=(19,12),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1916  DFLD  POS=(19,16),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1921  DFLD  POS=(19,21),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1931  DFLD  POS=(19,31),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1935  DFLD  POS=(19,35),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1940  DFLD  POS=(19,40),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1950  DFLD  POS=(19,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1954  DFLD  POS=(19,54),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1959  DFLD  POS=(19,59),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1969  DFLD  POS=(19,69),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1973  DFLD  POS=(19,73),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD2002  DFLD  POS=(20,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FLD2012  DFLD  POS=(20,12),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD2016  DFLD  POS=(20,16),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD2021  DFLD  POS=(20,21),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2031  DFLD  POS=(20,31),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD2035  DFLD  POS=(20,35),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD2040  DFLD  POS=(20,40),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2050  DFLD  POS=(20,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD2054  DFLD  POS=(20,54),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD2059  DFLD  POS=(20,59),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2069  DFLD  POS=(20,69),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD2073  DFLD  POS=(20,73),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '13 Wareh. area 14 Wareh.control 15 Defect.part.16',    +        
               POS=(21,2),LTH=49,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,17),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,49),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT,HI)                                                   
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT,HI)                                               
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4I123N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N123),                                           +        
               OPT=2,                                                  +        
               NXT=W4O123N1                                                     
MIDDEN   LPAGE SOR=(FORMAT),                                           +        
               NXT=W4O123N1                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  ' ',                                                    +        
               LTH=2                                                            
         MFLD  '41232',                                                +        
               LTH=5                                                            
         MFLD  (DGIA0006,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0004,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TIAARPI,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDDCIN,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  DGIA0007,                                               +        
               LTH=1                                                            
         MFLD  DGIA0005,                                               +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  TIAARPU,                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  DGIA0000,                                               +        
               LTH=8                                                            
         MFLD  DGIA0002,                                               +        
               LTH=2                                                            
         MFLD  DGIA0001,                                               +        
               LTH=8                                                            
         MFLD  DGIA0003,                                               +        
               LTH=2                                                            
         MFLD  (FLD0702,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0712,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0716,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0721,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0731,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0735,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0740,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0750,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0754,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0759,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0769,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0773,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0802,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0812,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0816,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0821,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0831,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0835,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0840,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0850,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0854,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0859,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0869,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0873,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0902,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0912,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0916,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0921,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0931,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0935,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0940,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0950,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0954,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0959,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0969,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0973,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1002,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1012,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1016,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1021,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1031,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1035,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1040,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1050,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1054,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1059,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1069,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1073,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1102,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1112,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1116,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1121,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1131,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1135,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1140,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1150,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1154,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1159,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1169,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1173,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1202,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1212,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1216,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1221,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1231,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1235,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1240,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1250,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1254,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1259,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1269,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1273,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1302,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1312,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1316,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1321,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1331,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1335,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1340,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1350,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1354,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1359,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1369,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1373,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1402,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1412,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1416,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1421,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1431,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1435,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1440,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1450,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1454,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1459,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1469,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1473,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1502,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1512,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1516,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1521,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1531,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1535,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1540,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1550,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1554,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1559,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1569,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1573,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1602,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1612,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1616,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1621,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1631,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1635,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1640,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1650,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1654,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1659,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1669,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1673,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1702,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1712,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1716,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1721,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1731,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1735,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1740,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1750,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1754,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1759,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1769,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1773,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1802,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1812,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1816,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1821,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1831,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1835,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1840,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1850,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1854,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1859,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1869,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1873,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1902,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1912,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1916,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1921,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1931,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1935,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1940,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1950,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1954,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1959,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1969,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1973,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD2002,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD2012,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD2016,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD2021,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD2031,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD2035,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD2040,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD2050,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD2054,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD2059,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD2069,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD2073,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
W4O123N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N123,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I123N1,                                           +        
               FILL=PT                                                          
MODDEN   LPAGE SOR=FORMAT,                                             +        
               NXT=W4I123N1                                                     
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  DGIA0006,                                               +        
               LTH=2                                                            
         MFLD  DGIA0004,                                               +        
               LTH=2                                                            
         MFLD  TIAARPI,                                                +        
               LTH=2                                                            
         MFLD  IDDCIN,                                                 +        
               LTH=2                                                            
         MFLD  DGIA0007,                                               +        
               LTH=2                                                            
         MFLD  DGIA0005,                                               +        
               LTH=2                                                            
         MFLD  TIAARPU,                                                +        
               LTH=4                                                            
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  DGIA0000,                                               +        
               LTH=8                                                            
         MFLD  DGIA0002,                                               +        
               LTH=2                                                            
         MFLD  DGIA0001,                                               +        
               LTH=8                                                            
         MFLD  DGIA0003,                                               +        
               LTH=2                                                            
         MFLD  FLD0702,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD0712,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0716,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0721,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD0731,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0735,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0740,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD0750,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0754,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0759,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD0769,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0773,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0802,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD0812,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0816,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0821,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD0831,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0835,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0840,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD0850,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0854,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0859,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD0869,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0873,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0902,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD0912,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0916,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0921,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD0931,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0935,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0940,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD0950,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0954,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0959,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD0969,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0973,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1002,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1012,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1016,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1021,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1031,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1035,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1040,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1050,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1054,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1059,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1069,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1073,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1102,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1112,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1116,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1121,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1131,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1135,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1140,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1150,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1154,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1159,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1169,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1173,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1202,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1212,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1216,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1221,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1231,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1235,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1240,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1250,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1254,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1259,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1269,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1273,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1302,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1312,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1316,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1321,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1331,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1335,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1340,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1350,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1354,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1359,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1369,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1373,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1402,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1412,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1416,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1421,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1431,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1435,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1440,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1450,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1454,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1459,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1469,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1473,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1502,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1512,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1516,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1521,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1531,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1535,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1540,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1550,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1554,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1559,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1569,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1573,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1602,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1612,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1616,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1621,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1631,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1635,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1640,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1650,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1654,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1659,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1669,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1673,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1702,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1712,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1716,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1721,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1731,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1735,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1740,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1750,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1754,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1759,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1769,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1773,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1802,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1812,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1816,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1821,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1831,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1835,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1840,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1850,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1854,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1859,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1869,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1873,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1902,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1912,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1916,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1921,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1931,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1935,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1940,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1950,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1954,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1959,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1969,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1973,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2002,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD2012,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2016,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2021,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD2031,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2035,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2040,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD2050,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2054,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2059,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD2069,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2073,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  FLD2364,                                                +        
               LTH=8                                                            
         MFLD  FLD2373,                                                +        
               LTH=8                                                            
         MFLD  FSYSMSG,                                                +        
               LTH=79                                                           
         MSGEND                                                                 
         END                                                                    
