***********************************************************************         
* CREATED BY PC40073   ON 98/05/20  AT 07:22                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'PART NO. INFO DISTRIBUTION CDC  '                               
W4N104   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W4T101  ',                                           +        
               2='W4T102  ',                                           +        
               3='W4T103  ',                                           +        
               4='W4T104  ',                                           +        
               5='W4T105  ',                                           +        
               6='W4T106  ',                                           +        
               7='W4T107  ',                                           +        
               8='W4T108  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T101  ',                                          +        
               14='W4T102  ',                                          +        
               15='W4T103  ',                                          +        
               16='W4T104  ',                                          +        
               17='W4T105  ',                                          +        
               18='W4T106  ',                                          +        
               19='W4T107  ',                                          +        
               20='W4T108  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'PART NO. INFO DISTRIB CDC',                            +        
               POS=(1,11),LTH=25,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Part No.',                                             +        
               POS=(2,2),LTH=8,                                        +        
               ATTR=(ALPHA,PROT)                                                
FLD0212  DFLD  POS=(2,12),LTH=9,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0240  DFLD  POS=(2,40),LTH=3,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0245  DFLD  POS=(2,45),LTH=3,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0312  DFLD  POS=(3,12),LTH=11,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Weight',                                               +        
               POS=(5,2),LTH=6,                                        +        
               ATTR=(PROT)                                                      
FLD0516  DFLD  POS=(5,16),LTH=7,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'EFR',                                                  +        
               POS=(5,27),LTH=3,                                       +        
               ATTR=(PROT)                                                      
FLD0538  DFLD  POS=(5,40),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'OKS day',                                              +        
               POS=(5,50),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FLD0563  DFLD  POS=(5,63),LTH=7,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Volume',                                               +        
               POS=(6,2),LTH=6,                                        +        
               ATTR=(PROT)                                                      
FLD0613  DFLD  POS=(6,13),LTH=10,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'TPO balance',                                          +        
               POS=(6,27),LTH=11,                                      +        
               ATTR=(PROT)                                                      
FLD0637  DFLD  POS=(6,39),LTH=7,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'OKS bulk',                                             +        
               POS=(6,50),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FLD0663  DFLD  POS=(6,63),LTH=7,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Sort',                                                 +        
               POS=(7,2),LTH=4,                                        +        
               ATTR=(PROT)                                                      
FLD0821  DFLD  POS=(7,21),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'SBC',                                                  +        
               POS=(7,27),LTH=3,                                       +        
               ATTR=(PROT)                                                      
FLD0743  DFLD  POS=(7,45),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Goodsrec w.',                                          +        
               POS=(7,50),LTH=11,                                      +        
               ATTR=(PROT)                                                      
FLD0843  DFLD  POS=(7,69),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Vehic. bel.',                                          +        
               POS=(9,2),LTH=11,                                       +        
               ATTR=(PROT)                                                      
FLD1013  DFLD  POS=(9,14),LTH=5,                                       +        
               ATTR=(PROT)                                                      
FLD1019  DFLD  POS=(9,20),LTH=5,                                       +        
               ATTR=(PROT)                                                      
FLD1025  DFLD  POS=(9,26),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Func. group',                                          +        
               POS=(10,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
FLD1113  DFLD  POS=(10,14),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Prod. group',                                          +        
               POS=(10,27),LTH=11,                                     +        
               ATTR=(PROT)                                                      
FLD1141  DFLD  POS=(10,41),LTH=3,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Prod. code acc.',                                      +        
               POS=(10,50),LTH=15,                                     +        
               ATTR=(PROT)                                                      
FLD1167  DFLD  POS=(10,67),LTH=3,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Stat. No.',                                            +        
               POS=(11,31),LTH=9,                                      +        
               ATTR=(PROT)                                                      
FLD1302  DFLD  POS=(12,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FLD1312  DFLD  POS=(12,12),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1322  DFLD  POS=(12,22),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1332  DFLD  POS=(12,32),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1342  DFLD  POS=(12,42),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1352  DFLD  POS=(12,52),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Delivery notice',                                      +        
               POS=(14,2),LTH=15,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Quantity',                                             +        
               POS=(14,24),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Date',                                                 +        
               POS=(14,37),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD1626  DFLD  POS=(15,26),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1637  DFLD  POS=(15,37),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD1726  DFLD  POS=(16,26),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1737  DFLD  POS=(16,37),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD1826  DFLD  POS=(17,26),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1837  DFLD  POS=(17,37),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD1926  DFLD  POS=(18,26),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1937  DFLD  POS=(18,37),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD1945  DFLD  POS=(18,45),LTH=27,                                     +        
               ATTR=(PROT)                                                      
LEVBSKE1 DFLD  POS=(19,2),LTH=78,                                      +        
               ATTR=(PROT)                                                      
LEVBSKE2 DFLD  POS=(20,2),LTH=78,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'PF 22 WHELP',                                          +        
               POS=(22,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(23,59),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W4O104N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N104,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I104N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  FLD0212,                                                +        
               LTH=9                                                            
         MFLD  FLD0312,                                                +        
               LTH=11                                                           
         MFLD  FLD0240,                                                +        
               LTH=3                                                            
         MFLD  FLD0245,                                                +        
               LTH=3                                                            
         MFLD  FLD0563,                                                +        
               LTH=7                                                            
         MFLD  FLD0663,                                                +        
               LTH=7                                                            
         MFLD  FLD1113,                                                +        
               LTH=5                                                            
         MFLD  FLD1141,                                                +        
               LTH=3                                                            
         MFLD  FLD1167,                                                +        
               LTH=3                                                            
         MFLD  FLD0821,                                                +        
               LTH=2                                                            
         MFLD  FLD0516,                                                +        
               LTH=7                                                            
         MFLD  FLD0613,                                                +        
               LTH=10                                                           
         MFLD  FLD1302,                                                +        
               LTH=8                                                            
         MFLD  FLD1312,                                                +        
               LTH=8                                                            
         MFLD  FLD1322,                                                +        
               LTH=8                                                            
         MFLD  FLD1332,                                                +        
               LTH=8                                                            
         MFLD  FLD1342,                                                +        
               LTH=8                                                            
         MFLD  FLD1352,                                                +        
               LTH=8                                                            
         MFLD  FLD1013,                                                +        
               LTH=5                                                            
         MFLD  FLD1019,                                                +        
               LTH=5                                                            
         MFLD  FLD1025,                                                +        
               LTH=5                                                            
         MFLD  FLD0743,                                                +        
               LTH=1                                                            
         MFLD  FLD0843,                                                +        
               LTH=1                                                            
         MFLD  FLD0637,                                                +        
               LTH=7                                                            
         MFLD  FLD0538,                                                +        
               LTH=6                                                            
         MFLD  FLD1626,                                                +        
               LTH=6                                                            
         MFLD  FLD1726,                                                +        
               LTH=6                                                            
         MFLD  FLD1826,                                                +        
               LTH=6                                                            
         MFLD  FLD1926,                                                +        
               LTH=6                                                            
         MFLD  FLD1637,                                                +        
               LTH=4                                                            
         MFLD  FLD1737,                                                +        
               LTH=4                                                            
         MFLD  FLD1837,                                                +        
               LTH=4                                                            
         MFLD  FLD1937,                                                +        
               LTH=4                                                            
         MFLD  FLD1945,                                                +        
               LTH=27                                                           
         MFLD  LEVBSKE1,                                               +        
               LTH=80                                                           
         MFLD  LEVBSKE2,                                               +        
               LTH=80                                                           
         MFLD  (FLD2302,                                               +        
               ' '),                                                   +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I104N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N104),                                           +        
               OPT=2,                                                  +        
               NXT=W4O104N1                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F4'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '41042',                                                +        
               LTH=5                                                            
         MFLD  (FLD0212,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0312,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0240,                                               +        
               '   '),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0245,                                                +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
