***********************************************************************         
* CREATED BY R030174   ON 92/02/17  AT 13:00                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'PROFORMA HEAD  ADDITION 2       '                               
W4N267   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T267U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T261  ',                                          +        
               14='W4T262  ',                                          +        
               15='W4T264  ',                                          +        
               16='W4T265  ',                                          +        
               17='W4T266  ',                                          +        
               18='W4T267  ',                                          +        
               19='W4T268  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W4N267   DPAGE CURSOR=((2,8)),                                         +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'PROFORMA HEAD ADDITION 2',                             +        
               POS=(1,11),LTH=24,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         DFLD  'Distr',                                                +        
               POS=(2,2),LTH=5,                                        +        
               ATTR=(ALPHA,PROT)                                                
DGIA0003 DFLD  POS=(2,8),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Cust',                                                 +        
               POS=(2,15),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0007 DFLD  POS=(2,20),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Order',                                                +        
               POS=(2,27),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0009 DFLD  POS=(2,33),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '*Partno',                                              +        
               POS=(2,41),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0001 DFLD  POS=(2,49),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0004 DFLD  POS=(3,8),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
DGIA0008 DFLD  POS=(3,20),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0010 DFLD  POS=(3,33),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  '*',                                                    +        
               POS=(3,41),LTH=1,                                       +        
               ATTR=(ALPHA,PROT)                                                
DGIA0002 DFLD  POS=(3,49),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
TEDDI    DFLD  POS=(4,70),LTH=11,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Tot-ordv',                                             +        
               POS=(5,2),LTH=8,                                        +        
               ATTR=(PROT)                                                      
VARUV    DFLD  POS=(5,12),LTH=12,                                      +        
               ATTR=(NUM,PROT)                                                  
ASTRIX1  DFLD  POS=(5,25),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'FCA-value',                                            +        
               POS=(5,27),LTH=9,                                       +        
               ATTR=(PROT)                                                      
DGIA0005 DFLD  POS=(5,37),LTH=12,                                      +        
               ATTR=(NUM,PROT)                                                  
ASTRIX2  DFLD  POS=(5,50),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Total value',                                          +        
               POS=(5,52),LTH=11,                                      +        
               ATTR=(PROT)                                                      
DGIA0011 DFLD  POS=(5,65),LTH=12,                                      +        
               ATTR=(NUM,PROT)                                                  
ASTRIX3  DFLD  POS=(5,78),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'VAT',                                                  +        
               POS=(6,52),LTH=3,                                       +        
               ATTR=(PROT)                                                      
MOMS     DFLD  POS=(6,68),LTH=10,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Packing',                                              +        
               POS=(7,2),LTH=7,                                        +        
               ATTR=(PROT)                                                      
EMBKOST  DFLD  POS=(7,25),LTH=10,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Deduction',                                            +        
               POS=(8,2),LTH=9,                                        +        
               ATTR=(PROT)                                                      
AVDRAG   DFLD  POS=(8,25),LTH=10,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0000 DFLD  POS=(8,39),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '%',                                                    +        
               POS=(8,44),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Freight',                                              +        
               POS=(9,2),LTH=7,                                        +        
               ATTR=(PROT)                                                      
FRAKT    DFLD  POS=(9,25),LTH=10,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Insurance',                                            +        
               POS=(10,2),LTH=9,                                       +        
               ATTR=(PROT)                                                      
FORSAKR  DFLD  POS=(10,25),LTH=10,                                     +        
               ATTR=(NUM,NOPROT)                                                
DGIA0006 DFLD  POS=(10,37),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '%  Overinsurance',                                     +        
               POS=(10,44),LTH=16,                                     +        
               ATTR=(NUM,PROT)                                                  
OVERF    DFLD  POS=(10,63),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '%',                                                    +        
               POS=(10,68),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Legalisation',                                         +        
               POS=(11,2),LTH=12,                                      +        
               ATTR=(PROT)                                                      
LEGALIS  DFLD  POS=(11,25),LTH=10,                                     +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Currency',                                             +        
               POS=(12,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
VALUTA   DFLD  POS=(12,12),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Exrate',                                               +        
               POS=(13,2),LTH=6,                                       +        
               ATTR=(PROT)                                                      
KURS1    DFLD  POS=(13,10),LTH=11,                                     +        
               ATTR=(NUM,NOPROT)                                                
KURS2    DFLD  POS=(13,23),LTH=12,                                     +        
               ATTR=(NUM,PROT)                                                  
BEVALUTA DFLD  POS=(13,37),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Dest place',                                           +        
               POS=(15,2),LTH=10,                                      +        
               ATTR=(PROT)                                                      
DEST     DFLD  POS=(15,18),LTH=17,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'Bank account',                                         +        
               POS=(15,37),LTH=12,                                     +        
               ATTR=(PROT)                                                      
BANKK    DFLD  POS=(15,51),LTH=20,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'Banking information',                                  +        
               POS=(16,2),LTH=19,                                      +        
               ATTR=(PROT)                                                      
BANKINF1 DFLD  POS=(17,9),LTH=72,                                      +        
               ATTR=(NOPROT)                                                    
BANKINF2 DFLD  POS=(18,9),LTH=72,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  '13 New head    14 New line',                           +        
               POS=(21,2),LTH=26,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '15 Adm/del head  16 Adm/del line  17 Addition 1',      +        
               POS=(21,33),LTH=47,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '18 Addition 2  19 Addition 3   20',                    +        
               POS=(22,2),LTH=33,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,67),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         DFLD  ' VCAS',POS=(23,58)                                              
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4I267N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N267),                                           +        
               OPT=2,                                                  +        
               NXT=W4O267N1                                                     
MID      LPAGE SOR=(W4N267)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F7'                                                       
         MFLD  ' ',                                                    +        
               LTH=2                                                            
         MFLD  '42672',                                                +        
               LTH=5                                                            
         MFLD  (DGIA0003,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0007,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0009,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0001,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0004,                                               +        
               LTH=4                                                            
         MFLD  DGIA0008,                                               +        
               LTH=6                                                            
         MFLD  DGIA0010,                                               +        
               LTH=7                                                            
         MFLD  DGIA0002,                                               +        
               LTH=9                                                            
         MFLD  (AVDRAG,                                                +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0000,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FRAKT,                                                 +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FORSAKR,                                               +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0006,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (OVERF,                                                 +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (LEGALIS,                                               +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (VALUTA,                                                +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KURS1,                                                 +        
               '++++++++++++'),                                        +        
               LTH=11,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DEST,                                                  +        
               '+++++++++++++++++'),                                   +        
               LTH=17,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (BANKK,                                                 +        
               '++++++++++++++++++++'),                                +        
               LTH=20,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (BANKINF1,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++++++++++++++'),                                    +        
               LTH=72,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (BANKINF2,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++++++++++++++'),                                    +        
               LTH=72,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MSGEND                                                                 
W4O267N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N267,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I267N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W4N267                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  DGIA0003,                                               +        
               LTH=4                                                            
         MFLD  DGIA0007,                                               +        
               LTH=6                                                            
         MFLD  DGIA0009,                                               +        
               LTH=7                                                            
         MFLD  DGIA0001,                                               +        
               LTH=9                                                            
         MFLD  DGIA0004,                                               +        
               LTH=4                                                            
         MFLD  DGIA0008,                                               +        
               LTH=6                                                            
         MFLD  DGIA0010,                                               +        
               LTH=7                                                            
         MFLD  DGIA0002,                                               +        
               LTH=9                                                            
         MFLD  TEDDI,                                                  +        
               LTH=11                                                           
         MFLD  VARUV,                                                  +        
               LTH=12                                                           
         MFLD  ASTRIX1,                                                +        
               LTH=1                                                            
         MFLD  DGIA0005,                                               +        
               LTH=12                                                           
         MFLD  ASTRIX2,                                                +        
               LTH=1                                                            
         MFLD  DGIA0011,                                               +        
               LTH=12                                                           
         MFLD  ASTRIX3,                                                +        
               LTH=1                                                            
         MFLD  MOMS,                                                   +        
               LTH=10                                                           
         MFLD  EMBKOST,                                                +        
               LTH=10                                                           
         MFLD  AVDRAG,                                                 +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0000,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FRAKT,                                                  +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FORSAKR,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0006,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OVERF,                                                  +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEGALIS,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  VALUTA,                                                 +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KURS1,                                                  +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KURS2,                                                  +        
               LTH=12                                                           
         MFLD  BEVALUTA,                                               +        
               LTH=3                                                            
         MFLD  DEST,                                                   +        
               LTH=19,                                                 +        
               ATTR=(YES)                                                       
         MFLD  BANKK,                                                  +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  BANKINF1,                                               +        
               LTH=74,                                                 +        
               ATTR=(YES)                                                       
         MFLD  BANKINF2,                                               +        
               LTH=74,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  FSYSMSG,                                                +        
               LTH=79                                                           
         MSGEND                                                                 
         END                                                                    
