***********************************************************************         
* CREATED BY V086939   ON 03/03/03  AT 11:00                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'VOR ROLE DEFINITION             '                               
W4N271   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W4T271 7',                                           +        
               8='W4T271 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T271U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,8)),                                         +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'VOR Role Definition ',                                 +        
               POS=(1,11),LTH=20,                                      +        
               ATTR=(PROT)                                                      
FLD0134  DFLD  POS=(1,34),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'ROLE:',                                                +        
               POS=(2,2),LTH=5,                                        +        
               ATTR=(ALPHA,PROT)                                                
IDROLL   DFLD  POS=(2,8),LTH=5,                                        +        
               ATTR=(NOPROT)                                                    
IDROLLUT DFLD  POS=(3,8),LTH=5,                                        +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'DIST-FROM DIST-TO',                                    +        
               POS=(5,2),LTH=17,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'DIST-FROM DIST-TO',                                    +        
               POS=(5,21),LTH=17,                                      +        
               ATTR=(PROT)                                                      
DISTFO1  DFLD  POS=(6,4),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
DISTTO1  DFLD  POS=(6,13),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DISTFO13 DFLD  POS=(6,23),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DISTTO13 DFLD  POS=(6,32),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DISTFO2  DFLD  POS=(7,4),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
DISTTO2  DFLD  POS=(7,13),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DISTFO14 DFLD  POS=(7,23),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DISTTO14 DFLD  POS=(7,32),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DISTFO3  DFLD  POS=(8,4),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
DISTTO3  DFLD  POS=(8,13),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DISTFO15 DFLD  POS=(8,23),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DISTTO15 DFLD  POS=(8,32),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DISTFO4  DFLD  POS=(9,4),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
DISTTO4  DFLD  POS=(9,13),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DISTFO16 DFLD  POS=(9,23),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DISTTO16 DFLD  POS=(9,32),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DISTFO5  DFLD  POS=(10,4),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DISTTO5  DFLD  POS=(10,13),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DISTFO17 DFLD  POS=(10,23),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DISTTO17 DFLD  POS=(10,32),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DISTFO6  DFLD  POS=(11,4),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DISTTO6  DFLD  POS=(11,13),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DISTFO18 DFLD  POS=(11,23),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DISTTO18 DFLD  POS=(11,32),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DISTFO7  DFLD  POS=(12,4),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DISTTO7  DFLD  POS=(12,13),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DISTFO19 DFLD  POS=(12,23),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DISTTO19 DFLD  POS=(12,32),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DISTFO8  DFLD  POS=(13,4),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DISTTO8  DFLD  POS=(13,13),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DISTFO20 DFLD  POS=(13,23),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DISTTO20 DFLD  POS=(13,32),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DISTFO9  DFLD  POS=(14,4),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DISTTO9  DFLD  POS=(14,13),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DISTFO21 DFLD  POS=(14,23),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DISTTO21 DFLD  POS=(14,32),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DISTFO10 DFLD  POS=(15,4),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DISTTO10 DFLD  POS=(15,13),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DISTFO22 DFLD  POS=(15,23),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DISTTO22 DFLD  POS=(15,32),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DISTFO11 DFLD  POS=(16,4),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DISTTO11 DFLD  POS=(16,13),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DISTFO23 DFLD  POS=(16,23),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DISTTO23 DFLD  POS=(16,32),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DISTFO12 DFLD  POS=(17,4),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DISTTO12 DFLD  POS=(17,13),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DISTFO24 DFLD  POS=(17,23),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DISTTO24 DFLD  POS=(17,32),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'CMD DIST-FROM DIST-TO ',                               +        
               POS=(19,2),LTH=22,                                      +        
               ATTR=(PROT)                                                      
KDBEHX   DFLD  POS=(20,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DISTFOUP DFLD  POS=(20,8),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
DISTTOUP DFLD  POS=(20,18),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'F7=First  F8=Next  F10=WHELP  F11=Update',             +        
               POS=(22,2),LTH=40,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W4O271N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N271,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I271N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0134,                                                +        
               LTH=40                                                           
         MFLD  IDROLL,                                                 +        
               LTH=2                                                            
         MFLD  IDROLLUT,                                               +        
               LTH=5                                                            
         MFLD  DISTFO1,                                                +        
               LTH=4                                                            
         MFLD  DISTTO1,                                                +        
               LTH=4                                                            
         MFLD  DISTFO2,                                                +        
               LTH=4                                                            
         MFLD  DISTTO2,                                                +        
               LTH=4                                                            
         MFLD  DISTFO3,                                                +        
               LTH=4                                                            
         MFLD  DISTTO3,                                                +        
               LTH=4                                                            
         MFLD  DISTFO4,                                                +        
               LTH=4                                                            
         MFLD  DISTTO4,                                                +        
               LTH=4                                                            
         MFLD  DISTFO5,                                                +        
               LTH=4                                                            
         MFLD  DISTTO5,                                                +        
               LTH=4                                                            
         MFLD  DISTFO6,                                                +        
               LTH=4                                                            
         MFLD  DISTTO6,                                                +        
               LTH=4                                                            
         MFLD  DISTFO7,                                                +        
               LTH=4                                                            
         MFLD  DISTTO7,                                                +        
               LTH=4                                                            
         MFLD  DISTFO8,                                                +        
               LTH=4                                                            
         MFLD  DISTTO8,                                                +        
               LTH=4                                                            
         MFLD  DISTFO9,                                                +        
               LTH=4                                                            
         MFLD  DISTTO9,                                                +        
               LTH=4                                                            
         MFLD  DISTFO10,                                               +        
               LTH=4                                                            
         MFLD  DISTTO10,                                               +        
               LTH=4                                                            
         MFLD  DISTFO11,                                               +        
               LTH=4                                                            
         MFLD  DISTTO11,                                               +        
               LTH=4                                                            
         MFLD  DISTFO12,                                               +        
               LTH=4                                                            
         MFLD  DISTTO12,                                               +        
               LTH=4                                                            
         MFLD  DISTFO13,                                               +        
               LTH=4                                                            
         MFLD  DISTTO13,                                               +        
               LTH=4                                                            
         MFLD  DISTFO14,                                               +        
               LTH=4                                                            
         MFLD  DISTTO14,                                               +        
               LTH=4                                                            
         MFLD  DISTFO15,                                               +        
               LTH=4                                                            
         MFLD  DISTTO15,                                               +        
               LTH=4                                                            
         MFLD  DISTFO16,                                               +        
               LTH=4                                                            
         MFLD  DISTTO16,                                               +        
               LTH=4                                                            
         MFLD  DISTFO17,                                               +        
               LTH=4                                                            
         MFLD  DISTTO17,                                               +        
               LTH=4                                                            
         MFLD  DISTFO18,                                               +        
               LTH=4                                                            
         MFLD  DISTTO18,                                               +        
               LTH=4                                                            
         MFLD  DISTFO19,                                               +        
               LTH=4                                                            
         MFLD  DISTTO19,                                               +        
               LTH=4                                                            
         MFLD  DISTFO20,                                               +        
               LTH=4                                                            
         MFLD  DISTTO20,                                               +        
               LTH=4                                                            
         MFLD  DISTFO21,                                               +        
               LTH=4                                                            
         MFLD  DISTTO21,                                               +        
               LTH=4                                                            
         MFLD  DISTFO22,                                               +        
               LTH=4                                                            
         MFLD  DISTTO22,                                               +        
               LTH=4                                                            
         MFLD  DISTFO23,                                               +        
               LTH=4                                                            
         MFLD  DISTTO23,                                               +        
               LTH=4                                                            
         MFLD  DISTFO24,                                               +        
               LTH=4                                                            
         MFLD  DISTTO24,                                               +        
               LTH=4                                                            
         MFLD  KDBEHX,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DISTFOUP,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DISTTOUP,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I271N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N271),                                           +        
               OPT=2,                                                  +        
               NXT=W4O271N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F7'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '42712',                                                +        
               LTH=5                                                            
         MFLD  (IDROLL,                                                +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDROLLUT,                                              +        
               '     '),                                               +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KDBEHX,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DISTFOUP,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DISTTOUP,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
