***********************************************************************         
* CREATED BY R030174   ON 92/02/17  AT 12:33                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'ANSWER ORDER                    '                               
W4N243   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W4T243 7',                                           +        
               3='W4T243 7',                                           +        
               4='W4T243 7',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W4T243 7',                                           +        
               8='W4T243 8',                                           +        
               9='W0T813 9',                                           +        
               10='W0T501  ',                                          +        
               11='W4T243U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='W0T501  ',                                          +        
               23='W4T243V  ',                                         +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W4N243   DPAGE CURSOR=((2,8)),                                         +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'ANSWER ORDER ENTRY',                                   +        
               POS=(1,12),LTH=18,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         DFLD  'Distr',                                                +        
               POS=(2,2),LTH=5,                                        +        
               ATTR=(ALPHA,PROT)                                                
IDDISTRI DFLD  POS=(2,8),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Cust',                                                 +        
               POS=(2,14),LTH=4,                                       +        
               ATTR=(PROT)                                                      
IDKUNDNI DFLD  POS=(2,19),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Order',                                                +        
               POS=(2,27),LTH=5,                                       +        
               ATTR=(PROT)                                                      
IDORDNRI DFLD  POS=(2,33),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Cancellation',                                         +        
               POS=(2,59),LTH=12,                                      +        
               ATTR=(PROT)                                                      
FLANNULL DFLD  POS=(2,72),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDDISTRU DFLD  POS=(3,8),LTH=4,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
IDKUNDGU DFLD  POS=(3,19),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
IDORDNRU DFLD  POS=(3,33),LTH=5,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  'Cl',                                                   +        
               POS=(3,42),LTH=2,                                       +        
               ATTR=(PROT)                                                      
KDORDKLU DFLD  POS=(3,45),LTH=1,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
IDARTNRN DFLD  POS=(4,22),LTH=9,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
IDLOPNRN DFLD  POS=(4,32),LTH=3,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
IDSEKNRN DFLD  POS=(4,36),LTH=3,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
KDCLAGN  DFLD  POS=(4,40),LTH=2,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
KDORDBKN DFLD  POS=(4,43),LTH=2,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
TEDDI    DFLD  POS=(4,70),LTH=11,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Code CMD   Part no. Description',                      +        
               POS=(5,2),LTH=31,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'DC',                                                   +        
               POS=(5,38),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Qty    Q ',                                            +        
               POS=(5,45),LTH=9,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Ref',                                                  +        
               POS=(5,59),LTH=3,                                       +        
               ATTR=(PROT)                                                      
KOD01    DFLD  POS=(6,2),LTH=2,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
AST01    DFLD  POS=(6,5),LTH=1,                                        +        
               ATTR=(PROT)                                                      
ANNULL01 DFLD  POS=(6,8),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDARTN01 DFLD  POS=(6,10),LTH=11,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
BEART01  DFLD  POS=(6,22),LTH=15,                                      +        
               ATTR=(NUM,PROT)                                                  
KDCLAG01 DFLD  POS=(6,38),LTH=2,                                       +        
               ATTR=(ALPHA,PROT,MOD)                                            
KVANT01  DFLD  POS=(6,41),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
KVQP01   DFLD  POS=(6,49),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
OREF01   DFLD  POS=(6,55),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KEYS01   DFLD  POS=(6,63),LTH=18,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KOD02    DFLD  POS=(7,2),LTH=2,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
AST02    DFLD  POS=(7,5),LTH=1,                                        +        
               ATTR=(PROT)                                                      
ANNULL02 DFLD  POS=(7,8),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDARTN02 DFLD  POS=(7,10),LTH=11,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
BEART02  DFLD  POS=(7,22),LTH=15,                                      +        
               ATTR=(NUM,PROT)                                                  
KDCLAG02 DFLD  POS=(7,38),LTH=2,                                       +        
               ATTR=(ALPHA,PROT,MOD)                                            
KVANT02  DFLD  POS=(7,41),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
KVQP02   DFLD  POS=(7,49),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
OREF02   DFLD  POS=(7,55),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KEYS02   DFLD  POS=(7,63),LTH=18,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KOD03    DFLD  POS=(8,2),LTH=2,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
AST03    DFLD  POS=(8,5),LTH=1,                                        +        
               ATTR=(PROT)                                                      
ANNULL03 DFLD  POS=(8,8),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDARTN03 DFLD  POS=(8,10),LTH=11,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
BEART03  DFLD  POS=(8,22),LTH=15,                                      +        
               ATTR=(NUM,PROT)                                                  
KDCLAG03 DFLD  POS=(8,38),LTH=2,                                       +        
               ATTR=(ALPHA,PROT,MOD)                                            
KVANT03  DFLD  POS=(8,41),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
KVQP03   DFLD  POS=(8,49),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
OREF03   DFLD  POS=(8,55),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KEYS03   DFLD  POS=(8,63),LTH=18,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KOD04    DFLD  POS=(9,2),LTH=2,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
AST04    DFLD  POS=(9,5),LTH=1,                                        +        
               ATTR=(PROT)                                                      
ANNULL04 DFLD  POS=(9,8),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDARTN04 DFLD  POS=(9,10),LTH=11,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
BEART04  DFLD  POS=(9,22),LTH=15,                                      +        
               ATTR=(NUM,PROT)                                                  
KDCLAG04 DFLD  POS=(9,38),LTH=2,                                       +        
               ATTR=(ALPHA,PROT,MOD)                                            
KVANT04  DFLD  POS=(9,41),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
KVQP04   DFLD  POS=(9,49),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
OREF04   DFLD  POS=(9,55),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KEYS04   DFLD  POS=(9,63),LTH=18,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KOD05    DFLD  POS=(10,2),LTH=2,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
AST05    DFLD  POS=(10,5),LTH=1,                                       +        
               ATTR=(PROT)                                                      
ANNULL05 DFLD  POS=(10,8),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDARTN05 DFLD  POS=(10,10),LTH=11,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
BEART05  DFLD  POS=(10,22),LTH=15,                                     +        
               ATTR=(NUM,PROT)                                                  
KDCLAG05 DFLD  POS=(10,38),LTH=2,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KVANT05  DFLD  POS=(10,41),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
KVQP05   DFLD  POS=(10,49),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
OREF05   DFLD  POS=(10,55),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KEYS05   DFLD  POS=(10,63),LTH=18,                                     +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KOD06    DFLD  POS=(11,2),LTH=2,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
AST06    DFLD  POS=(11,5),LTH=1,                                       +        
               ATTR=(PROT)                                                      
ANNULL06 DFLD  POS=(11,8),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDARTN06 DFLD  POS=(11,10),LTH=11,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
BEART06  DFLD  POS=(11,22),LTH=15,                                     +        
               ATTR=(NUM,PROT)                                                  
KDCLAG06 DFLD  POS=(11,38),LTH=2,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KVANT06  DFLD  POS=(11,41),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
KVQP06   DFLD  POS=(11,49),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
OREF06   DFLD  POS=(11,55),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KEYS06   DFLD  POS=(11,63),LTH=18,                                     +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KOD07    DFLD  POS=(12,2),LTH=2,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
AST07    DFLD  POS=(12,5),LTH=1,                                       +        
               ATTR=(PROT)                                                      
ANNULL07 DFLD  POS=(12,8),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDARTN07 DFLD  POS=(12,10),LTH=11,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
BEART07  DFLD  POS=(12,22),LTH=15,                                     +        
               ATTR=(NUM,PROT)                                                  
KDCLAG07 DFLD  POS=(12,38),LTH=2,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KVANT07  DFLD  POS=(12,41),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
KVQP07   DFLD  POS=(12,49),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
OREF07   DFLD  POS=(12,55),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KEYS07   DFLD  POS=(12,63),LTH=18,                                     +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KOD08    DFLD  POS=(13,2),LTH=2,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
AST08    DFLD  POS=(13,5),LTH=1,                                       +        
               ATTR=(PROT)                                                      
ANNULL08 DFLD  POS=(13,8),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDARTN08 DFLD  POS=(13,10),LTH=11,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
BEART08  DFLD  POS=(13,22),LTH=15,                                     +        
               ATTR=(NUM,PROT)                                                  
KDCLAG08 DFLD  POS=(13,38),LTH=2,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KVANT08  DFLD  POS=(13,41),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
KVQP08   DFLD  POS=(13,49),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
OREF08   DFLD  POS=(13,55),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KEYS08   DFLD  POS=(13,63),LTH=18,                                     +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KOD09    DFLD  POS=(14,2),LTH=2,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
AST09    DFLD  POS=(14,5),LTH=1,                                       +        
               ATTR=(PROT)                                                      
ANNULL09 DFLD  POS=(14,8),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDARTN09 DFLD  POS=(14,10),LTH=11,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
BEART09  DFLD  POS=(14,22),LTH=15,                                     +        
               ATTR=(NUM,PROT)                                                  
KDCLAG09 DFLD  POS=(14,38),LTH=2,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KVANT09  DFLD  POS=(14,41),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
KVQP09   DFLD  POS=(14,49),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
OREF09   DFLD  POS=(14,55),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KEYS09   DFLD  POS=(14,63),LTH=18,                                     +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KOD10    DFLD  POS=(15,2),LTH=2,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
AST10    DFLD  POS=(15,5),LTH=1,                                       +        
               ATTR=(PROT)                                                      
ANNULL10 DFLD  POS=(15,8),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDARTN10 DFLD  POS=(15,10),LTH=11,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
BEART10  DFLD  POS=(15,22),LTH=15,                                     +        
               ATTR=(NUM,PROT)                                                  
KDCLAG10 DFLD  POS=(15,38),LTH=2,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KVANT10  DFLD  POS=(15,41),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
KVQP10   DFLD  POS=(15,49),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
OREF10   DFLD  POS=(15,55),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KEYS10   DFLD  POS=(15,63),LTH=18,                                     +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KOD11    DFLD  POS=(16,2),LTH=2,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
AST11    DFLD  POS=(16,5),LTH=1,                                       +        
               ATTR=(PROT)                                                      
ANNULL11 DFLD  POS=(16,8),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDARTN11 DFLD  POS=(16,10),LTH=11,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
BEART11  DFLD  POS=(16,22),LTH=15,                                     +        
               ATTR=(NUM,PROT)                                                  
KDCLAG11 DFLD  POS=(16,38),LTH=2,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KVANT11  DFLD  POS=(16,41),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
KVQP11   DFLD  POS=(16,49),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
OREF11   DFLD  POS=(16,55),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KEYS11   DFLD  POS=(16,63),LTH=18,                                     +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KOD12    DFLD  POS=(17,2),LTH=2,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
AST12    DFLD  POS=(17,5),LTH=1,                                       +        
               ATTR=(PROT)                                                      
ANNULL12 DFLD  POS=(17,8),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDARTN12 DFLD  POS=(17,10),LTH=11,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
BEART12  DFLD  POS=(17,22),LTH=15,                                     +        
               ATTR=(NUM,PROT)                                                  
KDCLAG12 DFLD  POS=(17,38),LTH=2,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KVANT12  DFLD  POS=(17,41),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
KVQP12   DFLD  POS=(17,49),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
OREF12   DFLD  POS=(17,55),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KEYS12   DFLD  POS=(17,63),LTH=18,                                     +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KOD13    DFLD  POS=(18,2),LTH=2,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
AST13    DFLD  POS=(18,5),LTH=1,                                       +        
               ATTR=(PROT)                                                      
ANNULL13 DFLD  POS=(18,8),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDARTN13 DFLD  POS=(18,10),LTH=11,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
BEART13  DFLD  POS=(18,22),LTH=15,                                     +        
               ATTR=(NUM,PROT)                                                  
KDCLAG13 DFLD  POS=(18,38),LTH=2,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KVANT13  DFLD  POS=(18,41),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
KVQP13   DFLD  POS=(18,49),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
OREF13   DFLD  POS=(18,55),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KEYS13   DFLD  POS=(18,63),LTH=18,                                     +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
         DFLD  'Code-info: screen 0813 PF9',                           +        
               POS=(19,2),LTH=26,                                      +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  '13',                                                   +        
               POS=(21,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '14',                                                   +        
               POS=(21,17),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '15',                                                   +        
               POS=(21,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16',                                                   +        
               POS=(21,49),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,17),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,49),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10',                                                   +        
               POS=(22,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         DFLD  ' VCAS',POS=(23,58)                                              
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4I243N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N243),                                           +        
               OPT=2,                                                  +        
               NXT=W4O243N1                                                     
MID      LPAGE SOR=(W4N243)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '42432',                                                +        
               LTH=5                                                            
         MFLD  (IDDISTRI,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDKUNDNI,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDORDNRI,                                              +        
               '+++++++'),                                             +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDDISTRU,                                               +        
               LTH=4                                                            
         MFLD  IDKUNDGU,                                               +        
               LTH=6                                                            
         MFLD  IDORDNRU,                                               +        
               LTH=5                                                            
         MFLD  KDORDKLU,                                               +        
               LTH=1                                                            
         MFLD  (FLANNULL,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  IDARTNRN,                                               +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDLOPNRN,                                               +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDSEKNRN,                                               +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KDCLAGN,                                                +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KDORDBKN,                                               +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KOD01,                                                  +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (ANNULL01,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDARTN01,                                               +        
               LTH=11,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KDCLAG01,                                               +        
               LTH=2                                                            
         MFLD  OREF01,                                                 +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KEYS01,                                                 +        
               LTH=18                                                           
         MFLD  KOD02,                                                  +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (ANNULL02,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDARTN02,                                               +        
               LTH=11,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KDCLAG02,                                               +        
               LTH=2                                                            
         MFLD  OREF02,                                                 +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KEYS02,                                                 +        
               LTH=18                                                           
         MFLD  KOD03,                                                  +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (ANNULL03,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDARTN03,                                               +        
               LTH=11,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KDCLAG03,                                               +        
               LTH=2                                                            
         MFLD  OREF03,                                                 +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KEYS03,                                                 +        
               LTH=18                                                           
         MFLD  KOD04,                                                  +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (ANNULL04,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDARTN04,                                               +        
               LTH=11,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KDCLAG04,                                               +        
               LTH=2                                                            
         MFLD  OREF04,                                                 +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KEYS04,                                                 +        
               LTH=18                                                           
         MFLD  KOD05,                                                  +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (ANNULL05,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDARTN05,                                               +        
               LTH=11,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KDCLAG05,                                               +        
               LTH=2                                                            
         MFLD  OREF05,                                                 +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KEYS05,                                                 +        
               LTH=18                                                           
         MFLD  KOD06,                                                  +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (ANNULL06,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDARTN06,                                               +        
               LTH=11,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KDCLAG06,                                               +        
               LTH=2                                                            
         MFLD  OREF06,                                                 +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KEYS06,                                                 +        
               LTH=18                                                           
         MFLD  KOD07,                                                  +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (ANNULL07,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDARTN07,                                               +        
               LTH=11,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KDCLAG07,                                               +        
               LTH=2                                                            
         MFLD  OREF07,                                                 +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KEYS07,                                                 +        
               LTH=18                                                           
         MFLD  KOD08,                                                  +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (ANNULL08,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDARTN08,                                               +        
               LTH=11,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KDCLAG08,                                               +        
               LTH=2                                                            
         MFLD  OREF08,                                                 +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KEYS08,                                                 +        
               LTH=18                                                           
         MFLD  KOD09,                                                  +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (ANNULL09,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDARTN09,                                               +        
               LTH=11,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KDCLAG09,                                               +        
               LTH=2                                                            
         MFLD  OREF09,                                                 +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KEYS09,                                                 +        
               LTH=18                                                           
         MFLD  KOD10,                                                  +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (ANNULL10,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDARTN10,                                               +        
               LTH=11,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KDCLAG10,                                               +        
               LTH=2                                                            
         MFLD  OREF10,                                                 +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KEYS10,                                                 +        
               LTH=18                                                           
         MFLD  KOD11,                                                  +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (ANNULL11,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDARTN11,                                               +        
               LTH=11,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KDCLAG11,                                               +        
               LTH=2                                                            
         MFLD  OREF11,                                                 +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KEYS11,                                                 +        
               LTH=18                                                           
         MFLD  KOD12,                                                  +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (ANNULL12,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDARTN12,                                               +        
               LTH=11,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KDCLAG12,                                               +        
               LTH=2                                                            
         MFLD  OREF12,                                                 +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KEYS12,                                                 +        
               LTH=18                                                           
         MFLD  KOD13,                                                  +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (ANNULL13,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDARTN13,                                               +        
               LTH=11,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KDCLAG13,                                               +        
               LTH=2                                                            
         MFLD  OREF13,                                                 +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KEYS13,                                                 +        
               LTH=18                                                           
         MSGEND                                                                 
W4O243N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N243,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I243N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W4N243                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTRANS2,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDDISTRI,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDKUNDNI,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDORDNRI,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLANNULL,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDDISTRU,                                               +        
               LTH=4                                                            
         MFLD  IDKUNDGU,                                               +        
               LTH=6                                                            
         MFLD  IDORDNRU,                                               +        
               LTH=5                                                            
         MFLD  KDORDKLU,                                               +        
               LTH=1                                                            
         MFLD  IDARTNRN,                                               +        
               LTH=9                                                            
         MFLD  IDLOPNRN,                                               +        
               LTH=3                                                            
         MFLD  IDSEKNRN,                                               +        
               LTH=3                                                            
         MFLD  KDCLAGN,                                                +        
               LTH=2                                                            
         MFLD  KDORDBKN,                                               +        
               LTH=2                                                            
         MFLD  TEDDI,                                                  +        
               LTH=11                                                           
         MFLD  KOD01,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AST01,                                                  +        
               LTH=1                                                            
         MFLD  ANNULL01,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTN01,                                               +        
               LTH=11                                                           
         MFLD  BEART01,                                                +        
               LTH=15                                                           
         MFLD  KDCLAG01,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVANT01,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVQP01,                                                 +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OREF01,                                                 +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KEYS01,                                                 +        
               LTH=18                                                           
         MFLD  KOD02,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AST02,                                                  +        
               LTH=1                                                            
         MFLD  ANNULL02,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTN02,                                               +        
               LTH=11                                                           
         MFLD  BEART02,                                                +        
               LTH=15                                                           
         MFLD  KDCLAG02,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVANT02,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVQP02,                                                 +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OREF02,                                                 +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KEYS02,                                                 +        
               LTH=18                                                           
         MFLD  KOD03,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AST03,                                                  +        
               LTH=1                                                            
         MFLD  ANNULL03,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTN03,                                               +        
               LTH=11                                                           
         MFLD  BEART03,                                                +        
               LTH=15                                                           
         MFLD  KDCLAG03,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVANT03,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVQP03,                                                 +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OREF03,                                                 +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KEYS03,                                                 +        
               LTH=18                                                           
         MFLD  KOD04,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AST04,                                                  +        
               LTH=1                                                            
         MFLD  ANNULL04,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTN04,                                               +        
               LTH=11                                                           
         MFLD  BEART04,                                                +        
               LTH=15                                                           
         MFLD  KDCLAG04,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVANT04,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVQP04,                                                 +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OREF04,                                                 +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KEYS04,                                                 +        
               LTH=18                                                           
         MFLD  KOD05,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AST05,                                                  +        
               LTH=1                                                            
         MFLD  ANNULL05,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTN05,                                               +        
               LTH=11                                                           
         MFLD  BEART05,                                                +        
               LTH=15                                                           
         MFLD  KDCLAG05,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVANT05,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVQP05,                                                 +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OREF05,                                                 +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KEYS05,                                                 +        
               LTH=18                                                           
         MFLD  KOD06,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AST06,                                                  +        
               LTH=1                                                            
         MFLD  ANNULL06,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTN06,                                               +        
               LTH=11                                                           
         MFLD  BEART06,                                                +        
               LTH=15                                                           
         MFLD  KDCLAG06,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVANT06,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVQP06,                                                 +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OREF06,                                                 +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KEYS06,                                                 +        
               LTH=18                                                           
         MFLD  KOD07,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AST07,                                                  +        
               LTH=1                                                            
         MFLD  ANNULL07,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTN07,                                               +        
               LTH=11                                                           
         MFLD  BEART07,                                                +        
               LTH=15                                                           
         MFLD  KDCLAG07,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVANT07,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVQP07,                                                 +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OREF07,                                                 +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KEYS07,                                                 +        
               LTH=18                                                           
         MFLD  KOD08,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AST08,                                                  +        
               LTH=1                                                            
         MFLD  ANNULL08,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTN08,                                               +        
               LTH=11                                                           
         MFLD  BEART08,                                                +        
               LTH=15                                                           
         MFLD  KDCLAG08,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVANT08,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVQP08,                                                 +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OREF08,                                                 +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KEYS08,                                                 +        
               LTH=18                                                           
         MFLD  KOD09,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AST09,                                                  +        
               LTH=1                                                            
         MFLD  ANNULL09,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTN09,                                               +        
               LTH=11                                                           
         MFLD  BEART09,                                                +        
               LTH=15                                                           
         MFLD  KDCLAG09,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVANT09,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVQP09,                                                 +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OREF09,                                                 +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KEYS09,                                                 +        
               LTH=18                                                           
         MFLD  KOD10,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AST10,                                                  +        
               LTH=1                                                            
         MFLD  ANNULL10,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTN10,                                               +        
               LTH=11                                                           
         MFLD  BEART10,                                                +        
               LTH=15                                                           
         MFLD  KDCLAG10,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVANT10,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVQP10,                                                 +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OREF10,                                                 +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KEYS10,                                                 +        
               LTH=18                                                           
         MFLD  KOD11,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AST11,                                                  +        
               LTH=1                                                            
         MFLD  ANNULL11,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTN11,                                               +        
               LTH=11                                                           
         MFLD  BEART11,                                                +        
               LTH=15                                                           
         MFLD  KDCLAG11,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVANT11,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVQP11,                                                 +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OREF11,                                                 +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KEYS11,                                                 +        
               LTH=18                                                           
         MFLD  KOD12,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AST12,                                                  +        
               LTH=1                                                            
         MFLD  ANNULL12,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTN12,                                               +        
               LTH=11                                                           
         MFLD  BEART12,                                                +        
               LTH=15                                                           
         MFLD  KDCLAG12,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVANT12,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVQP12,                                                 +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OREF12,                                                 +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KEYS12,                                                 +        
               LTH=18                                                           
         MFLD  KOD13,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AST13,                                                  +        
               LTH=1                                                            
         MFLD  ANNULL13,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTN13,                                               +        
               LTH=11                                                           
         MFLD  BEART13,                                                +        
               LTH=15                                                           
         MFLD  KDCLAG13,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVANT13,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVQP13,                                                 +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OREF13,                                                 +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KEYS13,                                                 +        
               LTH=18                                                           
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
