***********************************************************************         
* CREATED BY V086939   ON 03/03/17  AT 10:00                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'VOR QUESTION                    '                               
W4N228   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W4T228 7',                                           +        
               8='W4T228 8',                                           +        
               9='W4T228 9',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,8)),                                         +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'VOR Question        ',                                 +        
               POS=(1,11),LTH=20,                                      +        
               ATTR=(PROT)                                                      
FLD0134  DFLD  POS=(1,34),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Distr',                                                +        
               POS=(2,2),LTH=5,                                        +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  'Customer',                                             +        
               POS=(2,14),LTH=8,                                       +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  'Order',                                                +        
               POS=(2,31),LTH=5,                                       +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  'Del.order',                                            +        
               POS=(2,46),LTH=9,                                       +        
               ATTR=(ALPHA,PROT)                                                
IDDIST   DFLD  POS=(2,8),LTH=4,                                        +        
               ATTR=(NOPROT)                                                    
IDKUND   DFLD  POS=(2,23),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
IDORDER  DFLD  POS=(2,37),LTH=7,                                       +        
               ATTR=(NOPROT)                                                    
LORDER   DFLD  POS=(2,56),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
IDDISTUT DFLD  POS=(3,8),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
IDKUNDUT DFLD  POS=(3,23),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
IDORDERU DFLD  POS=(3,37),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
LORDERUT DFLD  POS=(3,56),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'CMD',                                                  +        
               POS=(5,2),LTH=3,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'Order',                                                +        
               POS=(5,8),LTH=5,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'Partno',                                               +        
               POS=(5,14),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Regist-time',                                          +        
               POS=(5,23),LTH=11,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Ord-qty',                                              +        
               POS=(5,36),LTH=7,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Del-qty',                                              +        
               POS=(5,44),LTH=7,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Code',                                                 +        
               POS=(5,52),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Dorder',                                               +        
               POS=(5,59),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Ready-time',                                           +        
               POS=(5,66),LTH=10,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'T',                                                    +        
               POS=(5,79),LTH=1,                                       +        
               ATTR=(PROT)                                                      
CMD1     DFLD  POS=(6,3),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
ORDER1   DFLD  POS=(6,6),LTH=7,                                        +        
               ATTR=(PROT,MOD)                                                  
ARTNR1   DFLD  POS=(6,14),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
REGDAT1  DFLD  POS=(6,23),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
REGTID1  DFLD  POS=(6,30),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
URSANT1  DFLD  POS=(6,36),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
LEVANT1  DFLD  POS=(6,44),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
KOD1     DFLD  POS=(6,52),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
LORDER1  DFLD  POS=(6,57),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
LEVDAT1  DFLD  POS=(6,66),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
LEVTID1  DFLD  POS=(6,73),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
T1       DFLD  POS=(6,79),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
CMD2     DFLD  POS=(7,3),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
ORDER2   DFLD  POS=(7,6),LTH=7,                                        +        
               ATTR=(PROT,MOD)                                                  
ARTNR2   DFLD  POS=(7,14),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
REGDAT2  DFLD  POS=(7,23),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
REGTID2  DFLD  POS=(7,30),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
URSANT2  DFLD  POS=(7,36),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
LEVANT2  DFLD  POS=(7,44),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
KOD2     DFLD  POS=(7,52),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
LORDER2  DFLD  POS=(7,57),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
LEVDAT2  DFLD  POS=(7,66),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
LEVTID2  DFLD  POS=(7,73),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
T2       DFLD  POS=(7,79),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
CMD3     DFLD  POS=(8,3),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
ORDER3   DFLD  POS=(8,6),LTH=7,                                        +        
               ATTR=(PROT,MOD)                                                  
ARTNR3   DFLD  POS=(8,14),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
REGDAT3  DFLD  POS=(8,23),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
REGTID3  DFLD  POS=(8,30),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
URSANT3  DFLD  POS=(8,36),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
LEVANT3  DFLD  POS=(8,44),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
KOD3     DFLD  POS=(8,52),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
LORDER3  DFLD  POS=(8,57),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
LEVDAT3  DFLD  POS=(8,66),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
LEVTID3  DFLD  POS=(8,73),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
T3       DFLD  POS=(8,79),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
CMD4     DFLD  POS=(9,3),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
ORDER4   DFLD  POS=(9,6),LTH=7,                                        +        
               ATTR=(PROT,MOD)                                                  
ARTNR4   DFLD  POS=(9,14),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
REGDAT4  DFLD  POS=(9,23),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
REGTID4  DFLD  POS=(9,30),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
URSANT4  DFLD  POS=(9,36),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
LEVANT4  DFLD  POS=(9,44),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
KOD4     DFLD  POS=(9,52),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
LORDER4  DFLD  POS=(9,57),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
LEVDAT4  DFLD  POS=(9,66),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
LEVTID4  DFLD  POS=(9,73),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
T4       DFLD  POS=(9,79),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
CMD5     DFLD  POS=(10,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
ORDER5   DFLD  POS=(10,6),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
ARTNR5   DFLD  POS=(10,14),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
REGDAT5  DFLD  POS=(10,23),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
REGTID5  DFLD  POS=(10,30),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
URSANT5  DFLD  POS=(10,36),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
LEVANT5  DFLD  POS=(10,44),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
KOD5     DFLD  POS=(10,52),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
LORDER5  DFLD  POS=(10,57),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
LEVDAT5  DFLD  POS=(10,66),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
LEVTID5  DFLD  POS=(10,73),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
T5       DFLD  POS=(10,79),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
CMD6     DFLD  POS=(11,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
ORDER6   DFLD  POS=(11,6),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
ARTNR6   DFLD  POS=(11,14),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
REGDAT6  DFLD  POS=(11,23),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
REGTID6  DFLD  POS=(11,30),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
URSANT6  DFLD  POS=(11,36),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
LEVANT6  DFLD  POS=(11,44),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
KOD6     DFLD  POS=(11,52),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
LORDER6  DFLD  POS=(11,57),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
LEVDAT6  DFLD  POS=(11,66),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
LEVTID6  DFLD  POS=(11,73),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
T6       DFLD  POS=(11,79),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
CMD7     DFLD  POS=(12,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
ORDER7   DFLD  POS=(12,6),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
ARTNR7   DFLD  POS=(12,14),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
REGDAT7  DFLD  POS=(12,23),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
REGTID7  DFLD  POS=(12,30),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
URSANT7  DFLD  POS=(12,36),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
LEVANT7  DFLD  POS=(12,44),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
KOD7     DFLD  POS=(12,52),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
LORDER7  DFLD  POS=(12,57),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
LEVDAT7  DFLD  POS=(12,66),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
LEVTID7  DFLD  POS=(12,73),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
T7       DFLD  POS=(12,79),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
CMD8     DFLD  POS=(13,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
ORDER8   DFLD  POS=(13,6),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
ARTNR8   DFLD  POS=(13,14),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
REGDAT8  DFLD  POS=(13,23),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
REGTID8  DFLD  POS=(13,30),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
URSANT8  DFLD  POS=(13,36),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
LEVANT8  DFLD  POS=(13,44),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
KOD8     DFLD  POS=(13,52),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
LORDER8  DFLD  POS=(13,57),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
LEVDAT8  DFLD  POS=(13,66),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
LEVTID8  DFLD  POS=(13,73),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
T8       DFLD  POS=(13,79),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
CMD9     DFLD  POS=(14,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
ORDER9   DFLD  POS=(14,6),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
ARTNR9   DFLD  POS=(14,14),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
REGDAT9  DFLD  POS=(14,23),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
REGTID9  DFLD  POS=(14,30),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
URSANT9  DFLD  POS=(14,36),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
LEVANT9  DFLD  POS=(14,44),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
KOD9     DFLD  POS=(14,52),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
LORDER9  DFLD  POS=(14,57),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
LEVDAT9  DFLD  POS=(14,66),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
LEVTID9  DFLD  POS=(14,73),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
T9       DFLD  POS=(14,79),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
CMD10    DFLD  POS=(15,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
ORDER10  DFLD  POS=(15,6),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
ARTNR10  DFLD  POS=(15,14),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
REGDAT10 DFLD  POS=(15,23),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
REGTID10 DFLD  POS=(15,30),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
URSANT10 DFLD  POS=(15,36),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
LEVANT10 DFLD  POS=(15,44),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
KOD10    DFLD  POS=(15,52),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
LORDER10 DFLD  POS=(15,57),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
LEVDAT10 DFLD  POS=(15,66),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
LEVTID10 DFLD  POS=(15,73),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
T10      DFLD  POS=(15,79),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
CMD11    DFLD  POS=(16,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
ORDER11  DFLD  POS=(16,6),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
ARTNR11  DFLD  POS=(16,14),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
REGDAT11 DFLD  POS=(16,23),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
REGTID11 DFLD  POS=(16,30),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
URSANT11 DFLD  POS=(16,36),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
LEVANT11 DFLD  POS=(16,44),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
KOD11    DFLD  POS=(16,52),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
LORDER11 DFLD  POS=(16,57),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
LEVDAT11 DFLD  POS=(16,66),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
LEVTID11 DFLD  POS=(16,73),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
T11      DFLD  POS=(16,79),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
CMD12    DFLD  POS=(17,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
ORDER12  DFLD  POS=(17,6),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
ARTNR12  DFLD  POS=(17,14),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
REGDAT12 DFLD  POS=(17,23),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
REGTID12 DFLD  POS=(17,30),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
URSANT12 DFLD  POS=(17,36),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
LEVANT12 DFLD  POS=(17,44),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
KOD12    DFLD  POS=(17,52),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
LORDER12 DFLD  POS=(17,57),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
LEVDAT12 DFLD  POS=(17,66),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
LEVTID12 DFLD  POS=(17,73),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
T12      DFLD  POS=(17,79),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
CMD13    DFLD  POS=(18,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
ORDER13  DFLD  POS=(18,6),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
ARTNR13  DFLD  POS=(18,14),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
REGDAT13 DFLD  POS=(18,23),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
REGTID13 DFLD  POS=(18,30),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
URSANT13 DFLD  POS=(18,36),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
LEVANT13 DFLD  POS=(18,44),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
KOD13    DFLD  POS=(18,52),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
LORDER13 DFLD  POS=(18,57),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
LEVDAT13 DFLD  POS=(18,66),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
LEVTID13 DFLD  POS=(18,73),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
T13      DFLD  POS=(18,79),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
CMD14    DFLD  POS=(19,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
ORDER14  DFLD  POS=(19,6),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
ARTNR14  DFLD  POS=(19,14),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
REGDAT14 DFLD  POS=(19,23),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
REGTID14 DFLD  POS=(19,30),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
URSANT14 DFLD  POS=(19,36),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
LEVANT14 DFLD  POS=(19,44),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
KOD14    DFLD  POS=(19,52),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
LORDER14 DFLD  POS=(19,57),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
LEVDAT14 DFLD  POS=(19,66),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
LEVTID14 DFLD  POS=(19,73),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
T14      DFLD  POS=(19,79),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
CMD15    DFLD  POS=(20,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
ORDER15  DFLD  POS=(20,6),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
ARTNR15  DFLD  POS=(20,14),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
REGDAT15 DFLD  POS=(20,23),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
REGTID15 DFLD  POS=(20,30),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
URSANT15 DFLD  POS=(20,36),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
LEVANT15 DFLD  POS=(20,44),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
KOD15    DFLD  POS=(20,52),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
LORDER15 DFLD  POS=(20,57),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
LEVDAT15 DFLD  POS=(20,66),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
LEVTID15 DFLD  POS=(20,73),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
T15      DFLD  POS=(20,79),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'F7=First  F8=Next  F9=Jump to 4778  F10=WHELP',        +        
               POS=(22,2),LTH=45,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W4O228N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N228,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I228N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0134,                                                +        
               LTH=40                                                           
         MFLD  IDDIST,                                                 +        
               LTH=2                                                            
         MFLD  IDDISTUT,                                               +        
               LTH=4                                                            
         MFLD  IDKUND,                                                 +        
               LTH=2                                                            
         MFLD  IDKUNDUT,                                               +        
               LTH=6                                                            
         MFLD  IDORDER,                                                +        
               LTH=2                                                            
         MFLD  IDORDERU,                                               +        
               LTH=7                                                            
         MFLD  LORDER,                                                 +        
               LTH=2                                                            
         MFLD  LORDERUT,                                               +        
               LTH=1                                                            
         MFLD  CMD1,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ORDER1,                                                 +        
               LTH=7                                                            
         MFLD  ARTNR1,                                                 +        
               LTH=8                                                            
         MFLD  REGDAT1,                                                +        
               LTH=6                                                            
         MFLD  REGTID1,                                                +        
               LTH=5                                                            
         MFLD  URSANT1,                                                +        
               LTH=6                                                            
         MFLD  LEVANT1,                                                +        
               LTH=6                                                            
         MFLD  KOD1,                                                   +        
               LTH=2                                                            
         MFLD  LORDER1,                                                +        
               LTH=7                                                            
         MFLD  LEVDAT1,                                                +        
               LTH=6                                                            
         MFLD  LEVTID1,                                                +        
               LTH=5                                                            
         MFLD  T1,                                                     +        
               LTH=1                                                            
         MFLD  CMD2,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ORDER2,                                                 +        
               LTH=7                                                            
         MFLD  ARTNR2,                                                 +        
               LTH=8                                                            
         MFLD  REGDAT2,                                                +        
               LTH=6                                                            
         MFLD  REGTID2,                                                +        
               LTH=5                                                            
         MFLD  URSANT2,                                                +        
               LTH=6                                                            
         MFLD  LEVANT2,                                                +        
               LTH=6                                                            
         MFLD  KOD2,                                                   +        
               LTH=2                                                            
         MFLD  LORDER2,                                                +        
               LTH=7                                                            
         MFLD  LEVDAT2,                                                +        
               LTH=6                                                            
         MFLD  LEVTID2,                                                +        
               LTH=5                                                            
         MFLD  T2,                                                     +        
               LTH=1                                                            
         MFLD  CMD3,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ORDER3,                                                 +        
               LTH=7                                                            
         MFLD  ARTNR3,                                                 +        
               LTH=8                                                            
         MFLD  REGDAT3,                                                +        
               LTH=6                                                            
         MFLD  REGTID3,                                                +        
               LTH=5                                                            
         MFLD  URSANT3,                                                +        
               LTH=6                                                            
         MFLD  LEVANT3,                                                +        
               LTH=6                                                            
         MFLD  KOD3,                                                   +        
               LTH=2                                                            
         MFLD  LORDER3,                                                +        
               LTH=7                                                            
         MFLD  LEVDAT3,                                                +        
               LTH=6                                                            
         MFLD  LEVTID3,                                                +        
               LTH=5                                                            
         MFLD  T3,                                                     +        
               LTH=1                                                            
         MFLD  CMD4,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ORDER4,                                                 +        
               LTH=7                                                            
         MFLD  ARTNR4,                                                 +        
               LTH=8                                                            
         MFLD  REGDAT4,                                                +        
               LTH=6                                                            
         MFLD  REGTID4,                                                +        
               LTH=5                                                            
         MFLD  URSANT4,                                                +        
               LTH=6                                                            
         MFLD  LEVANT4,                                                +        
               LTH=6                                                            
         MFLD  KOD4,                                                   +        
               LTH=2                                                            
         MFLD  LORDER4,                                                +        
               LTH=7                                                            
         MFLD  LEVDAT4,                                                +        
               LTH=6                                                            
         MFLD  LEVTID4,                                                +        
               LTH=5                                                            
         MFLD  T4,                                                     +        
               LTH=1                                                            
         MFLD  CMD5,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ORDER5,                                                 +        
               LTH=7                                                            
         MFLD  ARTNR5,                                                 +        
               LTH=8                                                            
         MFLD  REGDAT5,                                                +        
               LTH=6                                                            
         MFLD  REGTID5,                                                +        
               LTH=5                                                            
         MFLD  URSANT5,                                                +        
               LTH=6                                                            
         MFLD  LEVANT5,                                                +        
               LTH=6                                                            
         MFLD  KOD5,                                                   +        
               LTH=2                                                            
         MFLD  LORDER5,                                                +        
               LTH=7                                                            
         MFLD  LEVDAT5,                                                +        
               LTH=6                                                            
         MFLD  LEVTID5,                                                +        
               LTH=5                                                            
         MFLD  T5,                                                     +        
               LTH=1                                                            
         MFLD  CMD6,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ORDER6,                                                 +        
               LTH=7                                                            
         MFLD  ARTNR6,                                                 +        
               LTH=8                                                            
         MFLD  REGDAT6,                                                +        
               LTH=6                                                            
         MFLD  REGTID6,                                                +        
               LTH=5                                                            
         MFLD  URSANT6,                                                +        
               LTH=6                                                            
         MFLD  LEVANT6,                                                +        
               LTH=6                                                            
         MFLD  KOD6,                                                   +        
               LTH=2                                                            
         MFLD  LORDER6,                                                +        
               LTH=7                                                            
         MFLD  LEVDAT6,                                                +        
               LTH=6                                                            
         MFLD  LEVTID6,                                                +        
               LTH=5                                                            
         MFLD  T6,                                                     +        
               LTH=1                                                            
         MFLD  CMD7,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ORDER7,                                                 +        
               LTH=7                                                            
         MFLD  ARTNR7,                                                 +        
               LTH=8                                                            
         MFLD  REGDAT7,                                                +        
               LTH=6                                                            
         MFLD  REGTID7,                                                +        
               LTH=5                                                            
         MFLD  URSANT7,                                                +        
               LTH=6                                                            
         MFLD  LEVANT7,                                                +        
               LTH=6                                                            
         MFLD  KOD7,                                                   +        
               LTH=2                                                            
         MFLD  LORDER7,                                                +        
               LTH=7                                                            
         MFLD  LEVDAT7,                                                +        
               LTH=6                                                            
         MFLD  LEVTID7,                                                +        
               LTH=5                                                            
         MFLD  T7,                                                     +        
               LTH=1                                                            
         MFLD  CMD8,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ORDER8,                                                 +        
               LTH=7                                                            
         MFLD  ARTNR8,                                                 +        
               LTH=8                                                            
         MFLD  REGDAT8,                                                +        
               LTH=6                                                            
         MFLD  REGTID8,                                                +        
               LTH=5                                                            
         MFLD  URSANT8,                                                +        
               LTH=6                                                            
         MFLD  LEVANT8,                                                +        
               LTH=6                                                            
         MFLD  KOD8,                                                   +        
               LTH=2                                                            
         MFLD  LORDER8,                                                +        
               LTH=7                                                            
         MFLD  LEVDAT8,                                                +        
               LTH=6                                                            
         MFLD  LEVTID8,                                                +        
               LTH=5                                                            
         MFLD  T8,                                                     +        
               LTH=1                                                            
         MFLD  CMD9,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ORDER9,                                                 +        
               LTH=7                                                            
         MFLD  ARTNR9,                                                 +        
               LTH=8                                                            
         MFLD  REGDAT9,                                                +        
               LTH=6                                                            
         MFLD  REGTID9,                                                +        
               LTH=5                                                            
         MFLD  URSANT9,                                                +        
               LTH=6                                                            
         MFLD  LEVANT9,                                                +        
               LTH=6                                                            
         MFLD  KOD9,                                                   +        
               LTH=2                                                            
         MFLD  LORDER9,                                                +        
               LTH=7                                                            
         MFLD  LEVDAT9,                                                +        
               LTH=6                                                            
         MFLD  LEVTID9,                                                +        
               LTH=5                                                            
         MFLD  T9,                                                     +        
               LTH=1                                                            
         MFLD  CMD10,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ORDER10,                                                +        
               LTH=7                                                            
         MFLD  ARTNR10,                                                +        
               LTH=8                                                            
         MFLD  REGDAT10,                                               +        
               LTH=6                                                            
         MFLD  REGTID10,                                               +        
               LTH=5                                                            
         MFLD  URSANT10,                                               +        
               LTH=6                                                            
         MFLD  LEVANT10,                                               +        
               LTH=6                                                            
         MFLD  KOD10,                                                  +        
               LTH=2                                                            
         MFLD  LORDER10,                                               +        
               LTH=7                                                            
         MFLD  LEVDAT10,                                               +        
               LTH=6                                                            
         MFLD  LEVTID10,                                               +        
               LTH=5                                                            
         MFLD  T10,                                                    +        
               LTH=1                                                            
         MFLD  CMD11,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ORDER11,                                                +        
               LTH=7                                                            
         MFLD  ARTNR11,                                                +        
               LTH=8                                                            
         MFLD  REGDAT11,                                               +        
               LTH=6                                                            
         MFLD  REGTID11,                                               +        
               LTH=5                                                            
         MFLD  URSANT11,                                               +        
               LTH=6                                                            
         MFLD  LEVANT11,                                               +        
               LTH=6                                                            
         MFLD  KOD11,                                                  +        
               LTH=2                                                            
         MFLD  LORDER11,                                               +        
               LTH=7                                                            
         MFLD  LEVDAT11,                                               +        
               LTH=6                                                            
         MFLD  LEVTID11,                                               +        
               LTH=5                                                            
         MFLD  T11,                                                    +        
               LTH=1                                                            
         MFLD  CMD12,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ORDER12,                                                +        
               LTH=7                                                            
         MFLD  ARTNR12,                                                +        
               LTH=8                                                            
         MFLD  REGDAT12,                                               +        
               LTH=6                                                            
         MFLD  REGTID12,                                               +        
               LTH=5                                                            
         MFLD  URSANT12,                                               +        
               LTH=6                                                            
         MFLD  LEVANT12,                                               +        
               LTH=6                                                            
         MFLD  KOD12,                                                  +        
               LTH=2                                                            
         MFLD  LORDER12,                                               +        
               LTH=7                                                            
         MFLD  LEVDAT12,                                               +        
               LTH=6                                                            
         MFLD  LEVTID12,                                               +        
               LTH=5                                                            
         MFLD  T12,                                                    +        
               LTH=1                                                            
         MFLD  CMD13,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ORDER13,                                                +        
               LTH=7                                                            
         MFLD  ARTNR13,                                                +        
               LTH=8                                                            
         MFLD  REGDAT13,                                               +        
               LTH=6                                                            
         MFLD  REGTID13,                                               +        
               LTH=5                                                            
         MFLD  URSANT13,                                               +        
               LTH=6                                                            
         MFLD  LEVANT13,                                               +        
               LTH=6                                                            
         MFLD  KOD13,                                                  +        
               LTH=2                                                            
         MFLD  LORDER13,                                               +        
               LTH=7                                                            
         MFLD  LEVDAT13,                                               +        
               LTH=6                                                            
         MFLD  LEVTID13,                                               +        
               LTH=5                                                            
         MFLD  T13,                                                    +        
               LTH=1                                                            
         MFLD  CMD14,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ORDER14,                                                +        
               LTH=7                                                            
         MFLD  ARTNR14,                                                +        
               LTH=8                                                            
         MFLD  REGDAT14,                                               +        
               LTH=6                                                            
         MFLD  REGTID14,                                               +        
               LTH=5                                                            
         MFLD  URSANT14,                                               +        
               LTH=6                                                            
         MFLD  LEVANT14,                                               +        
               LTH=6                                                            
         MFLD  KOD14,                                                  +        
               LTH=2                                                            
         MFLD  LORDER14,                                               +        
               LTH=7                                                            
         MFLD  LEVDAT14,                                               +        
               LTH=6                                                            
         MFLD  LEVTID14,                                               +        
               LTH=5                                                            
         MFLD  T14,                                                    +        
               LTH=1                                                            
         MFLD  CMD15,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ORDER15,                                                +        
               LTH=7                                                            
         MFLD  ARTNR15,                                                +        
               LTH=8                                                            
         MFLD  REGDAT15,                                               +        
               LTH=6                                                            
         MFLD  REGTID15,                                               +        
               LTH=5                                                            
         MFLD  URSANT15,                                               +        
               LTH=6                                                            
         MFLD  LEVANT15,                                               +        
               LTH=6                                                            
         MFLD  KOD15,                                                  +        
               LTH=2                                                            
         MFLD  LORDER15,                                               +        
               LTH=7                                                            
         MFLD  LEVDAT15,                                               +        
               LTH=6                                                            
         MFLD  LEVTID15,                                               +        
               LTH=5                                                            
         MFLD  T15,                                                    +        
               LTH=1                                                            
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I228N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N228),                                           +        
               OPT=2,                                                  +        
               NXT=W4O228N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F8'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '42282',                                                +        
               LTH=5                                                            
         MFLD  (IDDIST,                                                +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDDISTUT,                                              +        
               '    '),                                                +        
               LTH=4,                                                  +        
               FILL=X'40'                                                       
         MFLD  (IDKUND,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDKUNDUT,                                              +        
               '      '),                                              +        
               LTH=6,                                                  +        
               FILL=X'40'                                                       
         MFLD  (IDORDER,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDORDERU,                                              +        
               '       '),                                             +        
               LTH=7,                                                  +        
               FILL=X'40'                                                       
         MFLD  (LORDER,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (LORDERUT,                                              +        
               ' '),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD1,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD2,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD3,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD4,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD5,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD6,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD7,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD8,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD9,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD10,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD11,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD12,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD13,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD14,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD15,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
