***********************************************************************         
* CREATED BY V059625   ON 03/05/15  AT 10:43                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'Divergence VOR Purchase Planning'                               
W4N227   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W4T227 7',                                           +        
               8='W4T227 8',                                           +        
               9='W4T227 9',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((2,7)),                                         +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'VOR Deviations Procurer',                              +        
               POS=(1,11),LTH=23,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Proc',                                                 +        
               POS=(2,2),LTH=4,                                        +        
               ATTR=(NUM,PROT)                                                  
ANSKIN   DFLD  POS=(2,7),LTH=3,                                        +        
               ATTR=(NOPROT)                                                    
         DFLD  'Suppl',                                                +        
               POS=(2,13),LTH=5,                                       +        
               ATTR=(PROT)                                                      
LEVIN    DFLD  POS=(2,19),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Part No',                                              +        
               POS=(2,27),LTH=7,                                       +        
               ATTR=(PROT)                                                      
ARTIN    DFLD  POS=(2,35),LTH=9,                                       +        
               ATTR=(NOPROT)                                                    
ANSKUT   DFLD  POS=(3,7),LTH=3,                                        +        
               ATTR=(PROT,MOD)                                                  
LEVUT    DFLD  POS=(3,19),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
ARTUT    DFLD  POS=(3,35),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'CMD Date    M Distr  Cust Order Suppl    Part No',     +        
               POS=(5,2),LTH=48,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Qty    Diff  OC DC V S P A',                           +        
               POS=(5,55),LTH=26,                                      +        
               ATTR=(PROT)                                                      
CMDIN2   DFLD  POS=(7,2),LTH=3,                                        +        
               ATTR=(NOPROT,MOD)                                                
DATUT2   DFLD  POS=(7,6),LTH=6,                                        +        
               ATTR=(NUM,PROT)                                                  
KODUT2   DFLD  POS=(7,13),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DISTRU2  DFLD  POS=(7,16),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
KUNDU2   DFLD  POS=(7,21),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
ORDERU2  DFLD  POS=(7,28),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
ANSK2    DFLD  POS=(7,34),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
ARTNR2   DFLD  POS=(7,41),LTH=9,                                       +        
               ATTR=(PROT)                                                      
KVANT2   DFLD  POS=(7,51),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
DIFF2    DFLD  POS=(7,59),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
ORDBEK2  DFLD  POS=(7,68),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DC2      DFLD  POS=(7,71),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
VTEXT2   DFLD  POS=(7,74),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
STEXT2   DFLD  POS=(7,76),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
ATEXT2   DFLD  POS=(7,78),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
LTEXT2   DFLD  POS=(7,80),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
CMDIN3   DFLD  POS=(8,2),LTH=3,                                        +        
               ATTR=(NOPROT,MOD)                                                
DATUT3   DFLD  POS=(8,6),LTH=6,                                        +        
               ATTR=(NUM,PROT)                                                  
KODUT3   DFLD  POS=(8,13),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DISTRU3  DFLD  POS=(8,16),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
KUNDU3   DFLD  POS=(8,21),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
ORDERU3  DFLD  POS=(8,28),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
ANSK3    DFLD  POS=(8,34),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
ARTNR3   DFLD  POS=(8,41),LTH=9,                                       +        
               ATTR=(PROT)                                                      
KVANT3   DFLD  POS=(8,51),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
DIFF3    DFLD  POS=(8,59),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
ORDBEK3  DFLD  POS=(8,68),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DC3      DFLD  POS=(8,71),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
VTEXT3   DFLD  POS=(8,74),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
STEXT3   DFLD  POS=(8,76),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
ATEXT3   DFLD  POS=(8,78),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
LTEXT3   DFLD  POS=(8,80),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
CMDIN4   DFLD  POS=(9,2),LTH=3,                                        +        
               ATTR=(NOPROT,MOD)                                                
DATUT4   DFLD  POS=(9,6),LTH=6,                                        +        
               ATTR=(NUM,PROT)                                                  
KODUT4   DFLD  POS=(9,13),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DISTRU4  DFLD  POS=(9,16),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
KUNDU4   DFLD  POS=(9,21),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
ORDERU4  DFLD  POS=(9,28),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
ANSK4    DFLD  POS=(9,34),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
ARTNR4   DFLD  POS=(9,41),LTH=9,                                       +        
               ATTR=(PROT)                                                      
KVANT4   DFLD  POS=(9,51),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
DIFF4    DFLD  POS=(9,59),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
ORDBEK4  DFLD  POS=(9,68),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DC4      DFLD  POS=(9,71),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
VTEXT4   DFLD  POS=(9,74),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
STEXT4   DFLD  POS=(9,76),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
ATEXT4   DFLD  POS=(9,78),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
LTEXT4   DFLD  POS=(9,80),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
CMDIN5   DFLD  POS=(10,2),LTH=3,                                       +        
               ATTR=(NOPROT,MOD)                                                
DATUT5   DFLD  POS=(10,6),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
KODUT5   DFLD  POS=(10,13),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DISTRU5  DFLD  POS=(10,16),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
KUNDU5   DFLD  POS=(10,21),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
ORDERU5  DFLD  POS=(10,28),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
ANSK5    DFLD  POS=(10,34),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
ARTNR5   DFLD  POS=(10,41),LTH=9,                                      +        
               ATTR=(PROT)                                                      
KVANT5   DFLD  POS=(10,51),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DIFF5    DFLD  POS=(10,59),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
ORDBEK5  DFLD  POS=(10,68),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DC5      DFLD  POS=(10,71),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
VTEXT5   DFLD  POS=(10,74),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
STEXT5   DFLD  POS=(10,76),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
ATEXT5   DFLD  POS=(10,78),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
LTEXT5   DFLD  POS=(10,80),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
CMDIN6   DFLD  POS=(11,2),LTH=3,                                       +        
               ATTR=(NOPROT,MOD)                                                
DATUT6   DFLD  POS=(11,6),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
KODUT6   DFLD  POS=(11,13),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DISTRU6  DFLD  POS=(11,16),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
KUNDU6   DFLD  POS=(11,21),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
ORDERU6  DFLD  POS=(11,28),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
ANSK6    DFLD  POS=(11,34),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
ARTNR6   DFLD  POS=(11,41),LTH=9,                                      +        
               ATTR=(PROT)                                                      
KVANT6   DFLD  POS=(11,51),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DIFF6    DFLD  POS=(11,59),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
ORDBEK6  DFLD  POS=(11,68),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DC6      DFLD  POS=(11,71),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
VTEXT6   DFLD  POS=(11,74),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
STEXT6   DFLD  POS=(11,76),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
ATEXT6   DFLD  POS=(11,78),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
LTEXT6   DFLD  POS=(11,80),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
CMDIN7   DFLD  POS=(12,2),LTH=3,                                       +        
               ATTR=(NOPROT,MOD)                                                
DATUT7   DFLD  POS=(12,6),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
KODUT7   DFLD  POS=(12,13),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DISTRU7  DFLD  POS=(12,16),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
KUNDU7   DFLD  POS=(12,21),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
ORDERU7  DFLD  POS=(12,28),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
ANSK7    DFLD  POS=(12,34),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
ARTNR7   DFLD  POS=(12,41),LTH=9,                                      +        
               ATTR=(PROT)                                                      
KVANT7   DFLD  POS=(12,51),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DIFF7    DFLD  POS=(12,59),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
ORDBEK7  DFLD  POS=(12,68),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DC7      DFLD  POS=(12,71),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
VTEXT7   DFLD  POS=(12,74),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
STEXT7   DFLD  POS=(12,76),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
ATEXT7   DFLD  POS=(12,78),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
LTEXT7   DFLD  POS=(12,80),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
CMDIN8   DFLD  POS=(13,2),LTH=3,                                       +        
               ATTR=(NOPROT,MOD)                                                
DATUT8   DFLD  POS=(13,6),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
KODUT8   DFLD  POS=(13,13),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DISTRU8  DFLD  POS=(13,16),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
KUNDU8   DFLD  POS=(13,21),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
ORDERU8  DFLD  POS=(13,28),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
ANSK8    DFLD  POS=(13,34),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
ARTNR8   DFLD  POS=(13,41),LTH=9,                                      +        
               ATTR=(PROT)                                                      
KVANT8   DFLD  POS=(13,51),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DIFF8    DFLD  POS=(13,59),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
ORDBEK8  DFLD  POS=(13,68),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DC8      DFLD  POS=(13,71),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
VTEXT8   DFLD  POS=(13,74),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
STEXT8   DFLD  POS=(13,76),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
ATEXT8   DFLD  POS=(13,78),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
LTEXT8   DFLD  POS=(13,80),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
CMDIN9   DFLD  POS=(14,2),LTH=3,                                       +        
               ATTR=(NOPROT,MOD)                                                
DATUT9   DFLD  POS=(14,6),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
KODUT9   DFLD  POS=(14,13),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DISTRU9  DFLD  POS=(14,16),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
KUNDU9   DFLD  POS=(14,21),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
ORDERU9  DFLD  POS=(14,28),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
ANSK9    DFLD  POS=(14,34),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
ARTNR9   DFLD  POS=(14,41),LTH=9,                                      +        
               ATTR=(PROT)                                                      
KVANT9   DFLD  POS=(14,51),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DIFF9    DFLD  POS=(14,59),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
ORDBEK9  DFLD  POS=(14,68),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DC9      DFLD  POS=(14,71),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
VTEXT9   DFLD  POS=(14,74),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
STEXT9   DFLD  POS=(14,76),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
ATEXT9   DFLD  POS=(14,78),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
LTEXT9   DFLD  POS=(14,80),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
CMDIN10  DFLD  POS=(15,2),LTH=3,                                       +        
               ATTR=(NOPROT,MOD)                                                
DATUT10  DFLD  POS=(15,6),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
KODUT10  DFLD  POS=(15,13),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DISTRU10 DFLD  POS=(15,16),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
KUNDU10  DFLD  POS=(15,21),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
ORDERU10 DFLD  POS=(15,28),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
ANSK10   DFLD  POS=(15,34),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
ARTNR10  DFLD  POS=(15,41),LTH=9,                                      +        
               ATTR=(PROT)                                                      
KVANT10  DFLD  POS=(15,51),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DIFF10   DFLD  POS=(15,59),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
ORDBEK10 DFLD  POS=(15,68),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DC10     DFLD  POS=(15,71),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
VTEXT10  DFLD  POS=(15,74),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
STEXT10  DFLD  POS=(15,76),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
ATEXT10  DFLD  POS=(15,78),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
LTEXT10  DFLD  POS=(15,80),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
CMDIN11  DFLD  POS=(16,2),LTH=3,                                       +        
               ATTR=(NOPROT,MOD)                                                
DATUT11  DFLD  POS=(16,6),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
KODUT11  DFLD  POS=(16,13),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DISTRU11 DFLD  POS=(16,16),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
KUNDU11  DFLD  POS=(16,21),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
ORDERU11 DFLD  POS=(16,28),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
ANSK11   DFLD  POS=(16,34),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
ARTNR11  DFLD  POS=(16,41),LTH=9,                                      +        
               ATTR=(PROT)                                                      
KVANT11  DFLD  POS=(16,51),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DIFF11   DFLD  POS=(16,59),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
ORDBEK11 DFLD  POS=(16,68),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DC11     DFLD  POS=(16,71),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
VTEXT11  DFLD  POS=(16,74),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
STEXT11  DFLD  POS=(16,76),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
ATEXT11  DFLD  POS=(16,78),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
LTEXT11  DFLD  POS=(16,80),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
CMDIN12  DFLD  POS=(17,2),LTH=3,                                       +        
               ATTR=(NOPROT,MOD)                                                
DATUT12  DFLD  POS=(17,6),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
KODUT12  DFLD  POS=(17,13),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DISTRU12 DFLD  POS=(17,16),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
KUNDU12  DFLD  POS=(17,21),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
ORDERU12 DFLD  POS=(17,28),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
ANSK12   DFLD  POS=(17,34),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
ARTNR12  DFLD  POS=(17,41),LTH=9,                                      +        
               ATTR=(PROT)                                                      
KVANT12  DFLD  POS=(17,51),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DIFF12   DFLD  POS=(17,59),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
ORDBEK12 DFLD  POS=(17,68),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DC12     DFLD  POS=(17,71),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
VTEXT12  DFLD  POS=(17,74),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
STEXT12  DFLD  POS=(17,76),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
ATEXT12  DFLD  POS=(17,78),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
LTEXT12  DFLD  POS=(17,80),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
CMDIN13  DFLD  POS=(18,2),LTH=3,                                       +        
               ATTR=(NOPROT,MOD)                                                
DATUT13  DFLD  POS=(18,6),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
KODUT13  DFLD  POS=(18,13),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DISTRU13 DFLD  POS=(18,16),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
KUNDU13  DFLD  POS=(18,21),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
ORDERU13 DFLD  POS=(18,28),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
ANSK13   DFLD  POS=(18,34),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
ARTNR13  DFLD  POS=(18,41),LTH=9,                                      +        
               ATTR=(PROT)                                                      
KVANT13  DFLD  POS=(18,51),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DIFF13   DFLD  POS=(18,59),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
ORDBEK13 DFLD  POS=(18,68),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DC13     DFLD  POS=(18,71),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
VTEXT13  DFLD  POS=(18,74),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
STEXT13  DFLD  POS=(18,76),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
ATEXT13  DFLD  POS=(18,78),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
LTEXT13  DFLD  POS=(18,80),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
CMDIN14  DFLD  POS=(19,2),LTH=3,                                       +        
               ATTR=(NOPROT,MOD)                                                
DATUT14  DFLD  POS=(19,6),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
KODUT14  DFLD  POS=(19,13),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DISTRU14 DFLD  POS=(19,16),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
KUNDU14  DFLD  POS=(19,21),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
ORDERU14 DFLD  POS=(19,28),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
ANSK14   DFLD  POS=(19,34),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
ARTNR14  DFLD  POS=(19,41),LTH=9,                                      +        
               ATTR=(PROT)                                                      
KVANT14  DFLD  POS=(19,51),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DIFF14   DFLD  POS=(19,59),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
ORDBEK14 DFLD  POS=(19,68),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DC14     DFLD  POS=(19,71),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
VTEXT14  DFLD  POS=(19,74),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
STEXT14  DFLD  POS=(19,76),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
ATEXT14  DFLD  POS=(19,78),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
LTEXT14  DFLD  POS=(19,80),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
CMDIN15  DFLD  POS=(20,2),LTH=3,                                       +        
               ATTR=(NOPROT,MOD)                                                
DATUT15  DFLD  POS=(20,6),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
KODUT15  DFLD  POS=(20,13),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DISTRU15 DFLD  POS=(20,16),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
KUNDU15  DFLD  POS=(20,21),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
ORDERU15 DFLD  POS=(20,28),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
ANSK15   DFLD  POS=(20,34),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
ARTNR15  DFLD  POS=(20,41),LTH=9,                                      +        
               ATTR=(PROT)                                                      
KVANT15  DFLD  POS=(20,51),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DIFF15   DFLD  POS=(20,59),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
ORDBEK15 DFLD  POS=(20,68),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DC16     DFLD  POS=(20,71),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
VTEXT16  DFLD  POS=(20,74),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
STEXT16  DFLD  POS=(20,76),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
ATEXT16  DFLD  POS=(20,78),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
LTEXT16  DFLD  POS=(20,80),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'F7=First  F8=Next  F9=JUMP TO 4277  F10=WHELP',        +        
               POS=(22,2),LTH=45,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,MOD)                                                  
         FMTEND                                                                 
W4I227N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N227),                                           +        
               OPT=2,                                                  +        
               NXT=W4O227N1                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  (IDTRANS1,                                              +        
               '4'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  (IDTRANS2,                                              +        
               '2'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  (IDTRANS3,                                              +        
               '2'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  (IDTRANS4,                                              +        
               '7'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F7'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '42272',                                                +        
               LTH=5                                                            
         MFLD  (ANSKIN,                                                +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANSKUT,                                                +        
               '   '),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (LEVIN,                                                 +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (LEVUT,                                                 +        
               '     '),                                               +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (ARTIN,                                                 +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTUT,                                                 +        
               '         '),                                           +        
               LTH=9,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMDIN2,                                                +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMDIN3,                                                +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMDIN4,                                                +        
               '+++'),                                                 +        
               LTH=3                                                            
         MFLD  (CMDIN5,                                                +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMDIN6,                                                +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMDIN7,                                                +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMDIN8,                                                +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMDIN9,                                                +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMDIN10,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMDIN11,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMDIN12,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMDIN13,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMDIN14,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMDIN15,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
W4O227N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N227,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I227N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  ANSKIN,                                                 +        
               LTH=3                                                            
         MFLD  ANSKUT,                                                 +        
               LTH=3                                                            
         MFLD  LEVIN,                                                  +        
               LTH=5                                                            
         MFLD  LEVUT,                                                  +        
               LTH=5                                                            
         MFLD  ARTIN,                                                  +        
               LTH=9                                                            
         MFLD  ARTUT,                                                  +        
               LTH=9                                                            
         MFLD  CMDIN2,                                                 +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DATUT2,                                                 +        
               LTH=6                                                            
         MFLD  KODUT2,                                                 +        
               LTH=2                                                            
         MFLD  DISTRU2,                                                +        
               LTH=4                                                            
         MFLD  KUNDU2,                                                 +        
               LTH=6                                                            
         MFLD  ORDERU2,                                                +        
               LTH=5                                                            
         MFLD  ANSK2,                                                  +        
               LTH=5                                                            
         MFLD  ARTNR2,                                                 +        
               LTH=9                                                            
         MFLD  KVANT2,                                                 +        
               LTH=7                                                            
         MFLD  DIFF2,                                                  +        
               LTH=7                                                            
         MFLD  ORDBEK2,                                                +        
               LTH=2                                                            
         MFLD  DC2,                                                    +        
               LTH=2                                                            
         MFLD  VTEXT2,                                                 +        
               LTH=1                                                            
         MFLD  STEXT2,                                                 +        
               LTH=1                                                            
         MFLD  ATEXT2,                                                 +        
               LTH=1                                                            
         MFLD  LTEXT2,                                                 +        
               LTH=1                                                            
         MFLD  CMDIN3,                                                 +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DATUT3,                                                 +        
               LTH=6                                                            
         MFLD  KODUT3,                                                 +        
               LTH=2                                                            
         MFLD  DISTRU3,                                                +        
               LTH=4                                                            
         MFLD  KUNDU3,                                                 +        
               LTH=6                                                            
         MFLD  ORDERU3,                                                +        
               LTH=5                                                            
         MFLD  ANSK3,                                                  +        
               LTH=5                                                            
         MFLD  ARTNR3,                                                 +        
               LTH=9                                                            
         MFLD  KVANT3,                                                 +        
               LTH=7                                                            
         MFLD  DIFF3,                                                  +        
               LTH=7                                                            
         MFLD  ORDBEK3,                                                +        
               LTH=2                                                            
         MFLD  DC3,                                                    +        
               LTH=2                                                            
         MFLD  VTEXT3,                                                 +        
               LTH=1                                                            
         MFLD  STEXT3,                                                 +        
               LTH=1                                                            
         MFLD  ATEXT3,                                                 +        
               LTH=1                                                            
         MFLD  LTEXT3,                                                 +        
               LTH=1                                                            
         MFLD  CMDIN4,                                                 +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DATUT4,                                                 +        
               LTH=6                                                            
         MFLD  KODUT4,                                                 +        
               LTH=2                                                            
         MFLD  DISTRU4,                                                +        
               LTH=4                                                            
         MFLD  KUNDU4,                                                 +        
               LTH=6                                                            
         MFLD  ORDERU4,                                                +        
               LTH=5                                                            
         MFLD  ANSK4,                                                  +        
               LTH=5                                                            
         MFLD  ARTNR4,                                                 +        
               LTH=9                                                            
         MFLD  KVANT4,                                                 +        
               LTH=7                                                            
         MFLD  DIFF4,                                                  +        
               LTH=7                                                            
         MFLD  ORDBEK4,                                                +        
               LTH=2                                                            
         MFLD  DC4,                                                    +        
               LTH=2                                                            
         MFLD  VTEXT4,                                                 +        
               LTH=1                                                            
         MFLD  STEXT4,                                                 +        
               LTH=1                                                            
         MFLD  ATEXT4,                                                 +        
               LTH=1                                                            
         MFLD  LTEXT4,                                                 +        
               LTH=1                                                            
         MFLD  CMDIN5,                                                 +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DATUT5,                                                 +        
               LTH=6                                                            
         MFLD  KODUT5,                                                 +        
               LTH=2                                                            
         MFLD  DISTRU5,                                                +        
               LTH=4                                                            
         MFLD  KUNDU5,                                                 +        
               LTH=6                                                            
         MFLD  ORDERU5,                                                +        
               LTH=5                                                            
         MFLD  ANSK5,                                                  +        
               LTH=5                                                            
         MFLD  ARTNR5,                                                 +        
               LTH=9                                                            
         MFLD  KVANT5,                                                 +        
               LTH=7                                                            
         MFLD  DIFF5,                                                  +        
               LTH=7                                                            
         MFLD  ORDBEK5,                                                +        
               LTH=2                                                            
         MFLD  DC5,                                                    +        
               LTH=2                                                            
         MFLD  VTEXT5,                                                 +        
               LTH=1                                                            
         MFLD  STEXT5,                                                 +        
               LTH=1                                                            
         MFLD  ATEXT5,                                                 +        
               LTH=1                                                            
         MFLD  LTEXT5,                                                 +        
               LTH=1                                                            
         MFLD  CMDIN6,                                                 +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DATUT6,                                                 +        
               LTH=6                                                            
         MFLD  KODUT6,                                                 +        
               LTH=2                                                            
         MFLD  DISTRU6,                                                +        
               LTH=4                                                            
         MFLD  KUNDU6,                                                 +        
               LTH=6                                                            
         MFLD  ORDERU6,                                                +        
               LTH=5                                                            
         MFLD  ANSK6,                                                  +        
               LTH=5                                                            
         MFLD  ARTNR6,                                                 +        
               LTH=9                                                            
         MFLD  KVANT6,                                                 +        
               LTH=7                                                            
         MFLD  DIFF6,                                                  +        
               LTH=7                                                            
         MFLD  ORDBEK6,                                                +        
               LTH=2                                                            
         MFLD  DC6,                                                    +        
               LTH=2                                                            
         MFLD  VTEXT6,                                                 +        
               LTH=1                                                            
         MFLD  STEXT6,                                                 +        
               LTH=1                                                            
         MFLD  ATEXT6,                                                 +        
               LTH=1                                                            
         MFLD  LTEXT6,                                                 +        
               LTH=1                                                            
         MFLD  CMDIN7,                                                 +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DATUT7,                                                 +        
               LTH=6                                                            
         MFLD  KODUT7,                                                 +        
               LTH=2                                                            
         MFLD  DISTRU7,                                                +        
               LTH=4                                                            
         MFLD  KUNDU7,                                                 +        
               LTH=6                                                            
         MFLD  ORDERU7,                                                +        
               LTH=5                                                            
         MFLD  ANSK7,                                                  +        
               LTH=5                                                            
         MFLD  ARTNR7,                                                 +        
               LTH=9                                                            
         MFLD  KVANT7,                                                 +        
               LTH=7                                                            
         MFLD  DIFF7,                                                  +        
               LTH=7                                                            
         MFLD  ORDBEK7,                                                +        
               LTH=2                                                            
         MFLD  DC7,                                                    +        
               LTH=2                                                            
         MFLD  VTEXT7,                                                 +        
               LTH=1                                                            
         MFLD  STEXT7,                                                 +        
               LTH=1                                                            
         MFLD  ATEXT7,                                                 +        
               LTH=1                                                            
         MFLD  LTEXT7,                                                 +        
               LTH=1                                                            
         MFLD  CMDIN8,                                                 +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DATUT8,                                                 +        
               LTH=6                                                            
         MFLD  KODUT8,                                                 +        
               LTH=2                                                            
         MFLD  DISTRU8,                                                +        
               LTH=4                                                            
         MFLD  KUNDU8,                                                 +        
               LTH=6                                                            
         MFLD  ORDERU8,                                                +        
               LTH=5                                                            
         MFLD  ANSK8,                                                  +        
               LTH=5                                                            
         MFLD  ARTNR8,                                                 +        
               LTH=9                                                            
         MFLD  KVANT8,                                                 +        
               LTH=7                                                            
         MFLD  DIFF8,                                                  +        
               LTH=7                                                            
         MFLD  ORDBEK8,                                                +        
               LTH=2                                                            
         MFLD  DC8,                                                    +        
               LTH=2                                                            
         MFLD  VTEXT8,                                                 +        
               LTH=1                                                            
         MFLD  STEXT8,                                                 +        
               LTH=1                                                            
         MFLD  ATEXT8,                                                 +        
               LTH=1                                                            
         MFLD  LTEXT8,                                                 +        
               LTH=1                                                            
         MFLD  CMDIN9,                                                 +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DATUT9,                                                 +        
               LTH=6                                                            
         MFLD  KODUT9,                                                 +        
               LTH=2                                                            
         MFLD  DISTRU9,                                                +        
               LTH=4                                                            
         MFLD  KUNDU9,                                                 +        
               LTH=6                                                            
         MFLD  ORDERU9,                                                +        
               LTH=5                                                            
         MFLD  ANSK9,                                                  +        
               LTH=5                                                            
         MFLD  ARTNR9,                                                 +        
               LTH=9                                                            
         MFLD  KVANT9,                                                 +        
               LTH=7                                                            
         MFLD  DIFF9,                                                  +        
               LTH=7                                                            
         MFLD  ORDBEK9,                                                +        
               LTH=2                                                            
         MFLD  DC9,                                                    +        
               LTH=2                                                            
         MFLD  VTEXT9,                                                 +        
               LTH=1                                                            
         MFLD  STEXT9,                                                 +        
               LTH=1                                                            
         MFLD  ATEXT9,                                                 +        
               LTH=1                                                            
         MFLD  LTEXT9,                                                 +        
               LTH=1                                                            
         MFLD  CMDIN10,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DATUT10,                                                +        
               LTH=6                                                            
         MFLD  KODUT10,                                                +        
               LTH=2                                                            
         MFLD  DISTRU10,                                               +        
               LTH=4                                                            
         MFLD  KUNDU10,                                                +        
               LTH=6                                                            
         MFLD  ORDERU10,                                               +        
               LTH=5                                                            
         MFLD  ANSK10,                                                 +        
               LTH=5                                                            
         MFLD  ARTNR10,                                                +        
               LTH=9                                                            
         MFLD  KVANT10,                                                +        
               LTH=7                                                            
         MFLD  DIFF10,                                                 +        
               LTH=7                                                            
         MFLD  ORDBEK10,                                               +        
               LTH=2                                                            
         MFLD  DC10,                                                   +        
               LTH=2                                                            
         MFLD  VTEXT10,                                                +        
               LTH=1                                                            
         MFLD  STEXT10,                                                +        
               LTH=1                                                            
         MFLD  ATEXT10,                                                +        
               LTH=1                                                            
         MFLD  LTEXT10,                                                +        
               LTH=1                                                            
         MFLD  CMDIN11,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DATUT11,                                                +        
               LTH=6                                                            
         MFLD  KODUT11,                                                +        
               LTH=2                                                            
         MFLD  DISTRU11,                                               +        
               LTH=4                                                            
         MFLD  KUNDU11,                                                +        
               LTH=6                                                            
         MFLD  ORDERU11,                                               +        
               LTH=5                                                            
         MFLD  ANSK11,                                                 +        
               LTH=5                                                            
         MFLD  ARTNR11,                                                +        
               LTH=9                                                            
         MFLD  KVANT11,                                                +        
               LTH=7                                                            
         MFLD  DIFF11,                                                 +        
               LTH=7                                                            
         MFLD  ORDBEK11,                                               +        
               LTH=2                                                            
         MFLD  DC11,                                                   +        
               LTH=2                                                            
         MFLD  VTEXT11,                                                +        
               LTH=1                                                            
         MFLD  STEXT11,                                                +        
               LTH=1                                                            
         MFLD  ATEXT11,                                                +        
               LTH=1                                                            
         MFLD  LTEXT11,                                                +        
               LTH=1                                                            
         MFLD  CMDIN12,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DATUT12,                                                +        
               LTH=6                                                            
         MFLD  KODUT12,                                                +        
               LTH=2                                                            
         MFLD  DISTRU12,                                               +        
               LTH=4                                                            
         MFLD  KUNDU12,                                                +        
               LTH=6                                                            
         MFLD  ORDERU12,                                               +        
               LTH=5                                                            
         MFLD  ANSK12,                                                 +        
               LTH=5                                                            
         MFLD  ARTNR12,                                                +        
               LTH=9                                                            
         MFLD  KVANT12,                                                +        
               LTH=7                                                            
         MFLD  DIFF12,                                                 +        
               LTH=7                                                            
         MFLD  ORDBEK12,                                               +        
               LTH=2                                                            
         MFLD  DC12,                                                   +        
               LTH=2                                                            
         MFLD  VTEXT12,                                                +        
               LTH=1                                                            
         MFLD  STEXT12,                                                +        
               LTH=1                                                            
         MFLD  ATEXT12,                                                +        
               LTH=1                                                            
         MFLD  LTEXT12,                                                +        
               LTH=1                                                            
         MFLD  CMDIN13,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DATUT13,                                                +        
               LTH=6                                                            
         MFLD  KODUT13,                                                +        
               LTH=2                                                            
         MFLD  DISTRU13,                                               +        
               LTH=4                                                            
         MFLD  KUNDU13,                                                +        
               LTH=6                                                            
         MFLD  ORDERU13,                                               +        
               LTH=5                                                            
         MFLD  ANSK13,                                                 +        
               LTH=5                                                            
         MFLD  ARTNR13,                                                +        
               LTH=9                                                            
         MFLD  KVANT13,                                                +        
               LTH=7                                                            
         MFLD  DIFF13,                                                 +        
               LTH=7                                                            
         MFLD  ORDBEK13,                                               +        
               LTH=2                                                            
         MFLD  DC13,                                                   +        
               LTH=2                                                            
         MFLD  VTEXT13,                                                +        
               LTH=1                                                            
         MFLD  STEXT13,                                                +        
               LTH=1                                                            
         MFLD  ATEXT13,                                                +        
               LTH=1                                                            
         MFLD  LTEXT13,                                                +        
               LTH=1                                                            
         MFLD  CMDIN14,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DATUT14,                                                +        
               LTH=6                                                            
         MFLD  KODUT14,                                                +        
               LTH=2                                                            
         MFLD  DISTRU14,                                               +        
               LTH=4                                                            
         MFLD  KUNDU14,                                                +        
               LTH=6                                                            
         MFLD  ORDERU14,                                               +        
               LTH=5                                                            
         MFLD  ANSK14,                                                 +        
               LTH=5                                                            
         MFLD  ARTNR14,                                                +        
               LTH=9                                                            
         MFLD  KVANT14,                                                +        
               LTH=7                                                            
         MFLD  DIFF14,                                                 +        
               LTH=7                                                            
         MFLD  ORDBEK14,                                               +        
               LTH=2                                                            
         MFLD  DC14,                                                   +        
               LTH=2                                                            
         MFLD  VTEXT14,                                                +        
               LTH=1                                                            
         MFLD  STEXT14,                                                +        
               LTH=1                                                            
         MFLD  ATEXT14,                                                +        
               LTH=1                                                            
         MFLD  LTEXT14,                                                +        
               LTH=1                                                            
         MFLD  CMDIN15,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DATUT15,                                                +        
               LTH=6                                                            
         MFLD  KODUT15,                                                +        
               LTH=2                                                            
         MFLD  DISTRU15,                                               +        
               LTH=4                                                            
         MFLD  KUNDU15,                                                +        
               LTH=6                                                            
         MFLD  ORDERU15,                                               +        
               LTH=5                                                            
         MFLD  ANSK15,                                                 +        
               LTH=5                                                            
         MFLD  ARTNR15,                                                +        
               LTH=9                                                            
         MFLD  KVANT15,                                                +        
               LTH=7                                                            
         MFLD  DIFF15,                                                 +        
               LTH=7                                                            
         MFLD  ORDBEK15,                                               +        
               LTH=2                                                            
         MFLD  DC16,                                                   +        
               LTH=2                                                            
         MFLD  VTEXT16,                                                +        
               LTH=1                                                            
         MFLD  STEXT16,                                                +        
               LTH=1                                                            
         MFLD  ATEXT16,                                                +        
               LTH=1                                                            
         MFLD  LTEXT16,                                                +        
               LTH=1                                                            
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
