***********************************************************************         
* CREATED BY PC66269   ON 97/11/28  AT 15:14                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'proforma lines amendment/delete '                               
W4N265   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W4T265 7',                                           +        
               8='W4T265 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T265U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T261  ',                                          +        
               14='W4T262  ',                                          +        
               15='W4T264  ',                                          +        
               16='W4T265  ',                                          +        
               17='W4T266  ',                                          +        
               18='W4T267  ',                                          +        
               19='W4T268  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W4N265   DPAGE CURSOR=((2,8)),                                         +        
               FILL=PT                                                          
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'PROFORMA LINE AMEND/DELETE',                           +        
               POS=(1,11),LTH=26,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Distr',                                                +        
               POS=(2,2),LTH=5,                                        +        
               ATTR=(ALPHA,PROT)                                                
DGIA0102 DFLD  POS=(2,8),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Cust',                                                 +        
               POS=(2,13),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0104 DFLD  POS=(2,18),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Order',                                                +        
               POS=(2,25),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0108 DFLD  POS=(2,31),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Partn',                                                +        
               POS=(2,39),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0099 DFLD  POS=(2,45),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0103 DFLD  POS=(3,8),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
DGIA0105 DFLD  POS=(3,18),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0109 DFLD  POS=(3,31),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0101 DFLD  POS=(3,45),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Cl',                                                   +        
               POS=(3,61),LTH=2,                                       +        
               ATTR=(PROT)                                                      
KDORDKL  DFLD  POS=(3,64),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Fc',                                                   +        
               POS=(3,66),LTH=2,                                       +        
               ATTR=(ALPHA,PROT)                                                
KDFRAKT  DFLD  POS=(3,69),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Type',                                                 +        
               POS=(3,72),LTH=4,                                       +        
               ATTR=(ALPHA,PROT)                                                
KDPROTYP DFLD  POS=(3,77),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DGIA0098 DFLD  POS=(4,12),LTH=9,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0106 DFLD  POS=(4,22),LTH=3,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0100 DFLD  POS=(4,28),LTH=9,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0107 DFLD  POS=(4,38),LTH=3,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
TEDDI    DFLD  POS=(4,70),LTH=11,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'CMD   Part no',                                        +        
               POS=(5,2),LTH=13,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Qty Price/unit',                                       +        
               POS=(5,20),LTH=14,                                      +        
               ATTR=(PROT)                                                      
KDVALISO DFLD  POS=(5,35),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Description',                                          +        
               POS=(5,39),LTH=11,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Line ref   Q  VEO TPO',                                +        
               POS=(5,57),LTH=21,                                      +        
               ATTR=(PROT)                                                      
DGIA0028 DFLD  POS=(6,3),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
DGIA0014 DFLD  POS=(6,6),LTH=9,                                        +        
               ATTR=(PROT,MOD)                                                  
DGIA0049 DFLD  POS=(6,16),LTH=7,                                       +        
               ATTR=(PROT)                                                      
DGIA0070 DFLD  POS=(6,24),LTH=10,                                      +        
               ATTR=(PROT)                                                      
ASTRIX1  DFLD  POS=(6,35),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DGIA0000 DFLD  POS=(6,39),LTH=17,                                      +        
               ATTR=(PROT)                                                      
DGIA0084 DFLD  POS=(6,57),LTH=10,                                      +        
               ATTR=(PROT)                                                      
DGIA0035 DFLD  POS=(6,69),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DGIA0063 DFLD  POS=(6,72),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DGIA0042 DFLD  POS=(6,76),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DGIA0021 DFLD  POS=(6,78),LTH=3,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0056 DFLD  POS=(7,16),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0077 DFLD  POS=(7,24),LTH=10,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0007 DFLD  POS=(7,39),LTH=17,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0091 DFLD  POS=(7,57),LTH=10,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0029 DFLD  POS=(8,3),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
DGIA0015 DFLD  POS=(8,6),LTH=9,                                        +        
               ATTR=(PROT,MOD)                                                  
DGIA0050 DFLD  POS=(8,16),LTH=7,                                       +        
               ATTR=(PROT)                                                      
DGIA0071 DFLD  POS=(8,24),LTH=10,                                      +        
               ATTR=(PROT)                                                      
ASTRIX2  DFLD  POS=(8,35),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DGIA0001 DFLD  POS=(8,39),LTH=17,                                      +        
               ATTR=(PROT)                                                      
DGIA0085 DFLD  POS=(8,57),LTH=10,                                      +        
               ATTR=(PROT)                                                      
DGIA0036 DFLD  POS=(8,69),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DGIA0064 DFLD  POS=(8,72),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DGIA0043 DFLD  POS=(8,76),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DGIA0022 DFLD  POS=(8,78),LTH=3,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0057 DFLD  POS=(9,16),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0078 DFLD  POS=(9,24),LTH=10,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0008 DFLD  POS=(9,39),LTH=17,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0092 DFLD  POS=(9,57),LTH=10,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0030 DFLD  POS=(10,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0016 DFLD  POS=(10,6),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0051 DFLD  POS=(10,16),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DGIA0072 DFLD  POS=(10,24),LTH=10,                                     +        
               ATTR=(PROT)                                                      
ASTRIX3  DFLD  POS=(10,35),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0002 DFLD  POS=(10,39),LTH=17,                                     +        
               ATTR=(PROT)                                                      
DGIA0086 DFLD  POS=(10,57),LTH=10,                                     +        
               ATTR=(PROT)                                                      
DGIA0037 DFLD  POS=(10,69),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0065 DFLD  POS=(10,72),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0044 DFLD  POS=(10,76),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0023 DFLD  POS=(10,78),LTH=3,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0058 DFLD  POS=(11,16),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0079 DFLD  POS=(11,24),LTH=10,                                     +        
               ATTR=(NUM,NOPROT)                                                
DGIA0009 DFLD  POS=(11,39),LTH=17,                                     +        
               ATTR=(NOPROT)                                                    
DGIA0093 DFLD  POS=(11,57),LTH=10,                                     +        
               ATTR=(NOPROT)                                                    
DGIA0031 DFLD  POS=(12,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0017 DFLD  POS=(12,6),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0052 DFLD  POS=(12,16),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DGIA0073 DFLD  POS=(12,24),LTH=10,                                     +        
               ATTR=(PROT)                                                      
ASTRIX4  DFLD  POS=(12,35),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0003 DFLD  POS=(12,39),LTH=17,                                     +        
               ATTR=(PROT)                                                      
DGIA0087 DFLD  POS=(12,57),LTH=10,                                     +        
               ATTR=(PROT)                                                      
DGIA0038 DFLD  POS=(12,69),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0066 DFLD  POS=(12,72),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0045 DFLD  POS=(12,76),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0024 DFLD  POS=(12,78),LTH=3,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0059 DFLD  POS=(13,16),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0080 DFLD  POS=(13,24),LTH=10,                                     +        
               ATTR=(NUM,NOPROT)                                                
DGIA0010 DFLD  POS=(13,39),LTH=17,                                     +        
               ATTR=(NOPROT)                                                    
DGIA0094 DFLD  POS=(13,57),LTH=10,                                     +        
               ATTR=(NOPROT)                                                    
DGIA0032 DFLD  POS=(14,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0018 DFLD  POS=(14,6),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0053 DFLD  POS=(14,16),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DGIA0074 DFLD  POS=(14,24),LTH=10,                                     +        
               ATTR=(PROT)                                                      
ASTRIX5  DFLD  POS=(14,35),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0004 DFLD  POS=(14,39),LTH=17,                                     +        
               ATTR=(PROT)                                                      
DGIA0088 DFLD  POS=(14,57),LTH=10,                                     +        
               ATTR=(PROT)                                                      
DGIA0039 DFLD  POS=(14,69),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0067 DFLD  POS=(14,72),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0046 DFLD  POS=(14,76),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0025 DFLD  POS=(14,78),LTH=3,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0060 DFLD  POS=(15,16),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0081 DFLD  POS=(15,24),LTH=10,                                     +        
               ATTR=(NUM,NOPROT)                                                
DGIA0011 DFLD  POS=(15,39),LTH=17,                                     +        
               ATTR=(NOPROT)                                                    
DGIA0095 DFLD  POS=(15,57),LTH=10,                                     +        
               ATTR=(NOPROT)                                                    
DGIA0033 DFLD  POS=(16,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0019 DFLD  POS=(16,6),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0054 DFLD  POS=(16,16),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DGIA0075 DFLD  POS=(16,24),LTH=10,                                     +        
               ATTR=(PROT)                                                      
ASTRIX6  DFLD  POS=(16,35),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0005 DFLD  POS=(16,39),LTH=17,                                     +        
               ATTR=(PROT)                                                      
DGIA0089 DFLD  POS=(16,57),LTH=10,                                     +        
               ATTR=(PROT)                                                      
DGIA0040 DFLD  POS=(16,69),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0068 DFLD  POS=(16,72),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0047 DFLD  POS=(16,76),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0026 DFLD  POS=(16,78),LTH=3,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0061 DFLD  POS=(17,16),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0082 DFLD  POS=(17,24),LTH=10,                                     +        
               ATTR=(NUM,NOPROT)                                                
DGIA0012 DFLD  POS=(17,39),LTH=17,                                     +        
               ATTR=(NOPROT)                                                    
DGIA0096 DFLD  POS=(17,57),LTH=10,                                     +        
               ATTR=(NOPROT)                                                    
DGIA0034 DFLD  POS=(18,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0020 DFLD  POS=(18,6),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0055 DFLD  POS=(18,16),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DGIA0076 DFLD  POS=(18,24),LTH=10,                                     +        
               ATTR=(PROT)                                                      
ASTRIX7  DFLD  POS=(18,35),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0006 DFLD  POS=(18,39),LTH=17,                                     +        
               ATTR=(PROT)                                                      
DGIA0090 DFLD  POS=(18,57),LTH=10,                                     +        
               ATTR=(PROT)                                                      
DGIA0041 DFLD  POS=(18,69),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0069 DFLD  POS=(18,72),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0048 DFLD  POS=(18,76),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0027 DFLD  POS=(18,78),LTH=3,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0062 DFLD  POS=(19,16),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0083 DFLD  POS=(19,24),LTH=10,                                     +        
               ATTR=(NUM,NOPROT)                                                
DGIA0013 DFLD  POS=(19,39),LTH=17,                                     +        
               ATTR=(NOPROT)                                                    
DGIA0097 DFLD  POS=(19,57),LTH=10,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  '13 New head    14 New line    15 Amend/del head 16 Amen+        
               d/del line 17 Addition 1',                              +        
               POS=(21,2),LTH=79,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18 Addition 2  19 Addition 3  20',                     +        
               POS=(22,2),LTH=32,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,68),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4I265N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N265),                                           +        
               OPT=2,                                                  +        
               NXT=W4O265N1                                                     
MID      LPAGE SOR=(W4N265)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  (IDTRANS1,                                              +        
               '4'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  (IDTRANS2,                                              +        
               '2'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  (IDTRANS3,                                              +        
               '6'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  (IDTRANS4,                                              +        
               '5'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '42652',                                                +        
               LTH=5                                                            
         MFLD  (DGIA0102,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0104,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0108,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0099,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0103,                                               +        
               LTH=4                                                            
         MFLD  DGIA0105,                                               +        
               LTH=6                                                            
         MFLD  DGIA0109,                                               +        
               LTH=7                                                            
         MFLD  DGIA0101,                                               +        
               LTH=9                                                            
         MFLD  DGIA0098,                                               +        
               LTH=9                                                            
         MFLD  DGIA0106,                                               +        
               LTH=3                                                            
         MFLD  DGIA0100,                                               +        
               LTH=9                                                            
         MFLD  DGIA0107,                                               +        
               LTH=3                                                            
         MFLD  (DGIA0028,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (DGIA0029,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (DGIA0030,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (DGIA0031,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (DGIA0032,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (DGIA0033,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (DGIA0034,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (DGIA0014,                                              +        
               '         '),                                           +        
               LTH=9                                                            
         MFLD  (DGIA0015,                                              +        
               '         '),                                           +        
               LTH=9                                                            
         MFLD  (DGIA0016,                                              +        
               '         '),                                           +        
               LTH=9                                                            
         MFLD  (DGIA0017,                                              +        
               '         '),                                           +        
               LTH=9                                                            
         MFLD  (DGIA0018,                                              +        
               '         '),                                           +        
               LTH=9                                                            
         MFLD  (DGIA0019,                                              +        
               '         '),                                           +        
               LTH=9                                                            
         MFLD  (DGIA0020,                                              +        
               '         '),                                           +        
               LTH=9                                                            
         MFLD  (DGIA0021,                                              +        
               ' '),                                                   +        
               LTH=3                                                            
         MFLD  (DGIA0022,                                              +        
               ' '),                                                   +        
               LTH=3                                                            
         MFLD  (DGIA0023,                                              +        
               ' '),                                                   +        
               LTH=3                                                            
         MFLD  (DGIA0024,                                              +        
               ' '),                                                   +        
               LTH=3                                                            
         MFLD  (DGIA0025,                                              +        
               ' '),                                                   +        
               LTH=3                                                            
         MFLD  (DGIA0026,                                              +        
               ' '),                                                   +        
               LTH=3                                                            
         MFLD  (DGIA0027,                                              +        
               ' '),                                                   +        
               LTH=3                                                            
         MFLD  (DGIA0056,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0057,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0058,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0059,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0060,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0061,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0062,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0077,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0078,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0079,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0080,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0081,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0082,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0083,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0007,                                              +        
               '+++++++++++++++++'),                                   +        
               LTH=17,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0008,                                              +        
               '+++++++++++++++++'),                                   +        
               LTH=17,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0009,                                              +        
               '+++++++++++++++++'),                                   +        
               LTH=17,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0010,                                              +        
               '+++++++++++++++++'),                                   +        
               LTH=17,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0011,                                              +        
               '+++++++++++++++++'),                                   +        
               LTH=17,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0012,                                              +        
               '+++++++++++++++++'),                                   +        
               LTH=17,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0013,                                              +        
               '+++++++++++++++++'),                                   +        
               LTH=17,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0091,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0092,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0093,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0094,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0095,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0096,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0097,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MSGEND                                                                 
W4O265N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N265,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I265N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W4N265,                                             +        
               NXT=W4I265N1                                                     
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  DGIA0102,                                               +        
               LTH=4                                                            
         MFLD  DGIA0104,                                               +        
               LTH=6                                                            
         MFLD  DGIA0108,                                               +        
               LTH=7                                                            
         MFLD  DGIA0099,                                               +        
               LTH=9                                                            
         MFLD  DGIA0103,                                               +        
               LTH=4                                                            
         MFLD  DGIA0105,                                               +        
               LTH=6                                                            
         MFLD  DGIA0109,                                               +        
               LTH=7                                                            
         MFLD  DGIA0101,                                               +        
               LTH=9                                                            
         MFLD  KDORDKL,                                                +        
               LTH=1                                                            
         MFLD  KDFRAKT,                                                +        
               LTH=2                                                            
         MFLD  KDPROTYP,                                               +        
               LTH=1                                                            
         MFLD  DGIA0098,                                               +        
               LTH=9                                                            
         MFLD  DGIA0106,                                               +        
               LTH=3                                                            
         MFLD  DGIA0100,                                               +        
               LTH=9                                                            
         MFLD  DGIA0107,                                               +        
               LTH=3                                                            
         MFLD  TEDDI,                                                  +        
               LTH=11                                                           
         MFLD  KDVALISO,                                               +        
               LTH=3                                                            
         MFLD  DGIA0028,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0029,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0030,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0031,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0032,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0033,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0034,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0014,                                               +        
               LTH=9                                                            
         MFLD  DGIA0015,                                               +        
               LTH=9                                                            
         MFLD  DGIA0016,                                               +        
               LTH=9                                                            
         MFLD  DGIA0017,                                               +        
               LTH=9                                                            
         MFLD  DGIA0018,                                               +        
               LTH=9                                                            
         MFLD  DGIA0019,                                               +        
               LTH=9                                                            
         MFLD  DGIA0020,                                               +        
               LTH=9                                                            
         MFLD  DGIA0049,                                               +        
               LTH=7                                                            
         MFLD  DGIA0050,                                               +        
               LTH=7                                                            
         MFLD  DGIA0051,                                               +        
               LTH=7                                                            
         MFLD  DGIA0052,                                               +        
               LTH=7                                                            
         MFLD  DGIA0053,                                               +        
               LTH=7                                                            
         MFLD  DGIA0054,                                               +        
               LTH=7                                                            
         MFLD  DGIA0055,                                               +        
               LTH=7                                                            
         MFLD  DGIA0070,                                               +        
               LTH=10                                                           
         MFLD  DGIA0071,                                               +        
               LTH=10                                                           
         MFLD  DGIA0072,                                               +        
               LTH=10                                                           
         MFLD  DGIA0073,                                               +        
               LTH=10                                                           
         MFLD  DGIA0074,                                               +        
               LTH=10                                                           
         MFLD  DGIA0075,                                               +        
               LTH=10                                                           
         MFLD  DGIA0076,                                               +        
               LTH=10                                                           
         MFLD  ASTRIX1,                                                +        
               LTH=1                                                            
         MFLD  ASTRIX2,                                                +        
               LTH=1                                                            
         MFLD  ASTRIX3,                                                +        
               LTH=1                                                            
         MFLD  ASTRIX4,                                                +        
               LTH=1                                                            
         MFLD  ASTRIX5,                                                +        
               LTH=1                                                            
         MFLD  ASTRIX6,                                                +        
               LTH=1                                                            
         MFLD  ASTRIX7,                                                +        
               LTH=1                                                            
         MFLD  DGIA0000,                                               +        
               LTH=17                                                           
         MFLD  DGIA0001,                                               +        
               LTH=17                                                           
         MFLD  DGIA0002,                                               +        
               LTH=17                                                           
         MFLD  DGIA0003,                                               +        
               LTH=17                                                           
         MFLD  DGIA0004,                                               +        
               LTH=17                                                           
         MFLD  DGIA0005,                                               +        
               LTH=17                                                           
         MFLD  DGIA0006,                                               +        
               LTH=17                                                           
         MFLD  DGIA0084,                                               +        
               LTH=10                                                           
         MFLD  DGIA0085,                                               +        
               LTH=10                                                           
         MFLD  DGIA0086,                                               +        
               LTH=10                                                           
         MFLD  DGIA0087,                                               +        
               LTH=10                                                           
         MFLD  DGIA0088,                                               +        
               LTH=10                                                           
         MFLD  DGIA0089,                                               +        
               LTH=10                                                           
         MFLD  DGIA0090,                                               +        
               LTH=10                                                           
         MFLD  DGIA0035,                                               +        
               LTH=1                                                            
         MFLD  DGIA0036,                                               +        
               LTH=1                                                            
         MFLD  DGIA0037,                                               +        
               LTH=1                                                            
         MFLD  DGIA0038,                                               +        
               LTH=1                                                            
         MFLD  DGIA0039,                                               +        
               LTH=1                                                            
         MFLD  DGIA0040,                                               +        
               LTH=1                                                            
         MFLD  DGIA0041,                                               +        
               LTH=1                                                            
         MFLD  DGIA0063,                                               +        
               LTH=2                                                            
         MFLD  DGIA0064,                                               +        
               LTH=2                                                            
         MFLD  DGIA0065,                                               +        
               LTH=2                                                            
         MFLD  DGIA0066,                                               +        
               LTH=2                                                            
         MFLD  DGIA0067,                                               +        
               LTH=2                                                            
         MFLD  DGIA0068,                                               +        
               LTH=2                                                            
         MFLD  DGIA0069,                                               +        
               LTH=2                                                            
         MFLD  DGIA0042,                                               +        
               LTH=1                                                            
         MFLD  DGIA0043,                                               +        
               LTH=1                                                            
         MFLD  DGIA0044,                                               +        
               LTH=1                                                            
         MFLD  DGIA0045,                                               +        
               LTH=1                                                            
         MFLD  DGIA0046,                                               +        
               LTH=1                                                            
         MFLD  DGIA0047,                                               +        
               LTH=1                                                            
         MFLD  DGIA0048,                                               +        
               LTH=1                                                            
         MFLD  DGIA0021,                                               +        
               LTH=3                                                            
         MFLD  DGIA0022,                                               +        
               LTH=3                                                            
         MFLD  DGIA0023,                                               +        
               LTH=3                                                            
         MFLD  DGIA0024,                                               +        
               LTH=3                                                            
         MFLD  DGIA0025,                                               +        
               LTH=3                                                            
         MFLD  DGIA0026,                                               +        
               LTH=3                                                            
         MFLD  DGIA0027,                                               +        
               LTH=3                                                            
         MFLD  DGIA0056,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0057,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0058,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0059,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0060,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0061,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0062,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0077,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0078,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0079,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0080,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0081,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0082,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0083,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0007,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0008,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0009,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0010,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0011,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0012,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0013,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0091,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0092,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0093,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0094,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0095,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0096,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0097,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
