*          DATA SET W4N251FII0 AT LEVEL 001 AS OF 80/09/26                      
         PRINT NOGEN                                                            
W4N251   FMT                                                                    
         DEV   TYPE=(3270,2),                                          *        
               FEAT=IGNORE,                                            *        
               DSCA=X'0080',SYSMSG=FSYSMSG                                      
         DIV   TYPE=INOUT                                                       
         DPAGE CURSOR=((03,11)),                                       *        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(01,02),LTH=0001,ATTR=(ALPHA,NOPROT,MOD)                     
FLD0104  DFLD  POS=(01,04),LTH=0001,ATTR=(NUM,PROT,MOD)                         
FLD0106  DFLD  POS=(01,06),LTH=0001,ATTR=(NUM,PROT,MOD)                         
FLD0108  DFLD  POS=(01,08),LTH=0001,ATTR=(NUM,PROT,MOD)                         
         DFLD  '  D A Y O R D E R    INVOICERELEASE',                  *        
               POS=(01,10),LTH=0035,ATTR=(NUM,PROT)                             
SUORDV   DFLD  POS=(01,47),LTH=0010,ATTR=(NUM,PROT,MOD,NODISP)                  
VKORDBTO DFLD  POS=(01,58),LTH=0006,ATTR=(NUM,PROT,MOD,NODISP)                  
VLORDBTO DFLD  POS=(01,65),LTH=0006,ATTR=(NUM,PROT,MOD,NODISP)                  
KVORDERB DFLD  POS=(01,72),LTH=0003,ATTR=(NUM,PROT,MOD,NODISP)                  
KVORDERT DFLD  POS=(01,76),LTH=0003,ATTR=(NUM,PROT,MOD,NODISP)                  
IDORDR2  DFLD  POS=(02,02),LTH=0078,ATTR=(NUM,PROT,MOD,NODISP)                  
         DFLD  'DISTRICT',                                             *        
               POS=(03,02),LTH=0008,ATTR=(NUM,PROT)                             
IDDISTR  DFLD  POS=(03,11),LTH=0004,ATTR=(NUM,MOD)                              
         DFLD  'CUST',                                                 *        
               POS=(03,16),LTH=0004,ATTR=(NUM,PROT)                             
IDKUNDNR DFLD  POS=(03,21),LTH=0006,ATTR=(NUM,MOD)                              
IDORDF   DFLD  POS=(03,28),LTH=0006,ATTR=(NUM,PROT,MOD,NODISP)                  
KDFAKTG  DFLD  POS=(03,35),LTH=0001,ATTR=(ALPHA,PROT,MOD,NODISP)                
KDFRAKTG DFLD  POS=(03,37),LTH=0002,ATTR=(NUM,PROT,MOD,NODISP)                  
IDORDR3  DFLD  POS=(03,40),LTH=0036,ATTR=(NUM,PROT,MOD,NODISP)                  
IDORDR4  DFLD  POS=(04,02),LTH=0078,ATTR=(NUM,PROT,MOD,NODISP)                  
         DFLD  'PACKED NOT INVOICED',                                  *        
               POS=(05,09),LTH=0019,ATTR=(NUM,PROT)                             
IDORDR5  DFLD  POS=(05,29),LTH=0030,ATTR=(NUM,PROT,MOD,NODISP)                  
IDORDR6  DFLD  POS=(06,02),LTH=0078,ATTR=(NUM,PROT,MOD,NODISP)                  
         DFLD  'INV. ORDER   REP.NO IT FC  CLASS  GR.WGT   GR.VOL   NO *        
               ITEMS   AMOUNT DEL.PLACE',                              *        
               POS=(07,02),LTH=0079,ATTR=(NUM,PROT)                             
FLFAKT01 DFLD  POS=(08,02),LTH=0001,ATTR=(ALPHA,PROT,MOD)                       
IDKUND01 DFLD  POS=(08,07),LTH=0005,ATTR=(NUM,PROT)                             
IDORDN01 DFLD  POS=(08,15),LTH=0006,ATTR=(NUM,PROT,MOD)                         
KDFAKT01 DFLD  POS=(08,23),LTH=0001,ATTR=(ALPHA,PROT,MOD)                       
KDFRAK01 DFLD  POS=(08,25),LTH=0002,ATTR=(NUM,PROT,MOD)                         
KDORDK01 DFLD  POS=(08,31),LTH=0001,ATTR=(NUM,PROT)                             
VKORDB01 DFLD  POS=(08,35),LTH=0007,ATTR=(NUM,PROT,MOD)                         
VLORDB01 DFLD  POS=(08,44),LTH=0007,ATTR=(NUM,PROT,MOD)                         
KVORDR01 DFLD  POS=(08,58),LTH=0003,ATTR=(NUM,PROT)                             
SUORDV01 DFLD  POS=(08,62),LTH=0011,ATTR=(NUM,PROT,MOD)                         
ADLEVP01 DFLD  POS=(08,76),LTH=0002,ATTR=(NUM,PROT)                             
FLFAKT02 DFLD  POS=(09,02),LTH=0001,ATTR=(ALPHA,PROT,MOD)                       
IDKUND02 DFLD  POS=(09,07),LTH=0005,ATTR=(NUM,PROT)                             
IDORDN02 DFLD  POS=(09,15),LTH=0006,ATTR=(NUM,PROT,MOD)                         
KDFAKT02 DFLD  POS=(09,23),LTH=0001,ATTR=(ALPHA,PROT,MOD)                       
KDFRAK02 DFLD  POS=(09,25),LTH=0002,ATTR=(NUM,PROT,MOD)                         
KDORDK02 DFLD  POS=(09,31),LTH=0001,ATTR=(NUM,PROT)                             
VKORDB02 DFLD  POS=(09,35),LTH=0007,ATTR=(NUM,PROT,MOD)                         
VLORDB02 DFLD  POS=(09,44),LTH=0007,ATTR=(NUM,PROT,MOD)                         
KVORDR02 DFLD  POS=(09,58),LTH=0003,ATTR=(NUM,PROT)                             
SUORDV02 DFLD  POS=(09,62),LTH=0011,ATTR=(NUM,PROT,MOD)                         
ADLEVP02 DFLD  POS=(09,76),LTH=0002,ATTR=(NUM,PROT)                             
FLFAKT03 DFLD  POS=(10,02),LTH=0001,ATTR=(ALPHA,PROT,MOD)                       
IDKUND03 DFLD  POS=(10,07),LTH=0005,ATTR=(NUM,PROT)                             
IDORDN03 DFLD  POS=(10,15),LTH=0006,ATTR=(NUM,PROT,MOD)                         
KDFAKT03 DFLD  POS=(10,23),LTH=0001,ATTR=(ALPHA,PROT,MOD)                       
KDFRAK03 DFLD  POS=(10,25),LTH=0002,ATTR=(NUM,PROT,MOD)                         
KDORDK03 DFLD  POS=(10,31),LTH=0001,ATTR=(NUM,PROT)                             
VKORDB03 DFLD  POS=(10,35),LTH=0007,ATTR=(NUM,PROT,MOD)                         
VLORDB03 DFLD  POS=(10,44),LTH=0007,ATTR=(NUM,PROT,MOD)                         
KVORDR03 DFLD  POS=(10,58),LTH=0003,ATTR=(NUM,PROT)                             
SUORDV03 DFLD  POS=(10,62),LTH=0011,ATTR=(NUM,PROT,MOD)                         
ADLEVP03 DFLD  POS=(10,76),LTH=0002,ATTR=(NUM,PROT)                             
FLFAKT04 DFLD  POS=(11,02),LTH=0001,ATTR=(ALPHA,PROT,MOD)                       
IDKUND04 DFLD  POS=(11,07),LTH=0005,ATTR=(NUM,PROT)                             
IDORDN04 DFLD  POS=(11,15),LTH=0006,ATTR=(NUM,PROT,MOD)                         
KDFAKT04 DFLD  POS=(11,23),LTH=0001,ATTR=(ALPHA,PROT,MOD)                       
KDFRAK04 DFLD  POS=(11,25),LTH=0002,ATTR=(NUM,PROT,MOD)                         
KDORDK04 DFLD  POS=(11,31),LTH=0001,ATTR=(NUM,PROT)                             
VKORDB04 DFLD  POS=(11,35),LTH=0007,ATTR=(NUM,PROT,MOD)                         
VLORDB04 DFLD  POS=(11,44),LTH=0007,ATTR=(NUM,PROT,MOD)                         
KVORDR04 DFLD  POS=(11,58),LTH=0003,ATTR=(NUM,PROT)                             
SUORDV04 DFLD  POS=(11,62),LTH=0011,ATTR=(NUM,PROT,MOD)                         
ADLEVP04 DFLD  POS=(11,76),LTH=0002,ATTR=(NUM,PROT)                             
FLFAKT05 DFLD  POS=(12,02),LTH=0001,ATTR=(ALPHA,PROT,MOD)                       
IDKUND05 DFLD  POS=(12,07),LTH=0005,ATTR=(NUM,PROT)                             
IDORDN05 DFLD  POS=(12,15),LTH=0006,ATTR=(NUM,PROT,MOD)                         
KDFAKT05 DFLD  POS=(12,23),LTH=0001,ATTR=(ALPHA,PROT,MOD)                       
KDFRAK05 DFLD  POS=(12,25),LTH=0002,ATTR=(NUM,PROT,MOD)                         
KDORDK05 DFLD  POS=(12,31),LTH=0001,ATTR=(NUM,PROT)                             
VKORDB05 DFLD  POS=(12,35),LTH=0007,ATTR=(NUM,PROT,MOD)                         
VLORDB05 DFLD  POS=(12,44),LTH=0007,ATTR=(NUM,PROT,MOD)                         
KVORDR05 DFLD  POS=(12,58),LTH=0003,ATTR=(NUM,PROT)                             
SUORDV05 DFLD  POS=(12,62),LTH=0011,ATTR=(NUM,PROT,MOD)                         
ADLEVP05 DFLD  POS=(12,76),LTH=0002,ATTR=(NUM,PROT)                             
FLFAKT06 DFLD  POS=(13,02),LTH=0001,ATTR=(ALPHA,PROT,MOD)                       
IDKUND06 DFLD  POS=(13,07),LTH=0005,ATTR=(NUM,PROT)                             
IDORDN06 DFLD  POS=(13,15),LTH=0006,ATTR=(NUM,PROT,MOD)                         
KDFAKT06 DFLD  POS=(13,23),LTH=0001,ATTR=(ALPHA,PROT,MOD)                       
KDFRAK06 DFLD  POS=(13,25),LTH=0002,ATTR=(NUM,PROT,MOD)                         
KDORDK06 DFLD  POS=(13,31),LTH=0001,ATTR=(NUM,PROT)                             
VKORDB06 DFLD  POS=(13,35),LTH=0007,ATTR=(NUM,PROT,MOD)                         
VLORDB06 DFLD  POS=(13,44),LTH=0007,ATTR=(NUM,PROT,MOD)                         
KVORDR06 DFLD  POS=(13,58),LTH=0003,ATTR=(NUM,PROT)                             
SUORDV06 DFLD  POS=(13,62),LTH=0011,ATTR=(NUM,PROT,MOD)                         
ADLEVP06 DFLD  POS=(13,76),LTH=0002,ATTR=(NUM,PROT)                             
FLFAKT07 DFLD  POS=(14,02),LTH=0001,ATTR=(ALPHA,PROT,MOD)                       
IDKUND07 DFLD  POS=(14,07),LTH=0005,ATTR=(NUM,PROT)                             
IDORDN07 DFLD  POS=(14,15),LTH=0006,ATTR=(NUM,PROT,MOD)                         
KDFAKT07 DFLD  POS=(14,23),LTH=0001,ATTR=(ALPHA,PROT,MOD)                       
KDFRAK07 DFLD  POS=(14,25),LTH=0002,ATTR=(NUM,PROT,MOD)                         
KDORDK07 DFLD  POS=(14,31),LTH=0001,ATTR=(NUM,PROT)                             
VKORDB07 DFLD  POS=(14,35),LTH=0007,ATTR=(NUM,PROT,MOD)                         
VLORDB07 DFLD  POS=(14,44),LTH=0007,ATTR=(NUM,PROT,MOD)                         
KVORDR07 DFLD  POS=(14,58),LTH=0003,ATTR=(NUM,PROT)                             
SUORDV07 DFLD  POS=(14,62),LTH=0011,ATTR=(NUM,PROT,MOD)                         
ADLEVP07 DFLD  POS=(14,76),LTH=0002,ATTR=(NUM,PROT)                             
FLFAKT08 DFLD  POS=(15,02),LTH=0001,ATTR=(ALPHA,PROT,MOD)                       
IDKUND08 DFLD  POS=(15,07),LTH=0005,ATTR=(NUM,PROT)                             
IDORDN08 DFLD  POS=(15,15),LTH=0006,ATTR=(NUM,PROT,MOD)                         
KDFAKT08 DFLD  POS=(15,23),LTH=0001,ATTR=(ALPHA,PROT,MOD)                       
KDFRAK08 DFLD  POS=(15,25),LTH=0002,ATTR=(NUM,PROT,MOD)                         
KDORDK08 DFLD  POS=(15,31),LTH=0001,ATTR=(NUM,PROT)                             
VKORDB08 DFLD  POS=(15,35),LTH=0007,ATTR=(NUM,PROT,MOD)                         
VLORDB08 DFLD  POS=(15,44),LTH=0007,ATTR=(NUM,PROT,MOD)                         
KVORDR08 DFLD  POS=(15,58),LTH=0003,ATTR=(NUM,PROT)                             
SUORDV08 DFLD  POS=(15,62),LTH=0011,ATTR=(NUM,PROT,MOD)                         
ADLEVP08 DFLD  POS=(15,76),LTH=0002,ATTR=(NUM,PROT)                             
FLFAKT09 DFLD  POS=(16,02),LTH=0001,ATTR=(ALPHA,PROT,MOD)                       
IDKUND09 DFLD  POS=(16,07),LTH=0005,ATTR=(NUM,PROT)                             
IDORDN09 DFLD  POS=(16,15),LTH=0006,ATTR=(NUM,PROT,MOD)                         
KDFAKT09 DFLD  POS=(16,23),LTH=0001,ATTR=(ALPHA,PROT,MOD)                       
KDFRAK09 DFLD  POS=(16,25),LTH=0002,ATTR=(NUM,PROT,MOD)                         
KDORDK09 DFLD  POS=(16,31),LTH=0001,ATTR=(NUM,PROT)                             
VKORDB09 DFLD  POS=(16,35),LTH=0007,ATTR=(NUM,PROT,MOD)                         
VLORDB09 DFLD  POS=(16,44),LTH=0007,ATTR=(NUM,PROT,MOD)                         
KVORDR09 DFLD  POS=(16,58),LTH=0003,ATTR=(NUM,PROT)                             
SUORDV09 DFLD  POS=(16,62),LTH=0011,ATTR=(NUM,PROT,MOD)                         
ADLEVP09 DFLD  POS=(16,76),LTH=0002,ATTR=(NUM,PROT)                             
FLFAKT10 DFLD  POS=(17,02),LTH=0001,ATTR=(ALPHA,PROT,MOD)                       
IDKUND10 DFLD  POS=(17,07),LTH=0005,ATTR=(NUM,PROT)                             
IDORDN10 DFLD  POS=(17,15),LTH=0006,ATTR=(NUM,PROT,MOD)                         
KDFAKT10 DFLD  POS=(17,23),LTH=0001,ATTR=(ALPHA,PROT,MOD)                       
KDFRAK10 DFLD  POS=(17,25),LTH=0002,ATTR=(NUM,PROT,MOD)                         
KDORDK10 DFLD  POS=(17,31),LTH=0001,ATTR=(NUM,PROT)                             
VKORDB10 DFLD  POS=(17,35),LTH=0007,ATTR=(NUM,PROT,MOD)                         
VLORDB10 DFLD  POS=(17,44),LTH=0007,ATTR=(NUM,PROT,MOD)                         
KVORDR10 DFLD  POS=(17,58),LTH=0003,ATTR=(NUM,PROT)                             
SUORDV10 DFLD  POS=(17,62),LTH=0011,ATTR=(NUM,PROT,MOD)                         
ADLEVP10 DFLD  POS=(17,76),LTH=0002,ATTR=(NUM,PROT)                             
FLFAKT11 DFLD  POS=(18,02),LTH=0001,ATTR=(ALPHA,PROT,MOD)                       
IDKUND11 DFLD  POS=(18,07),LTH=0005,ATTR=(NUM,PROT)                             
IDORDN11 DFLD  POS=(18,15),LTH=0006,ATTR=(NUM,PROT,MOD)                         
KDFAKT11 DFLD  POS=(18,23),LTH=0001,ATTR=(ALPHA,PROT,MOD)                       
KDFRAK11 DFLD  POS=(18,25),LTH=0002,ATTR=(NUM,PROT,MOD)                         
KDORDK11 DFLD  POS=(18,31),LTH=0001,ATTR=(NUM,PROT)                             
VKORDB11 DFLD  POS=(18,35),LTH=0007,ATTR=(NUM,PROT,MOD)                         
VLORDB11 DFLD  POS=(18,44),LTH=0007,ATTR=(NUM,PROT,MOD)                         
KVORDR11 DFLD  POS=(18,58),LTH=0003,ATTR=(NUM,PROT)                             
SUORDV11 DFLD  POS=(18,62),LTH=0011,ATTR=(NUM,PROT,MOD)                         
ADLEVP11 DFLD  POS=(18,76),LTH=0002,ATTR=(NUM,PROT)                             
FLFAKT12 DFLD  POS=(19,02),LTH=0001,ATTR=(ALPHA,PROT,MOD)                       
IDKUND12 DFLD  POS=(19,07),LTH=0005,ATTR=(NUM,PROT)                             
IDORDN12 DFLD  POS=(19,15),LTH=0006,ATTR=(NUM,PROT,MOD)                         
KDFAKT12 DFLD  POS=(19,23),LTH=0001,ATTR=(ALPHA,PROT,MOD)                       
KDFRAK12 DFLD  POS=(19,25),LTH=0002,ATTR=(NUM,PROT,MOD)                         
KDORDK12 DFLD  POS=(19,31),LTH=0001,ATTR=(NUM,PROT)                             
VKORDB12 DFLD  POS=(19,35),LTH=0007,ATTR=(NUM,PROT,MOD)                         
VLORDB12 DFLD  POS=(19,44),LTH=0007,ATTR=(NUM,PROT,MOD)                         
KVORDR12 DFLD  POS=(19,58),LTH=0003,ATTR=(NUM,PROT)                             
SUORDV12 DFLD  POS=(19,62),LTH=0011,ATTR=(NUM,PROT,MOD)                         
ADLEVP12 DFLD  POS=(19,76),LTH=0002,ATTR=(NUM,PROT)                             
FLFAKT13 DFLD  POS=(20,02),LTH=0001,ATTR=(ALPHA,PROT,MOD)                       
IDKUND13 DFLD  POS=(20,07),LTH=0005,ATTR=(NUM,PROT)                             
IDORDN13 DFLD  POS=(20,15),LTH=0006,ATTR=(NUM,PROT,MOD)                         
KDFAKT13 DFLD  POS=(20,23),LTH=0001,ATTR=(ALPHA,PROT,MOD)                       
KDFRAK13 DFLD  POS=(20,25),LTH=0002,ATTR=(NUM,PROT,MOD)                         
KDORDK13 DFLD  POS=(20,31),LTH=0001,ATTR=(NUM,PROT)                             
VKORDB13 DFLD  POS=(20,35),LTH=0007,ATTR=(NUM,PROT,MOD)                         
VLORDB13 DFLD  POS=(20,44),LTH=0007,ATTR=(NUM,PROT,MOD)                         
KVORDR13 DFLD  POS=(20,58),LTH=0003,ATTR=(NUM,PROT)                             
SUORDV13 DFLD  POS=(20,62),LTH=0011,ATTR=(NUM,PROT,MOD)                         
ADLEVP13 DFLD  POS=(20,76),LTH=0002,ATTR=(NUM,PROT)                             
FLFAKT14 DFLD  POS=(21,02),LTH=0001,ATTR=(ALPHA,PROT,MOD)                       
IDKUND14 DFLD  POS=(21,07),LTH=0005,ATTR=(NUM,PROT)                             
IDORDN14 DFLD  POS=(21,15),LTH=0006,ATTR=(NUM,PROT,MOD)                         
KDFAKT14 DFLD  POS=(21,23),LTH=0001,ATTR=(ALPHA,PROT,MOD)                       
KDFRAK14 DFLD  POS=(21,25),LTH=0002,ATTR=(NUM,PROT,MOD)                         
KDORDK14 DFLD  POS=(21,31),LTH=0001,ATTR=(NUM,PROT)                             
VKORDB14 DFLD  POS=(21,35),LTH=0007,ATTR=(NUM,PROT,MOD)                         
VLORDB14 DFLD  POS=(21,44),LTH=0007,ATTR=(NUM,PROT,MOD)                         
KVORDR14 DFLD  POS=(21,58),LTH=0003,ATTR=(NUM,PROT)                             
SUORDV14 DFLD  POS=(21,62),LTH=0011,ATTR=(NUM,PROT,MOD)                         
ADLEVP14 DFLD  POS=(21,76),LTH=0002,ATTR=(NUM,PROT)                             
FLFAKT15 DFLD  POS=(22,02),LTH=0001,ATTR=(ALPHA,PROT,MOD)                       
IDKUND15 DFLD  POS=(22,07),LTH=0005,ATTR=(NUM,PROT)                             
IDORDN15 DFLD  POS=(22,15),LTH=0006,ATTR=(NUM,PROT,MOD)                         
KDFAKT15 DFLD  POS=(22,23),LTH=0001,ATTR=(ALPHA,PROT,MOD)                       
KDFRAK15 DFLD  POS=(22,25),LTH=0002,ATTR=(NUM,PROT,MOD)                         
KDORDK15 DFLD  POS=(22,31),LTH=0001,ATTR=(NUM,PROT)                             
VKORDB15 DFLD  POS=(22,35),LTH=0007,ATTR=(NUM,PROT,MOD)                         
VLORDB15 DFLD  POS=(22,44),LTH=0007,ATTR=(NUM,PROT,MOD)                         
KVORDR15 DFLD  POS=(22,58),LTH=0003,ATTR=(NUM,PROT)                             
SUORDV15 DFLD  POS=(22,62),LTH=0011,ATTR=(NUM,PROT,MOD)                         
ADLEVP15 DFLD  POS=(22,76),LTH=0002,ATTR=(NUM,PROT)                             
         DFLD  'TEXT:',                                                *        
               POS=(23,02),LTH=0005,ATTR=(NUM,PROT)                             
TEXT     DFLD  POS=(23,08),LTH=0073,ATTR=(NUM,PROT,HI)                          
FSYSMSG  DFLD  POS=(24,02),LTH=0079,ATTR=(NUM,PROT,HI)                          
         FMTEND                                                                 
         EJECT                                                                  
W4O251N1 MSG   TYPE=OUTPUT,                                            *        
               SOR=(W4N251,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W4I251N1,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  FLD0102,LTH=0001                                                 
         MFLD  FLD0104,LTH=0001                                                 
         MFLD  FLD0106,LTH=0001                                                 
         MFLD  FLD0108,LTH=0001                                                 
         MFLD  TEXT,LTH=0073                                                    
         MFLD  IDDISTR,LTH=0004,ATTR=YES                                        
         MFLD  IDKUNDNR,LTH=0004,ATTR=YES                                       
         MFLD  FLFAKT01,LTH=0004,ATTR=YES                                       
         MFLD  FLFAKT02,LTH=0004,ATTR=YES                                       
         MFLD  FLFAKT03,LTH=0004,ATTR=YES                                       
         MFLD  FLFAKT04,LTH=0004,ATTR=YES                                       
         MFLD  FLFAKT05,LTH=0004,ATTR=YES                                       
         MFLD  FLFAKT06,LTH=0004,ATTR=YES                                       
         MFLD  FLFAKT07,LTH=0004,ATTR=YES                                       
         MFLD  FLFAKT08,LTH=0004,ATTR=YES                                       
         MFLD  FLFAKT09,LTH=0004,ATTR=YES                                       
         MFLD  FLFAKT10,LTH=0004,ATTR=YES                                       
         MFLD  FLFAKT11,LTH=0004,ATTR=YES                                       
         MFLD  FLFAKT12,LTH=0004,ATTR=YES                                       
         MFLD  FLFAKT13,LTH=0004,ATTR=YES                                       
         MFLD  FLFAKT14,LTH=0004,ATTR=YES                                       
         MFLD  FLFAKT15,LTH=0004,ATTR=YES                                       
         MFLD  SUORDV,LTH=0010                                                  
         MFLD  VKORDBTO,LTH=0006                                                
         MFLD  VLORDBTO,LTH=0006                                                
         MFLD  IDORDF,LTH=0006                                                  
         MFLD  KDFAKTG,LTH=0001                                                 
         MFLD  KDFRAKTG,LTH=0002                                                
         MFLD  KVORDERB,LTH=0003                                                
         MFLD  KVORDERT,LTH=0003                                                
         MFLD  IDORDR2,LTH=0078                                                 
         MFLD  IDORDR3,LTH=0036                                                 
         MFLD  IDORDR4,LTH=0078                                                 
         MFLD  IDORDR5,LTH=0030                                                 
         MFLD  IDORDR6,LTH=0078                                                 
         MFLD  IDKUND01,LTH=0005                                                
         MFLD  IDORDN01,LTH=0006                                                
         MFLD  KDFAKT01,LTH=0001                                                
         MFLD  KDFRAK01,LTH=0002                                                
         MFLD  KDORDK01,LTH=0001                                                
         MFLD  VKORDB01,LTH=0007                                                
         MFLD  VLORDB01,LTH=0007                                                
         MFLD  KVORDR01,LTH=0003                                                
         MFLD  SUORDV01,LTH=0011                                                
         MFLD  ADLEVP01,LTH=0002                                                
         MFLD  IDKUND02,LTH=0005                                                
         MFLD  IDORDN02,LTH=0006                                                
         MFLD  KDFAKT02,LTH=0001                                                
         MFLD  KDFRAK02,LTH=0002                                                
         MFLD  KDORDK02,LTH=0001                                                
         MFLD  VKORDB02,LTH=0007                                                
         MFLD  VLORDB02,LTH=0007                                                
         MFLD  KVORDR02,LTH=0003                                                
         MFLD  SUORDV02,LTH=0011                                                
         MFLD  ADLEVP02,LTH=0002                                                
         MFLD  IDKUND03,LTH=0005                                                
         MFLD  IDORDN03,LTH=0006                                                
         MFLD  KDFAKT03,LTH=0001                                                
         MFLD  KDFRAK03,LTH=0002                                                
         MFLD  KDORDK03,LTH=0001                                                
         MFLD  VKORDB03,LTH=0007                                                
         MFLD  VLORDB03,LTH=0007                                                
         MFLD  KVORDR03,LTH=0003                                                
         MFLD  SUORDV03,LTH=0011                                                
         MFLD  ADLEVP03,LTH=0002                                                
         MFLD  IDKUND04,LTH=0005                                                
         MFLD  IDORDN04,LTH=0006                                                
         MFLD  KDFAKT04,LTH=0001                                                
         MFLD  KDFRAK04,LTH=0002                                                
         MFLD  KDORDK04,LTH=0001                                                
         MFLD  VKORDB04,LTH=0007                                                
         MFLD  VLORDB04,LTH=0007                                                
         MFLD  KVORDR04,LTH=0003                                                
         MFLD  SUORDV04,LTH=0011                                                
         MFLD  ADLEVP04,LTH=0002                                                
         MFLD  IDKUND05,LTH=0005                                                
         MFLD  IDORDN05,LTH=0006                                                
         MFLD  KDFAKT05,LTH=0001                                                
         MFLD  KDFRAK05,LTH=0002                                                
         MFLD  KDORDK05,LTH=0001                                                
         MFLD  VKORDB05,LTH=0007                                                
         MFLD  VLORDB05,LTH=0007                                                
         MFLD  KVORDR05,LTH=0003                                                
         MFLD  SUORDV05,LTH=0011                                                
         MFLD  ADLEVP05,LTH=0002                                                
         MFLD  IDKUND06,LTH=0005                                                
         MFLD  IDORDN06,LTH=0006                                                
         MFLD  KDFAKT06,LTH=0001                                                
         MFLD  KDFRAK06,LTH=0002                                                
         MFLD  KDORDK06,LTH=0001                                                
         MFLD  VKORDB06,LTH=0007                                                
         MFLD  VLORDB06,LTH=0007                                                
         MFLD  KVORDR06,LTH=0003                                                
         MFLD  SUORDV06,LTH=0011                                                
         MFLD  ADLEVP06,LTH=0002                                                
         MFLD  IDKUND07,LTH=0005                                                
         MFLD  IDORDN07,LTH=0006                                                
         MFLD  KDFAKT07,LTH=0001                                                
         MFLD  KDFRAK07,LTH=0002                                                
         MFLD  KDORDK07,LTH=0001                                                
         MFLD  VKORDB07,LTH=0007                                                
         MFLD  VLORDB07,LTH=0007                                                
         MFLD  KVORDR07,LTH=0003                                                
         MFLD  SUORDV07,LTH=0011                                                
         MFLD  ADLEVP07,LTH=0002                                                
         MFLD  IDKUND08,LTH=0005                                                
         MFLD  IDORDN08,LTH=0006                                                
         MFLD  KDFAKT08,LTH=0001                                                
         MFLD  KDFRAK08,LTH=0002                                                
         MFLD  KDORDK08,LTH=0001                                                
         MFLD  VKORDB08,LTH=0007                                                
         MFLD  VLORDB08,LTH=0007                                                
         MFLD  KVORDR08,LTH=0003                                                
         MFLD  SUORDV08,LTH=0011                                                
         MFLD  ADLEVP08,LTH=0002                                                
         MFLD  IDKUND09,LTH=0005                                                
         MFLD  IDORDN09,LTH=0006                                                
         MFLD  KDFAKT09,LTH=0001                                                
         MFLD  KDFRAK09,LTH=0002                                                
         MFLD  KDORDK09,LTH=0001                                                
         MFLD  VKORDB09,LTH=0007                                                
         MFLD  VLORDB09,LTH=0007                                                
         MFLD  KVORDR09,LTH=0003                                                
         MFLD  SUORDV09,LTH=0011                                                
         MFLD  ADLEVP09,LTH=0002                                                
         MFLD  IDKUND10,LTH=0005                                                
         MFLD  IDORDN10,LTH=0006                                                
         MFLD  KDFAKT10,LTH=0001                                                
         MFLD  KDFRAK10,LTH=0002                                                
         MFLD  KDORDK10,LTH=0001                                                
         MFLD  VKORDB10,LTH=0007                                                
         MFLD  VLORDB10,LTH=0007                                                
         MFLD  KVORDR10,LTH=0003                                                
         MFLD  SUORDV10,LTH=0011                                                
         MFLD  ADLEVP10,LTH=0002                                                
         MFLD  IDKUND11,LTH=0005                                                
         MFLD  IDORDN11,LTH=0006                                                
         MFLD  KDFAKT11,LTH=0001                                                
         MFLD  KDFRAK11,LTH=0002                                                
         MFLD  KDORDK11,LTH=0001                                                
         MFLD  VKORDB11,LTH=0007                                                
         MFLD  VLORDB11,LTH=0007                                                
         MFLD  KVORDR11,LTH=0003                                                
         MFLD  SUORDV11,LTH=0011                                                
         MFLD  ADLEVP11,LTH=0002                                                
         MFLD  IDKUND12,LTH=0005                                                
         MFLD  IDORDN12,LTH=0006                                                
         MFLD  KDFAKT12,LTH=0001                                                
         MFLD  KDFRAK12,LTH=0002                                                
         MFLD  KDORDK12,LTH=0001                                                
         MFLD  VKORDB12,LTH=0007                                                
         MFLD  VLORDB12,LTH=0007                                                
         MFLD  KVORDR12,LTH=0003                                                
         MFLD  SUORDV12,LTH=0011                                                
         MFLD  ADLEVP12,LTH=0002                                                
         MFLD  IDKUND13,LTH=0005                                                
         MFLD  IDORDN13,LTH=0006                                                
         MFLD  KDFAKT13,LTH=0001                                                
         MFLD  KDFRAK13,LTH=0002                                                
         MFLD  KDORDK13,LTH=0001                                                
         MFLD  VKORDB13,LTH=0007                                                
         MFLD  VLORDB13,LTH=0007                                                
         MFLD  KVORDR13,LTH=0003                                                
         MFLD  SUORDV13,LTH=0011                                                
         MFLD  ADLEVP13,LTH=0002                                                
         MFLD  IDKUND14,LTH=0005                                                
         MFLD  IDORDN14,LTH=0006                                                
         MFLD  KDFAKT14,LTH=0001                                                
         MFLD  KDFRAK14,LTH=0002                                                
         MFLD  KDORDK14,LTH=0001                                                
         MFLD  VKORDB14,LTH=0007                                                
         MFLD  VLORDB14,LTH=0007                                                
         MFLD  KVORDR14,LTH=0003                                                
         MFLD  SUORDV14,LTH=0011                                                
         MFLD  ADLEVP14,LTH=0002                                                
         MFLD  IDKUND15,LTH=0005                                                
         MFLD  IDORDN15,LTH=0006                                                
         MFLD  KDFAKT15,LTH=0001                                                
         MFLD  KDFRAK15,LTH=0002                                                
         MFLD  KDORDK15,LTH=0001                                                
         MFLD  VKORDB15,LTH=0007                                                
         MFLD  VLORDB15,LTH=0007                                                
         MFLD  KVORDR15,LTH=0003                                                
         MFLD  SUORDV15,LTH=0011                                                
         MFLD  ADLEVP15,LTH=0002                                                
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W4I251N1 MSG   TYPE=INPUT,                                             *        
               SOR=W4N251,                                             *        
               OPT=2,                                                  *        
               NXT=W4O251N1                                                     
         SEG                                                                    
         MFLD  'W',LTH=0001                                                     
         MFLD  FLD0102,LTH=0001,FILL=C'4'                                       
         MFLD  'T',LTH=0001                                                     
         MFLD  FLD0104,LTH=0001,FILL=C'2'                                       
         MFLD  FLD0106,LTH=0001,FILL=C'5'                                       
         MFLD  FLD0108,LTH=0001,FILL=C'1'                                       
         MFLD  '  ',LTH=0002                                                    
         MFLD  '4251',LTH=0004                                                  
         MFLD  '2',LTH=0001                                                     
         MFLD  (IDDISTR,'++++'),LTH=0004,FILL=C'0',JUST=R                       
         MFLD  (IDKUNDNR,'++++++'),LTH=0006,FILL=C'0',JUST=R                    
         MFLD  (SUORDV,'++++++++++'),LTH=0010                                   
         MFLD  (VKORDBTO,'++++++'),LTH=0006                                     
         MFLD  (VLORDBTO,'++++++'),LTH=0006                                     
         MFLD  (IDORDF,'++++++'),LTH=006                                        
         MFLD  (KDFAKTG,'+'),LTH=001                                            
         MFLD  (KDFRAKTG,'++'),LTH=002                                          
         MFLD  (KVORDERB,'+++'),LTH=0003                                        
         MFLD  (KVORDERT,'+++'),LTH=0003                                        
         MFLD  IDORDR2,LTH=0078                                                 
         MFLD  IDORDR3,LTH=0036                                                 
         MFLD  IDORDR4,LTH=0078                                                 
         MFLD  IDORDR5,LTH=0030                                                 
         MFLD  IDORDR6,LTH=0078                                                 
         MFLD  (FLFAKT01,'+'),LTH=0001                                          
         MFLD  (IDORDN01,'++++++'),LTH=0006                                     
         MFLD  (KDFAKT01,'+'),LTH=0001                                          
         MFLD  (KDFRAK01,'++'),LTH=0002                                         
         MFLD  (SUORDV01,'+++++++++++'),LTH=0011                                
         MFLD  (VKORDB01,'+++++++'),LTH=0007                                    
         MFLD  (VLORDB01,'+++++++'),LTH=0007                                    
         MFLD  (FLFAKT02,'+'),LTH=0001                                          
         MFLD  (IDORDN02,'++++++'),LTH=0006                                     
         MFLD  (KDFAKT02,'+'),LTH=0001                                          
         MFLD  (KDFRAK02,'++'),LTH=0002                                         
         MFLD  (SUORDV02,'+++++++++++'),LTH=0011                                
         MFLD  (VKORDB02,'+++++++'),LTH=0007                                    
         MFLD  (VLORDB02,'+++++++'),LTH=0007                                    
         MFLD  (FLFAKT03,'+'),LTH=0001                                          
         MFLD  (IDORDN03,'++++++'),LTH=0006                                     
         MFLD  (KDFAKT03,'+'),LTH=0001                                          
         MFLD  (KDFRAK03,'++'),LTH=0002                                         
         MFLD  (SUORDV03,'+++++++++++'),LTH=0011                                
         MFLD  (VKORDB03,'+++++++'),LTH=0007                                    
         MFLD  (VLORDB03,'+++++++'),LTH=0007                                    
         MFLD  (FLFAKT04,'+'),LTH=0001                                          
         MFLD  (IDORDN04,'++++++'),LTH=0006                                     
         MFLD  (KDFAKT04,'+'),LTH=0001                                          
         MFLD  (KDFRAK04,'++'),LTH=0002                                         
         MFLD  (SUORDV04,'+++++++++++'),LTH=0011                                
         MFLD  (VKORDB04,'+++++++'),LTH=0007                                    
         MFLD  (VLORDB04,'+++++++'),LTH=0007                                    
         MFLD  (FLFAKT05,'+'),LTH=0001                                          
         MFLD  (IDORDN05,'++++++'),LTH=0006                                     
         MFLD  (KDFAKT05,'+'),LTH=0001                                          
         MFLD  (KDFRAK05,'++'),LTH=0002                                         
         MFLD  (SUORDV05,'+++++++++++'),LTH=0011                                
         MFLD  (VKORDB05,'+++++++'),LTH=0007                                    
         MFLD  (VLORDB05,'+++++++'),LTH=0007                                    
         MFLD  (FLFAKT06,'+'),LTH=0001                                          
         MFLD  (IDORDN06,'++++++'),LTH=0006                                     
         MFLD  (KDFAKT06,'+'),LTH=0001                                          
         MFLD  (KDFRAK06,'++'),LTH=0002                                         
         MFLD  (SUORDV06,'+++++++++++'),LTH=0011                                
         MFLD  (VKORDB06,'+++++++'),LTH=0007                                    
         MFLD  (VLORDB06,'+++++++'),LTH=0007                                    
         MFLD  (FLFAKT07,'+'),LTH=0001                                          
         MFLD  (IDORDN07,'++++++'),LTH=0006                                     
         MFLD  (KDFAKT07,'+'),LTH=0001                                          
         MFLD  (KDFRAK07,'++'),LTH=0002                                         
         MFLD  (SUORDV07,'+++++++++++'),LTH=0011                                
         MFLD  (VKORDB07,'+++++++'),LTH=0007                                    
         MFLD  (VLORDB07,'+++++++'),LTH=0007                                    
         MFLD  (FLFAKT08,'+'),LTH=0001                                          
         MFLD  (IDORDN08,'++++++'),LTH=0006                                     
         MFLD  (KDFAKT08,'+'),LTH=0001                                          
         MFLD  (KDFRAK08,'++'),LTH=0002                                         
         MFLD  (SUORDV08,'+++++++++++'),LTH=0011                                
         MFLD  (VKORDB08,'+++++++'),LTH=0007                                    
         MFLD  (VLORDB08,'+++++++'),LTH=0007                                    
         MFLD  (FLFAKT09,'+'),LTH=0001                                          
         MFLD  (IDORDN09,'++++++'),LTH=0006                                     
         MFLD  (KDFAKT09,'+'),LTH=0001                                          
         MFLD  (KDFRAK09,'++'),LTH=0002                                         
         MFLD  (SUORDV09,'+++++++++++'),LTH=0011                                
         MFLD  (VKORDB09,'+++++++'),LTH=0007                                    
         MFLD  (VLORDB09,'+++++++'),LTH=0007                                    
         MFLD  (FLFAKT10,'+'),LTH=0001                                          
         MFLD  (IDORDN10,'++++++'),LTH=0006                                     
         MFLD  (KDFAKT10,'+'),LTH=0001                                          
         MFLD  (KDFRAK10,'++'),LTH=0002                                         
         MFLD  (SUORDV10,'+++++++++++'),LTH=0011                                
         MFLD  (VKORDB10,'+++++++'),LTH=0007                                    
         MFLD  (VLORDB10,'+++++++'),LTH=0007                                    
         MFLD  (FLFAKT11,'+'),LTH=0001                                          
         MFLD  (IDORDN11,'++++++'),LTH=0006                                     
         MFLD  (KDFAKT11,'+'),LTH=0001                                          
         MFLD  (KDFRAK11,'++'),LTH=0002                                         
         MFLD  (SUORDV11,'+++++++++++'),LTH=0011                                
         MFLD  (VKORDB11,'+++++++'),LTH=0007                                    
         MFLD  (VLORDB11,'+++++++'),LTH=0007                                    
         MFLD  (FLFAKT12,'+'),LTH=0001                                          
         MFLD  (IDORDN12,'++++++'),LTH=0006                                     
         MFLD  (KDFAKT12,'+'),LTH=0001                                          
         MFLD  (KDFRAK12,'++'),LTH=0002                                         
         MFLD  (SUORDV12,'+++++++++++'),LTH=0011                                
         MFLD  (VKORDB12,'+++++++'),LTH=0007                                    
         MFLD  (VLORDB12,'+++++++'),LTH=0007                                    
         MFLD  (FLFAKT13,'+'),LTH=0001                                          
         MFLD  (IDORDN13,'++++++'),LTH=0006                                     
         MFLD  (KDFAKT13,'+'),LTH=0001                                          
         MFLD  (KDFRAK13,'++'),LTH=0002                                         
         MFLD  (SUORDV13,'+++++++++++'),LTH=0011                                
         MFLD  (VKORDB13,'+++++++'),LTH=0007                                    
         MFLD  (VLORDB13,'+++++++'),LTH=0007                                    
         MFLD  (FLFAKT14,'+'),LTH=0001                                          
         MFLD  (IDORDN14,'++++++'),LTH=0006                                     
         MFLD  (KDFAKT14,'+'),LTH=0001                                          
         MFLD  (KDFRAK14,'++'),LTH=0002                                         
         MFLD  (SUORDV14,'+++++++++++'),LTH=0011                                
         MFLD  (VKORDB14,'+++++++'),LTH=0007                                    
         MFLD  (VLORDB14,'+++++++'),LTH=0007                                    
         MFLD  (FLFAKT15,'+'),LTH=0001                                          
         MFLD  (IDORDN15,'++++++'),LTH=0006                                     
         MFLD  (KDFAKT15,'+'),LTH=0001                                          
         MFLD  (KDFRAK15,'++'),LTH=0002                                         
         MFLD  (SUORDV15,'+++++++++++'),LTH=0011                                
         MFLD  (VKORDB15,'+++++++'),LTH=0007                                    
         MFLD  (VLORDB15,'+++++++'),LTH=0007                                    
         MSGEND                                                                 
         EJECT                                                                  
         END                                                                    
