***********************************************************************         
* CREATED BY PC36146   ON 96/01/11  AT 10:55                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'PROFORMA HEAD  ADDITION 1       '                               
W4N266   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T266U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T261  ',                                          +        
               14='W4T262  ',                                          +        
               15='W4T264  ',                                          +        
               16='W4T265  ',                                          +        
               17='W4T266  ',                                          +        
               18='W4T267  ',                                          +        
               19='W4T268  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W4N266   DPAGE CURSOR=((2,8)),                                         +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'PROFORMA HEAD ADDITION 1',                             +        
               POS=(1,11),LTH=24,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Distr',                                                +        
               POS=(2,2),LTH=5,                                        +        
               ATTR=(ALPHA,PROT)                                                
DGIA0002 DFLD  POS=(2,8),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Cust',                                                 +        
               POS=(2,15),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0004 DFLD  POS=(2,20),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Order',                                                +        
               POS=(2,27),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0006 DFLD  POS=(2,33),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '*Partno',                                              +        
               POS=(2,41),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0000 DFLD  POS=(2,49),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0003 DFLD  POS=(3,8),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
DGIA0005 DFLD  POS=(3,20),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0007 DFLD  POS=(3,33),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  '*',                                                    +        
               POS=(3,41),LTH=1,                                       +        
               ATTR=(ALPHA,PROT)                                                
DGIA0001 DFLD  POS=(3,49),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
TEDDI    DFLD  POS=(4,70),LTH=11,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'N-weight',                                             +        
               POS=(5,2),LTH=8,                                        +        
               ATTR=(PROT)                                                      
NVIKT    DFLD  POS=(5,11),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Total value',                                          +        
               POS=(5,20),LTH=11,                                      +        
               ATTR=(PROT)                                                      
DGIA0008 DFLD  POS=(5,33),LTH=12,                                      +        
               ATTR=(PROT)                                                      
ASTERIX  DFLD  POS=(5,46),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Prod : Engine',                                        +        
               POS=(5,48),LTH=13,                                      +        
               ATTR=(PROT)                                                      
FLMOTOR  DFLD  POS=(5,62),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Coach',                                                +        
               POS=(5,65),LTH=5,                                       +        
               ATTR=(PROT)                                                      
FLKAROSS DFLD  POS=(5,71),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Gr kg',                                                +        
               POS=(6,2),LTH=5,                                        +        
               ATTR=(PROT)                                                      
BVIKT    DFLD  POS=(6,11),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Dang Goods',                                           +        
               POS=(6,47),LTH=10,                                      +        
               ATTR=(PROT)                                                      
KDFARLIG DFLD  POS=(6,61),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Volume',                                               +        
               POS=(7,2),LTH=6,                                        +        
               ATTR=(PROT)                                                      
VOLYM    DFLD  POS=(7,11),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Payment terms',                                        +        
               POS=(9,2),LTH=13,                                       +        
               ATTR=(PROT)                                                      
BETVIL   DFLD  POS=(9,20),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
BETTEXT  DFLD  POS=(9,25),LTH=30,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Delivery terms',                                       +        
               POS=(10,2),LTH=14,                                      +        
               ATTR=(PROT)                                                      
LEVVIL   DFLD  POS=(10,22),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
LEVTEXT  DFLD  POS=(10,24),LTH=35,                                     +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Offer validity',                                       +        
               POS=(11,2),LTH=14,                                      +        
               ATTR=(PROT)                                                      
GILTIG   DFLD  POS=(11,17),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Day of payment',                                       +        
               POS=(12,2),LTH=14,                                      +        
               ATTR=(PROT)                                                      
FORFDAT  DFLD  POS=(12,17),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Confirm prel. prices Y/N:',                            +        
               POS=(15,2),LTH=25,                                      +        
               ATTR=(PROT)                                                      
PRELPRIS DFLD  POS=(15,30),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Printer/',                                             +        
               POS=(17,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Printer/',                                             +        
               POS=(17,28),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'New',                                                  +        
               POS=(17,50),LTH=3,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Proforma document',                                    +        
               POS=(18,2),LTH=17,                                      +        
               ATTR=(PROT)                                                      
PUTSKR   DFLD  POS=(18,21),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  ' ',                                                    +        
               POS=(18,25),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
         DFLD  'Order release',                                        +        
               POS=(18,28),LTH=13,                                     +        
               ATTR=(PROT)                                                      
ORELEASE DFLD  POS=(18,43),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  ' ',                                                    +        
               POS=(18,47),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
         DFLD  'custno',                                               +        
               POS=(18,50),LTH=6,                                      +        
               ATTR=(PROT)                                                      
NYTTKUND DFLD  POS=(18,58),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(18,65),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
         DFLD  '13 New head    14 New line',                           +        
               POS=(21,2),LTH=26,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '15 Adm/del head  16 Adm/del line  17 Addition 1',      +        
               POS=(21,33),LTH=47,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '18 Addition 2  19 Addition 3   20',                    +        
               POS=(22,2),LTH=33,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,67),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4O266N2 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N266,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I266N1,                                           +        
               FILL=PT                                                          
MOD2     LPAGE SOR=W4N266                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  FSYSMSG,                                                +        
               LTH=79                                                           
         MSGEND                                                                 
W4I266N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N266),                                           +        
               OPT=2,                                                  +        
               NXT=W4O266N1                                                     
MID      LPAGE SOR=(W4N266)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  ' ',                                                    +        
               LTH=2                                                            
         MFLD  '42662',                                                +        
               LTH=5                                                            
         MFLD  (DGIA0002,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0004,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0006,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0000,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0003,                                               +        
               LTH=4                                                            
         MFLD  DGIA0005,                                               +        
               LTH=6                                                            
         MFLD  DGIA0007,                                               +        
               LTH=7                                                            
         MFLD  DGIA0001,                                               +        
               LTH=9                                                            
         MFLD  (BVIKT,                                                 +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (VOLYM,                                                 +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (LEVVIL,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (GILTIG,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FORFDAT,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PRELPRIS,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (PUTSKR,                                                +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (ORELEASE,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (NYTTKUND,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
W4O266N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N266,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I266N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W4N266                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  DGIA0002,                                               +        
               LTH=4                                                            
         MFLD  DGIA0004,                                               +        
               LTH=6                                                            
         MFLD  DGIA0006,                                               +        
               LTH=7                                                            
         MFLD  DGIA0000,                                               +        
               LTH=9                                                            
         MFLD  DGIA0003,                                               +        
               LTH=4                                                            
         MFLD  DGIA0005,                                               +        
               LTH=6                                                            
         MFLD  DGIA0007,                                               +        
               LTH=7                                                            
         MFLD  DGIA0001,                                               +        
               LTH=9                                                            
         MFLD  TEDDI,                                                  +        
               LTH=11                                                           
         MFLD  NVIKT,                                                  +        
               LTH=8                                                            
         MFLD  DGIA0008,                                               +        
               LTH=12                                                           
         MFLD  ASTERIX,                                                +        
               LTH=1                                                            
         MFLD  FLMOTOR,                                                +        
               LTH=1                                                            
         MFLD  FLKAROSS,                                               +        
               LTH=1                                                            
         MFLD  BVIKT,                                                  +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDFARLIG,                                               +        
               LTH=1                                                            
         MFLD  VOLYM,                                                  +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  BETVIL,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BETTEXT,                                                +        
               LTH=30                                                           
         MFLD  LEVVIL,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEVTEXT,                                                +        
               LTH=35                                                           
         MFLD  GILTIG,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FORFDAT,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRELPRIS,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PUTSKR,                                                 +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ORELEASE,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  NYTTKUND,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  FSYSMSG,                                                +        
               LTH=79                                                           
         MSGEND                                                                 
         END                                                                    
