***********************************************************************         
* CREATED BY PC36147   ON 98/08/26  AT 13:46                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'REGISTRERING ORDERRADER         '                               
W4N222   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='W0T501  ',                                          +        
               11='W4T222  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='W0T501  ',                                          +        
               23='W4T222U  ',                                         +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((6,2)),                                         +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NUM,PROT)                                                  
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,PROT)                                                  
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,PROT)                                                  
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'ORDER LINE REGISTRATION',                              +        
               POS=(1,12),LTH=23,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'ENTER AND NO INPUT WILL DELETE THE ORDER',             +        
               POS=(2,40),LTH=40,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Distr',                                                +        
               POS=(3,2),LTH=5,                                        +        
               ATTR=(ALPHA,PROT)                                                
IDDISTR  DFLD  POS=(3,8),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Cust',                                                 +        
               POS=(3,14),LTH=4,                                       +        
               ATTR=(PROT)                                                      
IDKUNDNR DFLD  POS=(3,19),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Order',                                                +        
               POS=(3,26),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
IDORDNR  DFLD  POS=(3,32),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Cl',                                                   +        
               POS=(3,40),LTH=2,                                       +        
               ATTR=(PROT)                                                      
KDORDKL  DFLD  POS=(3,43),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'FC',                                                   +        
               POS=(3,45),LTH=2,                                       +        
               ATTR=(ALPHA,PROT)                                                
KDFRAKT  DFLD  POS=(3,48),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
FLVORKO  DFLD  POS=(3,55),LTH=1,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
FLFORBI  DFLD  POS=(3,57),LTH=1,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KDTRTYP  DFLD  POS=(3,59),LTH=1,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
TEDDI    DFLD  POS=(4,70),LTH=11,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Partno',                                               +        
               POS=(5,2),LTH=6,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'Qty    Reference  Uprice',                             +        
               POS=(5,14),LTH=24,                                      +        
               ATTR=(PROT)                                                      
KDVALISO DFLD  POS=(5,39),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'E VR',                                                 +        
               POS=(5,43),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0014 DFLD  POS=(6,2),LTH=11,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0000 DFLD  POS=(6,14),LTH=6,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
R1       DFLD  POS=(6,21),LTH=10,                                      +        
               ATTR=(NOPROT,MOD)                                                
DGIA0042 DFLD  POS=(6,32),LTH=10,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0028 DFLD  POS=(6,43),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
DGIA0063 DFLD  POS=(6,46),LTH=1,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  ' ',                                                    +        
               POS=(6,48),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
DGIA0020 DFLD  POS=(7,2),LTH=11,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0006 DFLD  POS=(7,14),LTH=6,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
R2       DFLD  POS=(7,21),LTH=10,                                      +        
               ATTR=(NOPROT,MOD)                                                
DGIA0048 DFLD  POS=(7,32),LTH=10,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0034 DFLD  POS=(7,43),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
DGIA0064 DFLD  POS=(7,46),LTH=1,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  ' ',                                                    +        
               POS=(7,48),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
DGIA0021 DFLD  POS=(8,2),LTH=11,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0007 DFLD  POS=(8,14),LTH=6,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
R3       DFLD  POS=(8,21),LTH=10,                                      +        
               ATTR=(NOPROT,MOD)                                                
DGIA0049 DFLD  POS=(8,32),LTH=10,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0035 DFLD  POS=(8,43),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
DGIA0056 DFLD  POS=(8,46),LTH=1,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  ' ',                                                    +        
               POS=(8,48),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
DGIA0022 DFLD  POS=(9,2),LTH=11,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0008 DFLD  POS=(9,14),LTH=6,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
R4       DFLD  POS=(9,21),LTH=10,                                      +        
               ATTR=(NOPROT,MOD)                                                
DGIA0050 DFLD  POS=(9,32),LTH=10,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0036 DFLD  POS=(9,43),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
DGIA0057 DFLD  POS=(9,46),LTH=1,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  ' ',                                                    +        
               POS=(9,48),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
DGIA0023 DFLD  POS=(10,2),LTH=11,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0009 DFLD  POS=(10,14),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
R5       DFLD  POS=(10,21),LTH=10,                                     +        
               ATTR=(NOPROT,MOD)                                                
DGIA0051 DFLD  POS=(10,32),LTH=10,                                     +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0037 DFLD  POS=(10,43),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
DGIA0058 DFLD  POS=(10,46),LTH=1,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  ' ',                                                    +        
               POS=(10,48),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
DGIA0024 DFLD  POS=(11,2),LTH=11,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0010 DFLD  POS=(11,14),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
R6       DFLD  POS=(11,21),LTH=10,                                     +        
               ATTR=(NOPROT,MOD)                                                
DGIA0052 DFLD  POS=(11,32),LTH=10,                                     +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0038 DFLD  POS=(11,43),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
DGIA0059 DFLD  POS=(11,46),LTH=1,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  ' ',                                                    +        
               POS=(11,48),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
DGIA0025 DFLD  POS=(12,2),LTH=11,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0011 DFLD  POS=(12,14),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
R7       DFLD  POS=(12,21),LTH=10,                                     +        
               ATTR=(NOPROT,MOD)                                                
DGIA0053 DFLD  POS=(12,32),LTH=10,                                     +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0039 DFLD  POS=(12,43),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
DGIA0060 DFLD  POS=(12,46),LTH=1,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  ' ',                                                    +        
               POS=(12,48),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
DGIA0026 DFLD  POS=(13,2),LTH=11,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0012 DFLD  POS=(13,14),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
R8       DFLD  POS=(13,21),LTH=10,                                     +        
               ATTR=(NOPROT,MOD)                                                
DGIA0054 DFLD  POS=(13,32),LTH=10,                                     +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0040 DFLD  POS=(13,43),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
DGIA0061 DFLD  POS=(13,46),LTH=1,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  ' ',                                                    +        
               POS=(13,48),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
DGIA0027 DFLD  POS=(14,2),LTH=11,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0013 DFLD  POS=(14,14),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
R9       DFLD  POS=(14,21),LTH=10,                                     +        
               ATTR=(NOPROT,MOD)                                                
DGIA0055 DFLD  POS=(14,32),LTH=10,                                     +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0041 DFLD  POS=(14,43),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
DGIA0062 DFLD  POS=(14,46),LTH=1,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  ' ',                                                    +        
               POS=(14,48),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
DGIA0015 DFLD  POS=(15,2),LTH=11,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0001 DFLD  POS=(15,14),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
R10      DFLD  POS=(15,21),LTH=10,                                     +        
               ATTR=(NOPROT,MOD)                                                
DGIA0043 DFLD  POS=(15,32),LTH=10,                                     +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0029 DFLD  POS=(15,43),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
VR10     DFLD  POS=(15,46),LTH=1,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  ' ',                                                    +        
               POS=(15,48),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
DGIA0016 DFLD  POS=(16,2),LTH=11,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0002 DFLD  POS=(16,14),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
R11      DFLD  POS=(16,21),LTH=10,                                     +        
               ATTR=(NOPROT,MOD)                                                
DGIA0044 DFLD  POS=(16,32),LTH=10,                                     +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0030 DFLD  POS=(16,43),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
VR11     DFLD  POS=(16,46),LTH=1,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  ' ',                                                    +        
               POS=(16,48),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
DGIA0017 DFLD  POS=(17,2),LTH=11,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0003 DFLD  POS=(17,14),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
R12      DFLD  POS=(17,21),LTH=10,                                     +        
               ATTR=(NOPROT,MOD)                                                
DGIA0045 DFLD  POS=(17,32),LTH=10,                                     +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0031 DFLD  POS=(17,43),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
VR12     DFLD  POS=(17,46),LTH=1,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  ' ',                                                    +        
               POS=(17,48),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
DGIA0018 DFLD  POS=(18,2),LTH=11,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0004 DFLD  POS=(18,14),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
R13      DFLD  POS=(18,21),LTH=10,                                     +        
               ATTR=(NOPROT,MOD)                                                
DGIA0046 DFLD  POS=(18,32),LTH=10,                                     +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0032 DFLD  POS=(18,43),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
VR13     DFLD  POS=(18,46),LTH=1,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  ' ',                                                    +        
               POS=(18,48),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
DGIA0019 DFLD  POS=(19,2),LTH=11,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0005 DFLD  POS=(19,14),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
R14      DFLD  POS=(19,21),LTH=10,                                     +        
               ATTR=(NOPROT,MOD)                                                
DGIA0047 DFLD  POS=(19,32),LTH=10,                                     +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0033 DFLD  POS=(19,43),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
VR14     DFLD  POS=(19,46),LTH=1,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  ' ',                                                    +        
               POS=(19,48),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
STOP     DFLD  POS=(20,2),LTH=1,                                       +        
               ATTR=(NUM,NOPROT,HI)                                             
         DFLD  ' ',                                                    +        
               POS=(20,4),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
         DFLD  '13',                                                   +        
               POS=(21,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '14',                                                   +        
               POS=(21,17),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '15',                                                   +        
               POS=(21,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16',                                                   +        
               POS=(21,49),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,17),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,49),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10',                                                   +        
               POS=(22,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4I222N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N222),                                           +        
               OPT=2,                                                  +        
               NXT=W4O222N1                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  (IDTRANS1,                                              +        
               '4'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  (IDTRANS2,                                              +        
               '2'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  (IDTRANS3,                                              +        
               '2'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  (IDTRANS4,                                              +        
               '2'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '42222',                                                +        
               LTH=5                                                            
         MFLD  IDDISTR,                                                +        
               LTH=4                                                            
         MFLD  IDKUNDNR,                                               +        
               LTH=6                                                            
         MFLD  IDORDNR,                                                +        
               LTH=5                                                            
         MFLD  KDORDKL,                                                +        
               LTH=1                                                            
         MFLD  KDFRAKT,                                                +        
               LTH=2                                                            
         MFLD  FLVORKO,                                                +        
               LTH=1                                                            
         MFLD  FLFORBI,                                                +        
               LTH=1                                                            
         MFLD  KDTRTYP,                                                +        
               LTH=1                                                            
         MFLD  (DGIA0014,                                              +        
               '+++++++++++'),                                         +        
               LTH=11,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0000,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (R1,                                                    +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0042,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0028,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0063,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0020,                                              +        
               '+++++++++++'),                                         +        
               LTH=11,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0006,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (R2,                                                    +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0048,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0034,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0064,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0021,                                              +        
               '+++++++++++'),                                         +        
               LTH=11,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0007,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (R3,                                                    +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0049,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0035,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0056,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0022,                                              +        
               '+++++++++++'),                                         +        
               LTH=11,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0008,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (R4,                                                    +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0050,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0036,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0057,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0023,                                              +        
               '+++++++++++'),                                         +        
               LTH=11,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0009,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (R5,                                                    +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0051,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0037,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0058,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0024,                                              +        
               '+++++++++++'),                                         +        
               LTH=11,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0010,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (R6,                                                    +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0052,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0038,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0059,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0025,                                              +        
               '+++++++++++'),                                         +        
               LTH=11,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0011,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (R7,                                                    +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0053,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0039,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0060,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0026,                                              +        
               '+++++++++++'),                                         +        
               LTH=11,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0012,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (R8,                                                    +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0054,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0040,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0061,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0027,                                              +        
               '+++++++++++'),                                         +        
               LTH=11,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0013,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (R9,                                                    +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0055,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0041,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0062,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0015,                                              +        
               '+++++++++++'),                                         +        
               LTH=11,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0001,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (R10,                                                   +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0043,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0029,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (VR10,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0016,                                              +        
               '+++++++++++'),                                         +        
               LTH=11,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0002,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (R11,                                                   +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0044,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0030,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (VR11,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0017,                                              +        
               '+++++++++++'),                                         +        
               LTH=11,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0003,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (R12,                                                   +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0045,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0031,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (VR12,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0018,                                              +        
               '+++++++++++'),                                         +        
               LTH=11,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0004,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (R13,                                                   +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0046,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0032,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (VR13,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0019,                                              +        
               '+++++++++++'),                                         +        
               LTH=11,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0005,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (R14,                                                   +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0047,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0033,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (VR14,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
W4O222N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N222,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I222N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDDISTR,                                                +        
               LTH=4                                                            
         MFLD  IDKUNDNR,                                               +        
               LTH=6                                                            
         MFLD  IDORDNR,                                                +        
               LTH=5                                                            
         MFLD  KDORDKL,                                                +        
               LTH=1                                                            
         MFLD  KDFRAKT,                                                +        
               LTH=2                                                            
         MFLD  FLVORKO,                                                +        
               LTH=1                                                            
         MFLD  FLFORBI,                                                +        
               LTH=1                                                            
         MFLD  KDTRTYP,                                                +        
               LTH=1                                                            
         MFLD  TEDDI,                                                  +        
               LTH=11                                                           
         MFLD  KDVALISO,                                               +        
               LTH=3                                                            
         MFLD  DGIA0014,                                               +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0000,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  R1,                                                     +        
               LTH=10                                                           
         MFLD  DGIA0042,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0028,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0063,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0020,                                               +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0006,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  R2,                                                     +        
               LTH=10                                                           
         MFLD  DGIA0048,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0034,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0064,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0021,                                               +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0007,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  R3,                                                     +        
               LTH=10                                                           
         MFLD  DGIA0049,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0035,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0056,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0022,                                               +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0008,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  R4,                                                     +        
               LTH=10                                                           
         MFLD  DGIA0050,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0036,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0057,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0023,                                               +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0009,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  R5,                                                     +        
               LTH=10                                                           
         MFLD  DGIA0051,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0037,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0058,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0024,                                               +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0010,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  R6,                                                     +        
               LTH=10                                                           
         MFLD  DGIA0052,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0038,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0059,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0025,                                               +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0011,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  R7,                                                     +        
               LTH=10                                                           
         MFLD  DGIA0053,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0039,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0060,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0026,                                               +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0012,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  R8,                                                     +        
               LTH=10                                                           
         MFLD  DGIA0054,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0040,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0061,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0027,                                               +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0013,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  R9,                                                     +        
               LTH=10                                                           
         MFLD  DGIA0055,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0041,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0062,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0015,                                               +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0001,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  R10,                                                    +        
               LTH=10                                                           
         MFLD  DGIA0043,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0029,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VR10,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0016,                                               +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0002,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  R11,                                                    +        
               LTH=10                                                           
         MFLD  DGIA0044,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0030,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VR11,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0017,                                               +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0003,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  R12,                                                    +        
               LTH=10                                                           
         MFLD  DGIA0045,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0031,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VR12,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0018,                                               +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0004,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  R13,                                                    +        
               LTH=10                                                           
         MFLD  DGIA0046,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0032,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VR13,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0019,                                               +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0005,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  R14,                                                    +        
               LTH=10                                                           
         MFLD  DGIA0047,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0033,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VR14,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  STOP,                                                   +        
               LTH=1                                                            
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
