***********************************************************************         
* CREATED BY PC36147   ON 98/09/03  AT 15:46                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'REGISTRATION ORDER LINES        '                               
W4N232   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='W0T501  ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='W0T501  ',                                          +        
               23='W4T232U  ',                                         +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W4N232   DPAGE CURSOR=((6,2)),                                         +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NUM,PROT)                                                  
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,PROT)                                                  
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,PROT)                                                  
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'SPEC.ORDER LINE REGISTRATION',                         +        
               POS=(1,12),LTH=28,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'ENTER AND NO INPUT WILL DELETE THE ORDER',             +        
               POS=(2,40),LTH=40,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Distr',                                                +        
               POS=(2,2),LTH=5,                                        +        
               ATTR=(ALPHA,PROT)                                                
IDDISTR  DFLD  POS=(3,8),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Cust',                                                 +        
               POS=(3,14),LTH=4,                                       +        
               ATTR=(PROT)                                                      
IDKUNDNR DFLD  POS=(3,19),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Order',                                                +        
               POS=(3,26),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
IDORDNR  DFLD  POS=(3,32),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Cl',                                                   +        
               POS=(3,40),LTH=2,                                       +        
               ATTR=(PROT)                                                      
KDORDKL  DFLD  POS=(3,43),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'FC',                                                   +        
               POS=(3,45),LTH=2,                                       +        
               ATTR=(ALPHA,PROT)                                                
KDFRAKT  DFLD  POS=(3,48),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
TEDDI    DFLD  POS=(4,70),LTH=11,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'PartNo',                                               +        
               POS=(5,2),LTH=6,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'Qty    Reference  Uprice',                             +        
               POS=(5,14),LTH=24,                                      +        
               ATTR=(PROT)                                                      
KDVALISO DFLD  POS=(5,39),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'E',                                                    +        
               POS=(5,44),LTH=1,                                       +        
               ATTR=(PROT)                                                      
ARTNR1   DFLD  POS=(6,2),LTH=11,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
KVB1     DFLD  POS=(6,14),LTH=6,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
R1       DFLD  POS=(6,21),LTH=10,                                      +        
               ATTR=(NOPROT,MOD)                                                
PRIS1    DFLD  POS=(6,32),LTH=10,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
B1       DFLD  POS=(6,44),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
ARTNR2   DFLD  POS=(7,2),LTH=11,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
KVB2     DFLD  POS=(7,14),LTH=6,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
R2       DFLD  POS=(7,21),LTH=10,                                      +        
               ATTR=(NOPROT,MOD)                                                
PRIS2    DFLD  POS=(7,32),LTH=10,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
B2       DFLD  POS=(7,44),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
ARTNR3   DFLD  POS=(8,2),LTH=11,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
KVB3     DFLD  POS=(8,14),LTH=6,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
R3       DFLD  POS=(8,21),LTH=10,                                      +        
               ATTR=(NOPROT,MOD)                                                
PRIS3    DFLD  POS=(8,32),LTH=10,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
B3       DFLD  POS=(8,44),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
ARTNR4   DFLD  POS=(9,2),LTH=11,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
KVB4     DFLD  POS=(9,14),LTH=6,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
R4       DFLD  POS=(9,21),LTH=10,                                      +        
               ATTR=(NOPROT,MOD)                                                
PRIS4    DFLD  POS=(9,32),LTH=10,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
B4       DFLD  POS=(9,44),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
ARTNR5   DFLD  POS=(10,2),LTH=11,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
KVB5     DFLD  POS=(10,14),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
R5       DFLD  POS=(10,21),LTH=10,                                     +        
               ATTR=(NOPROT,MOD)                                                
PRIS5    DFLD  POS=(10,32),LTH=10,                                     +        
               ATTR=(NUM,NOPROT,MOD)                                            
B5       DFLD  POS=(10,44),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
ARTNR6   DFLD  POS=(11,2),LTH=11,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
KVB6     DFLD  POS=(11,14),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
R6       DFLD  POS=(11,21),LTH=10,                                     +        
               ATTR=(NOPROT,MOD)                                                
PRIS6    DFLD  POS=(11,32),LTH=10,                                     +        
               ATTR=(NUM,NOPROT,MOD)                                            
B6       DFLD  POS=(11,44),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
ARTNR7   DFLD  POS=(12,2),LTH=11,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
KVB7     DFLD  POS=(12,14),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
R7       DFLD  POS=(12,21),LTH=10,                                     +        
               ATTR=(NOPROT,MOD)                                                
PRIS7    DFLD  POS=(12,32),LTH=10,                                     +        
               ATTR=(NUM,NOPROT,MOD)                                            
B7       DFLD  POS=(12,44),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
ARTNR8   DFLD  POS=(13,2),LTH=11,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
KVB8     DFLD  POS=(13,14),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
R8       DFLD  POS=(13,21),LTH=10,                                     +        
               ATTR=(NOPROT,MOD)                                                
PRIS8    DFLD  POS=(13,32),LTH=10,                                     +        
               ATTR=(NUM,NOPROT,MOD)                                            
B8       DFLD  POS=(13,44),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
ARTNR9   DFLD  POS=(14,2),LTH=11,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
KVB9     DFLD  POS=(14,14),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
R9       DFLD  POS=(14,21),LTH=10,                                     +        
               ATTR=(NOPROT,MOD)                                                
PRIS9    DFLD  POS=(14,32),LTH=10,                                     +        
               ATTR=(NUM,NOPROT,MOD)                                            
B9       DFLD  POS=(14,44),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
ARTNR10  DFLD  POS=(15,2),LTH=11,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
KVB10    DFLD  POS=(15,14),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
R10      DFLD  POS=(15,21),LTH=10,                                     +        
               ATTR=(NOPROT,MOD)                                                
PRIS10   DFLD  POS=(15,32),LTH=10,                                     +        
               ATTR=(NUM,NOPROT,MOD)                                            
B10      DFLD  POS=(15,44),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
ARTNR11  DFLD  POS=(16,2),LTH=11,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
KVB11    DFLD  POS=(16,14),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
R11      DFLD  POS=(16,21),LTH=10,                                     +        
               ATTR=(NOPROT,MOD)                                                
PRIS11   DFLD  POS=(16,32),LTH=10,                                     +        
               ATTR=(NUM,NOPROT,MOD)                                            
B11      DFLD  POS=(16,44),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
ARTNR12  DFLD  POS=(17,2),LTH=11,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
KVB12    DFLD  POS=(17,14),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
R12      DFLD  POS=(17,21),LTH=10,                                     +        
               ATTR=(NOPROT,MOD)                                                
PRIS12   DFLD  POS=(17,32),LTH=10,                                     +        
               ATTR=(NUM,NOPROT,MOD)                                            
B12      DFLD  POS=(17,44),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
ARTNR13  DFLD  POS=(18,2),LTH=11,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
KVB13    DFLD  POS=(18,14),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
R13      DFLD  POS=(18,21),LTH=10,                                     +        
               ATTR=(NOPROT,MOD)                                                
PRIS13   DFLD  POS=(18,32),LTH=10,                                     +        
               ATTR=(NUM,NOPROT,MOD)                                            
B13      DFLD  POS=(18,44),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
ARTNR14  DFLD  POS=(19,2),LTH=11,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
KVB14    DFLD  POS=(19,14),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
R14      DFLD  POS=(19,21),LTH=10,                                     +        
               ATTR=(NOPROT,MOD)                                                
PRIS14   DFLD  POS=(19,32),LTH=10,                                     +        
               ATTR=(NUM,NOPROT,MOD)                                            
B14      DFLD  POS=(19,44),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
STOP     DFLD  POS=(20,2),LTH=1,                                       +        
               ATTR=(NUM,NOPROT,HI,MOD)                                         
         DFLD  ' ',                                                    +        
               POS=(20,4),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
         DFLD  '13',                                                   +        
               POS=(21,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '14',                                                   +        
               POS=(21,17),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '15',                                                   +        
               POS=(21,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16',                                                   +        
               POS=(21,49),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,17),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,49),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10',                                                   +        
               POS=(22,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
TEMSINF  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4I232N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N232),                                           +        
               OPT=2,                                                  +        
               NXT=W4O232N1                                                     
MID      LPAGE SOR=(W4N232)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '42322',                                                +        
               LTH=5                                                            
         MFLD  IDDISTR,                                                +        
               LTH=4                                                            
         MFLD  IDKUNDNR,                                               +        
               LTH=6                                                            
         MFLD  IDORDNR,                                                +        
               LTH=5                                                            
         MFLD  KDORDKL,                                                +        
               LTH=1                                                            
         MFLD  KDFRAKT,                                                +        
               LTH=2                                                            
         MFLD  (ARTNR1,                                                +        
               '+++++++++++'),                                         +        
               LTH=11,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVB1,                                                  +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (R1,                                                    +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (PRIS1,                                                 +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (B1,                                                    +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR2,                                                +        
               '+++++++++++'),                                         +        
               LTH=11,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVB2,                                                  +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (R2,                                                    +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (PRIS2,                                                 +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (B2,                                                    +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR3,                                                +        
               '+++++++++++'),                                         +        
               LTH=11,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVB3,                                                  +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (R3,                                                    +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (PRIS3,                                                 +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (B3,                                                    +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR4,                                                +        
               '+++++++++++'),                                         +        
               LTH=11,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVB4,                                                  +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (R4,                                                    +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (PRIS4,                                                 +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (B4,                                                    +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR5,                                                +        
               '+++++++++++'),                                         +        
               LTH=11,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVB5,                                                  +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (R5,                                                    +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (PRIS5,                                                 +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (B5,                                                    +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR6,                                                +        
               '+++++++++++'),                                         +        
               LTH=11,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVB6,                                                  +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (R6,                                                    +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (PRIS6,                                                 +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (B6,                                                    +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR7,                                                +        
               '+++++++++++'),                                         +        
               LTH=11,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVB7,                                                  +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (R7,                                                    +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (PRIS7,                                                 +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (B7,                                                    +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR8,                                                +        
               '+++++++++++'),                                         +        
               LTH=11,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVB8,                                                  +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (R8,                                                    +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (PRIS8,                                                 +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (B8,                                                    +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR9,                                                +        
               '+++++++++++'),                                         +        
               LTH=11,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVB9,                                                  +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (R9,                                                    +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (PRIS9,                                                 +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (B9,                                                    +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR10,                                               +        
               '+++++++++++'),                                         +        
               LTH=11,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVB10,                                                 +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (R10,                                                   +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (PRIS10,                                                +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (B10,                                                   +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR11,                                               +        
               '+++++++++++'),                                         +        
               LTH=11,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVB11,                                                 +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (R11,                                                   +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (PRIS11,                                                +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (B11,                                                   +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR12,                                               +        
               '+++++++++++'),                                         +        
               LTH=11,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVB12,                                                 +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (R12,                                                   +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (PRIS12,                                                +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (B12,                                                   +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR13,                                               +        
               '+++++++++++'),                                         +        
               LTH=11,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVB13,                                                 +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (R13,                                                   +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (PRIS13,                                                +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (B13,                                                   +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR14,                                               +        
               '+++++++++++'),                                         +        
               LTH=11,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVB14,                                                 +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (R14,                                                   +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (PRIS14,                                                +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (B14,                                                   +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
W4O232N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N232,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I232N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W4N232                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDDISTR,                                                +        
               LTH=4                                                            
         MFLD  IDKUNDNR,                                               +        
               LTH=6                                                            
         MFLD  IDORDNR,                                                +        
               LTH=5                                                            
         MFLD  KDORDKL,                                                +        
               LTH=1                                                            
         MFLD  KDFRAKT,                                                +        
               LTH=2                                                            
         MFLD  TEDDI,                                                  +        
               LTH=11                                                           
         MFLD  KDVALISO,                                               +        
               LTH=3                                                            
         MFLD  ARTNR1,                                                 +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVB1,                                                   +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  R1,                                                     +        
               LTH=10                                                           
         MFLD  PRIS1,                                                  +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  B1,                                                     +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ARTNR2,                                                 +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVB2,                                                   +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  R2,                                                     +        
               LTH=10                                                           
         MFLD  PRIS2,                                                  +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  B2,                                                     +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ARTNR3,                                                 +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVB3,                                                   +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  R3,                                                     +        
               LTH=10                                                           
         MFLD  PRIS3,                                                  +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  B3,                                                     +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ARTNR4,                                                 +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVB4,                                                   +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  R4,                                                     +        
               LTH=10                                                           
         MFLD  PRIS4,                                                  +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  B4,                                                     +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ARTNR5,                                                 +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVB5,                                                   +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  R5,                                                     +        
               LTH=10                                                           
         MFLD  PRIS5,                                                  +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  B5,                                                     +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ARTNR6,                                                 +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVB6,                                                   +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  R6,                                                     +        
               LTH=10                                                           
         MFLD  PRIS6,                                                  +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  B6,                                                     +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ARTNR7,                                                 +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVB7,                                                   +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  R7,                                                     +        
               LTH=10                                                           
         MFLD  PRIS7,                                                  +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  B7,                                                     +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ARTNR8,                                                 +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVB8,                                                   +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  R8,                                                     +        
               LTH=10                                                           
         MFLD  PRIS8,                                                  +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  B8,                                                     +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ARTNR9,                                                 +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVB9,                                                   +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  R9,                                                     +        
               LTH=10                                                           
         MFLD  PRIS9,                                                  +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  B9,                                                     +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ARTNR10,                                                +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVB10,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  R10,                                                    +        
               LTH=10                                                           
         MFLD  PRIS10,                                                 +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  B10,                                                    +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ARTNR11,                                                +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVB11,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  R11,                                                    +        
               LTH=10                                                           
         MFLD  PRIS11,                                                 +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  B11,                                                    +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ARTNR12,                                                +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVB12,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  R12,                                                    +        
               LTH=10                                                           
         MFLD  PRIS12,                                                 +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  B12,                                                    +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ARTNR13,                                                +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVB13,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  R13,                                                    +        
               LTH=10                                                           
         MFLD  PRIS13,                                                 +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  B13,                                                    +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ARTNR14,                                                +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVB14,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  R14,                                                    +        
               LTH=10                                                           
         MFLD  PRIS14,                                                 +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  B14,                                                    +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  STOP,                                                   +        
               LTH=1                                                            
         MFLD  TEMSINF,                                                +        
               LTH=61                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
