***********************************************************************         
* CREATED BY PCC4448   ON 95/02/02  AT 09:41                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'FRÅGA ORDERBEKRÄFTELSE DISTRIKT '                               
W4N281   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W4T281 4',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W4T281 7',                                           +        
               8='W4T281 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T281  ',                                          +        
               14='W4T282  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W4N281   DPAGE CURSOR=((2,8)),                                         +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Order conf/distr. print',                              +        
               POS=(1,12),LTH=23,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Distr',                                                +        
               POS=(2,2),LTH=5,                                        +        
               ATTR=(ALPHA,PROT)                                                
IDDISTRI DFLD  POS=(2,8),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Cust',                                                 +        
               POS=(2,13),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
IDKUNDNI DFLD  POS=(2,18),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Date',                                                 +        
               POS=(2,25),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
DATUMIN  DFLD  POS=(2,30),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DC',                                                   +        
               POS=(2,37),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
IDDCI    DFLD  POS=(2,40),LTH=2,                                       +        
               ATTR=(ALPHA,NOPROT)                                              
         DFLD  'FC',                                                   +        
               POS=(2,43),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
KDFRAKTI DFLD  POS=(2,46),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Cl',                                                   +        
               POS=(2,49),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
KDORDKLI DFLD  POS=(2,52),LTH=1,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '* Order',                                              +        
               POS=(2,54),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
IDORDNRI DFLD  POS=(2,62),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
IDDISTRU DFLD  POS=(3,8),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
IDKUNDNU DFLD  POS=(3,18),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
DATUMUT  DFLD  POS=(3,30),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
IDDCU    DFLD  POS=(3,40),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
FRAKTU   DFLD  POS=(3,46),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
ORDKLUT  DFLD  POS=(3,52),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  '*',                                                    +        
               POS=(3,54),LTH=1,                                       +        
               ATTR=(ALPHA,PROT)                                                
IDORDNRU DFLD  POS=(3,62),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
IDDISTRA DFLD  POS=(4,2),LTH=4,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
IDKUNDA  DFLD  POS=(4,7),LTH=6,                                        +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
IDKUNDRA DFLD  POS=(4,14),LTH=7,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
IDORDEA  DFLD  POS=(4,23),LTH=7,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
IDARTNA  DFLD  POS=(4,31),LTH=9,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
IDLOPNA  DFLD  POS=(4,41),LTH=3,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
IDSEKVA  DFLD  POS=(4,45),LTH=3,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KDORDBA  DFLD  POS=(4,51),LTH=2,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0000 DFLD  POS=(4,54),LTH=9,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0001 DFLD  POS=(4,64),LTH=9,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
         DFLD  'Printer No:',                                          +        
               POS=(5,2),LTH=11,                                       +        
               ATTR=(PROT)                                                      
KDPRT    DFLD  POS=(5,14),LTH=3,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  ' ',                                                    +        
               POS=(5,18),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
DGIA0002 DFLD  POS=(5,22),LTH=2,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0003 DFLD  POS=(5,25),LTH=2,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
         DFLD  'Proforma',                                             +        
               POS=(5,58),LTH=8,                                       +        
               ATTR=(PROT)                                                      
PROFORMA DFLD  POS=(5,67),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
PROFUT   DFLD  POS=(5,69),LTH=1,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
         DFLD  'CMD Cust   Order   Cust ref',                          +        
               POS=(6,2),LTH=27,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'DC Fc Cl    Date',                                     +        
               POS=(6,37),LTH=16,                                      +        
               ATTR=(PROT)                                                      
KDCMD1   DFLD  POS=(7,3),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDKUNDN1 DFLD  POS=(7,6),LTH=6,                                        +        
               ATTR=(PROT,MOD)                                                  
IDKUNDU1 DFLD  POS=(7,13),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
BEKUNDR1 DFLD  POS=(7,21),LTH=15,                                      +        
               ATTR=(NUM,PROT)                                                  
KDCLAGE1 DFLD  POS=(7,37),LTH=2,                                       +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDFRAKT1 DFLD  POS=(7,40),LTH=2,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KDORDKL1 DFLD  POS=(7,43),LTH=1,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
TIREGTI1 DFLD  POS=(7,47),LTH=6,                                       +        
               ATTR=(PROT)                                                      
IDORDER1 DFLD  POS=(7,61),LTH=7,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
IDARTNR1 DFLD  POS=(7,69),LTH=9,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KDORDBE1 DFLD  POS=(7,79),LTH=2,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KDCMD2   DFLD  POS=(8,3),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDKUNDN2 DFLD  POS=(8,6),LTH=6,                                        +        
               ATTR=(PROT,MOD)                                                  
IDKUNDU2 DFLD  POS=(8,13),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
BEKUNDR2 DFLD  POS=(8,21),LTH=15,                                      +        
               ATTR=(NUM,PROT)                                                  
KDCLAGE2 DFLD  POS=(8,37),LTH=2,                                       +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDFRAKT2 DFLD  POS=(8,40),LTH=2,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KDORDKL2 DFLD  POS=(8,43),LTH=1,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
TIREGTI2 DFLD  POS=(8,47),LTH=6,                                       +        
               ATTR=(PROT)                                                      
IDORDER2 DFLD  POS=(8,61),LTH=7,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
IDARTNR2 DFLD  POS=(8,69),LTH=9,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KDORDBE2 DFLD  POS=(8,79),LTH=2,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KDCMD3   DFLD  POS=(9,3),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDKUNDN3 DFLD  POS=(9,6),LTH=6,                                        +        
               ATTR=(PROT,MOD)                                                  
IDKUNDU3 DFLD  POS=(9,13),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
BEKUNDR3 DFLD  POS=(9,21),LTH=15,                                      +        
               ATTR=(NUM,PROT)                                                  
KDCLAGE3 DFLD  POS=(9,37),LTH=2,                                       +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDFRAKT3 DFLD  POS=(9,40),LTH=2,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KDORDKL3 DFLD  POS=(9,43),LTH=1,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
TIREGTI3 DFLD  POS=(9,47),LTH=6,                                       +        
               ATTR=(PROT)                                                      
IDORDER3 DFLD  POS=(9,61),LTH=7,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
IDARTNR3 DFLD  POS=(9,69),LTH=9,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KDORDBE3 DFLD  POS=(9,79),LTH=2,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KDCMD4   DFLD  POS=(10,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDKUNDN4 DFLD  POS=(10,6),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
IDKUNDU4 DFLD  POS=(10,13),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
BEKUNDR4 DFLD  POS=(10,21),LTH=15,                                     +        
               ATTR=(NUM,PROT)                                                  
KDCLAGE4 DFLD  POS=(10,37),LTH=2,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDFRAKT4 DFLD  POS=(10,40),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KDORDKL4 DFLD  POS=(10,43),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
TIREGTI4 DFLD  POS=(10,47),LTH=6,                                      +        
               ATTR=(PROT)                                                      
IDORDER4 DFLD  POS=(10,61),LTH=7,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
IDARTNR4 DFLD  POS=(10,69),LTH=9,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KDORDBE4 DFLD  POS=(10,79),LTH=2,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KDCMD5   DFLD  POS=(11,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDKUNDN5 DFLD  POS=(11,6),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
IDKUNDU5 DFLD  POS=(11,13),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
BEKUNDR5 DFLD  POS=(11,21),LTH=15,                                     +        
               ATTR=(NUM,PROT)                                                  
KDCLAGE5 DFLD  POS=(11,37),LTH=2,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDFRAKT5 DFLD  POS=(11,40),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KDORDKL5 DFLD  POS=(11,43),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
TIREGTI5 DFLD  POS=(11,47),LTH=6,                                      +        
               ATTR=(PROT)                                                      
IDORDER5 DFLD  POS=(11,61),LTH=7,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
IDARTNR5 DFLD  POS=(11,69),LTH=9,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KDORDBE5 DFLD  POS=(11,79),LTH=2,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KDCMD6   DFLD  POS=(12,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDKUNDN6 DFLD  POS=(12,6),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
IDKUNDU6 DFLD  POS=(12,13),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
BEKUNDR6 DFLD  POS=(12,21),LTH=15,                                     +        
               ATTR=(NUM,PROT)                                                  
KDCLAGE6 DFLD  POS=(12,37),LTH=2,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDFRAKT6 DFLD  POS=(12,40),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KDORDKL6 DFLD  POS=(12,43),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
TIREGTI6 DFLD  POS=(12,47),LTH=6,                                      +        
               ATTR=(PROT)                                                      
IDORDER6 DFLD  POS=(12,61),LTH=7,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
IDARTNR6 DFLD  POS=(12,69),LTH=9,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KDORDBE6 DFLD  POS=(12,79),LTH=2,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KDCMD7   DFLD  POS=(13,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDKUNDN7 DFLD  POS=(13,6),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
IDKUNDU7 DFLD  POS=(13,13),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
BEKUNDR7 DFLD  POS=(13,21),LTH=15,                                     +        
               ATTR=(NUM,PROT)                                                  
KDCLAGE7 DFLD  POS=(13,37),LTH=2,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDFRAKT7 DFLD  POS=(13,40),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KDORDKL7 DFLD  POS=(13,43),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
TIREGTI7 DFLD  POS=(13,47),LTH=6,                                      +        
               ATTR=(PROT)                                                      
IDORDER7 DFLD  POS=(13,61),LTH=7,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
IDARTNR7 DFLD  POS=(13,69),LTH=9,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KDORDBE7 DFLD  POS=(13,79),LTH=2,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KDCMD8   DFLD  POS=(14,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDKUNDN8 DFLD  POS=(14,6),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
IDKUNDU8 DFLD  POS=(14,13),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
BEKUNDR8 DFLD  POS=(14,21),LTH=15,                                     +        
               ATTR=(NUM,PROT)                                                  
KDCLAGE8 DFLD  POS=(14,37),LTH=2,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDFRAKT8 DFLD  POS=(14,40),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KDORDKL8 DFLD  POS=(14,43),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
TIREGTI8 DFLD  POS=(14,47),LTH=6,                                      +        
               ATTR=(PROT)                                                      
IDORDER8 DFLD  POS=(14,61),LTH=7,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
IDARTNR8 DFLD  POS=(14,69),LTH=9,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KDORDBE8 DFLD  POS=(14,79),LTH=2,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KDCMD9   DFLD  POS=(15,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDKUNDN9 DFLD  POS=(15,6),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
IDKUNDU9 DFLD  POS=(15,13),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
BEKUNDR9 DFLD  POS=(15,21),LTH=15,                                     +        
               ATTR=(NUM,PROT)                                                  
KDCLAGE9 DFLD  POS=(15,37),LTH=2,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDFRAKT9 DFLD  POS=(15,40),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KDORDKL9 DFLD  POS=(15,43),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
TIREGTI9 DFLD  POS=(15,47),LTH=6,                                      +        
               ATTR=(PROT)                                                      
IDORDER9 DFLD  POS=(15,61),LTH=7,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
IDARTNR9 DFLD  POS=(15,69),LTH=9,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KDORDBE9 DFLD  POS=(15,79),LTH=2,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KDCMDW   DFLD  POS=(16,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDKUNDNW DFLD  POS=(16,6),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
IDKUNDUW DFLD  POS=(16,13),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
BEKUNDRW DFLD  POS=(16,21),LTH=15,                                     +        
               ATTR=(NUM,PROT)                                                  
KDCLAGEW DFLD  POS=(16,37),LTH=2,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDFRAKTW DFLD  POS=(16,40),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KDORDKLW DFLD  POS=(16,43),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
TIREGTIW DFLD  POS=(16,47),LTH=6,                                      +        
               ATTR=(PROT)                                                      
IDORDERW DFLD  POS=(16,61),LTH=7,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
IDARTNRW DFLD  POS=(16,69),LTH=9,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KDORDBEW DFLD  POS=(16,79),LTH=2,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KDCMDX   DFLD  POS=(17,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDKUNDNX DFLD  POS=(17,6),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
IDKUNDUX DFLD  POS=(17,13),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
BEKUNDRX DFLD  POS=(17,21),LTH=15,                                     +        
               ATTR=(NUM,PROT)                                                  
KDCLAGEX DFLD  POS=(17,37),LTH=2,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDFRAKTX DFLD  POS=(17,40),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KDORDKLX DFLD  POS=(17,43),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
TIREGTIX DFLD  POS=(17,47),LTH=6,                                      +        
               ATTR=(PROT)                                                      
IDORDERX DFLD  POS=(17,61),LTH=7,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
IDARTNRX DFLD  POS=(17,69),LTH=9,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KDORDBEX DFLD  POS=(17,79),LTH=2,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KDCMDY   DFLD  POS=(18,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDKUNDNY DFLD  POS=(18,6),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
IDKUNDUY DFLD  POS=(18,13),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
BEKUNDRY DFLD  POS=(18,21),LTH=15,                                     +        
               ATTR=(NUM,PROT)                                                  
KDCLAGEY DFLD  POS=(18,37),LTH=2,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDFRAKTY DFLD  POS=(18,40),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KDORDKLY DFLD  POS=(18,43),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
TIREGTIY DFLD  POS=(18,47),LTH=6,                                      +        
               ATTR=(PROT)                                                      
IDORDERY DFLD  POS=(18,61),LTH=7,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
IDARTNRY DFLD  POS=(18,69),LTH=9,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KDORDBEY DFLD  POS=(18,79),LTH=2,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KDCMDZ   DFLD  POS=(19,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDKUNDNZ DFLD  POS=(19,6),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
IDKUNDUZ DFLD  POS=(19,13),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
BEKUNDRZ DFLD  POS=(19,21),LTH=15,                                     +        
               ATTR=(NUM,PROT)                                                  
KDCLAGEZ DFLD  POS=(19,37),LTH=2,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDFRAKTZ DFLD  POS=(19,40),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KDORDKLZ DFLD  POS=(19,43),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
TIREGTIZ DFLD  POS=(19,47),LTH=6,                                      +        
               ATTR=(PROT)                                                      
IDORDERZ DFLD  POS=(19,61),LTH=7,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
IDARTNRZ DFLD  POS=(19,69),LTH=9,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KDORDBEZ DFLD  POS=(19,79),LTH=2,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
IDDISTN  DFLD  POS=(20,2),LTH=4,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
IDKUNDN  DFLD  POS=(20,7),LTH=6,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
IDKUNDRN DFLD  POS=(20,14),LTH=7,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
IDORDEN  DFLD  POS=(20,23),LTH=7,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
IDARTNRN DFLD  POS=(20,31),LTH=9,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
IDLOPNRN DFLD  POS=(20,41),LTH=3,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
IDSEKVN  DFLD  POS=(20,45),LTH=3,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KDORDBN  DFLD  POS=(20,51),LTH=2,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  '13 Ordcon.distr 14 Ordcon.order 15',                   +        
               POS=(21,2),LTH=34,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16',                                                   +        
               POS=(21,51),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,68),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,51),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,68),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4I281N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N281),                                           +        
               OPT=2,                                                  +        
               NXT=W4O281N1                                                     
MID      LPAGE SOR=(W4N281)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  (IDTRANS1,                                              +        
               '4'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  (IDTRANS2,                                              +        
               '2'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  (IDTRANS3,                                              +        
               '8'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F8'                                                       
         MFLD  (IDTRANS4,                                              +        
               '1'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '42812',                                                +        
               LTH=5                                                            
         MFLD  (IDDISTRI,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDDISTRU,                                               +        
               LTH=4                                                            
         MFLD  (IDKUNDNI,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDKUNDNU,                                               +        
               LTH=6                                                            
         MFLD  (IDORDNRI,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDORDNRU,                                               +        
               LTH=7                                                            
         MFLD  (IDDCI,                                                 +        
               '+'),                                                   +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  IDDCU,                                                  +        
               LTH=2                                                            
         MFLD  DGIA0000,                                               +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0001,                                               +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0002,                                               +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0003,                                               +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DATUMIN,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DATUMUT,                                                +        
               LTH=6                                                            
         MFLD  (KDFRAKTI,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FRAKTU,                                                 +        
               LTH=2                                                            
         MFLD  (KDORDKLI,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  ORDKLUT,                                                +        
               LTH=1                                                            
         MFLD  IDDISTRA,                                               +        
               LTH=4                                                            
         MFLD  IDKUNDA,                                                +        
               LTH=6                                                            
         MFLD  IDKUNDRA,                                               +        
               LTH=7                                                            
         MFLD  IDORDEA,                                                +        
               LTH=7                                                            
         MFLD  IDARTNA,                                                +        
               LTH=9                                                            
         MFLD  IDLOPNA,                                                +        
               LTH=3                                                            
         MFLD  IDSEKVA,                                                +        
               LTH=3                                                            
         MFLD  KDORDBA,                                                +        
               LTH=2                                                            
         MFLD  (KDPRT,                                                 +        
               '+++'),                                                 +        
               LTH=3                                                            
         MFLD  (PROFORMA,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  PROFUT,                                                 +        
               LTH=1                                                            
         MFLD  (KDCMD1,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  IDKUNDN1,                                               +        
               LTH=6                                                            
         MFLD  IDKUNDU1,                                               +        
               LTH=7                                                            
         MFLD  KDCLAGE1,                                               +        
               LTH=2                                                            
         MFLD  KDFRAKT1,                                               +        
               LTH=2                                                            
         MFLD  KDORDKL1,                                               +        
               LTH=1                                                            
         MFLD  IDORDER1,                                               +        
               LTH=7                                                            
         MFLD  IDARTNR1,                                               +        
               LTH=9                                                            
         MFLD  KDORDBE1,                                               +        
               LTH=2                                                            
         MFLD  (KDCMD2,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  IDKUNDN2,                                               +        
               LTH=6                                                            
         MFLD  IDKUNDU2,                                               +        
               LTH=7                                                            
         MFLD  KDCLAGE2,                                               +        
               LTH=2                                                            
         MFLD  KDFRAKT2,                                               +        
               LTH=2                                                            
         MFLD  KDORDKL2,                                               +        
               LTH=1                                                            
         MFLD  IDORDER2,                                               +        
               LTH=7                                                            
         MFLD  IDARTNR2,                                               +        
               LTH=9                                                            
         MFLD  KDORDBE2,                                               +        
               LTH=2                                                            
         MFLD  (KDCMD3,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  IDKUNDN3,                                               +        
               LTH=6                                                            
         MFLD  IDKUNDU3,                                               +        
               LTH=7                                                            
         MFLD  KDCLAGE3,                                               +        
               LTH=2                                                            
         MFLD  KDFRAKT3,                                               +        
               LTH=2                                                            
         MFLD  KDORDKL3,                                               +        
               LTH=1                                                            
         MFLD  IDORDER3,                                               +        
               LTH=7                                                            
         MFLD  IDARTNR3,                                               +        
               LTH=9                                                            
         MFLD  KDORDBE3,                                               +        
               LTH=2                                                            
         MFLD  (KDCMD4,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  IDKUNDN4,                                               +        
               LTH=6                                                            
         MFLD  IDKUNDU4,                                               +        
               LTH=7                                                            
         MFLD  KDCLAGE4,                                               +        
               LTH=2                                                            
         MFLD  KDFRAKT4,                                               +        
               LTH=2                                                            
         MFLD  KDORDKL4,                                               +        
               LTH=1                                                            
         MFLD  IDORDER4,                                               +        
               LTH=7                                                            
         MFLD  IDARTNR4,                                               +        
               LTH=9                                                            
         MFLD  KDORDBE4,                                               +        
               LTH=2                                                            
         MFLD  (KDCMD5,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  IDKUNDN5,                                               +        
               LTH=6                                                            
         MFLD  IDKUNDU5,                                               +        
               LTH=7                                                            
         MFLD  KDCLAGE5,                                               +        
               LTH=2                                                            
         MFLD  KDFRAKT5,                                               +        
               LTH=2                                                            
         MFLD  KDORDKL5,                                               +        
               LTH=1                                                            
         MFLD  IDORDER5,                                               +        
               LTH=7                                                            
         MFLD  IDARTNR5,                                               +        
               LTH=9                                                            
         MFLD  KDORDBE5,                                               +        
               LTH=2                                                            
         MFLD  (KDCMD6,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  IDKUNDN6,                                               +        
               LTH=6                                                            
         MFLD  IDKUNDU6,                                               +        
               LTH=7                                                            
         MFLD  KDCLAGE6,                                               +        
               LTH=2                                                            
         MFLD  KDFRAKT6,                                               +        
               LTH=2                                                            
         MFLD  KDORDKL6,                                               +        
               LTH=1                                                            
         MFLD  IDORDER6,                                               +        
               LTH=7                                                            
         MFLD  IDARTNR6,                                               +        
               LTH=9                                                            
         MFLD  KDORDBE6,                                               +        
               LTH=2                                                            
         MFLD  (KDCMD7,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  IDKUNDN7,                                               +        
               LTH=6                                                            
         MFLD  IDKUNDU7,                                               +        
               LTH=7                                                            
         MFLD  KDCLAGE7,                                               +        
               LTH=2                                                            
         MFLD  KDFRAKT7,                                               +        
               LTH=2                                                            
         MFLD  KDORDKL7,                                               +        
               LTH=1                                                            
         MFLD  IDORDER7,                                               +        
               LTH=7                                                            
         MFLD  IDARTNR7,                                               +        
               LTH=9                                                            
         MFLD  KDORDBE7,                                               +        
               LTH=2                                                            
         MFLD  (KDCMD8,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  IDKUNDN8,                                               +        
               LTH=6                                                            
         MFLD  IDKUNDU8,                                               +        
               LTH=7                                                            
         MFLD  KDCLAGE8,                                               +        
               LTH=2                                                            
         MFLD  KDFRAKT8,                                               +        
               LTH=2                                                            
         MFLD  KDORDKL8,                                               +        
               LTH=1                                                            
         MFLD  IDORDER8,                                               +        
               LTH=7                                                            
         MFLD  IDARTNR8,                                               +        
               LTH=9                                                            
         MFLD  KDORDBE8,                                               +        
               LTH=2                                                            
         MFLD  (KDCMD9,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  IDKUNDN9,                                               +        
               LTH=6                                                            
         MFLD  IDKUNDU9,                                               +        
               LTH=7                                                            
         MFLD  KDCLAGE9,                                               +        
               LTH=2                                                            
         MFLD  KDFRAKT9,                                               +        
               LTH=2                                                            
         MFLD  KDORDKL9,                                               +        
               LTH=1                                                            
         MFLD  IDORDER9,                                               +        
               LTH=7                                                            
         MFLD  IDARTNR9,                                               +        
               LTH=9                                                            
         MFLD  KDORDBE9,                                               +        
               LTH=2                                                            
         MFLD  (KDCMDW,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  IDKUNDNW,                                               +        
               LTH=6                                                            
         MFLD  IDKUNDUW,                                               +        
               LTH=7                                                            
         MFLD  KDCLAGEW,                                               +        
               LTH=2                                                            
         MFLD  KDFRAKTW,                                               +        
               LTH=2                                                            
         MFLD  KDORDKLW,                                               +        
               LTH=1                                                            
         MFLD  IDORDERW,                                               +        
               LTH=7                                                            
         MFLD  IDARTNRW,                                               +        
               LTH=9                                                            
         MFLD  KDORDBEW,                                               +        
               LTH=2                                                            
         MFLD  (KDCMDX,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  IDKUNDNX,                                               +        
               LTH=6                                                            
         MFLD  IDKUNDUX,                                               +        
               LTH=7                                                            
         MFLD  KDCLAGEX,                                               +        
               LTH=2                                                            
         MFLD  KDFRAKTX,                                               +        
               LTH=2                                                            
         MFLD  KDORDKLX,                                               +        
               LTH=1                                                            
         MFLD  IDORDERX,                                               +        
               LTH=7                                                            
         MFLD  IDARTNRX,                                               +        
               LTH=9                                                            
         MFLD  KDORDBEX,                                               +        
               LTH=2                                                            
         MFLD  (KDCMDY,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  IDKUNDNY,                                               +        
               LTH=6                                                            
         MFLD  IDKUNDUY,                                               +        
               LTH=7                                                            
         MFLD  KDCLAGEY,                                               +        
               LTH=2                                                            
         MFLD  KDFRAKTY,                                               +        
               LTH=2                                                            
         MFLD  KDORDKLY,                                               +        
               LTH=1                                                            
         MFLD  IDORDERY,                                               +        
               LTH=7                                                            
         MFLD  IDARTNRY,                                               +        
               LTH=9                                                            
         MFLD  KDORDBEY,                                               +        
               LTH=2                                                            
         MFLD  (KDCMDZ,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  IDKUNDNZ,                                               +        
               LTH=6                                                            
         MFLD  IDKUNDUZ,                                               +        
               LTH=7                                                            
         MFLD  KDCLAGEZ,                                               +        
               LTH=2                                                            
         MFLD  KDFRAKTZ,                                               +        
               LTH=2                                                            
         MFLD  KDORDKLZ,                                               +        
               LTH=1                                                            
         MFLD  IDORDERZ,                                               +        
               LTH=7                                                            
         MFLD  IDARTNRZ,                                               +        
               LTH=9                                                            
         MFLD  KDORDBEZ,                                               +        
               LTH=2                                                            
         MFLD  IDDISTN,                                                +        
               LTH=4                                                            
         MFLD  IDKUNDN,                                                +        
               LTH=6                                                            
         MFLD  IDKUNDRN,                                               +        
               LTH=7                                                            
         MFLD  IDORDEN,                                                +        
               LTH=7                                                            
         MFLD  IDARTNRN,                                               +        
               LTH=9                                                            
         MFLD  IDLOPNRN,                                               +        
               LTH=3                                                            
         MFLD  IDSEKVN,                                                +        
               LTH=3                                                            
         MFLD  KDORDBN,                                                +        
               LTH=2                                                            
         MSGEND                                                                 
W4O281N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N281,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I281N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W4N281                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDDISTRI,                                               +        
               LTH=4                                                            
         MFLD  IDDISTRU,                                               +        
               LTH=4                                                            
         MFLD  IDKUNDNI,                                               +        
               LTH=6                                                            
         MFLD  IDKUNDNU,                                               +        
               LTH=6                                                            
         MFLD  DATUMIN,                                                +        
               LTH=6                                                            
         MFLD  DATUMUT,                                                +        
               LTH=6                                                            
         MFLD  IDDCI,                                                  +        
               LTH=2                                                            
         MFLD  IDDCU,                                                  +        
               LTH=2                                                            
         MFLD  KDFRAKTI,                                               +        
               LTH=2                                                            
         MFLD  FRAKTU,                                                 +        
               LTH=2                                                            
         MFLD  KDORDKLI,                                               +        
               LTH=1                                                            
         MFLD  ORDKLUT,                                                +        
               LTH=1                                                            
         MFLD  IDORDNRI,                                               +        
               LTH=7                                                            
         MFLD  IDORDNRU,                                               +        
               LTH=7                                                            
         MFLD  IDDISTRA,                                               +        
               LTH=4                                                            
         MFLD  IDKUNDA,                                                +        
               LTH=6                                                            
         MFLD  IDKUNDRA,                                               +        
               LTH=7                                                            
         MFLD  IDORDEA,                                                +        
               LTH=7                                                            
         MFLD  IDARTNA,                                                +        
               LTH=9                                                            
         MFLD  IDLOPNA,                                                +        
               LTH=3                                                            
         MFLD  IDSEKVA,                                                +        
               LTH=3                                                            
         MFLD  KDORDBA,                                                +        
               LTH=2                                                            
         MFLD  DGIA0000,                                               +        
               LTH=9                                                            
         MFLD  DGIA0001,                                               +        
               LTH=9                                                            
         MFLD  KDPRT,                                                  +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0002,                                               +        
               LTH=2                                                            
         MFLD  DGIA0003,                                               +        
               LTH=2                                                            
         MFLD  PROFORMA,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PROFUT,                                                 +        
               LTH=1                                                            
         MFLD  KDCMD1,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDKUNDN1,                                               +        
               LTH=6                                                            
         MFLD  IDKUNDU1,                                               +        
               LTH=7                                                            
         MFLD  BEKUNDR1,                                               +        
               LTH=15                                                           
         MFLD  KDCLAGE1,                                               +        
               LTH=2                                                            
         MFLD  KDFRAKT1,                                               +        
               LTH=2                                                            
         MFLD  KDORDKL1,                                               +        
               LTH=1                                                            
         MFLD  TIREGTI1,                                               +        
               LTH=6                                                            
         MFLD  IDORDER1,                                               +        
               LTH=7                                                            
         MFLD  IDARTNR1,                                               +        
               LTH=9                                                            
         MFLD  KDORDBE1,                                               +        
               LTH=2                                                            
         MFLD  KDCMD2,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDKUNDN2,                                               +        
               LTH=6                                                            
         MFLD  IDKUNDU2,                                               +        
               LTH=7                                                            
         MFLD  BEKUNDR2,                                               +        
               LTH=15                                                           
         MFLD  KDCLAGE2,                                               +        
               LTH=2                                                            
         MFLD  KDFRAKT2,                                               +        
               LTH=2                                                            
         MFLD  KDORDKL2,                                               +        
               LTH=1                                                            
         MFLD  TIREGTI2,                                               +        
               LTH=6                                                            
         MFLD  IDORDER2,                                               +        
               LTH=7                                                            
         MFLD  IDARTNR2,                                               +        
               LTH=9                                                            
         MFLD  KDORDBE2,                                               +        
               LTH=2                                                            
         MFLD  KDCMD3,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDKUNDN3,                                               +        
               LTH=6                                                            
         MFLD  IDKUNDU3,                                               +        
               LTH=7                                                            
         MFLD  BEKUNDR3,                                               +        
               LTH=15                                                           
         MFLD  KDCLAGE3,                                               +        
               LTH=2                                                            
         MFLD  KDFRAKT3,                                               +        
               LTH=2                                                            
         MFLD  KDORDKL3,                                               +        
               LTH=1                                                            
         MFLD  TIREGTI3,                                               +        
               LTH=6                                                            
         MFLD  IDORDER3,                                               +        
               LTH=7                                                            
         MFLD  IDARTNR3,                                               +        
               LTH=9                                                            
         MFLD  KDORDBE3,                                               +        
               LTH=2                                                            
         MFLD  KDCMD4,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDKUNDN4,                                               +        
               LTH=6                                                            
         MFLD  IDKUNDU4,                                               +        
               LTH=7                                                            
         MFLD  BEKUNDR4,                                               +        
               LTH=15                                                           
         MFLD  KDCLAGE4,                                               +        
               LTH=2                                                            
         MFLD  KDFRAKT4,                                               +        
               LTH=2                                                            
         MFLD  KDORDKL4,                                               +        
               LTH=1                                                            
         MFLD  TIREGTI4,                                               +        
               LTH=6                                                            
         MFLD  IDORDER4,                                               +        
               LTH=7                                                            
         MFLD  IDARTNR4,                                               +        
               LTH=9                                                            
         MFLD  KDORDBE4,                                               +        
               LTH=2                                                            
         MFLD  KDCMD5,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDKUNDN5,                                               +        
               LTH=6                                                            
         MFLD  IDKUNDU5,                                               +        
               LTH=7                                                            
         MFLD  BEKUNDR5,                                               +        
               LTH=15                                                           
         MFLD  KDCLAGE5,                                               +        
               LTH=2                                                            
         MFLD  KDFRAKT5,                                               +        
               LTH=2                                                            
         MFLD  KDORDKL5,                                               +        
               LTH=1                                                            
         MFLD  TIREGTI5,                                               +        
               LTH=6                                                            
         MFLD  IDORDER5,                                               +        
               LTH=7                                                            
         MFLD  IDARTNR5,                                               +        
               LTH=9                                                            
         MFLD  KDORDBE5,                                               +        
               LTH=2                                                            
         MFLD  KDCMD6,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDKUNDN6,                                               +        
               LTH=6                                                            
         MFLD  IDKUNDU6,                                               +        
               LTH=7                                                            
         MFLD  BEKUNDR6,                                               +        
               LTH=15                                                           
         MFLD  KDCLAGE6,                                               +        
               LTH=2                                                            
         MFLD  KDFRAKT6,                                               +        
               LTH=2                                                            
         MFLD  KDORDKL6,                                               +        
               LTH=1                                                            
         MFLD  TIREGTI6,                                               +        
               LTH=6                                                            
         MFLD  IDORDER6,                                               +        
               LTH=7                                                            
         MFLD  IDARTNR6,                                               +        
               LTH=9                                                            
         MFLD  KDORDBE6,                                               +        
               LTH=2                                                            
         MFLD  KDCMD7,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDKUNDN7,                                               +        
               LTH=6                                                            
         MFLD  IDKUNDU7,                                               +        
               LTH=7                                                            
         MFLD  BEKUNDR7,                                               +        
               LTH=15                                                           
         MFLD  KDCLAGE7,                                               +        
               LTH=2                                                            
         MFLD  KDFRAKT7,                                               +        
               LTH=2                                                            
         MFLD  KDORDKL7,                                               +        
               LTH=1                                                            
         MFLD  TIREGTI7,                                               +        
               LTH=6                                                            
         MFLD  IDORDER7,                                               +        
               LTH=7                                                            
         MFLD  IDARTNR7,                                               +        
               LTH=9                                                            
         MFLD  KDORDBE7,                                               +        
               LTH=2                                                            
         MFLD  KDCMD8,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDKUNDN8,                                               +        
               LTH=6                                                            
         MFLD  IDKUNDU8,                                               +        
               LTH=7                                                            
         MFLD  BEKUNDR8,                                               +        
               LTH=15                                                           
         MFLD  KDCLAGE8,                                               +        
               LTH=2                                                            
         MFLD  KDFRAKT8,                                               +        
               LTH=2                                                            
         MFLD  KDORDKL8,                                               +        
               LTH=1                                                            
         MFLD  TIREGTI8,                                               +        
               LTH=6                                                            
         MFLD  IDORDER8,                                               +        
               LTH=7                                                            
         MFLD  IDARTNR8,                                               +        
               LTH=9                                                            
         MFLD  KDORDBE8,                                               +        
               LTH=2                                                            
         MFLD  KDCMD9,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDKUNDN9,                                               +        
               LTH=6                                                            
         MFLD  IDKUNDU9,                                               +        
               LTH=7                                                            
         MFLD  BEKUNDR9,                                               +        
               LTH=15                                                           
         MFLD  KDCLAGE9,                                               +        
               LTH=2                                                            
         MFLD  KDFRAKT9,                                               +        
               LTH=2                                                            
         MFLD  KDORDKL9,                                               +        
               LTH=1                                                            
         MFLD  TIREGTI9,                                               +        
               LTH=6                                                            
         MFLD  IDORDER9,                                               +        
               LTH=7                                                            
         MFLD  IDARTNR9,                                               +        
               LTH=9                                                            
         MFLD  KDORDBE9,                                               +        
               LTH=2                                                            
         MFLD  KDCMDW,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDKUNDNW,                                               +        
               LTH=6                                                            
         MFLD  IDKUNDUW,                                               +        
               LTH=7                                                            
         MFLD  BEKUNDRW,                                               +        
               LTH=15                                                           
         MFLD  KDCLAGEW,                                               +        
               LTH=2                                                            
         MFLD  KDFRAKTW,                                               +        
               LTH=2                                                            
         MFLD  KDORDKLW,                                               +        
               LTH=1                                                            
         MFLD  TIREGTIW,                                               +        
               LTH=6                                                            
         MFLD  IDORDERW,                                               +        
               LTH=7                                                            
         MFLD  IDARTNRW,                                               +        
               LTH=9                                                            
         MFLD  KDORDBEW,                                               +        
               LTH=2                                                            
         MFLD  KDCMDX,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDKUNDNX,                                               +        
               LTH=6                                                            
         MFLD  IDKUNDUX,                                               +        
               LTH=7                                                            
         MFLD  BEKUNDRX,                                               +        
               LTH=15                                                           
         MFLD  KDCLAGEX,                                               +        
               LTH=2                                                            
         MFLD  KDFRAKTX,                                               +        
               LTH=2                                                            
         MFLD  KDORDKLX,                                               +        
               LTH=1                                                            
         MFLD  TIREGTIX,                                               +        
               LTH=6                                                            
         MFLD  IDORDERX,                                               +        
               LTH=7                                                            
         MFLD  IDARTNRX,                                               +        
               LTH=9                                                            
         MFLD  KDORDBEX,                                               +        
               LTH=2                                                            
         MFLD  KDCMDY,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDKUNDNY,                                               +        
               LTH=6                                                            
         MFLD  IDKUNDUY,                                               +        
               LTH=7                                                            
         MFLD  BEKUNDRY,                                               +        
               LTH=15                                                           
         MFLD  KDCLAGEY,                                               +        
               LTH=2                                                            
         MFLD  KDFRAKTY,                                               +        
               LTH=2                                                            
         MFLD  KDORDKLY,                                               +        
               LTH=1                                                            
         MFLD  TIREGTIY,                                               +        
               LTH=6                                                            
         MFLD  IDORDERY,                                               +        
               LTH=7                                                            
         MFLD  IDARTNRY,                                               +        
               LTH=9                                                            
         MFLD  KDORDBEY,                                               +        
               LTH=2                                                            
         MFLD  KDCMDZ,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDKUNDNZ,                                               +        
               LTH=6                                                            
         MFLD  IDKUNDUZ,                                               +        
               LTH=7                                                            
         MFLD  BEKUNDRZ,                                               +        
               LTH=15                                                           
         MFLD  KDCLAGEZ,                                               +        
               LTH=2                                                            
         MFLD  KDFRAKTZ,                                               +        
               LTH=2                                                            
         MFLD  KDORDKLZ,                                               +        
               LTH=1                                                            
         MFLD  TIREGTIZ,                                               +        
               LTH=6                                                            
         MFLD  IDORDERZ,                                               +        
               LTH=7                                                            
         MFLD  IDARTNRZ,                                               +        
               LTH=9                                                            
         MFLD  KDORDBEZ,                                               +        
               LTH=2                                                            
         MFLD  IDDISTN,                                                +        
               LTH=4                                                            
         MFLD  IDKUNDN,                                                +        
               LTH=6                                                            
         MFLD  IDKUNDRN,                                               +        
               LTH=7                                                            
         MFLD  IDORDEN,                                                +        
               LTH=7                                                            
         MFLD  IDARTNRN,                                               +        
               LTH=9                                                            
         MFLD  IDLOPNRN,                                               +        
               LTH=3                                                            
         MFLD  IDSEKVN,                                                +        
               LTH=3                                                            
         MFLD  KDORDBN,                                                +        
               LTH=2                                                            
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
