***********************************************************************         
* CREATED BY PC36147   ON 98/08/27  AT 12:52                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'PROFORMA HEAD AMENDMENT/DELETE  '                               
W4N264   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T264U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T261  ',                                          +        
               14='W4T262  ',                                          +        
               15='W4T264  ',                                          +        
               16='W4T265  ',                                          +        
               17='W4T266  ',                                          +        
               18='W4T267  ',                                          +        
               19='W4T268  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W4N264   DPAGE CURSOR=((2,8)),                                         +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'PROFORMA HEAD AMENDMENT/DEL. ',                        +        
               POS=(1,11),LTH=29,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Distr',                                                +        
               POS=(2,2),LTH=5,                                        +        
               ATTR=(NUM,PROT)                                                  
IDDISTR  DFLD  POS=(2,8),LTH=4,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Cust',                                                 +        
               POS=(2,14),LTH=4,                                       +        
               ATTR=(PROT)                                                      
IDKUNDNR DFLD  POS=(2,19),LTH=6,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Order',                                                +        
               POS=(2,26),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
IDORDNR  DFLD  POS=(2,32),LTH=7,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  '*Part No',                                             +        
               POS=(2,41),LTH=8,                                       +        
               ATTR=(PROT)                                                      
ARTNR    DFLD  POS=(2,51),LTH=9,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLANNULL DFLD  POS=(2,64),LTH=1,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
DISTRUT  DFLD  POS=(3,8),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
KUNDUT   DFLD  POS=(3,19),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
ORDERUT  DFLD  POS=(3,32),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0000 DFLD  POS=(4,11),LTH=60,                                      +        
               ATTR=(PROT)                                                      
TEDDI    DFLD  POS=(4,72),LTH=9,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Custref',                                              +        
               POS=(5,16),LTH=7,                                       +        
               ATTR=(PROT)                                                      
KUNDRF   DFLD  POS=(5,24),LTH=15,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Co.',                                                  +        
               POS=(5,43),LTH=3,                                       +        
               ATTR=(PROT)                                                      
FTG      DFLD  POS=(5,57),LTH=2,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Cl',                                                   +        
               POS=(5,61),LTH=2,                                       +        
               ATTR=(PROT)                                                      
KDORDKL  DFLD  POS=(5,64),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'FC',                                                   +        
               POS=(5,67),LTH=2,                                       +        
               ATTR=(PROT)                                                      
KDFRAKT  DFLD  POS=(5,70),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Type',                                                 +        
               POS=(5,73),LTH=4,                                       +        
               ATTR=(PROT)                                                      
TYP      DFLD  POS=(5,78),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Disc. ',                                               +        
               POS=(6,2),LTH=6,                                        +        
               ATTR=(PROT)                                                      
OMRTAL   DFLD  POS=(6,9),LTH=5,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Int.ref',                                              +        
               POS=(6,16),LTH=7,                                       +        
               ATTR=(PROT)                                                      
INTREF   DFLD  POS=(6,24),LTH=10,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Acc. ',                                                +        
               POS=(6,43),LTH=5,                                       +        
               ATTR=(PROT)                                                      
KONTO    DFLD  POS=(6,49),LTH=10,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Lang.',                                                +        
               POS=(7,2),LTH=5,                                        +        
               ATTR=(PROT)                                                      
SPRAK    DFLD  POS=(7,11),LTH=3,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Due day',                                              +        
               POS=(7,16),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FORFDAT  DFLD  POS=(7,24),LTH=6,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Anal.No.',                                             +        
               POS=(7,37),LTH=8,                                       +        
               ATTR=(PROT)                                                      
IDANALYS DFLD  POS=(7,47),LTH=12,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Inv.type',                                             +        
               POS=(7,61),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FAKTTYP  DFLD  POS=(7,71),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'CC',                                                   +        
               POS=(8,43),LTH=2,                                       +        
               ATTR=(PROT)                                                      
KS       DFLD  POS=(8,54),LTH=10,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Cons. name   ',                                        +        
               POS=(9,2),LTH=13,                                       +        
               ATTR=(PROT)                                                      
BEGMT1   DFLD  POS=(9,18),LTH=35,                                      +        
               ATTR=(NOPROT,MOD)                                                
BEGMT2   DFLD  POS=(10,18),LTH=35,                                     +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Cons. address  ',                                      +        
               POS=(11,2),LTH=15,                                      +        
               ATTR=(PROT)                                                      
ADGMTGAT DFLD  POS=(11,18),LTH=35,                                     +        
               ATTR=(NOPROT,MOD)                                                
ADGMTPAD DFLD  POS=(12,18),LTH=35,                                     +        
               ATTR=(NOPROT,MOD)                                                
ADGMTLAN DFLD  POS=(13,18),LTH=35,                                     +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Payer name   ',                                        +        
               POS=(14,2),LTH=13,                                      +        
               ATTR=(PROT)                                                      
BEBET1   DFLD  POS=(14,18),LTH=35,                                     +        
               ATTR=(NOPROT,MOD)                                                
BEBET2   DFLD  POS=(15,18),LTH=35,                                     +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Payer address  ',                                      +        
               POS=(16,2),LTH=15,                                      +        
               ATTR=(PROT)                                                      
ADBET1   DFLD  POS=(16,18),LTH=35,                                     +        
               ATTR=(NOPROT,MOD)                                                
ADBET2   DFLD  POS=(17,18),LTH=35,                                     +        
               ATTR=(NOPROT,MOD)                                                
ADBET3   DFLD  POS=(18,18),LTH=35,                                     +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Delete proforma ',                                     +        
               POS=(19,2),LTH=16,                                      +        
               ATTR=(PROT)                                                      
BORTTAG  DFLD  POS=(19,19),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Rel. date ',                                           +        
               POS=(19,43),LTH=10,                                     +        
               ATTR=(PROT)                                                      
TIORDDAT DFLD  POS=(19,54),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'F10=WHELP',                                            +        
               POS=(22,02),LTH=09,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'F11=Update',                                           +        
               POS=(22,13),LTH=10,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'F12=Logoff',                                           +        
               POS=(22,25),LTH=10,                                     +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4I264N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N264),                                           +        
               OPT=2,                                                  +        
               NXT=W4O264N1                                                     
MID      LPAGE SOR=(W4N264)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '42642',                                                +        
               LTH=5                                                            
         MFLD  (IDDISTR,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDKUNDNR,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDORDNR,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR,                                                 +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DISTRUT,                                                +        
               LTH=4                                                            
         MFLD  KUNDUT,                                                 +        
               LTH=6                                                            
         MFLD  ORDERUT,                                                +        
               LTH=7                                                            
         MFLD  FLANNULL,                                               +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  DGIA0000,                                               +        
               LTH=60,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KUNDRF,                                                +        
               '+++++++++++++++'),                                     +        
               LTH=15,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FTG,                                                   +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (OMRTAL,                                                +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (INTREF,                                                +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KONTO,                                                 +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (SPRAK,                                                 +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FORFDAT,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDANALYS,                                              +        
               '++++++++++++'),                                        +        
               LTH=12,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KS,                                                    +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FAKTTYP,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (BEGMT1,                                                +        
               '+++++++++++++++++++++++++++++++++++'),                 +        
               LTH=35,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (BEGMT2,                                                +        
               '+++++++++++++++++++++++++++++++++++'),                 +        
               LTH=35,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (ADGMTGAT,                                              +        
               '+++++++++++++++++++++++++++++++++++'),                 +        
               LTH=35,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (ADGMTPAD,                                              +        
               '+++++++++++++++++++++++++++++++++++'),                 +        
               LTH=35,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (ADGMTLAN,                                              +        
               '+++++++++++++++++++++++++++++++++++'),                 +        
               LTH=35,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (BEBET1,                                                +        
               '+++++++++++++++++++++++++++++++++++'),                 +        
               LTH=35,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (BEBET2,                                                +        
               '+++++++++++++++++++++++++++++++++++'),                 +        
               LTH=35,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (ADBET1,                                                +        
               '+++++++++++++++++++++++++++++++++++'),                 +        
               LTH=35,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (ADBET2,                                                +        
               '+++++++++++++++++++++++++++++++++++'),                 +        
               LTH=35,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (ADBET3,                                                +        
               '+++++++++++++++++++++++++++++++++++'),                 +        
               LTH=35,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (BORTTAG,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
W4O264N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N264,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I264N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W4N264                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDDISTR,                                                +        
               LTH=4                                                            
         MFLD  IDKUNDNR,                                               +        
               LTH=6                                                            
         MFLD  IDORDNR,                                                +        
               LTH=7                                                            
         MFLD  ARTNR,                                                  +        
               LTH=9                                                            
         MFLD  DISTRUT,                                                +        
               LTH=4                                                            
         MFLD  KUNDUT,                                                 +        
               LTH=6                                                            
         MFLD  ORDERUT,                                                +        
               LTH=7                                                            
         MFLD  FLANNULL,                                               +        
               LTH=1                                                            
         MFLD  DGIA0000,                                               +        
               LTH=62,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TEDDI,                                                  +        
               LTH=9                                                            
         MFLD  KUNDRF,                                                 +        
               LTH=15                                                           
         MFLD  FTG,                                                    +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDORDKL,                                                +        
               LTH=1                                                            
         MFLD  KDFRAKT,                                                +        
               LTH=2                                                            
         MFLD  TYP,                                                    +        
               LTH=1                                                            
         MFLD  OMRTAL,                                                 +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  INTREF,                                                 +        
               LTH=10                                                           
         MFLD  KONTO,                                                  +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  SPRAK,                                                  +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FORFDAT,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDANALYS,                                               +        
               LTH=14,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KS,                                                     +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FAKTTYP,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BEGMT1,                                                 +        
               LTH=35                                                           
         MFLD  BEGMT2,                                                 +        
               LTH=35                                                           
         MFLD  ADGMTGAT,                                               +        
               LTH=35                                                           
         MFLD  ADGMTPAD,                                               +        
               LTH=35                                                           
         MFLD  ADGMTLAN,                                               +        
               LTH=35                                                           
         MFLD  BEBET1,                                                 +        
               LTH=35                                                           
         MFLD  BEBET2,                                                 +        
               LTH=35                                                           
         MFLD  ADBET1,                                                 +        
               LTH=35                                                           
         MFLD  ADBET2,                                                 +        
               LTH=35                                                           
         MFLD  ADBET3,                                                 +        
               LTH=35                                                           
         MFLD  BORTTAG,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TIORDDAT,                                               +        
               LTH=6                                                            
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
