***********************************************************************         
* CREATED BY V059625   ON 03/04/01  AT 10:36                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'VOR MESSAGES INFORMATION        '                               
W4N278   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W4T228  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'VOR Messages Information',                             +        
               POS=(1,12),LTH=24,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Distr',                                                +        
               POS=(3,2),LTH=5,                                        +        
               ATTR=(PROT)                                                      
DISTRUT  DFLD  POS=(3,8),LTH=5,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'Cust',                                                 +        
               POS=(3,14),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
KUNDUT   DFLD  POS=(3,19),LTH=7,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Order',                                                +        
               POS=(3,27),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
ORDUT    DFLD  POS=(3,33),LTH=10,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Part No',                                              +        
               POS=(3,44),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
ARTUT    DFLD  POS=(3,52),LTH=9,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Qty', ,                                                +        
               POS=(3,63),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
ANTUT    DFLD  POS=(3,67),LTH=7,                                       +        
               ATTR=(PROT)                                                      
DISTR    DFLD  POS=(4,2),LTH=4,                                        +        
               ATTR=(PROT,MOD,NODISP)                                           
KUNDNR   DFLD  POS=(4,8),LTH=6,                                        +        
               ATTR=(PROT,MOD,NODISP)                                           
KUNDRF   DFLD  POS=(4,16),LTH=7,                                       +        
               ATTR=(PROT,MOD,NODISP)                                           
DAURSP   DFLD  POS=(4,27),LTH=6,                                       +        
               ATTR=(PROT,MOD,NODISP)                                           
ARTNR    DFLD  POS=(4,34),LTH=9,                                       +        
               ATTR=(NUM,PROT,MOD,NODISP)                                       
TIURSP   DFLD  POS=(4,44),LTH=8,                                       +        
               ATTR=(NUM,PROT,MOD,NODISP)                                       
DAAVV    DFLD  POS=(4,54),LTH=6,                                       +        
               ATTR=(PROT,MOD,NODISP)                                           
TIAVV    DFLD  POS=(4,61),LTH=8,                                       +        
               ATTR=(NUM,PROT,MOD,NODISP)                                       
         DFLD  'VOR-ext:',                                             +        
               POS=(6,2),LTH=8,                                        +        
               ATTR=(PROT)                                                      
TEEXT    DFLD  POS=(6,11),LTH=310,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'SC',                                                   +        
               POS=(12,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  ':',                                                    +        
               POS=(12,9),LTH=1,                                       +        
               ATTR=(PROT)                                                      
TESC     DFLD  POS=(12,11),LTH=310,                                    +        
               ATTR=(PROT)                                                      
         DFLD  'F3=JUMP TO 4228    ',                                  +        
               POS=(22,2),LTH=19,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,MOD)                                                  
         FMTEND                                                                 
W4I278N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N278),                                           +        
               OPT=2,                                                  +        
               NXT=W4O278N1                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  (IDTRANS1,                                              +        
               '4'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  (IDTRANS2,                                              +        
               '2'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  (IDTRANS3,                                              +        
               '7'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F7'                                                       
         MFLD  (IDTRANS4,                                              +        
               '8'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F8'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '42782',                                                +        
               LTH=5                                                            
         MFLD  (DISTR,                                                 +        
               '    '),                                                +        
               LTH=4,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KUNDNR,                                                +        
               '      '),                                              +        
               LTH=6,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KUNDRF,                                                +        
               '       '),                                             +        
               LTH=7,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DAURSP,                                                +        
               '      '),                                              +        
               LTH=6,                                                  +        
               FILL=X'40'                                                       
         MFLD  (ARTNR,                                                 +        
               '         '),                                           +        
               LTH=9,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TIURSP,                                                +        
               '        '),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DAAVV,                                                 +        
               '      '),                                              +        
               LTH=6,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TIAVV,                                                 +        
               '        '),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
W4O278N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N278,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I278N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  DISTRUT,                                                +        
               LTH=5                                                            
         MFLD  KUNDUT,                                                 +        
               LTH=7                                                            
         MFLD  ORDUT,                                                  +        
               LTH=10                                                           
         MFLD  ARTUT,                                                  +        
               LTH=9                                                            
         MFLD  ANTUT,                                                  +        
               LTH=7                                                            
         MFLD  DISTR,                                                  +        
               LTH=4                                                            
         MFLD  KUNDNR,                                                 +        
               LTH=6                                                            
         MFLD  KUNDRF,                                                 +        
               LTH=7                                                            
         MFLD  DAURSP,                                                 +        
               LTH=6                                                            
         MFLD  ARTNR,                                                  +        
               LTH=9                                                            
         MFLD  TIURSP,                                                 +        
               LTH=8                                                            
         MFLD  DAAVV,                                                  +        
               LTH=6                                                            
         MFLD  TIAVV,                                                  +        
               LTH=8                                                            
         MFLD  TEEXT,                                                  +        
               LTH=310                                                          
         MFLD  TESC,                                                   +        
               LTH=310                                                          
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
