***********************************************************************         
* CREATED BY R030174   ON 92/02/17  AT 12:32                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'ANSWER SCREEN W4N233            '                               
W4N233   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W4T233 7',                                           +        
               3='W4T233 7',                                           +        
               4='W4T233 7',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W4T233 7',                                           +        
               8='W4T233 8',                                           +        
               9='W0T813 9',                                           +        
               10='W0T501  ',                                          +        
               11='W4T233U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='W0T501  ',                                          +        
               23='W4T233V  ',                                         +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W4N233   DPAGE CURSOR=((2,8)),                                         +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Answer special order entry',                           +        
               POS=(1,12),LTH=26,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         DFLD  'Distr',                                                +        
               POS=(2,2),LTH=5,                                        +        
               ATTR=(ALPHA,PROT)                                                
IDDISTRI DFLD  POS=(2,8),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Cust',                                                 +        
               POS=(2,14),LTH=4,                                       +        
               ATTR=(PROT)                                                      
IDKUNDNI DFLD  POS=(2,19),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Order',                                                +        
               POS=(2,27),LTH=5,                                       +        
               ATTR=(PROT)                                                      
IDORDNRI DFLD  POS=(2,33),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Cancellation',                                         +        
               POS=(2,59),LTH=12,                                      +        
               ATTR=(PROT)                                                      
FLANNULL DFLD  POS=(2,72),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDDISTRU DFLD  POS=(3,8),LTH=4,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
IDKUNDGU DFLD  POS=(3,19),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
IDORDNRU DFLD  POS=(3,33),LTH=5,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  'Cl',                                                   +        
               POS=(3,42),LTH=2,                                       +        
               ATTR=(PROT)                                                      
KDORDKLU DFLD  POS=(3,45),LTH=1,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
ARTNRNEX DFLD  POS=(4,2),LTH=9,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
LOPNRNEX DFLD  POS=(4,12),LTH=3,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
SEKNRNEX DFLD  POS=(4,16),LTH=3,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
IDDCNEX  DFLD  POS=(4,20),LTH=2,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
KODBKNEX DFLD  POS=(4,23),LTH=2,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
TEDDI    DFLD  POS=(4,70),LTH=11,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Code CMD',                                             +        
               POS=(5,2),LTH=8,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'Part No Description',                                  +        
               POS=(5,15),LTH=19,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'DC',                                                   +        
               POS=(5,39),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Qty',                                                  +        
               POS=(5,46),LTH=3,                                       +        
               ATTR=(PROT)                                                      
KOD01    DFLD  POS=(6,3),LTH=2,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
ANNULL01 DFLD  POS=(6,8),LTH=1,                                        +        
               ATTR=(PROT)                                                      
IDARTN01 DFLD  POS=(6,11),LTH=11,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
BEART01  DFLD  POS=(6,23),LTH=15,                                      +        
               ATTR=(NUM,PROT)                                                  
IDDC01   DFLD  POS=(6,39),LTH=2,                                       +        
               ATTR=(ALPHA,PROT,MOD)                                            
KVANT01  DFLD  POS=(6,42),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
KEYS01   DFLD  POS=(6,75),LTH=6,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KOD02    DFLD  POS=(7,3),LTH=2,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
ANNULL02 DFLD  POS=(7,8),LTH=1,                                        +        
               ATTR=(PROT)                                                      
IDARTN02 DFLD  POS=(7,11),LTH=11,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
BEART02  DFLD  POS=(7,23),LTH=15,                                      +        
               ATTR=(NUM,PROT)                                                  
IDDC02   DFLD  POS=(7,39),LTH=2,                                       +        
               ATTR=(ALPHA,PROT,MOD)                                            
KVANT02  DFLD  POS=(7,42),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
KEYS02   DFLD  POS=(7,75),LTH=6,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KOD03    DFLD  POS=(8,3),LTH=2,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
ANNULL03 DFLD  POS=(8,8),LTH=1,                                        +        
               ATTR=(PROT)                                                      
IDARTN03 DFLD  POS=(8,11),LTH=11,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
BEART03  DFLD  POS=(8,23),LTH=15,                                      +        
               ATTR=(NUM,PROT)                                                  
IDDC03   DFLD  POS=(8,39),LTH=2,                                       +        
               ATTR=(ALPHA,PROT,MOD)                                            
KVANT03  DFLD  POS=(8,42),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
KEYS03   DFLD  POS=(8,75),LTH=6,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KOD04    DFLD  POS=(9,3),LTH=2,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
ANNULL04 DFLD  POS=(9,8),LTH=1,                                        +        
               ATTR=(PROT)                                                      
IDARTN04 DFLD  POS=(9,11),LTH=11,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
BEART04  DFLD  POS=(9,23),LTH=15,                                      +        
               ATTR=(NUM,PROT)                                                  
IDDC04 DFLD    POS=(9,39),LTH=2,                                       +        
               ATTR=(ALPHA,PROT,MOD)                                            
KVANT04  DFLD  POS=(9,42),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
KEYS04   DFLD  POS=(9,75),LTH=6,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KOD05    DFLD  POS=(10,3),LTH=2,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
ANNULL05 DFLD  POS=(10,8),LTH=1,                                       +        
               ATTR=(PROT)                                                      
IDARTN05 DFLD  POS=(10,11),LTH=11,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
BEART05  DFLD  POS=(10,23),LTH=15,                                     +        
               ATTR=(NUM,PROT)                                                  
IDDC05   DFLD  POS=(10,39),LTH=2,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KVANT05  DFLD  POS=(10,42),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
KEYS05   DFLD  POS=(10,75),LTH=6,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KOD06    DFLD  POS=(11,3),LTH=2,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
ANNULL06 DFLD  POS=(11,8),LTH=1,                                       +        
               ATTR=(PROT)                                                      
IDARTN06 DFLD  POS=(11,11),LTH=11,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
BEART06  DFLD  POS=(11,23),LTH=15,                                     +        
               ATTR=(NUM,PROT)                                                  
IDDC06   DFLD  POS=(11,39),LTH=2,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KVANT06  DFLD  POS=(11,42),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
KEYS06   DFLD  POS=(11,75),LTH=6,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KOD07    DFLD  POS=(12,3),LTH=2,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
ANNULL07 DFLD  POS=(12,8),LTH=1,                                       +        
               ATTR=(PROT)                                                      
IDARTN07 DFLD  POS=(12,11),LTH=11,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
BEART07  DFLD  POS=(12,23),LTH=15,                                     +        
               ATTR=(NUM,PROT)                                                  
IDDC07   DFLD  POS=(12,39),LTH=2,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KVANT07  DFLD  POS=(12,42),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
KEYS07   DFLD  POS=(12,75),LTH=6,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KOD08    DFLD  POS=(13,3),LTH=2,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
ANNULL08 DFLD  POS=(13,8),LTH=1,                                       +        
               ATTR=(PROT)                                                      
IDARTN08 DFLD  POS=(13,11),LTH=11,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
BEART08  DFLD  POS=(13,23),LTH=15,                                     +        
               ATTR=(NUM,PROT)                                                  
IDDC08   DFLD  POS=(13,39),LTH=2,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KVANT08  DFLD  POS=(13,42),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
KEYS08   DFLD  POS=(13,75),LTH=6,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KOD09    DFLD  POS=(14,3),LTH=2,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
ANNULL09 DFLD  POS=(14,8),LTH=1,                                       +        
               ATTR=(PROT)                                                      
IDARTN09 DFLD  POS=(14,11),LTH=11,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
BEART09  DFLD  POS=(14,23),LTH=15,                                     +        
               ATTR=(NUM,PROT)                                                  
IDDC09   DFLD  POS=(14,39),LTH=2,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KVANT09  DFLD  POS=(14,42),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
KEYS09   DFLD  POS=(14,75),LTH=6,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KOD10    DFLD  POS=(15,3),LTH=2,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
ANNULL10 DFLD  POS=(15,8),LTH=1,                                       +        
               ATTR=(PROT)                                                      
IDARTN10 DFLD  POS=(15,11),LTH=11,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
BEART10  DFLD  POS=(15,23),LTH=15,                                     +        
               ATTR=(NUM,PROT)                                                  
IDDC10 DFLD    POS=(15,39),LTH=2,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KVANT10  DFLD  POS=(15,42),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
KEYS10   DFLD  POS=(15,75),LTH=6,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KOD11    DFLD  POS=(16,3),LTH=2,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
ANNULL11 DFLD  POS=(16,8),LTH=1,                                       +        
               ATTR=(PROT)                                                      
IDARTN11 DFLD  POS=(16,11),LTH=11,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
BEART11  DFLD  POS=(16,23),LTH=15,                                     +        
               ATTR=(NUM,PROT)                                                  
IDDC11   DFLD  POS=(16,39),LTH=2,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KVANT11  DFLD  POS=(16,42),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
KEYS11   DFLD  POS=(16,75),LTH=6,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KOD12    DFLD  POS=(17,3),LTH=2,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
ANNULL12 DFLD  POS=(17,8),LTH=1,                                       +        
               ATTR=(PROT)                                                      
IDARTN12 DFLD  POS=(17,11),LTH=11,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
BEART12  DFLD  POS=(17,23),LTH=15,                                     +        
               ATTR=(NUM,PROT)                                                  
IDDC12 DFLD    POS=(17,39),LTH=2,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KVANT12  DFLD  POS=(17,42),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
KEYS12   DFLD  POS=(17,75),LTH=6,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KOD13    DFLD  POS=(18,3),LTH=2,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
ANNULL13 DFLD  POS=(18,8),LTH=1,                                       +        
               ATTR=(PROT)                                                      
IDARTN13 DFLD  POS=(18,11),LTH=11,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
BEART13  DFLD  POS=(18,23),LTH=15,                                     +        
               ATTR=(NUM,PROT)                                                  
IDDC13   DFLD  POS=(18,39),LTH=2,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KVANT13  DFLD  POS=(18,42),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
KEYS13   DFLD  POS=(18,75),LTH=6,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
         DFLD  'Code-info: screen 0813 PF9',                           +        
               POS=(19,2),LTH=26,                                      +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  '13',                                                   +        
               POS=(21,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '14',                                                   +        
               POS=(21,17),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '15',                                                   +        
               POS=(21,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16',                                                   +        
               POS=(21,49),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,17),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,49),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10',                                                   +        
               POS=(22,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         DFLD  ' VCAS',POS=(23,58)                                              
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4I233N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N233),                                           +        
               OPT=2,                                                  +        
               NXT=W4O233N1                                                     
MID      LPAGE SOR=(W4N233)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '42332',                                                +        
               LTH=5                                                            
         MFLD  (IDDISTRI,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDKUNDNI,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDORDNRI,                                              +        
               '+++++++'),                                             +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDDISTRU,                                               +        
               LTH=4                                                            
         MFLD  IDKUNDGU,                                               +        
               LTH=6                                                            
         MFLD  IDORDNRU,                                               +        
               LTH=5                                                            
         MFLD  KDORDKLU,                                               +        
               LTH=1                                                            
         MFLD  (FLANNULL,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  ARTNRNEX,                                               +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  LOPNRNEX,                                               +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  SEKNRNEX,                                               +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  IDDCNEX,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  KODBKNEX,                                               +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  KOD01,                                                  +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  IDARTN01,                                               +        
               LTH=11,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDDC01,                                                 +        
               LTH=2                                                            
         MFLD  KEYS01,                                                 +        
               LTH=6                                                            
         MFLD  KOD02,                                                  +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  IDARTN02,                                               +        
               LTH=11,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDDC02,                                                 +        
               LTH=2                                                            
         MFLD  KEYS02,                                                 +        
               LTH=6                                                            
         MFLD  KOD03,                                                  +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  IDARTN03,                                               +        
               LTH=11,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDDC03,                                                 +        
               LTH=2                                                            
         MFLD  KEYS03,                                                 +        
               LTH=6                                                            
         MFLD  KOD04,                                                  +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  IDARTN04,                                               +        
               LTH=11,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDDC04,                                                 +        
               LTH=2                                                            
         MFLD  KEYS04,                                                 +        
               LTH=6                                                            
         MFLD  KOD05,                                                  +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  IDARTN05,                                               +        
               LTH=11,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDDC05,                                                 +        
               LTH=2                                                            
         MFLD  KEYS05,                                                 +        
               LTH=6                                                            
         MFLD  KOD06,                                                  +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  IDARTN06,                                               +        
               LTH=11,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDDC06,                                                 +        
               LTH=2                                                            
         MFLD  KEYS06,                                                 +        
               LTH=6                                                            
         MFLD  KOD07,                                                  +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  IDARTN07,                                               +        
               LTH=11,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDDC07,                                                 +        
               LTH=2                                                            
         MFLD  KEYS07,                                                 +        
               LTH=6                                                            
         MFLD  KOD08,                                                  +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  IDARTN08,                                               +        
               LTH=11,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDDC08,                                                 +        
               LTH=2                                                            
         MFLD  KEYS08,                                                 +        
               LTH=6                                                            
         MFLD  KOD09,                                                  +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  IDARTN09,                                               +        
               LTH=11,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDDC09,                                                 +        
               LTH=2                                                            
         MFLD  KEYS09,                                                 +        
               LTH=6                                                            
         MFLD  KOD10,                                                  +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  IDARTN10,                                               +        
               LTH=11,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDDC10,                                                 +        
               LTH=2                                                            
         MFLD  KEYS10,                                                 +        
               LTH=6                                                            
         MFLD  KOD11,                                                  +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  IDARTN11,                                               +        
               LTH=11,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDDC11,                                                 +        
               LTH=2                                                            
         MFLD  KEYS11,                                                 +        
               LTH=6                                                            
         MFLD  KOD12,                                                  +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  IDARTN12,                                               +        
               LTH=11,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDDC12,                                                 +        
               LTH=2                                                            
         MFLD  KEYS12,                                                 +        
               LTH=6                                                            
         MFLD  KOD13,                                                  +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  IDARTN13,                                               +        
               LTH=11,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDDC13,                                                 +        
               LTH=2                                                            
         MFLD  KEYS13,                                                 +        
               LTH=6                                                            
         MSGEND                                                                 
W4O233N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N233,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I233N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W4N233                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTRANS2,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDDISTRI,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDKUNDNI,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDORDNRI,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLANNULL,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDDISTRU,                                               +        
               LTH=4                                                            
         MFLD  IDKUNDGU,                                               +        
               LTH=6                                                            
         MFLD  IDORDNRU,                                               +        
               LTH=5                                                            
         MFLD  KDORDKLU,                                               +        
               LTH=1                                                            
         MFLD  ARTNRNEX,                                               +        
               LTH=9                                                            
         MFLD  LOPNRNEX,                                               +        
               LTH=3                                                            
         MFLD  SEKNRNEX,                                               +        
               LTH=3                                                            
         MFLD  IDDCNEX,                                                +        
               LTH=2                                                            
         MFLD  KODBKNEX,                                               +        
               LTH=2                                                            
         MFLD  TEDDI,                                                  +        
               LTH=11                                                           
         MFLD  KOD01,                                                  +        
               LTH=2                                                            
         MFLD  ANNULL01,                                               +        
               LTH=1                                                            
         MFLD  IDARTN01,                                               +        
               LTH=11                                                           
         MFLD  BEART01,                                                +        
               LTH=15                                                           
         MFLD  IDDC01,                                                 +        
               LTH=2                                                            
         MFLD  KVANT01,                                                +        
               LTH=7                                                            
         MFLD  KEYS01,                                                 +        
               LTH=6                                                            
         MFLD  KOD02,                                                  +        
               LTH=2                                                            
         MFLD  ANNULL02,                                               +        
               LTH=1                                                            
         MFLD  IDARTN02,                                               +        
               LTH=11                                                           
         MFLD  BEART02,                                                +        
               LTH=15                                                           
         MFLD  IDDC02,                                                 +        
               LTH=2                                                            
         MFLD  KVANT02,                                                +        
               LTH=7                                                            
         MFLD  KEYS02,                                                 +        
               LTH=6                                                            
         MFLD  KOD03,                                                  +        
               LTH=2                                                            
         MFLD  ANNULL03,                                               +        
               LTH=1                                                            
         MFLD  IDARTN03,                                               +        
               LTH=11                                                           
         MFLD  BEART03,                                                +        
               LTH=15                                                           
         MFLD  IDDC03,                                                 +        
               LTH=2                                                            
         MFLD  KVANT03,                                                +        
               LTH=7                                                            
         MFLD  KEYS03,                                                 +        
               LTH=6                                                            
         MFLD  KOD04,                                                  +        
               LTH=2                                                            
         MFLD  ANNULL04,                                               +        
               LTH=1                                                            
         MFLD  IDARTN04,                                               +        
               LTH=11                                                           
         MFLD  BEART04,                                                +        
               LTH=15                                                           
         MFLD  IDDC04,                                                 +        
               LTH=2                                                            
         MFLD  KVANT04,                                                +        
               LTH=7                                                            
         MFLD  KEYS04,                                                 +        
               LTH=6                                                            
         MFLD  KOD05,                                                  +        
               LTH=2                                                            
         MFLD  ANNULL05,                                               +        
               LTH=1                                                            
         MFLD  IDARTN05,                                               +        
               LTH=11                                                           
         MFLD  BEART05,                                                +        
               LTH=15                                                           
         MFLD  IDDC05,                                                 +        
               LTH=2                                                            
         MFLD  KVANT05,                                                +        
               LTH=7                                                            
         MFLD  KEYS05,                                                 +        
               LTH=6                                                            
         MFLD  KOD06,                                                  +        
               LTH=2                                                            
         MFLD  ANNULL06,                                               +        
               LTH=1                                                            
         MFLD  IDARTN06,                                               +        
               LTH=11                                                           
         MFLD  BEART06,                                                +        
               LTH=15                                                           
         MFLD  IDDC06,                                                 +        
               LTH=2                                                            
         MFLD  KVANT06,                                                +        
               LTH=7                                                            
         MFLD  KEYS06,                                                 +        
               LTH=6                                                            
         MFLD  KOD07,                                                  +        
               LTH=2                                                            
         MFLD  ANNULL07,                                               +        
               LTH=1                                                            
         MFLD  IDARTN07,                                               +        
               LTH=11                                                           
         MFLD  BEART07,                                                +        
               LTH=15                                                           
         MFLD  IDDC07,                                                 +        
               LTH=2                                                            
         MFLD  KVANT07,                                                +        
               LTH=7                                                            
         MFLD  KEYS07,                                                 +        
               LTH=6                                                            
         MFLD  KOD08,                                                  +        
               LTH=2                                                            
         MFLD  ANNULL08,                                               +        
               LTH=1                                                            
         MFLD  IDARTN08,                                               +        
               LTH=11                                                           
         MFLD  BEART08,                                                +        
               LTH=15                                                           
         MFLD  IDDC08,                                                 +        
               LTH=2                                                            
         MFLD  KVANT08,                                                +        
               LTH=7                                                            
         MFLD  KEYS08,                                                 +        
               LTH=6                                                            
         MFLD  KOD09,                                                  +        
               LTH=2                                                            
         MFLD  ANNULL09,                                               +        
               LTH=1                                                            
         MFLD  IDARTN09,                                               +        
               LTH=11                                                           
         MFLD  BEART09,                                                +        
               LTH=15                                                           
         MFLD  IDDC09,                                                 +        
               LTH=2                                                            
         MFLD  KVANT09,                                                +        
               LTH=7                                                            
         MFLD  KEYS09,                                                 +        
               LTH=6                                                            
         MFLD  KOD10,                                                  +        
               LTH=2                                                            
         MFLD  ANNULL10,                                               +        
               LTH=1                                                            
         MFLD  IDARTN10,                                               +        
               LTH=11                                                           
         MFLD  BEART10,                                                +        
               LTH=15                                                           
         MFLD  IDDC10,                                                 +        
               LTH=2                                                            
         MFLD  KVANT10,                                                +        
               LTH=7                                                            
         MFLD  KEYS10,                                                 +        
               LTH=6                                                            
         MFLD  KOD11,                                                  +        
               LTH=2                                                            
         MFLD  ANNULL11,                                               +        
               LTH=1                                                            
         MFLD  IDARTN11,                                               +        
               LTH=11                                                           
         MFLD  BEART11,                                                +        
               LTH=15                                                           
         MFLD  IDDC11,                                                 +        
               LTH=2                                                            
         MFLD  KVANT11,                                                +        
               LTH=7                                                            
         MFLD  KEYS11,                                                 +        
               LTH=6                                                            
         MFLD  KOD12,                                                  +        
               LTH=2                                                            
         MFLD  ANNULL12,                                               +        
               LTH=1                                                            
         MFLD  IDARTN12,                                               +        
               LTH=11                                                           
         MFLD  BEART12,                                                +        
               LTH=15                                                           
         MFLD  IDDC12,                                                 +        
               LTH=2                                                            
         MFLD  KVANT12,                                                +        
               LTH=7                                                            
         MFLD  KEYS12,                                                 +        
               LTH=6                                                            
         MFLD  KOD13,                                                  +        
               LTH=2                                                            
         MFLD  ANNULL13,                                               +        
               LTH=1                                                            
         MFLD  IDARTN13,                                               +        
               LTH=11                                                           
         MFLD  BEART13,                                                +        
               LTH=15                                                           
         MFLD  IDDC13,                                                 +        
               LTH=2                                                            
         MFLD  KVANT13,                                                +        
               LTH=7                                                            
         MFLD  KEYS13,                                                 +        
               LTH=6                                                            
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
