***********************************************************************         
* CREATED BY PC36146   ON 97/02/20  AT 14:15                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'ORDERHUVUD EXTERN               '                               
W4N241   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T241  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((5,8)),                                         +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'ORDER HEAD EXTERN',                                    +        
               POS=(1,12),LTH=17,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Distr',                                                +        
               POS=(5,2),LTH=5,                                        +        
               ATTR=(PROT)                                                      
IDDISTR  DFLD  POS=(5,8),LTH=4,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Cust',                                                 +        
               POS=(5,14),LTH=4,                                       +        
               ATTR=(PROT)                                                      
IDKUNDNR DFLD  POS=(5,19),LTH=6,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Order',                                                +        
               POS=(5,26),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
IDORDNR  DFLD  POS=(5,32),LTH=5,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Cl',                                                   +        
               POS=(5,41),LTH=2,                                       +        
               ATTR=(PROT)                                                      
KDORDKL  DFLD  POS=(5,44),LTH=1,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'FC',                                                   +        
               POS=(5,46),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
KDFRAKT  DFLD  POS=(5,49),LTH=2,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'VOR-FC-1 Y/N ',                                        +        
               POS=(5,52),LTH=13,                                      +        
               ATTR=(NUM,PROT)                                                  
FLVORFC  DFLD  POS=(5,66),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
TEDDI    DFLD  POS=(5,70),LTH=11,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Custref',                                              +        
               POS=(7,2),LTH=7,                                        +        
               ATTR=(PROT)                                                      
BEKUNDRF DFLD  POS=(7,10),LTH=15,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Backorder',                                            +        
               POS=(7,31),LTH=9,                                       +        
               ATTR=(PROT)                                                      
FLRESTN  DFLD  POS=(7,41),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'RFS',                                                  +        
               POS=(7,43),LTH=3,                                       +        
               ATTR=(PROT)                                                      
RFS      DFLD  POS=(7,47),LTH=6,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Time',                                                 +        
               POS=(7,54),LTH=4,                                       +        
               ATTR=(PROT)                                                      
BEGTID   DFLD  POS=(7,59),LTH=4,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'TPO type',                                             +        
               POS=(9,2),LTH=8,                                        +        
               ATTR=(PROT)                                                      
KDTPOTYP DFLD  POS=(9,11),LTH=1,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Req TPO',                                              +        
               POS=(9,14),LTH=7,                                       +        
               ATTR=(PROT)                                                      
TITPO    DFLD  POS=(9,22),LTH=6,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Campaign ref',                                         +        
               POS=(9,29),LTH=12,                                      +        
               ATTR=(NUM,PROT)                                                  
IDUPPREF DFLD  POS=(9,42),LTH=7,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Warehouse instr',                                      +        
               POS=(11,2),LTH=15,                                      +        
               ATTR=(PROT)                                                      
BELAGIN1 DFLD  POS=(11,20),LTH=60,                                     +        
               ATTR=(NOPROT,MOD)                                                
BELAGIN2 DFLD  POS=(12,20),LTH=60,                                     +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Consignee name',                                       +        
               POS=(13,2),LTH=14,                                      +        
               ATTR=(PROT)                                                      
DGIA0003 DFLD  POS=(13,20),LTH=35,                                     +        
               ATTR=(NOPROT,MOD)                                                
DGIA0004 DFLD  POS=(14,20),LTH=35,                                     +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Consignee street',                                     +        
               POS=(15,2),LTH=16,                                      +        
               ATTR=(PROT)                                                      
DGIA0000 DFLD  POS=(15,20),LTH=35,                                     +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'town',                                                 +        
               POS=(16,14),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0002 DFLD  POS=(16,20),LTH=35,                                     +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'country',                                              +        
               POS=(17,11),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DGIA0001 DFLD  POS=(17,20),LTH=35,                                     +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Goods marking',                                        +        
               POS=(19,2),LTH=13,                                      +        
               ATTR=(PROT)                                                      
BEGMRK1  DFLD  POS=(19,20),LTH=30,                                     +        
               ATTR=(NOPROT,MOD)                                                
BEGMRK2  DFLD  POS=(19,51),LTH=30,                                     +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Rel BO/TPO',                                           +        
               POS=(20,2),LTH=10,                                      +        
               ATTR=(NUM,PROT)                                                  
C1       DFLD  POS=(20,15),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Ref',                                                  +        
               POS=(20,18),LTH=3,                                      +        
               ATTR=(PROT)                                                      
C1REF    DFLD  POS=(20,22),LTH=7,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  '13',                                                   +        
               POS=(21,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '14',                                                   +        
               POS=(21,17),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '15',                                                   +        
               POS=(21,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16',                                                   +        
               POS=(21,49),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,17),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,49),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W4I241N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N241),                                           +        
               OPT=2,                                                  +        
               NXT=W4O241N1                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '42412',                                                +        
               LTH=5                                                            
         MFLD  (IDDISTR,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDKUNDNR,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDORDNR,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDORDKL,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDFRAKT,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLVORFC,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (RFS,                                                   +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (BEGTID,                                                +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (BEKUNDRF,                                              +        
               '+++++++++++++++'),                                     +        
               LTH=15,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLRESTN,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KDTPOTYP,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TITPO,                                                 +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDUPPREF,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (BELAGIN1,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++'),                                                +        
               LTH=60,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (BELAGIN2,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++'),                                                +        
               LTH=60,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0003,                                              +        
               '+++++++++++++++++++++++++++++++++++'),                 +        
               LTH=35,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0004,                                              +        
               '+++++++++++++++++++++++++++++++++++'),                 +        
               LTH=35,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0000,                                              +        
               '+++++++++++++++++++++++++++++++++++'),                 +        
               LTH=35,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0002,                                              +        
               '+++++++++++++++++++++++++++++++++++'),                 +        
               LTH=35,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0001,                                              +        
               '+++++++++++++++++++++++++++++++++++'),                 +        
               LTH=35,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (BEGMRK1,                                               +        
               '+++++++++++++++++++++++++++++++++++++++++++++++'),     +        
               LTH=30,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (BEGMRK2,                                               +        
               '++++++++++++++++++++++++++++++'),                      +        
               LTH=30,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (C1,                                                    +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (C1REF,                                                 +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MSGEND                                                                 
W4O241N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N241,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I241N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDDISTR,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDKUNDNR,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDORDNR,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDORDKL,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDFRAKT,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLVORFC,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEDDI,                                                  +        
               LTH=11                                                           
         MFLD  RFS,                                                    +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BEGTID,                                                 +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BEKUNDRF,                                               +        
               LTH=15                                                           
         MFLD  FLRESTN,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDTPOTYP,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TITPO,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDUPPREF,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BELAGIN1,                                               +        
               LTH=60                                                           
         MFLD  BELAGIN2,                                               +        
               LTH=60                                                           
         MFLD  DGIA0003,                                               +        
               LTH=35                                                           
         MFLD  DGIA0004,                                               +        
               LTH=35                                                           
         MFLD  DGIA0000,                                               +        
               LTH=35                                                           
         MFLD  DGIA0002,                                               +        
               LTH=35                                                           
         MFLD  DGIA0001,                                               +        
               LTH=35                                                           
         MFLD  BEGMRK1,                                                +        
               LTH=30                                                           
         MFLD  BEGMRK2,                                                +        
               LTH=30                                                           
         MFLD  C1,                                                     +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  C1REF,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
