***********************************************************************         
* CREATED BY PC36147   ON 98/09/03  AT 17:33                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'PROFORMA HEAD  REGISTRATION     '                               
W4N261   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T261  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T261  ',                                          +        
               14='W4T262  ',                                          +        
               15='W4T264  ',                                          +        
               16='W4T265  ',                                          +        
               17='W4T266  ',                                          +        
               18='W4T267  ',                                          +        
               19='W4T268  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W4N261   DPAGE CURSOR=((5,8)),                                         +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'PROFORMA HEAD REGISTRATION',                           +        
               POS=(1,12),LTH=26,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Distr',                                                +        
               POS=(5,2),LTH=5,                                        +        
               ATTR=(PROT)                                                      
IDDISTR  DFLD  POS=(5,8),LTH=4,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Cust',                                                 +        
               POS=(5,14),LTH=4,                                       +        
               ATTR=(PROT)                                                      
IDKUNDNR DFLD  POS=(5,19),LTH=6,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Order',                                                +        
               POS=(5,26),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
IDORDNR  DFLD  POS=(5,32),LTH=7,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Cl',                                                   +        
               POS=(5,40),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
KDORDKL  DFLD  POS=(5,43),LTH=1,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Fc',                                                   +        
               POS=(5,45),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
KDFRAKT  DFLD  POS=(5,48),LTH=2,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Type',                                                 +        
               POS=(5,51),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
TYP      DFLD  POS=(5,56),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Inv type',                                             +        
               POS=(5,69),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FAKTTYP  DFLD  POS=(5,78),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
TEDDI    DFLD  POS=(6,70),LTH=11,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Custref',                                              +        
               POS=(7,16),LTH=7,                                       +        
               ATTR=(PROT)                                                      
KUNDRF   DFLD  POS=(7,24),LTH=15,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Co',                                                   +        
               POS=(7,43),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FTG      DFLD  POS=(7,57),LTH=2,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Disc',                                                 +        
               POS=(8,2),LTH=4,                                        +        
               ATTR=(PROT)                                                      
OMRTAL   DFLD  POS=(8,9),LTH=5,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Int.ref',                                              +        
               POS=(8,16),LTH=7,                                       +        
               ATTR=(PROT)                                                      
INTREF   DFLD  POS=(8,24),LTH=10,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Acc',                                                  +        
               POS=(8,43),LTH=3,                                       +        
               ATTR=(PROT)                                                      
KONTO    DFLD  POS=(8,49),LTH=10,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Language',                                             +        
               POS=(9,2),LTH=8,                                        +        
               ATTR=(PROT)                                                      
SPRAK    DFLD  POS=(9,11),LTH=3,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Due day',                                              +        
               POS=(9,16),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FORFDAT  DFLD  POS=(9,24),LTH=6,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'AnNo',                                                 +        
               POS=(9,43),LTH=4,                                       +        
               ATTR=(PROT)                                                      
IDANALYS DFLD  POS=(9,48),LTH=12,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'CC',                                                   +        
               POS=(10,43),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KS       DFLD  POS=(10,54),LTH=10,                                     +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Consignee name',                                       +        
               POS=(11,2),LTH=14,                                      +        
               ATTR=(PROT)                                                      
BEGODSM1 DFLD  POS=(11,20),LTH=35,                                     +        
               ATTR=(NOPROT,MOD)                                                
BEGODSM2 DFLD  POS=(12,20),LTH=35,                                     +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Consignee address',                                    +        
               POS=(13,2),LTH=17,                                      +        
               ATTR=(PROT)                                                      
ADGODSM1 DFLD  POS=(13,20),LTH=35,                                     +        
               ATTR=(NOPROT,MOD)                                                
ADGODSM2 DFLD  POS=(14,20),LTH=35,                                     +        
               ATTR=(NOPROT,MOD)                                                
ADGODSM3 DFLD  POS=(15,20),LTH=35,                                     +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Pay resp name',                                        +        
               POS=(16,2),LTH=13,                                      +        
               ATTR=(PROT)                                                      
DGIA0002 DFLD  POS=(16,20),LTH=35,                                     +        
               ATTR=(NOPROT,MOD)                                                
DGIA0003 DFLD  POS=(17,20),LTH=35,                                     +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Pay resp address',                                     +        
               POS=(18,2),LTH=16,                                      +        
               ATTR=(PROT)                                                      
DGIA0000 DFLD  POS=(18,20),LTH=35,                                     +        
               ATTR=(NOPROT,MOD)                                                
DGIA0001 DFLD  POS=(19,20),LTH=35,                                     +        
               ATTR=(NOPROT,MOD)                                                
DGIA0004 DFLD  POS=(20,20),LTH=35,                                     +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  '13 New head    14 New line    15 Adm/del head  16 Adm/d+        
               el line  17 Addition 1',                                +        
               POS=(21,2),LTH=77,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18 Addition 2  19 Addition 3  20',                     +        
               POS=(22,2),LTH=32,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,49),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4I261N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N261),                                           +        
               OPT=2,                                                  +        
               NXT=W4O261N1                                                     
MID      LPAGE SOR=(W4N261)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '42612',                                                +        
               LTH=5                                                            
         MFLD  (IDDISTR,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDKUNDNR,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDORDNR,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDORDKL,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDFRAKT,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TYP,                                                   +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FAKTTYP,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KUNDRF,                                                +        
               '+++++++++++++++'),                                     +        
               LTH=15,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FTG,                                                   +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (OMRTAL,                                                +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (INTREF,                                                +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KONTO,                                                 +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDANALYS,                                              +        
               '++++++++++++'),                                        +        
               LTH=12,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (SPRAK,                                                 +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FORFDAT,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KS,                                                    +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (BEGODSM1,                                              +        
               '+++++++++++++++++++++++++++++++++++'),                 +        
               LTH=35,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (BEGODSM2,                                              +        
               '+++++++++++++++++++++++++++++++++++'),                 +        
               LTH=35,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (ADGODSM1,                                              +        
               '+++++++++++++++++++++++++++++++++++'),                 +        
               LTH=35,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (ADGODSM2,                                              +        
               '+++++++++++++++++++++++++++++++++++'),                 +        
               LTH=35,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (ADGODSM3,                                              +        
               '+++++++++++++++++++++++++++++++++++'),                 +        
               LTH=35,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0002,                                              +        
               '+++++++++++++++++++++++++++++++++++'),                 +        
               LTH=35,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0003,                                              +        
               '+++++++++++++++++++++++++++++++++++'),                 +        
               LTH=35,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0000,                                              +        
               '+++++++++++++++++++++++++++++++++++'),                 +        
               LTH=35,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0001,                                              +        
               '+++++++++++++++++++++++++++++++++++'),                 +        
               LTH=35,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0004,                                              +        
               '+++++++++++++++++++++++++++++++++++'),                 +        
               LTH=35,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MSGEND                                                                 
W4O261N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N261,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I261N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W4N261                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDDISTR,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDKUNDNR,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDORDNR,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDORDKL,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDFRAKT,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TYP,                                                    +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FAKTTYP,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEDDI,                                                  +        
               LTH=11                                                           
         MFLD  KUNDRF,                                                 +        
               LTH=15                                                           
         MFLD  FTG,                                                    +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OMRTAL,                                                 +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  INTREF,                                                 +        
               LTH=10                                                           
         MFLD  KONTO,                                                  +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDANALYS,                                               +        
               LTH=14,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KS,                                                     +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  SPRAK,                                                  +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FORFDAT,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BEGODSM1,                                               +        
               LTH=35                                                           
         MFLD  BEGODSM2,                                               +        
               LTH=35                                                           
         MFLD  ADGODSM1,                                               +        
               LTH=35                                                           
         MFLD  ADGODSM2,                                               +        
               LTH=35                                                           
         MFLD  ADGODSM3,                                               +        
               LTH=35                                                           
         MFLD  DGIA0002,                                               +        
               LTH=35                                                           
         MFLD  DGIA0003,                                               +        
               LTH=35                                                           
         MFLD  DGIA0000,                                               +        
               LTH=35                                                           
         MFLD  DGIA0001,                                               +        
               LTH=35                                                           
         MFLD  DGIA0004,                                               +        
               LTH=35                                                           
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
