***********************************************************************         
* CREATED BY R0C3633   ON 91/05/14  AT 12:45                                    
***********************************************************************         
         TITLE 'TRANSPORT-VOLUME (SCREEN 4385)  '                               
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyzˆÈ¸‰Â…'                               
W4N385   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W4T385 7',                                           +        
               8='W4T385 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T381  ',                                          +        
               14='W4T382  ',                                          +        
               15='W4T383  ',                                          +        
               16='W4T384  ',                                          +        
               17='W4T385  ',                                          +        
               18='W4T386  ',                                          +        
               19='W4T387  ',                                          +        
               20='W4T388  ',                                          +        
               21='W4T389  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((2,9)),                                         +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(ALPHA,NOPROT,MOD)                                          
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'TODAYS TRANSPORT VOLUME ',                             +        
               POS=(1,11),LTH=24,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Trp-id',                                               +        
               POS=(2,2),LTH=6,                                        +        
               ATTR=(ALPHA,PROT)                                                
DGIA0000 DFLD  POS=(2,9),LTH=5,                                        +        
               ATTR=(NOPROT)                                                    
         DFLD  'DC',                                                   +        
               POS=(2,15),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DCI      DFLD  POS=(2,18),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DGIA0001 DFLD  POS=(3,9),LTH=5,                                        +        
               ATTR=(PROT,MOD)                                                  
DCO      DFLD  POS=(3,18),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
PFE      DFLD  POS=(4,2),LTH=12,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
PF8      DFLD  POS=(4,15),LTH=12,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'Distr   Cust   Order',                                 +        
               POS=(5,2),LTH=20,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'M3',                                                   +        
               POS=(5,29),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Kg    RFS',                                            +        
               POS=(5,38),LTH=9,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'S',                                                    +        
               POS=(5,54),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Tot M3   Tot kg',                                      +        
               POS=(5,61),LTH=15,                                      +        
               ATTR=(PROT)                                                      
DST06    DFLD  POS=(6,3),LTH=4,                                        +        
               ATTR=(NUM,PROT)                                                  
KND06    DFLD  POS=(6,8),LTH=6,                                        +        
               ATTR=(NUM,PROT)                                                  
ORD06    DFLD  POS=(6,15),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
VOL06    DFLD  POS=(6,23),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
WGT06    DFLD  POS=(6,32),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
RFS06    DFLD  POS=(6,41),LTH=11,                                      +        
               ATTR=(NUM,PROT)                                                  
STA06    DFLD  POS=(6,54),LTH=2,                                       +        
               ATTR=(PROT)                                                      
TOTVOL   DFLD  POS=(6,59),LTH=8,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
TOTWGT   DFLD  POS=(6,68),LTH=8,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DST07    DFLD  POS=(7,3),LTH=4,                                        +        
               ATTR=(NUM,PROT)                                                  
KND07    DFLD  POS=(7,8),LTH=6,                                        +        
               ATTR=(NUM,PROT)                                                  
ORD07    DFLD  POS=(7,15),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
VOL07    DFLD  POS=(7,23),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
WGT07    DFLD  POS=(7,32),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
RFS07    DFLD  POS=(7,41),LTH=11,                                      +        
               ATTR=(NUM,PROT)                                                  
STA07    DFLD  POS=(7,54),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DST08    DFLD  POS=(8,3),LTH=4,                                        +        
               ATTR=(NUM,PROT)                                                  
KND08    DFLD  POS=(8,8),LTH=6,                                        +        
               ATTR=(NUM,PROT)                                                  
ORD08    DFLD  POS=(8,15),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
VOL08    DFLD  POS=(8,23),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
WGT08    DFLD  POS=(8,32),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
RFS08    DFLD  POS=(8,41),LTH=11,                                      +        
               ATTR=(NUM,PROT)                                                  
STA08    DFLD  POS=(8,54),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DST09    DFLD  POS=(9,3),LTH=4,                                        +        
               ATTR=(NUM,PROT)                                                  
KND09    DFLD  POS=(9,8),LTH=6,                                        +        
               ATTR=(NUM,PROT)                                                  
ORD09    DFLD  POS=(9,15),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
VOL09    DFLD  POS=(9,23),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
WGT09    DFLD  POS=(9,32),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
RFS09    DFLD  POS=(9,41),LTH=11,                                      +        
               ATTR=(NUM,PROT)                                                  
STA09    DFLD  POS=(9,54),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DST10    DFLD  POS=(10,3),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
KND10    DFLD  POS=(10,8),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
ORD10    DFLD  POS=(10,15),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
VOL10    DFLD  POS=(10,23),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
WGT10    DFLD  POS=(10,32),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
RFS10    DFLD  POS=(10,41),LTH=11,                                     +        
               ATTR=(NUM,PROT)                                                  
STA10    DFLD  POS=(10,54),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DST11    DFLD  POS=(11,3),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
KND11    DFLD  POS=(11,8),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
ORD11    DFLD  POS=(11,15),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
VOL11    DFLD  POS=(11,23),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
WGT11    DFLD  POS=(11,32),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
RFS11    DFLD  POS=(11,41),LTH=11,                                     +        
               ATTR=(NUM,PROT)                                                  
STA11    DFLD  POS=(11,54),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DST12    DFLD  POS=(12,3),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
KND12    DFLD  POS=(12,8),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
ORD12    DFLD  POS=(12,15),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
VOL12    DFLD  POS=(12,23),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
WGT12    DFLD  POS=(12,32),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
RFS12    DFLD  POS=(12,41),LTH=11,                                     +        
               ATTR=(NUM,PROT)                                                  
STA12    DFLD  POS=(12,54),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DST13    DFLD  POS=(13,3),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
KND13    DFLD  POS=(13,8),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
ORD13    DFLD  POS=(13,15),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
VOL13    DFLD  POS=(13,23),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
WGT13    DFLD  POS=(13,32),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
RFS13    DFLD  POS=(13,41),LTH=11,                                     +        
               ATTR=(NUM,PROT)                                                  
STA13    DFLD  POS=(13,54),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DST14    DFLD  POS=(14,3),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
KND14    DFLD  POS=(14,8),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
ORD14    DFLD  POS=(14,15),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
VOL14    DFLD  POS=(14,23),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
WGT14    DFLD  POS=(14,32),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
RFS14    DFLD  POS=(14,41),LTH=11,                                     +        
               ATTR=(NUM,PROT)                                                  
STA14    DFLD  POS=(14,54),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DST15    DFLD  POS=(15,3),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
KND15    DFLD  POS=(15,8),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
ORD15    DFLD  POS=(15,15),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
VOL15    DFLD  POS=(15,23),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
WGT15    DFLD  POS=(15,32),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
RFS15    DFLD  POS=(15,41),LTH=11,                                     +        
               ATTR=(NUM,PROT)                                                  
STA15    DFLD  POS=(15,54),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DST16    DFLD  POS=(16,3),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
KND16    DFLD  POS=(16,8),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
ORD16    DFLD  POS=(16,15),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
VOL16    DFLD  POS=(16,23),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
WGT16    DFLD  POS=(16,32),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
RFS16    DFLD  POS=(16,41),LTH=11,                                     +        
               ATTR=(NUM,PROT)                                                  
STA16    DFLD  POS=(16,54),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DST17    DFLD  POS=(17,3),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
KND17    DFLD  POS=(17,8),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
ORD17    DFLD  POS=(17,15),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
VOL17    DFLD  POS=(17,23),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
WGT17    DFLD  POS=(17,32),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
RFS17    DFLD  POS=(17,41),LTH=11,                                     +        
               ATTR=(NUM,PROT)                                                  
STA17    DFLD  POS=(17,54),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DST18    DFLD  POS=(18,3),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
KND18    DFLD  POS=(18,8),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
ORD18    DFLD  POS=(18,15),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
VOL18    DFLD  POS=(18,23),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
WGT18    DFLD  POS=(18,32),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
RFS18    DFLD  POS=(18,41),LTH=11,                                     +        
               ATTR=(NUM,PROT)                                                  
STA18    DFLD  POS=(18,54),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DST19    DFLD  POS=(19,3),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
KND19    DFLD  POS=(19,8),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
ORD19    DFLD  POS=(19,15),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
VOL19    DFLD  POS=(19,23),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
WGT19    DFLD  POS=(19,32),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
RFS19    DFLD  POS=(19,41),LTH=11,                                     +        
               ATTR=(NUM,PROT)                                                  
STA19    DFLD  POS=(19,54),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '13 Synch PRC Stat 14 Synch PRC lines 15 Plan dayorders +        
               16 Manning PRC 17 TRP Vol',                             +        
               POS=(21,2),LTH=79,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18 Plan bulk time 19 Plan bulk lines 20 Order lists    +        
               21 Picker-shif 10 WHELP  ',                             +        
               POS=(22,2),LTH=79,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  ' VCAS',POS=(23,58)                                              
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W4I385N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N385,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4O385N1                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F8'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '43852',                                                +        
               LTH=5                                                            
         MFLD  (DGIA0000,                                              +        
               '+++++'),                                               +        
               LTH=5                                                            
         MFLD  DGIA0001,                                               +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DCI,                                                   +        
               '++'),                                                  +        
               LTH=2                                                            
         MFLD  DCO,                                                    +        
               LTH=2                                                   +        
               FILL=X'40'                                                       
         MFLD  PFE,                                                    +        
               LTH=12,                                                 +        
               FILL=X'40'                                                       
         MFLD  PF8,                                                    +        
               LTH=12,                                                 +        
               FILL=X'40'                                                       
         MFLD  TOTVOL,                                                 +        
               LTH=8                                                            
         MFLD  TOTWGT,                                                 +        
               LTH=8                                                            
         MSGEND                                                                 
W4O385N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N385,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I385N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  DGIA0000,                                               +        
               LTH=5                                                            
         MFLD  DCI,                                                    +        
               LTH=2                                                            
         MFLD  DGIA0001,                                               +        
               LTH=5                                                            
         MFLD  DCO,                                                    +        
               LTH=2                                                            
         MFLD  PFE,                                                    +        
               LTH=12                                                           
         MFLD  PF8,                                                    +        
               LTH=12                                                           
         MFLD  TOTVOL,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TOTWGT,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DST06,                                                  +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KND06,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ORD06,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VOL06,                                                  +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  WGT06,                                                  +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  RFS06,                                                  +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  STA06,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DST07,                                                  +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KND07,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ORD07,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VOL07,                                                  +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  WGT07,                                                  +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  RFS07,                                                  +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  STA07,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DST08,                                                  +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KND08,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ORD08,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VOL08,                                                  +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  WGT08,                                                  +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  RFS08,                                                  +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  STA08,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DST09,                                                  +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KND09,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ORD09,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VOL09,                                                  +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  WGT09,                                                  +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  RFS09,                                                  +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  STA09,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DST10,                                                  +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KND10,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ORD10,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VOL10,                                                  +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  WGT10,                                                  +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  RFS10,                                                  +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  STA10,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DST11,                                                  +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KND11,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ORD11,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VOL11,                                                  +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  WGT11,                                                  +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  RFS11,                                                  +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  STA11,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DST12,                                                  +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KND12,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ORD12,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VOL12,                                                  +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  WGT12,                                                  +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  RFS12,                                                  +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  STA12,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DST13,                                                  +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KND13,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ORD13,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VOL13,                                                  +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  WGT13,                                                  +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  RFS13,                                                  +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  STA13,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DST14,                                                  +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KND14,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ORD14,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VOL14,                                                  +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  WGT14,                                                  +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  RFS14,                                                  +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  STA14,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DST15,                                                  +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KND15,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ORD15,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VOL15,                                                  +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  WGT15,                                                  +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  RFS15,                                                  +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  STA15,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DST16,                                                  +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KND16,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ORD16,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VOL16,                                                  +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  WGT16,                                                  +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  RFS16,                                                  +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  STA16,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DST17,                                                  +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KND17,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ORD17,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VOL17,                                                  +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  WGT17,                                                  +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  RFS17,                                                  +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  STA17,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DST18,                                                  +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KND18,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ORD18,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VOL18,                                                  +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  WGT18,                                                  +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  RFS18,                                                  +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  STA18,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DST19,                                                  +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KND19,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ORD19,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VOL19,                                                  +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  WGT19,                                                  +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  RFS19,                                                  +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  STA19,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
