***********************************************************************         
* CREATED BY PC36147   ON 95/10/17  AT 15:22                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'UTSKRIFT AV PLOCKSATS           '                               
W4N351   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T351  ',                                          +        
               14='W4T352  ',                                          +        
               15='W4T353  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W4T356  ',                                          +        
               19='W4T357  ',                                          +        
               20='W0T501  ',                                          +        
               21='W4T359  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((2,9)),                                         +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Printing of Picking Unit',                             +        
               POS=(1,12),LTH=24,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'PRC',                                                  +        
               POS=(2,4),LTH=3,                                        +        
               ATTR=(PROT)                                                      
DGIA0004 DFLD  POS=(2,9),LTH=4,                                        +        
               ATTR=(NOPROT)                                                    
         DFLD  'Picker',                                               +        
               POS=(2,14),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0006 DFLD  POS=(2,22),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Table',                                                +        
               POS=(2,31),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0002 DFLD  POS=(2,37),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DC',                                                   +        
               POS=(2,42),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DCI      DFLD  POS=(2,46),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'PR print',                                             +        
               POS=(2,53),LTH=8,                                       +        
               ATTR=(PROT)                                                      
IDPRTPU  DFLD  POS=(2,62),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'LBL print',                                            +        
               POS=(2,67),LTH=9,                                       +        
               ATTR=(PROT)                                                      
IDPRTPLE DFLD  POS=(2,77),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0005 DFLD  POS=(3,9),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
DGIA0007 DFLD  POS=(3,22),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0003 DFLD  POS=(3,37),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
DCO      DFLD  POS=(3,46),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Ord/Picker',                                           +        
               POS=(5,2),LTH=10,                                       +        
               ATTR=(PROT)                                                      
FLORDKNY DFLD  POS=(5,13),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Mixed',                                                +        
               POS=(5,17),LTH=5,                                       +        
               ATTR=(PROT)                                                      
MIXAT    DFLD  POS=(5,23),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Printing of Incomplete PU',                            +        
               POS=(5,28),LTH=25,                                      +        
               ATTR=(PROT)                                                      
DGIA0008 DFLD  POS=(5,56),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Order',                                                +        
               POS=(8,2),LTH=5,                                        +        
               ATTR=(PROT)                                                      
KVORDER  DFLD  POS=(8,9),LTH=7,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'Lines',                                                +        
               POS=(8,21),LTH=5,                                       +        
               ATTR=(PROT)                                                      
KVRADER  DFLD  POS=(8,30),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'PRC',                                                  +        
               POS=(8,40),LTH=3,                                       +        
               ATTR=(PROT)                                                      
IDPRC    DFLD  POS=(8,44),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Weight',                                               +        
               POS=(10,2),LTH=6,                                       +        
               ATTR=(PROT)                                                      
VKORDNTO DFLD  POS=(10,9),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Volume',                                               +        
               POS=(10,21),LTH=6,                                      +        
               ATTR=(PROT)                                                      
VLORDNTO DFLD  POS=(10,28),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Packing instr.',                                       +        
               POS=(13,2),LTH=14,                                      +        
               ATTR=(PROT)                                                      
BEFDKRAV DFLD  POS=(13,19),LTH=40,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Warehouse inst.',                                      +        
               POS=(14,2),LTH=15,                                      +        
               ATTR=(PROT)                                                      
DGIA0000 DFLD  POS=(14,19),LTH=60,                                     +        
               ATTR=(PROT)                                                      
DGIA0001 DFLD  POS=(15,19),LTH=60,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '13 Printing PU   14 O-queue PRC   15 Manual Print 16', +        
               POS=(21,2),LTH=52,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,70),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18 Lines Special 19 Order Per PRC 20',                 +        
               POS=(22,2),LTH=36,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21 Can Print ord  22',                                 +        
               POS=(22,52),LTH=20,                                     +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4I351N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N351),                                           +        
               OPT=2,                                                  +        
               NXT=W4O351N1                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  ' ',                                                    +        
               LTH=2                                                            
         MFLD  '43512',                                                +        
               LTH=5                                                            
         MFLD  (DGIA0004,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  DGIA0005,                                               +        
               LTH=4                                                            
         MFLD  (DGIA0006,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0007,                                               +        
               LTH=8                                                            
         MFLD  (DGIA0002,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0003,                                               +        
               LTH=3                                                            
         MFLD  (DCI,                                                   +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  DCO,                                                    +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (IDPRTPU,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDPRTPLE,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  FLORDKNY,                                               +        
               LTH=1,                                                  +        
               FILL=X'D5'                                                       
         MFLD  MIXAT,                                                  +        
               LTH=1,                                                  +        
               FILL=X'D5'                                                       
         MFLD  DGIA0008,                                               +        
               LTH=1,                                                  +        
               FILL=X'D5'                                                       
         MFLD  '+++++++++++++++++++++++++++++++++++++',                +        
               LTH=37                                                           
         MSGEND                                                                 
W4O351N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N351,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I351N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  DGIA0004,                                               +        
               LTH=2                                                            
         MFLD  DGIA0005,                                               +        
               LTH=4                                                            
         MFLD  DGIA0006,                                               +        
               LTH=2                                                            
         MFLD  DGIA0007,                                               +        
               LTH=8                                                            
         MFLD  DGIA0002,                                               +        
               LTH=2                                                            
         MFLD  DGIA0003,                                               +        
               LTH=3                                                            
         MFLD  DCI,                                                    +        
               LTH=2                                                            
         MFLD  DCO,                                                    +        
               LTH=2                                                            
         MFLD  IDPRTPU,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDPRTPLE,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLORDKNY,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  MIXAT,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0008,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVORDER,                                                +        
               LTH=7                                                            
         MFLD  KVRADER,                                                +        
               LTH=5                                                            
         MFLD  IDPRC,                                                  +        
               LTH=4                                                            
         MFLD  VKORDNTO,                                               +        
               LTH=8                                                            
         MFLD  VLORDNTO,                                               +        
               LTH=8                                                            
         MFLD  BEFDKRAV,                                               +        
               LTH=40                                                           
         MFLD  DGIA0000,                                               +        
               LTH=60                                                           
         MFLD  DGIA0001,                                               +        
               LTH=60                                                           
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
