***********************************************************************         
* CREATED BY PCC8448   ON 99/05/11  AT 11:35                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE '                                '                               
W4N314   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T311  ',                                          +        
               14='W4T312  ',                                          +        
               15='W4T313  ',                                          +        
               16='W4T314  ',                                          +        
               17='W4T315  ',                                          +        
               18='W4T316  ',                                          +        
               19='W4T317  ',                                          +        
               20='W4T318U ',                                          +        
               21='W4T319  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,9)),                                         +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'CASE REPORTING 1',                                     +        
               POS=(1,10),LTH=16,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Picker',                                               +        
               POS=(2,2),LTH=6,                                        +        
               ATTR=(NUM,PROT)                                                  
FLD0210  DFLD  POS=(2,9),LTH=5,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Distr',                                                +        
               POS=(2,15),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0222  DFLD  POS=(2,21),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Cust',                                                 +        
               POS=(2,26),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0232  DFLD  POS=(2,31),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Order',                                                +        
               POS=(2,38),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0245  DFLD  POS=(2,44),LTH=5,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Case',                                                 +        
               POS=(2,50),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0259  DFLD  POS=(2,56),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Prod',                                                 +        
               POS=(2,62),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0007 DFLD  POS=(2,67),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DC',                                                   +        
               POS=(2,75),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0001 DFLD  POS=(2,78),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DGIA0009 DFLD  POS=(3,9),LTH=5,                                        +        
               ATTR=(PROT,MOD)                                                  
DGIA0003 DFLD  POS=(3,21),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0005 DFLD  POS=(3,31),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0006 DFLD  POS=(3,44),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0004 DFLD  POS=(3,56),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0008 DFLD  POS=(3,67),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0002 DFLD  POS=(3,78),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0460  DFLD  POS=(4,60),LTH=4,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'Last case   Y/N:',                                     +        
               POS=(5,2),LTH=16,                                       +        
               ATTR=(PROT)                                                      
FLD0519  DFLD  POS=(5,19),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Continue reporting in this case  Y/N:',                +        
               POS=(5,24),LTH=37,                                      +        
               ATTR=(PROT)                                                      
FLD0558  DFLD  POS=(5,62),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
FLD0605  DFLD  POS=(6,5),LTH=4,                                        +        
               ATTR=(PROT)                                                      
FLD0614  DFLD  POS=(6,14),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FLD0624  DFLD  POS=(6,24),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Line-from Line-to  Qty in case',                       +        
               POS=(7,2),LTH=30,                                       +        
               ATTR=(PROT)                                                      
DGIA0000 DFLD  POS=(7,34),LTH=2,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'DN-Print:',                                            +        
               POS=(7,37),LTH=9,                                       +        
               ATTR=(PROT)                                                      
DGIA0010 DFLD  POS=(7,47),LTH=2,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Gross wt',                                             +        
               POS=(7,50),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FLD0625  DFLD  POS=(7,59),LTH=8,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0011 DFLD  POS=(7,68),LTH=8,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
COL0508  DFLD  POS=(8,5),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(8,11),LTH=1,                                       +        
               ATTR=(PROT)                                                      
COL1408  DFLD  POS=(8,14),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL2408  DFLD  POS=(8,24),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL0509  DFLD  POS=(9,5),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(9,11),LTH=1,                                       +        
               ATTR=(PROT)                                                      
COL1409  DFLD  POS=(9,14),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL2409  DFLD  POS=(9,24),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL0510  DFLD  POS=(10,5),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(10,11),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL1410  DFLD  POS=(10,14),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL2410  DFLD  POS=(10,24),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL0511  DFLD  POS=(11,5),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(11,11),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL1411  DFLD  POS=(11,14),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL2411  DFLD  POS=(11,24),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL0512  DFLD  POS=(12,5),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(12,11),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL1412  DFLD  POS=(12,14),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL2412  DFLD  POS=(12,24),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL0513  DFLD  POS=(13,5),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(13,11),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL1413  DFLD  POS=(13,14),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL2413  DFLD  POS=(13,24),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL0514  DFLD  POS=(14,5),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(14,11),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL1414  DFLD  POS=(14,14),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL2414  DFLD  POS=(14,24),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL0515  DFLD  POS=(15,5),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(15,11),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL1415  DFLD  POS=(15,14),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL2415  DFLD  POS=(15,24),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL0516  DFLD  POS=(16,5),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(16,11),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL1416  DFLD  POS=(16,14),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL2416  DFLD  POS=(16,24),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL0517  DFLD  POS=(17,5),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(17,11),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL1417  DFLD  POS=(17,14),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL2417  DFLD  POS=(17,24),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL0518  DFLD  POS=(18,5),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(18,11),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL1418  DFLD  POS=(18,14),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL2418  DFLD  POS=(18,24),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL0519  DFLD  POS=(19,5),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(19,11),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL1419  DFLD  POS=(19,14),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL2419  DFLD  POS=(19,24),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '13 Split of ord 14 Split/Update 15 Case rep 3    16 Cas+        
               e rep 1  17 Case rep 2',                                +        
               POS=(21,2),LTH=77,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18 Case correct 19 Origin',                            +        
               POS=(22,2),LTH=25,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20 Control',                                           +        
               POS=(22,34),LTH=10,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,51),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4O314N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N314,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I314N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  FLD0210,                                                +        
               LTH=2                                                            
         MFLD  DGIA0009,                                               +        
               LTH=5                                                            
         MFLD  FLD0222,                                                +        
               LTH=2                                                            
         MFLD  DGIA0003,                                               +        
               LTH=4                                                            
         MFLD  FLD0232,                                                +        
               LTH=2                                                            
         MFLD  DGIA0005,                                               +        
               LTH=6                                                            
         MFLD  FLD0245,                                                +        
               LTH=2                                                            
         MFLD  DGIA0006,                                               +        
               LTH=5                                                            
         MFLD  FLD0259,                                                +        
               LTH=2                                                            
         MFLD  DGIA0004,                                               +        
               LTH=5                                                            
         MFLD  DGIA0007,                                               +        
               LTH=2                                                            
         MFLD  DGIA0008,                                               +        
               LTH=7                                                            
         MFLD  DGIA0001,                                               +        
               LTH=2                                                            
         MFLD  DGIA0002,                                               +        
               LTH=2                                                            
         MFLD  FLD0460,                                                +        
               LTH=4                                                            
         MFLD  FLD0519,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0558,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0605,                                                +        
               LTH=4                                                            
         MFLD  FLD0614,                                                +        
               LTH=4                                                            
         MFLD  FLD0624,                                                +        
               LTH=6                                                            
         MFLD  DGIA0000,                                               +        
               LTH=2                                                            
         MFLD  DGIA0010,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0508,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1408,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2408,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0509,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1409,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2409,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0510,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1410,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2410,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0511,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1411,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2411,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0512,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1412,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2412,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0513,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1413,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2413,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0514,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1414,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2414,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0515,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1415,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2415,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0516,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1416,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2416,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0517,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1417,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2417,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0518,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1418,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2418,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0519,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1419,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2419,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0625,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0011,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I314N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N314),                                           +        
               OPT=2,                                                  +        
               NXT=W4O314N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '43142',                                                +        
               LTH=5                                                            
         MFLD  (FLD0210,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0009,                                               +        
               LTH=5                                                            
         MFLD  (FLD0222,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0003,                                               +        
               LTH=4                                                            
         MFLD  (FLD0232,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0005,                                               +        
               LTH=6                                                            
         MFLD  (FLD0245,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0006,                                               +        
               LTH=5                                                            
         MFLD  (FLD0259,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0004,                                               +        
               LTH=5                                                            
         MFLD  (DGIA0007,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0008,                                               +        
               LTH=7                                                            
         MFLD  (DGIA0001,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  DGIA0002,                                               +        
               LTH=2                                                            
         MFLD  FLD0460,                                                +        
               LTH=4,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0519,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0558,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0605,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0614,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0624,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0000,                                               +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0010,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL0508,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1408,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2408,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0509,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1409,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2409,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0510,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1410,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2410,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0511,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1411,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2411,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0512,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1412,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2412,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0513,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1413,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2413,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0514,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1414,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2414,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0515,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1415,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2415,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0516,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1416,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2416,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0517,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1417,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2417,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0518,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1418,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2418,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0519,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1419,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2419,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0625,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0011,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
