***********************************************************************         
* CREATED BY V036147   ON 00/09/11  AT 09:01                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE '                                '                               
W4N333   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W4T333 4',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T333 4',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T331  ',                                          +        
               14='W4T332  ',                                          +        
               15='W4T333  ',                                          +        
               16='W4T334  ',                                          +        
               17='W4T335  ',                                          +        
               18='W4T336  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,8)),                                         +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'INFO/PRINTOUT CASE LABEL',                             +        
               POS=(1,10),LTH=24,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD0140  DFLD  POS=(1,40),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Distr',                                                +        
               POS=(2,2),LTH=5,                                        +        
               ATTR=(PROT)                                                      
FLD0208  DFLD  POS=(2,8),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Cust',                                                 +        
               POS=(2,14),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FLD0219  DFLD  POS=(2,19),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Order',                                                +        
               POS=(2,27),LTH=5,                                       +        
               ATTR=(PROT)                                                      
FLD0233  DFLD  POS=(2,33),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Case',                                                 +        
               POS=(2,41),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FLD0248  DFLD  POS=(2,48),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DC',                                                   +        
               POS=(2,54),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DCI      DFLD  POS=(2,58),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Prod',                                                 +        
               POS=(2,62),LTH=4,                                       +        
               ATTR=(PROT)                                                      
PRODNRIN DFLD  POS=(2,67),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
FLD0308  DFLD  POS=(3,8),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
FLD0319  DFLD  POS=(3,19),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0333  DFLD  POS=(3,33),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0348  DFLD  POS=(3,48),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
DCO      DFLD  POS=(3,58),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
PRODNRUT DFLD  POS=(3,67),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Printer',                                              +        
               POS=(5,2),LTH=7,                                        +        
               ATTR=(PROT)                                                      
FLD0510  DFLD  POS=(5,10),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
FLD0610  DFLD  POS=(6,10),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Area',                                                 +        
               POS=(8,4),LTH=4,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'Loading Area   Square',                                +        
               POS=(8,15),LTH=21,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Left',                                                 +        
               POS=(8,42),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Right    FC',                                          +        
               POS=(8,51),LTH=11,                                      +        
               ATTR=(PROT)                                                      
FLD0905  DFLD  POS=(9,5),LTH=3,                                        +        
               ATTR=(PROT,MOD)                                                  
FLD0920  DFLD  POS=(9,20),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0932  DFLD  POS=(9,32),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0943  DFLD  POS=(9,43),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0952  DFLD  POS=(9,52),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0962  DFLD  POS=(9,62),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  '13 Strapping',                                         +        
               POS=(21,2),LTH=12,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '14 Correct',                                           +        
               POS=(21,19),LTH=10,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '15 Info',                                              +        
               POS=(21,34),LTH=7,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16 Move Cases   17 Coll. Case',                        +        
               POS=(21,50),LTH=29,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '18 Corr Coll Cse 19',                                  +        
               POS=(22,2),LTH=19,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4O333N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N333,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I333N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0140,                                                +        
               LTH=40                                                           
         MFLD  FLD0208,                                                +        
               LTH=2                                                            
         MFLD  FLD0308,                                                +        
               LTH=4                                                            
         MFLD  FLD0219,                                                +        
               LTH=2                                                            
         MFLD  FLD0319,                                                +        
               LTH=6                                                            
         MFLD  FLD0233,                                                +        
               LTH=2                                                            
         MFLD  FLD0333,                                                +        
               LTH=5                                                            
         MFLD  FLD0248,                                                +        
               LTH=2                                                            
         MFLD  FLD0348,                                                +        
               LTH=5                                                            
         MFLD  DCI,                                                    +        
               LTH=2                                                            
         MFLD  DCO,                                                    +        
               LTH=2                                                            
         MFLD  PRODNRIN,                                               +        
               LTH=2                                                            
         MFLD  PRODNRUT,                                               +        
               LTH=7                                                            
         MFLD  FLD0510,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0610,                                                +        
               LTH=2                                                            
         MFLD  FLD0905,                                                +        
               LTH=3                                                            
         MFLD  FLD0920,                                                +        
               LTH=3                                                            
         MFLD  FLD0932,                                                +        
               LTH=3                                                            
         MFLD  FLD0943,                                                +        
               LTH=3                                                            
         MFLD  FLD0952,                                                +        
               LTH=3                                                            
         MFLD  FLD0962,                                                +        
               LTH=2                                                            
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I333N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N333),                                           +        
               OPT=2,                                                  +        
               NXT=W4O333N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '43332',                                                +        
               LTH=5                                                            
         MFLD  (FLD0208,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0308,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0219,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0319,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0233,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0333,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0248,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0348,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (DCI,                                                   +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  DCO,                                                    +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (PRODNRIN,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  PRODNRUT,                                               +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0510,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  FLD0610,                                                +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
