***********************************************************************         
* CREATED BY PC36147   ON 94/12/08  AT 11:05                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'ORDERSPLIT PER PRC              '                               
W4N357   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W4T357 7',                                           +        
               8='W4T357 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T357U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T351  ',                                          +        
               14='W4T352  ',                                          +        
               15='W4T353  ',                                          +        
               16='W4T354  ',                                          +        
               17='W4T355  ',                                          +        
               18='W4T356  ',                                          +        
               19='W4T357  ',                                          +        
               20='W4T358  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W4T357U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((2,7)),                                         +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Orders Split Per PRC',                                 +        
               POS=(1,12),LTH=20,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Dist',                                                 +        
               POS=(2,2),LTH=4,                                        +        
               ATTR=(ALPHA,PROT)                                                
IDDISTRI DFLD  POS=(2,7),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Cust',                                                 +        
               POS=(2,12),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
IDKUNDI  DFLD  POS=(2,17),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Order',                                                +        
               POS=(2,24),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
IDORDNRI DFLD  POS=(2,30),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'PNo',                                                  +        
               POS=(2,38),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
IDPRODIN DFLD  POS=(2,42),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DC',                                                   +        
               POS=(2,50),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0000 DFLD  POS=(2,53),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
IDDISTRO DFLD  POS=(3,7),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
IDKUNDO  DFLD  POS=(3,17),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
IDORDNRO DFLD  POS=(3,30),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
IDPRODUT DFLD  POS=(3,42),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0001 DFLD  POS=(3,53),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
FIRST    DFLD  POS=(4,2),LTH=17,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
ENTER    DFLD  POS=(4,20),LTH=17,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
NEXT     DFLD  POS=(4,38),LTH=17,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
         DFLD  'Trp.Id',                                               +        
               POS=(5,2),LTH=6,                                        +        
               ATTR=(PROT)                                                      
IDTRP    DFLD  POS=(5,9),LTH=5,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'Trp.dep.time',                                         +        
               POS=(5,15),LTH=12,                                      +        
               ATTR=(ALPHA,PROT)                                                
TRPAVG   DFLD  POS=(5,28),LTH=12,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'FC',                                                   +        
               POS=(5,41),LTH=2,                                       +        
               ATTR=(PROT)                                                      
KDFRAKT  DFLD  POS=(5,44),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Joined with',                                          +        
               POS=(5,47),LTH=11,                                      +        
               ATTR=(NUM,PROT)                                                  
IDKRFIHO DFLD  POS=(5,59),LTH=7,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Ln  PRC  S    Ol   Pck',                               +        
               POS=(6,2),LTH=22,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Weight',                                               +        
               POS=(6,26),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Volume',                                               +        
               POS=(6,34),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'LST',                                                  +        
               POS=(6,45),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'P-Time',                                               +        
               POS=(6,54),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'RFS',                                                  +        
               POS=(6,65),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Packer',                                               +        
               POS=(6,74),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0201  DFLD  POS=(7,2),LTH=3,                                        +        
               ATTR=(PROT,MOD)                                                  
FLD0601  DFLD  POS=(7,6),LTH=4,                                        +        
               ATTR=(NUM,PROT)                                                  
FLD1101  DFLD  POS=(7,11),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD1301  DFLD  POS=(7,13),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD1901  DFLD  POS=(7,19),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD2501  DFLD  POS=(7,25),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD3301  DFLD  POS=(7,33),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD4101  DFLD  POS=(7,41),LTH=12,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD5301  DFLD  POS=(7,54),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD6001  DFLD  POS=(7,61),LTH=12,                                      +        
               ATTR=(NUM,PROT)                                                  
IDUSER1  DFLD  POS=(7,74),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0202  DFLD  POS=(8,2),LTH=3,                                        +        
               ATTR=(PROT,MOD)                                                  
FLD0602  DFLD  POS=(8,6),LTH=4,                                        +        
               ATTR=(NUM,PROT)                                                  
FLD1102  DFLD  POS=(8,11),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD1302  DFLD  POS=(8,13),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD1902  DFLD  POS=(8,19),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD2502  DFLD  POS=(8,25),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD3302  DFLD  POS=(8,33),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD4102  DFLD  POS=(8,41),LTH=12,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD5302  DFLD  POS=(8,54),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD6002  DFLD  POS=(8,61),LTH=12,                                      +        
               ATTR=(NUM,PROT)                                                  
IDUSER2  DFLD  POS=(8,74),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0203  DFLD  POS=(9,2),LTH=3,                                        +        
               ATTR=(PROT,MOD)                                                  
FLD0603  DFLD  POS=(9,6),LTH=4,                                        +        
               ATTR=(NUM,PROT)                                                  
FLD1103  DFLD  POS=(9,11),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD1303  DFLD  POS=(9,13),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD1903  DFLD  POS=(9,19),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD2503  DFLD  POS=(9,25),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD3303  DFLD  POS=(9,33),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD4103  DFLD  POS=(9,41),LTH=12,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD5303  DFLD  POS=(9,54),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD6003  DFLD  POS=(9,61),LTH=12,                                      +        
               ATTR=(NUM,PROT)                                                  
IDUSER3  DFLD  POS=(9,74),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0204  DFLD  POS=(10,2),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0604  DFLD  POS=(10,6),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD1104  DFLD  POS=(10,11),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1304  DFLD  POS=(10,13),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1904  DFLD  POS=(10,19),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD2504  DFLD  POS=(10,25),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD3304  DFLD  POS=(10,33),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD4104  DFLD  POS=(10,41),LTH=12,                                     +        
               ATTR=(NUM,PROT)                                                  
FLD5304  DFLD  POS=(10,54),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD6004  DFLD  POS=(10,61),LTH=12,                                     +        
               ATTR=(NUM,PROT)                                                  
IDUSER4  DFLD  POS=(10,74),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD0205  DFLD  POS=(11,2),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0605  DFLD  POS=(11,6),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD1105  DFLD  POS=(11,11),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1305  DFLD  POS=(11,13),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1905  DFLD  POS=(11,19),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD2505  DFLD  POS=(11,25),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD3305  DFLD  POS=(11,33),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD4105  DFLD  POS=(11,41),LTH=12,                                     +        
               ATTR=(NUM,PROT)                                                  
FLD5305  DFLD  POS=(11,54),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD6005  DFLD  POS=(11,61),LTH=12,                                     +        
               ATTR=(NUM,PROT)                                                  
IDUSER5  DFLD  POS=(11,74),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD0206  DFLD  POS=(12,2),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0606  DFLD  POS=(12,6),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD1106  DFLD  POS=(12,11),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1306  DFLD  POS=(12,13),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1906  DFLD  POS=(12,19),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD2506  DFLD  POS=(12,25),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD3306  DFLD  POS=(12,33),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD4106  DFLD  POS=(12,41),LTH=12,                                     +        
               ATTR=(NUM,PROT)                                                  
FLD5306  DFLD  POS=(12,54),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD6006  DFLD  POS=(12,61),LTH=12,                                     +        
               ATTR=(NUM,PROT)                                                  
IDUSER6  DFLD  POS=(12,74),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD0207  DFLD  POS=(13,2),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0607  DFLD  POS=(13,6),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD1107  DFLD  POS=(13,11),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1307  DFLD  POS=(13,13),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1907  DFLD  POS=(13,19),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD2507  DFLD  POS=(13,25),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD3307  DFLD  POS=(13,33),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD4107  DFLD  POS=(13,41),LTH=12,                                     +        
               ATTR=(NUM,PROT)                                                  
FLD5307  DFLD  POS=(13,54),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD6007  DFLD  POS=(13,61),LTH=12,                                     +        
               ATTR=(NUM,PROT)                                                  
IDUSER7  DFLD  POS=(13,74),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD0208  DFLD  POS=(14,2),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0608  DFLD  POS=(14,6),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD1108  DFLD  POS=(14,11),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1308  DFLD  POS=(14,13),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1908  DFLD  POS=(14,19),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD2508  DFLD  POS=(14,25),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD3308  DFLD  POS=(14,33),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD4108  DFLD  POS=(14,41),LTH=12,                                     +        
               ATTR=(NUM,PROT)                                                  
FLD5308  DFLD  POS=(14,54),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD6008  DFLD  POS=(14,61),LTH=12,                                     +        
               ATTR=(NUM,PROT)                                                  
IDUSER8  DFLD  POS=(14,74),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD0209  DFLD  POS=(15,2),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0609  DFLD  POS=(15,6),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD1109  DFLD  POS=(15,11),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1309  DFLD  POS=(15,13),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1909  DFLD  POS=(15,19),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD2509  DFLD  POS=(15,25),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD3309  DFLD  POS=(15,33),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD4109  DFLD  POS=(15,41),LTH=12,                                     +        
               ATTR=(NUM,PROT)                                                  
FLD5309  DFLD  POS=(15,54),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD6009  DFLD  POS=(15,61),LTH=12,                                     +        
               ATTR=(NUM,PROT)                                                  
IDUSER9  DFLD  POS=(15,74),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD0210  DFLD  POS=(16,2),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0610  DFLD  POS=(16,6),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD1110  DFLD  POS=(16,11),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1310  DFLD  POS=(16,13),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1910  DFLD  POS=(16,19),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD2510  DFLD  POS=(16,25),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD3310  DFLD  POS=(16,33),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD4110  DFLD  POS=(16,41),LTH=12,                                     +        
               ATTR=(NUM,PROT)                                                  
FLD5310  DFLD  POS=(16,54),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD6010  DFLD  POS=(16,61),LTH=12,                                     +        
               ATTR=(NUM,PROT)                                                  
IDUSE10  DFLD  POS=(16,74),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD0211  DFLD  POS=(17,2),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0611  DFLD  POS=(17,6),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD1111  DFLD  POS=(17,11),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1311  DFLD  POS=(17,13),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1911  DFLD  POS=(17,19),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD2511  DFLD  POS=(17,25),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD3311  DFLD  POS=(17,33),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD4111  DFLD  POS=(17,41),LTH=12,                                     +        
               ATTR=(NUM,PROT)                                                  
FLD5311  DFLD  POS=(17,54),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD6011  DFLD  POS=(17,61),LTH=12,                                     +        
               ATTR=(NUM,PROT)                                                  
IDUSE11  DFLD  POS=(17,74),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD0212  DFLD  POS=(18,2),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0612  DFLD  POS=(18,6),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD1112  DFLD  POS=(18,11),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1312  DFLD  POS=(18,13),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1912  DFLD  POS=(18,19),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD2512  DFLD  POS=(18,25),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD3312  DFLD  POS=(18,33),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD4112  DFLD  POS=(18,41),LTH=12,                                     +        
               ATTR=(NUM,PROT)                                                  
FLD5312  DFLD  POS=(18,54),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD6012  DFLD  POS=(18,61),LTH=12,                                     +        
               ATTR=(NUM,PROT)                                                  
IDUSE12  DFLD  POS=(18,74),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
IDPLKLST DFLD  POS=(19,2),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
TIAAMMDD DFLD  POS=(19,57),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
TIHHMM   DFLD  POS=(19,64),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'All',                                                  +        
               POS=(19,70),LTH=3,                                      +        
               ATTR=(PROT)                                                      
YN       DFLD  POS=(19,75),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Y/N',                                                  +        
               POS=(19,77),LTH=3,                                      +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  '13 Printing PU ',                                      +        
               POS=(21,2),LTH=16,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '14 O-queue PRC  ',                                     +        
               POS=(21,19),LTH=16,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '15 Manual Print',                                      +        
               POS=(21,36),LTH=15,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '16',                                                   +        
               POS=(21,52),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,70),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18 Lines Special',                                     +        
               POS=(22,2),LTH=16,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '19 Order Per PRC',                                     +        
               POS=(22,19),LTH=16,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,36),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21 Can Print ord ',                                    +        
               POS=(22,52),LTH=17,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '22',                                                   +        
               POS=(22,70),LTH=2,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4I357N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N357),                                           +        
               NXT=W4O357N1                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F7'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '43572',                                                +        
               LTH=5                                                            
         MFLD  (IDDISTRI,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDDISTRO,                                               +        
               LTH=4                                                            
         MFLD  (IDKUNDI,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDKUNDO,                                                +        
               LTH=6                                                            
         MFLD  (IDORDNRI,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDORDNRO,                                               +        
               LTH=7                                                            
         MFLD  (IDPRODIN,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDPRODUT,                                               +        
               LTH=7                                                            
         MFLD  (DGIA0000,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  DGIA0001,                                               +        
               LTH=2                                                            
         MFLD  FIRST,                                                  +        
               LTH=17,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  ENTER,                                                  +        
               LTH=17,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  NEXT,                                                   +        
               LTH=17,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0201,                                                +        
               LTH=3                                                            
         MFLD  FLD0202,                                                +        
               LTH=3                                                            
         MFLD  FLD0203,                                                +        
               LTH=3                                                            
         MFLD  FLD0204,                                                +        
               LTH=3                                                            
         MFLD  FLD0205,                                                +        
               LTH=3                                                            
         MFLD  FLD0206,                                                +        
               LTH=3                                                            
         MFLD  FLD0207,                                                +        
               LTH=3                                                            
         MFLD  FLD0208,                                                +        
               LTH=3                                                            
         MFLD  FLD0209,                                                +        
               LTH=3                                                            
         MFLD  FLD0210,                                                +        
               LTH=3                                                            
         MFLD  FLD0211,                                                +        
               LTH=3                                                            
         MFLD  FLD0212,                                                +        
               LTH=3                                                            
         MFLD  (IDPLKLST,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TIAAMMDD,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TIHHMM,                                                +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (YN,                                                    +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
W4O357N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N357,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I357N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDDISTRI,                                               +        
               LTH=4                                                            
         MFLD  IDKUNDI,                                                +        
               LTH=6                                                            
         MFLD  IDORDNRI,                                               +        
               LTH=7                                                            
         MFLD  IDPRODIN,                                               +        
               LTH=7                                                            
         MFLD  DGIA0000,                                               +        
               LTH=2                                                            
         MFLD  IDDISTRO,                                               +        
               LTH=4                                                            
         MFLD  IDKUNDO,                                                +        
               LTH=6                                                            
         MFLD  IDORDNRO,                                               +        
               LTH=7                                                            
         MFLD  IDPRODUT,                                               +        
               LTH=7                                                            
         MFLD  DGIA0001,                                               +        
               LTH=2                                                            
         MFLD  FIRST,                                                  +        
               LTH=17                                                           
         MFLD  ENTER,                                                  +        
               LTH=17                                                           
         MFLD  NEXT,                                                   +        
               LTH=17                                                           
         MFLD  IDTRP,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TRPAVG,                                                 +        
               LTH=14,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDFRAKT,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDKRFIHO,                                               +        
               LTH=7                                                            
         MFLD  FLD0201,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0601,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1101,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1301,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1901,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2501,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD3301,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD4101,                                                +        
               LTH=14,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD5301,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD6001,                                                +        
               LTH=14,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDUSER1,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0202,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0602,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1102,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1302,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1902,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2502,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD3302,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD4102,                                                +        
               LTH=14,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD5302,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD6002,                                                +        
               LTH=14,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDUSER2,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0203,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0603,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1103,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1303,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1903,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2503,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD3303,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD4103,                                                +        
               LTH=14,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD5303,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD6003,                                                +        
               LTH=14,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDUSER3,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0204,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0604,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1104,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1304,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1904,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2504,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD3304,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD4104,                                                +        
               LTH=14,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD5304,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD6004,                                                +        
               LTH=14,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDUSER4,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0205,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0605,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1105,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1305,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1905,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2505,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD3305,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD4105,                                                +        
               LTH=14,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD5305,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD6005,                                                +        
               LTH=14,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDUSER5,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0206,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0606,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1106,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1306,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1906,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2506,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD3306,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD4106,                                                +        
               LTH=14,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD5306,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD6006,                                                +        
               LTH=14,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDUSER6,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0207,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0607,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1107,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1307,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1907,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2507,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD3307,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD4107,                                                +        
               LTH=14,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD5307,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD6007,                                                +        
               LTH=14,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDUSER7,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0208,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0608,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1108,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1308,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1908,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2508,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD3308,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD4108,                                                +        
               LTH=14,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD5308,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD6008,                                                +        
               LTH=14,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDUSER8,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0209,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0609,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1109,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1309,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1909,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2509,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD3309,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD4109,                                                +        
               LTH=14,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD5309,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD6009,                                                +        
               LTH=14,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDUSER9,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0210,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0610,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1110,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1310,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1910,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2510,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD3310,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD4110,                                                +        
               LTH=14,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD5310,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD6010,                                                +        
               LTH=14,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDUSE10,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0211,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0611,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1111,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1311,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1911,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2511,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD3311,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD4111,                                                +        
               LTH=14,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD5311,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD6011,                                                +        
               LTH=14,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDUSE11,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0212,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0612,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1112,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1312,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1912,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2512,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD3312,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD4112,                                                +        
               LTH=14,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD5312,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD6012,                                                +        
               LTH=14,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDUSE12,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDPLKLST,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TIAAMMDD,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TIHHMM,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  YN,                                                     +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
