***********************************************************************         
* CREATED BY PCC8448   ON 99/05/12  AT 09:09                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE '                                '                               
W4N337   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='W0T501  ',                                          +        
               11='W4T337U ',                                          +        
               12='W0T501  ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='W0T501  ',                                          +        
               23='W0T501  ',                                          +        
               24='W0T501  ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((8,15)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,PROT)                                                  
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,PROT)                                                  
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'WEIGHTREPORT STRAPPINGSTATION',                        +        
               POS=(1,10),LTH=29,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD0140  DFLD  POS=(1,40),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Distr',                                                +        
               POS=(2,2),LTH=5,                                        +        
               ATTR=(PROT)                                                      
FLD0208  DFLD  POS=(2,8),LTH=4,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'Cust',                                                 +        
               POS=(2,14),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FLD0219  DFLD  POS=(2,19),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Order',                                                +        
               POS=(2,27),LTH=5,                                       +        
               ATTR=(PROT)                                                      
FLD0233  DFLD  POS=(2,33),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'CaseNO',                                               +        
               POS=(2,41),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0248  DFLD  POS=(2,48),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'DC',                                                   +        
               POS=(2,55),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DGIA0000 DFLD  POS=(2,58),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FLD0308  DFLD  POS=(3,8),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
FLD0319  DFLD  POS=(3,19),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0333  DFLD  POS=(3,33),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0348  DFLD  POS=(3,48),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0001 DFLD  POS=(3,58),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0406  DFLD  POS=(4,6),LTH=7,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0414  DFLD  POS=(4,14),LTH=2,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
FLD0510  DFLD  POS=(5,10),LTH=2,                                       +        
               ATTR=(PROT,NODISP)                                               
FLD0610  DFLD  POS=(6,10),LTH=2,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'Grossweight',                                          +        
               POS=(8,2),LTH=11,                                       +        
               ATTR=(PROT)                                                      
FLD0813  DFLD  POS=(8,15),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
FLD1502  DFLD  POS=(15,2),LTH=7,                                       +        
               ATTR=(PROT,NODISP)                                               
FLD1510  DFLD  POS=(15,10),LTH=3,                                      +        
               ATTR=(NUM,PROT,NODISP)                                           
FLD1514  DFLD  POS=(15,14),LTH=3,                                      +        
               ATTR=(NUM,PROT,NODISP)                                           
FLD1518  DFLD  POS=(15,18),LTH=3,                                      +        
               ATTR=(NUM,PROT,NODISP)                                           
FLD1522  DFLD  POS=(15,22),LTH=3,                                      +        
               ATTR=(NUM,PROT,NODISP)                                           
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4O337N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N337,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I337N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0140,                                                +        
               LTH=40                                                           
         MFLD  FLD0208,                                                +        
               LTH=2                                                            
         MFLD  FLD0308,                                                +        
               LTH=4                                                            
         MFLD  FLD0219,                                                +        
               LTH=2                                                            
         MFLD  FLD0319,                                                +        
               LTH=6                                                            
         MFLD  FLD0233,                                                +        
               LTH=2                                                            
         MFLD  FLD0333,                                                +        
               LTH=5                                                            
         MFLD  FLD0248,                                                +        
               LTH=2                                                            
         MFLD  FLD0348,                                                +        
               LTH=5                                                            
         MFLD  DGIA0000,                                               +        
               LTH=2                                                            
         MFLD  DGIA0001,                                               +        
               LTH=2                                                            
         MFLD  FLD0406,                                                +        
               LTH=7                                                            
         MFLD  FLD0414,                                                +        
               LTH=2                                                            
         MFLD  FLD0510,                                                +        
               LTH=2                                                            
         MFLD  FLD0610,                                                +        
               LTH=2                                                            
         MFLD  FLD0813,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1502,                                                +        
               LTH=7                                                            
         MFLD  FLD1510,                                                +        
               LTH=3                                                            
         MFLD  FLD1514,                                                +        
               LTH=3                                                            
         MFLD  FLD1518,                                                +        
               LTH=3                                                            
         MFLD  FLD1522,                                                +        
               LTH=3                                                            
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I337N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N337),                                           +        
               OPT=2,                                                  +        
               NXT=W4O337N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F7'                                                       
         MFLD  'U ',                                                   +        
               LTH=2                                                            
         MFLD  '43372',                                                +        
               LTH=5                                                            
         MFLD  (FLD0208,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0308,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0219,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0319,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0233,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0333,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0248,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0348,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  DGIA0000,                                               +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0001,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  FLD0406,                                                +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0414,                                                +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0510,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  FLD0610,                                                +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0813,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD1510,                                                +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  FLD1514,                                                +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD1518,                                                +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD1522,                                                +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
