***********************************************************************         
* CREATED BY PC36147   ON 97/11/10  AT 15:19                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE '                                '                               
W4N322   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T321  ',                                          +        
               14='W4T322  ',                                          +        
               15='W4T323  ',                                          +        
               16='W4T324  ',                                          +        
               17='W4T325  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,10)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'PACKING REPORT HEAD',                                  +        
               POS=(1,10),LTH=19,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD0140  DFLD  POS=(1,40),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Picker',                                               +        
               POS=(2,2),LTH=6,                                        +        
               ATTR=(PROT)                                                      
FLD0210  DFLD  POS=(2,10),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Distr',                                                +        
               POS=(2,16),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0223  DFLD  POS=(2,22),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Cust',                                                 +        
               POS=(2,27),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0234  DFLD  POS=(2,32),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Order',                                                +        
               POS=(2,39),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0248  DFLD  POS=(2,45),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Case',                                                 +        
               POS=(2,51),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0261  DFLD  POS=(2,57),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Prod',                                                 +        
               POS=(2,63),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0274  DFLD  POS=(2,68),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DC',                                                   +        
               POS=(2,76),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DCI      DFLD  POS=(2,79),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
FLD0310  DFLD  POS=(3,10),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0323  DFLD  POS=(3,22),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0334  DFLD  POS=(3,32),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0348  DFLD  POS=(3,45),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0361  DFLD  POS=(3,57),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0374  DFLD  POS=(3,68),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
DCO      DFLD  POS=(3,79),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Distr  Cust   DC   FC    Order',                       +        
               POS=(5,2),LTH=30,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Goods Receiver',                                       +        
               POS=(5,37),LTH=14,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Pr. Date',                                             +        
               POS=(5,67),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FLD0603  DFLD  POS=(6,3),LTH=4,                                        +        
               ATTR=(PROT)                                                      
FLD0609  DFLD  POS=(6,9),LTH=6,                                        +        
               ATTR=(PROT)                                                      
FLD0618  DFLD  POS=(6,16),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FLD0621  DFLD  POS=(6,21),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FLD0625  DFLD  POS=(6,25),LTH=10,                                      +        
               ATTR=(PROT)                                                      
FLD0637  DFLD  POS=(6,37),LTH=27,                                      +        
               ATTR=(PROT)                                                      
FLD0666  DFLD  POS=(6,66),LTH=13,                                      +        
               ATTR=(PROT)                                                      
FLD0737  DFLD  POS=(7,37),LTH=27,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Our Ref',                                              +        
               POS=(8,2),LTH=7,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'Reg Date CL  Reg. Pack',                               +        
               POS=(8,14),LTH=22,                                      +        
               ATTR=(PROT)                                                      
FLD0837  DFLD  POS=(8,37),LTH=27,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Packed',                                               +        
               POS=(8,68),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0902  DFLD  POS=(9,2),LTH=10,                                       +        
               ATTR=(PROT)                                                      
FLD0914  DFLD  POS=(9,14),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0923  DFLD  POS=(9,23),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0927  DFLD  POS=(9,27),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0937  DFLD  POS=(9,37),LTH=27,                                      +        
               ATTR=(PROT)                                                      
FLD0966  DFLD  POS=(9,68),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD1037  DFLD  POS=(10,37),LTH=27,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Transport:',                                           +        
               POS=(11,2),LTH=10,                                      +        
               ATTR=(PROT)                                                      
FLD1114  DFLD  POS=(11,14),LTH=20,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Cycle :',                                              +        
               POS=(11,37),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FLD1146  DFLD  POS=(11,46),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Reg.Ident.  Tel. NO   NET Volume  NET Weight  Qty Lines+        
               ',                                                      +        
               POS=(13,2),LTH=55,                                      +        
               ATTR=(PROT)                                                      
IDUSER   DFLD  POS=(14,4),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FLD1410  DFLD  POS=(14,14),LTH=10,                                     +        
               ATTR=(PROT)                                                      
FLD1422  DFLD  POS=(14,26),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1433  DFLD  POS=(14,36),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1446  DFLD  POS=(14,50),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FLD1460  DFLD  POS=(14,60),LTH=12,                                     +        
               ATTR=(PROT)                                                      
FLD1474  DFLD  POS=(14,74),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Goods Marking',                                        +        
               POS=(16,2),LTH=13,                                      +        
               ATTR=(PROT)                                                      
FLD1617  DFLD  POS=(16,17),LTH=47,                                     +        
               ATTR=(PROT)                                                      
FLD1717  DFLD  POS=(17,17),LTH=47,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Warehouse Instr :',                                    +        
               POS=(18,2),LTH=17,                                      +        
               ATTR=(PROT)                                                      
FLD1821  DFLD  POS=(18,21),LTH=60,                                     +        
               ATTR=(PROT)                                                      
FLD1921  DFLD  POS=(19,21),LTH=60,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '13 Non Rep Lines 14 Pr Head 15 Pr Lines 16 S Not Fin 17+        
                Conf.zero',                                            +        
               POS=(21,2),LTH=65,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,19),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,30),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,42),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,55),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4O322N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N322,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I322N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0140,                                                +        
               LTH=40                                                           
         MFLD  FLD0210,                                                +        
               LTH=2                                                            
         MFLD  FLD0310,                                                +        
               LTH=5                                                            
         MFLD  FLD0223,                                                +        
               LTH=2                                                            
         MFLD  FLD0323,                                                +        
               LTH=4                                                            
         MFLD  FLD0234,                                                +        
               LTH=2                                                            
         MFLD  FLD0334,                                                +        
               LTH=6                                                            
         MFLD  FLD0248,                                                +        
               LTH=2                                                            
         MFLD  FLD0348,                                                +        
               LTH=5                                                            
         MFLD  FLD0261,                                                +        
               LTH=2                                                            
         MFLD  FLD0361,                                                +        
               LTH=5                                                            
         MFLD  FLD0274,                                                +        
               LTH=2                                                            
         MFLD  FLD0374,                                                +        
               LTH=7                                                            
         MFLD  DCI,                                                    +        
               LTH=2                                                            
         MFLD  DCO,                                                    +        
               LTH=2                                                            
         MFLD  FLD0603,                                                +        
               LTH=4                                                            
         MFLD  FLD0609,                                                +        
               LTH=6                                                            
         MFLD  FLD0618,                                                +        
               LTH=2                                                            
         MFLD  FLD0621,                                                +        
               LTH=2                                                            
         MFLD  FLD0625,                                                +        
               LTH=10                                                           
         MFLD  FLD0637,                                                +        
               LTH=27                                                           
         MFLD  FLD0666,                                                +        
               LTH=13                                                           
         MFLD  FLD0737,                                                +        
               LTH=27                                                           
         MFLD  FLD0837,                                                +        
               LTH=27                                                           
         MFLD  FLD0902,                                                +        
               LTH=10                                                           
         MFLD  FLD0914,                                                +        
               LTH=6                                                            
         MFLD  FLD0923,                                                +        
               LTH=1                                                            
         MFLD  FLD0927,                                                +        
               LTH=6                                                            
         MFLD  FLD0937,                                                +        
               LTH=27                                                           
         MFLD  FLD0966,                                                +        
               LTH=6                                                            
         MFLD  FLD1037,                                                +        
               LTH=27                                                           
         MFLD  FLD1114,                                                +        
               LTH=20                                                           
         MFLD  FLD1146,                                                +        
               LTH=8                                                            
         MFLD  IDUSER,                                                 +        
               LTH=8                                                            
         MFLD  FLD1410,                                                +        
               LTH=10                                                           
         MFLD  FLD1422,                                                +        
               LTH=8                                                            
         MFLD  FLD1433,                                                +        
               LTH=8                                                            
         MFLD  FLD1446,                                                +        
               LTH=5                                                            
         MFLD  FLD1460,                                                +        
               LTH=12                                                           
         MFLD  FLD1474,                                                +        
               LTH=1                                                            
         MFLD  FLD1617,                                                +        
               LTH=47                                                           
         MFLD  FLD1717,                                                +        
               LTH=47                                                           
         MFLD  FLD1821,                                                +        
               LTH=60                                                           
         MFLD  FLD1921,                                                +        
               LTH=60                                                           
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I322N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N322),                                           +        
               OPT=2,                                                  +        
               NXT=W4O322N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '43222',                                                +        
               LTH=5                                                            
         MFLD  (FLD0210,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0310,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0223,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0323,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0234,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0334,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0248,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0348,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0261,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0361,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0274,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0374,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (DCI,                                                   +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  DCO,                                                    +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
