***********************************************************************         
* CREATED BY PC36147   ON 97/04/30  AT 14:15                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE '                                '                               
W4N321   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W4T321 7',                                           +        
               8='W4T321 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T321  ',                                          +        
               14='W4T322  ',                                          +        
               15='W4T323  ',                                          +        
               16='W4T324  ',                                          +        
               17='W4T325  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,10)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'NON REPORTED LINES/ORDER',                             +        
               POS=(1,10),LTH=24,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD0140  DFLD  POS=(1,40),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Picker',                                               +        
               POS=(2,2),LTH=6,                                        +        
               ATTR=(PROT)                                                      
FLD0210  DFLD  POS=(2,10),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Distr',                                                +        
               POS=(2,16),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0223  DFLD  POS=(2,22),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Cust',                                                 +        
               POS=(2,27),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0234  DFLD  POS=(2,32),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Order',                                                +        
               POS=(2,39),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0248  DFLD  POS=(2,45),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Case',                                                 +        
               POS=(2,51),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0261  DFLD  POS=(2,57),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Prod',                                                 +        
               POS=(2,63),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0274  DFLD  POS=(2,68),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DC',                                                   +        
               POS=(2,76),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DCI      DFLD  POS=(2,79),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
FLD0310  DFLD  POS=(3,10),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0323  DFLD  POS=(3,22),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0334  DFLD  POS=(3,32),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0348  DFLD  POS=(3,45),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0361  DFLD  POS=(3,57),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0374  DFLD  POS=(3,68),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
DCO      DFLD  POS=(3,79),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0455  DFLD  POS=(4,55),LTH=16,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'Line  Line  Rem. Qty Of',                              +        
               POS=(5,7),LTH=23,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Line  Line  Rem. Qty Of',                              +        
               POS=(5,51),LTH=23,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Area From   To   Partly Rep. Picker',                  +        
               POS=(6,2),LTH=35,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Area From   To   Partly Rep. PICKER',                  +        
               POS=(6,46),LTH=35,                                      +        
               ATTR=(PROT)                                                      
COL0207  DFLD  POS=(7,2),LTH=2,                                        +        
               ATTR=(PROT)                                                      
COL0607  DFLD  POS=(7,6),LTH=4,                                        +        
               ATTR=(PROT)                                                      
COL1207  DFLD  POS=(7,12),LTH=4,                                       +        
               ATTR=(PROT)                                                      
COL2207  DFLD  POS=(7,22),LTH=6,                                       +        
               ATTR=(PROT)                                                      
COL3207  DFLD  POS=(7,32),LTH=5,                                       +        
               ATTR=(PROT)                                                      
COL4607  DFLD  POS=(7,46),LTH=2,                                       +        
               ATTR=(PROT)                                                      
COL5007  DFLD  POS=(7,50),LTH=4,                                       +        
               ATTR=(PROT)                                                      
COL5607  DFLD  POS=(7,56),LTH=4,                                       +        
               ATTR=(PROT)                                                      
COL6607  DFLD  POS=(7,66),LTH=6,                                       +        
               ATTR=(PROT)                                                      
COL7607  DFLD  POS=(7,76),LTH=5,                                       +        
               ATTR=(PROT)                                                      
COL0208  DFLD  POS=(8,2),LTH=2,                                        +        
               ATTR=(NUM,PROT)                                                  
COL0608  DFLD  POS=(8,6),LTH=4,                                        +        
               ATTR=(PROT)                                                      
COL1208  DFLD  POS=(8,12),LTH=4,                                       +        
               ATTR=(PROT)                                                      
COL2208  DFLD  POS=(8,22),LTH=6,                                       +        
               ATTR=(PROT)                                                      
COL3208  DFLD  POS=(8,32),LTH=5,                                       +        
               ATTR=(PROT)                                                      
COL4608  DFLD  POS=(8,46),LTH=2,                                       +        
               ATTR=(PROT)                                                      
COL5008  DFLD  POS=(8,50),LTH=4,                                       +        
               ATTR=(PROT)                                                      
COL5608  DFLD  POS=(8,56),LTH=4,                                       +        
               ATTR=(PROT)                                                      
COL6608  DFLD  POS=(8,66),LTH=6,                                       +        
               ATTR=(PROT)                                                      
COL7608  DFLD  POS=(8,76),LTH=5,                                       +        
               ATTR=(PROT)                                                      
COL0209  DFLD  POS=(9,2),LTH=2,                                        +        
               ATTR=(NUM,PROT)                                                  
COL0609  DFLD  POS=(9,6),LTH=4,                                        +        
               ATTR=(PROT)                                                      
COL1209  DFLD  POS=(9,12),LTH=4,                                       +        
               ATTR=(PROT)                                                      
COL2209  DFLD  POS=(9,22),LTH=6,                                       +        
               ATTR=(PROT)                                                      
COL3209  DFLD  POS=(9,32),LTH=5,                                       +        
               ATTR=(PROT)                                                      
COL4609  DFLD  POS=(9,46),LTH=2,                                       +        
               ATTR=(PROT)                                                      
COL5009  DFLD  POS=(9,50),LTH=4,                                       +        
               ATTR=(PROT)                                                      
COL5609  DFLD  POS=(9,56),LTH=4,                                       +        
               ATTR=(PROT)                                                      
COL6609  DFLD  POS=(9,66),LTH=6,                                       +        
               ATTR=(PROT)                                                      
COL7609  DFLD  POS=(9,76),LTH=5,                                       +        
               ATTR=(PROT)                                                      
COL0210  DFLD  POS=(10,2),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
COL0610  DFLD  POS=(10,6),LTH=4,                                       +        
               ATTR=(PROT)                                                      
COL1210  DFLD  POS=(10,12),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL2210  DFLD  POS=(10,22),LTH=6,                                      +        
               ATTR=(PROT)                                                      
COL3210  DFLD  POS=(10,32),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL4610  DFLD  POS=(10,46),LTH=2,                                      +        
               ATTR=(PROT)                                                      
COL5010  DFLD  POS=(10,50),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL5610  DFLD  POS=(10,56),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL6610  DFLD  POS=(10,66),LTH=6,                                      +        
               ATTR=(PROT)                                                      
COL7610  DFLD  POS=(10,76),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL0211  DFLD  POS=(11,2),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
COL0611  DFLD  POS=(11,6),LTH=4,                                       +        
               ATTR=(PROT)                                                      
COL1211  DFLD  POS=(11,12),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL2211  DFLD  POS=(11,22),LTH=6,                                      +        
               ATTR=(PROT)                                                      
COL3211  DFLD  POS=(11,32),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL4611  DFLD  POS=(11,46),LTH=2,                                      +        
               ATTR=(PROT)                                                      
COL5011  DFLD  POS=(11,50),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL5611  DFLD  POS=(11,56),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL6611  DFLD  POS=(11,66),LTH=6,                                      +        
               ATTR=(PROT)                                                      
COL7611  DFLD  POS=(11,76),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL0212  DFLD  POS=(12,2),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
COL0612  DFLD  POS=(12,6),LTH=4,                                       +        
               ATTR=(PROT)                                                      
COL1212  DFLD  POS=(12,12),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL2212  DFLD  POS=(12,22),LTH=6,                                      +        
               ATTR=(PROT)                                                      
COL3212  DFLD  POS=(12,32),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL4612  DFLD  POS=(12,46),LTH=2,                                      +        
               ATTR=(PROT)                                                      
COL5012  DFLD  POS=(12,50),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL5612  DFLD  POS=(12,56),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL6612  DFLD  POS=(12,66),LTH=6,                                      +        
               ATTR=(PROT)                                                      
COL7612  DFLD  POS=(12,76),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL0213  DFLD  POS=(13,2),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
COL0613  DFLD  POS=(13,6),LTH=4,                                       +        
               ATTR=(PROT)                                                      
COL1213  DFLD  POS=(13,12),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL2213  DFLD  POS=(13,22),LTH=6,                                      +        
               ATTR=(PROT)                                                      
COL3213  DFLD  POS=(13,32),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL4613  DFLD  POS=(13,46),LTH=2,                                      +        
               ATTR=(PROT)                                                      
COL5013  DFLD  POS=(13,50),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL5613  DFLD  POS=(13,56),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL6613  DFLD  POS=(13,66),LTH=6,                                      +        
               ATTR=(PROT)                                                      
COL7613  DFLD  POS=(13,76),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL0214  DFLD  POS=(14,2),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
COL0614  DFLD  POS=(14,6),LTH=4,                                       +        
               ATTR=(PROT)                                                      
COL1214  DFLD  POS=(14,12),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL2214  DFLD  POS=(14,22),LTH=6,                                      +        
               ATTR=(PROT)                                                      
COL3214  DFLD  POS=(14,32),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL4614  DFLD  POS=(14,46),LTH=2,                                      +        
               ATTR=(PROT)                                                      
COL5014  DFLD  POS=(14,50),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL5614  DFLD  POS=(14,56),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL6614  DFLD  POS=(14,66),LTH=6,                                      +        
               ATTR=(PROT)                                                      
COL7614  DFLD  POS=(14,76),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL0215  DFLD  POS=(15,2),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
COL0615  DFLD  POS=(15,6),LTH=4,                                       +        
               ATTR=(PROT)                                                      
COL1215  DFLD  POS=(15,12),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL2215  DFLD  POS=(15,22),LTH=6,                                      +        
               ATTR=(PROT)                                                      
COL3215  DFLD  POS=(15,32),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL4615  DFLD  POS=(15,46),LTH=2,                                      +        
               ATTR=(PROT)                                                      
COL5015  DFLD  POS=(15,50),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL5615  DFLD  POS=(15,56),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL6615  DFLD  POS=(15,66),LTH=6,                                      +        
               ATTR=(PROT)                                                      
COL7615  DFLD  POS=(15,76),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL0216  DFLD  POS=(16,2),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
COL0616  DFLD  POS=(16,6),LTH=4,                                       +        
               ATTR=(PROT)                                                      
COL1216  DFLD  POS=(16,12),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL2216  DFLD  POS=(16,22),LTH=6,                                      +        
               ATTR=(PROT)                                                      
COL3216  DFLD  POS=(16,32),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL4616  DFLD  POS=(16,46),LTH=2,                                      +        
               ATTR=(PROT)                                                      
COL5016  DFLD  POS=(16,50),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL5616  DFLD  POS=(16,56),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL6616  DFLD  POS=(16,66),LTH=6,                                      +        
               ATTR=(PROT)                                                      
COL7616  DFLD  POS=(16,76),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL0217  DFLD  POS=(17,2),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
COL0617  DFLD  POS=(17,6),LTH=4,                                       +        
               ATTR=(PROT)                                                      
COL1217  DFLD  POS=(17,12),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL2217  DFLD  POS=(17,22),LTH=6,                                      +        
               ATTR=(PROT)                                                      
COL3217  DFLD  POS=(17,32),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL4617  DFLD  POS=(17,46),LTH=2,                                      +        
               ATTR=(PROT)                                                      
COL5017  DFLD  POS=(17,50),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL5617  DFLD  POS=(17,56),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL6617  DFLD  POS=(17,66),LTH=6,                                      +        
               ATTR=(PROT)                                                      
COL7617  DFLD  POS=(17,76),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL0218  DFLD  POS=(18,2),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
COL0618  DFLD  POS=(18,6),LTH=4,                                       +        
               ATTR=(PROT)                                                      
COL1218  DFLD  POS=(18,12),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL2218  DFLD  POS=(18,22),LTH=6,                                      +        
               ATTR=(PROT)                                                      
COL3218  DFLD  POS=(18,32),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL4618  DFLD  POS=(18,46),LTH=2,                                      +        
               ATTR=(PROT)                                                      
COL5018  DFLD  POS=(18,50),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL5618  DFLD  POS=(18,56),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL6618  DFLD  POS=(18,66),LTH=6,                                      +        
               ATTR=(PROT)                                                      
COL7618  DFLD  POS=(18,76),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL0219  DFLD  POS=(19,2),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
COL0619  DFLD  POS=(19,6),LTH=4,                                       +        
               ATTR=(PROT)                                                      
COL1219  DFLD  POS=(19,12),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL2219  DFLD  POS=(19,22),LTH=6,                                      +        
               ATTR=(PROT)                                                      
COL3219  DFLD  POS=(19,32),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL4619  DFLD  POS=(19,46),LTH=2,                                      +        
               ATTR=(PROT)                                                      
COL5019  DFLD  POS=(19,50),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL5619  DFLD  POS=(19,56),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL6619  DFLD  POS=(19,66),LTH=6,                                      +        
               ATTR=(PROT)                                                      
COL7619  DFLD  POS=(19,76),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '13 Non Rep Lines 14 Pr Head 15 Pr Lines 16 S Not Fin 17+        
                Conf.zero',                                            +        
               POS=(21,2),LTH=65,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,19),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,30),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,42),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,55),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4O321N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N321,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I321N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0140,                                                +        
               LTH=40                                                           
         MFLD  FLD0210,                                                +        
               LTH=2                                                            
         MFLD  FLD0310,                                                +        
               LTH=5                                                            
         MFLD  FLD0223,                                                +        
               LTH=2                                                            
         MFLD  FLD0323,                                                +        
               LTH=4                                                            
         MFLD  FLD0234,                                                +        
               LTH=2                                                            
         MFLD  FLD0334,                                                +        
               LTH=6                                                            
         MFLD  FLD0248,                                                +        
               LTH=2                                                            
         MFLD  FLD0348,                                                +        
               LTH=5                                                            
         MFLD  FLD0261,                                                +        
               LTH=2                                                            
         MFLD  FLD0361,                                                +        
               LTH=5                                                            
         MFLD  FLD0274,                                                +        
               LTH=2                                                            
         MFLD  FLD0374,                                                +        
               LTH=7                                                            
         MFLD  DCI,                                                    +        
               LTH=2                                                            
         MFLD  DCO,                                                    +        
               LTH=2                                                            
         MFLD  FLD0455,                                                +        
               LTH=16                                                           
         MFLD  COL0207,                                                +        
               LTH=2                                                            
         MFLD  COL0607,                                                +        
               LTH=4                                                            
         MFLD  COL1207,                                                +        
               LTH=4                                                            
         MFLD  COL2207,                                                +        
               LTH=6                                                            
         MFLD  COL3207,                                                +        
               LTH=5                                                            
         MFLD  COL4607,                                                +        
               LTH=2                                                            
         MFLD  COL5007,                                                +        
               LTH=4                                                            
         MFLD  COL5607,                                                +        
               LTH=4                                                            
         MFLD  COL6607,                                                +        
               LTH=6                                                            
         MFLD  COL7607,                                                +        
               LTH=5                                                            
         MFLD  COL0208,                                                +        
               LTH=2                                                            
         MFLD  COL0608,                                                +        
               LTH=4                                                            
         MFLD  COL1208,                                                +        
               LTH=4                                                            
         MFLD  COL2208,                                                +        
               LTH=6                                                            
         MFLD  COL3208,                                                +        
               LTH=5                                                            
         MFLD  COL4608,                                                +        
               LTH=2                                                            
         MFLD  COL5008,                                                +        
               LTH=4                                                            
         MFLD  COL5608,                                                +        
               LTH=4                                                            
         MFLD  COL6608,                                                +        
               LTH=6                                                            
         MFLD  COL7608,                                                +        
               LTH=5                                                            
         MFLD  COL0209,                                                +        
               LTH=2                                                            
         MFLD  COL0609,                                                +        
               LTH=4                                                            
         MFLD  COL1209,                                                +        
               LTH=4                                                            
         MFLD  COL2209,                                                +        
               LTH=6                                                            
         MFLD  COL3209,                                                +        
               LTH=5                                                            
         MFLD  COL4609,                                                +        
               LTH=2                                                            
         MFLD  COL5009,                                                +        
               LTH=4                                                            
         MFLD  COL5609,                                                +        
               LTH=4                                                            
         MFLD  COL6609,                                                +        
               LTH=6                                                            
         MFLD  COL7609,                                                +        
               LTH=5                                                            
         MFLD  COL0210,                                                +        
               LTH=2                                                            
         MFLD  COL0610,                                                +        
               LTH=4                                                            
         MFLD  COL1210,                                                +        
               LTH=4                                                            
         MFLD  COL2210,                                                +        
               LTH=6                                                            
         MFLD  COL3210,                                                +        
               LTH=5                                                            
         MFLD  COL4610,                                                +        
               LTH=2                                                            
         MFLD  COL5010,                                                +        
               LTH=4                                                            
         MFLD  COL5610,                                                +        
               LTH=4                                                            
         MFLD  COL6610,                                                +        
               LTH=6                                                            
         MFLD  COL7610,                                                +        
               LTH=5                                                            
         MFLD  COL0211,                                                +        
               LTH=2                                                            
         MFLD  COL0611,                                                +        
               LTH=4                                                            
         MFLD  COL1211,                                                +        
               LTH=4                                                            
         MFLD  COL2211,                                                +        
               LTH=6                                                            
         MFLD  COL3211,                                                +        
               LTH=5                                                            
         MFLD  COL4611,                                                +        
               LTH=2                                                            
         MFLD  COL5011,                                                +        
               LTH=4                                                            
         MFLD  COL5611,                                                +        
               LTH=4                                                            
         MFLD  COL6611,                                                +        
               LTH=6                                                            
         MFLD  COL7611,                                                +        
               LTH=5                                                            
         MFLD  COL0212,                                                +        
               LTH=2                                                            
         MFLD  COL0612,                                                +        
               LTH=4                                                            
         MFLD  COL1212,                                                +        
               LTH=4                                                            
         MFLD  COL2212,                                                +        
               LTH=6                                                            
         MFLD  COL3212,                                                +        
               LTH=5                                                            
         MFLD  COL4612,                                                +        
               LTH=2                                                            
         MFLD  COL5012,                                                +        
               LTH=4                                                            
         MFLD  COL5612,                                                +        
               LTH=4                                                            
         MFLD  COL6612,                                                +        
               LTH=6                                                            
         MFLD  COL7612,                                                +        
               LTH=5                                                            
         MFLD  COL0213,                                                +        
               LTH=2                                                            
         MFLD  COL0613,                                                +        
               LTH=4                                                            
         MFLD  COL1213,                                                +        
               LTH=4                                                            
         MFLD  COL2213,                                                +        
               LTH=6                                                            
         MFLD  COL3213,                                                +        
               LTH=5                                                            
         MFLD  COL4613,                                                +        
               LTH=2                                                            
         MFLD  COL5013,                                                +        
               LTH=4                                                            
         MFLD  COL5613,                                                +        
               LTH=4                                                            
         MFLD  COL6613,                                                +        
               LTH=6                                                            
         MFLD  COL7613,                                                +        
               LTH=5                                                            
         MFLD  COL0214,                                                +        
               LTH=2                                                            
         MFLD  COL0614,                                                +        
               LTH=4                                                            
         MFLD  COL1214,                                                +        
               LTH=4                                                            
         MFLD  COL2214,                                                +        
               LTH=6                                                            
         MFLD  COL3214,                                                +        
               LTH=5                                                            
         MFLD  COL4614,                                                +        
               LTH=2                                                            
         MFLD  COL5014,                                                +        
               LTH=4                                                            
         MFLD  COL5614,                                                +        
               LTH=4                                                            
         MFLD  COL6614,                                                +        
               LTH=6                                                            
         MFLD  COL7614,                                                +        
               LTH=5                                                            
         MFLD  COL0215,                                                +        
               LTH=2                                                            
         MFLD  COL0615,                                                +        
               LTH=4                                                            
         MFLD  COL1215,                                                +        
               LTH=4                                                            
         MFLD  COL2215,                                                +        
               LTH=6                                                            
         MFLD  COL3215,                                                +        
               LTH=5                                                            
         MFLD  COL4615,                                                +        
               LTH=2                                                            
         MFLD  COL5015,                                                +        
               LTH=4                                                            
         MFLD  COL5615,                                                +        
               LTH=4                                                            
         MFLD  COL6615,                                                +        
               LTH=6                                                            
         MFLD  COL7615,                                                +        
               LTH=5                                                            
         MFLD  COL0216,                                                +        
               LTH=2                                                            
         MFLD  COL0616,                                                +        
               LTH=4                                                            
         MFLD  COL1216,                                                +        
               LTH=4                                                            
         MFLD  COL2216,                                                +        
               LTH=6                                                            
         MFLD  COL3216,                                                +        
               LTH=5                                                            
         MFLD  COL4616,                                                +        
               LTH=2                                                            
         MFLD  COL5016,                                                +        
               LTH=4                                                            
         MFLD  COL5616,                                                +        
               LTH=4                                                            
         MFLD  COL6616,                                                +        
               LTH=6                                                            
         MFLD  COL7616,                                                +        
               LTH=5                                                            
         MFLD  COL0217,                                                +        
               LTH=2                                                            
         MFLD  COL0617,                                                +        
               LTH=4                                                            
         MFLD  COL1217,                                                +        
               LTH=4                                                            
         MFLD  COL2217,                                                +        
               LTH=6                                                            
         MFLD  COL3217,                                                +        
               LTH=5                                                            
         MFLD  COL4617,                                                +        
               LTH=2                                                            
         MFLD  COL5017,                                                +        
               LTH=4                                                            
         MFLD  COL5617,                                                +        
               LTH=4                                                            
         MFLD  COL6617,                                                +        
               LTH=6                                                            
         MFLD  COL7617,                                                +        
               LTH=5                                                            
         MFLD  COL0218,                                                +        
               LTH=2                                                            
         MFLD  COL0618,                                                +        
               LTH=4                                                            
         MFLD  COL1218,                                                +        
               LTH=4                                                            
         MFLD  COL2218,                                                +        
               LTH=6                                                            
         MFLD  COL3218,                                                +        
               LTH=5                                                            
         MFLD  COL4618,                                                +        
               LTH=2                                                            
         MFLD  COL5018,                                                +        
               LTH=4                                                            
         MFLD  COL5618,                                                +        
               LTH=4                                                            
         MFLD  COL6618,                                                +        
               LTH=6                                                            
         MFLD  COL7618,                                                +        
               LTH=5                                                            
         MFLD  COL0219,                                                +        
               LTH=2                                                            
         MFLD  COL0619,                                                +        
               LTH=4                                                            
         MFLD  COL1219,                                                +        
               LTH=4                                                            
         MFLD  COL2219,                                                +        
               LTH=6                                                            
         MFLD  COL3219,                                                +        
               LTH=5                                                            
         MFLD  COL4619,                                                +        
               LTH=2                                                            
         MFLD  COL5019,                                                +        
               LTH=4                                                            
         MFLD  COL5619,                                                +        
               LTH=4                                                            
         MFLD  COL6619,                                                +        
               LTH=6                                                            
         MFLD  COL7619,                                                +        
               LTH=5                                                            
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I321N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N321),                                           +        
               OPT=2,                                                  +        
               NXT=W4O321N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '43212',                                                +        
               LTH=5                                                            
         MFLD  (FLD0210,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0310,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0223,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0323,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0234,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0334,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0248,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0348,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0261,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0361,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0274,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0374,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (DCI,                                                   +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  DCO,                                                    +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  FLD0455,                                                +        
               LTH=16,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
