***********************************************************************         
* CREATED BY PCC8448   ON 99/05/11  AT 11:45                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE '                                '                               
W4N315   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T311  ',                                          +        
               14='W4T312  ',                                          +        
               15='W4T313  ',                                          +        
               16='W4T314  ',                                          +        
               17='W4T315  ',                                          +        
               18='W4T316  ',                                          +        
               19='W4T317  ',                                          +        
               20='W4T318U ',                                          +        
               21='W4T319  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,10)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'CASE REPORTING 2',                                     +        
               POS=(1,10),LTH=16,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Picker',                                               +        
               POS=(2,2),LTH=6,                                        +        
               ATTR=(NUM,PROT)                                                  
FLD0210  DFLD  POS=(2,10),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Distr',                                                +        
               POS=(2,16),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0222  DFLD  POS=(2,22),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Cust',                                                 +        
               POS=(2,27),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0232  DFLD  POS=(2,32),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Order',                                                +        
               POS=(2,39),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0245  DFLD  POS=(2,45),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Case',                                                 +        
               POS=(2,51),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0257  DFLD  POS=(2,57),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Prod',                                                 +        
               POS=(2,63),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0268  DFLD  POS=(2,68),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DC',                                                   +        
               POS=(2,76),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0276  DFLD  POS=(2,79),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FLD0310  DFLD  POS=(3,10),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0322  DFLD  POS=(3,22),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0332  DFLD  POS=(3,32),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0345  DFLD  POS=(3,45),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0357  DFLD  POS=(3,57),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0368  DFLD  POS=(3,68),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0376  DFLD  POS=(3,79),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0460  DFLD  POS=(4,60),LTH=4,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'Case code Grossw Last case Type Length Width Heigth',  +        
               POS=(5,2),LTH=51,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Case from - to',                                       +        
               POS=(5,64),LTH=14,                                      +        
               ATTR=(PROT)                                                      
FLD0602  DFLD  POS=(6,2),LTH=8,                                        +        
               ATTR=(NOPROT)                                                    
         DFLD  ' ',                                                    +        
               POS=(6,11),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
FLD0611  DFLD  POS=(6,13),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
FLD0622  DFLD  POS=(6,24),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
FLD0631  DFLD  POS=(6,31),LTH=1,                                       +        
               ATTR=(NUM,NOPROT)                                                
FLD0635  DFLD  POS=(6,35),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
FLD0641  DFLD  POS=(6,42),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
FLD0647  DFLD  POS=(6,48),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
FLD0652  DFLD  POS=(6,53),LTH=3,                                       +        
               ATTR=(PROT,NODISP)                                               
FLD0656  DFLD  POS=(6,57),LTH=3,                                       +        
               ATTR=(NUM,PROT,NODISP)                                           
FLD0660  DFLD  POS=(6,61),LTH=3,                                       +        
               ATTR=(NUM,PROT,NODISP)                                           
FLD0668  DFLD  POS=(6,68),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(6,74),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0676  DFLD  POS=(6,76),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Line-from  Line-to  Qty in case  Lbl-Print:',          +        
               POS=(7,2),LTH=43,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0746  DFLD  POS=(7,46),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'DN-Print:',                                            +        
               POS=(7,49),LTH=9,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0759  DFLD  POS=(7,59),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
COL0508  DFLD  POS=(8,5),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(8,11),LTH=1,                                       +        
               ATTR=(PROT)                                                      
COL1408  DFLD  POS=(8,14),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL2408  DFLD  POS=(8,24),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL0509  DFLD  POS=(9,5),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(9,11),LTH=1,                                       +        
               ATTR=(PROT)                                                      
COL1409  DFLD  POS=(9,14),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL2409  DFLD  POS=(9,24),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL0510  DFLD  POS=(10,5),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(10,11),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL1410  DFLD  POS=(10,14),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL2410  DFLD  POS=(10,24),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL0511  DFLD  POS=(11,5),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(11,11),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL1411  DFLD  POS=(11,14),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL2411  DFLD  POS=(11,24),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL0512  DFLD  POS=(12,5),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(12,11),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL1412  DFLD  POS=(12,14),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL2412  DFLD  POS=(12,24),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL0513  DFLD  POS=(13,5),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(13,11),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL1413  DFLD  POS=(13,14),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL2413  DFLD  POS=(13,24),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL0514  DFLD  POS=(14,5),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(14,11),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL1414  DFLD  POS=(14,14),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL2414  DFLD  POS=(14,24),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL0515  DFLD  POS=(15,5),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(15,11),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL1415  DFLD  POS=(15,14),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL2415  DFLD  POS=(15,24),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL0516  DFLD  POS=(16,5),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(16,11),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL1416  DFLD  POS=(16,14),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL2416  DFLD  POS=(16,24),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL0517  DFLD  POS=(17,5),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(17,11),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL1417  DFLD  POS=(17,14),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL2417  DFLD  POS=(17,24),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL0518  DFLD  POS=(18,5),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(18,11),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL1418  DFLD  POS=(18,14),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL2418  DFLD  POS=(18,24),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL0519  DFLD  POS=(19,5),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(19,11),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL1419  DFLD  POS=(19,14),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL2419  DFLD  POS=(19,24),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '13 Split of ord 14 Split/Update 15 Case rep 3    16 Cas+        
               e rep 1  17 Case rep 2',                                +        
               POS=(21,2),LTH=77,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18 Case correct 19 Origin',                            +        
               POS=(22,2),LTH=25,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20 Control',                                           +        
               POS=(22,34),LTH=10,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,51),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4O315N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N315,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I315N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  FLD0210,                                                +        
               LTH=2                                                            
         MFLD  FLD0310,                                                +        
               LTH=5                                                            
         MFLD  FLD0222,                                                +        
               LTH=2                                                            
         MFLD  FLD0322,                                                +        
               LTH=4                                                            
         MFLD  FLD0232,                                                +        
               LTH=2                                                            
         MFLD  FLD0332,                                                +        
               LTH=6                                                            
         MFLD  FLD0245,                                                +        
               LTH=2                                                            
         MFLD  FLD0345,                                                +        
               LTH=5                                                            
         MFLD  FLD0257,                                                +        
               LTH=2                                                            
         MFLD  FLD0357,                                                +        
               LTH=5                                                            
         MFLD  FLD0268,                                                +        
               LTH=2                                                            
         MFLD  FLD0368,                                                +        
               LTH=7                                                            
         MFLD  FLD0276,                                                +        
               LTH=2                                                            
         MFLD  FLD0376,                                                +        
               LTH=2                                                            
         MFLD  FLD0460,                                                +        
               LTH=4                                                            
         MFLD  FLD0602,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD0611,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0622,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0631,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0635,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0641,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0647,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0652,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0656,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0660,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0668,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0676,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0746,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0759,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0508,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1408,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2408,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0509,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1409,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2409,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0510,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1410,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2410,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0511,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1411,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2411,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0512,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1412,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2412,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0513,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1413,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2413,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0514,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1414,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2414,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0515,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1415,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2415,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0516,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1416,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2416,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0517,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1417,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2417,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0518,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1418,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2418,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0519,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1419,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2419,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I315N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N315),                                           +        
               OPT=2,                                                  +        
               NXT=W4O315N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '43152',                                                +        
               LTH=5                                                            
         MFLD  (FLD0210,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0310,                                                +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0222,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0322,                                                +        
               LTH=4,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0232,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0332,                                                +        
               LTH=6,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0245,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0345,                                                +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0257,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0357,                                                +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0268,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0368,                                                +        
               LTH=7,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0276,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  FLD0376,                                                +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  FLD0460,                                                +        
               LTH=4,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0602,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0611,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0622,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0631,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0635,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0641,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0647,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0652,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0656,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0660,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0668,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0676,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0746,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0759,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL0508,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1408,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2408,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0509,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1409,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2409,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0510,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1410,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2410,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0511,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1411,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2411,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0512,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1412,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2412,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0513,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1413,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2413,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0514,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1414,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2414,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0515,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1415,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2415,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0516,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1416,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2416,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0517,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1417,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2417,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0518,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1418,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2418,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0519,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1419,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2419,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
