***********************************************************************         
* CREATED BY PC36147   ON 94/12/05  AT 17:04                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'PRC TABLE                       '                               
W4N366   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W4T366 6',                                           +        
               7='W4T366 7',                                           +        
               8='W4T366 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T366U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T361  ',                                          +        
               14='W4T362  ',                                          +        
               15='W4T363  ',                                          +        
               16='W4T364  ',                                          +        
               17='W4T365  ',                                          +        
               18='W4T366  ',                                          +        
               19='W4T367  ',                                          +        
               20='W4T368  ',                                          +        
               21='W4T366 6',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W4N366   DPAGE CURSOR=((2,11)),                                        +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'PRC TABLE',                                            +        
               POS=(1,11),LTH=9,                                       +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Table id',                                             +        
               POS=(2,2),LTH=8,                                        +        
               ATTR=(ALPHA,PROT)                                                
DGIA0171 DFLD  POS=(2,11),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DC',                                                   +        
               POS=(2,16),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DGIA0000 DFLD  POS=(2,19),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DGIA0172 DFLD  POS=(3,11),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0001 DFLD  POS=(3,19),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0169 DFLD  POS=(4,2),LTH=4,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0170 DFLD  POS=(4,11),LTH=4,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'Seq    GR code      P-class  FC        Trp id   MWA    +        
                Ptime tab PRC',                                        +        
               POS=(5,3),LTH=69,                                       +        
               ATTR=(PROT)                                                      
RAD1     DFLD  POS=(6,3),LTH=4,                                        +        
               ATTR=(PROT)                                                      
DGIA0044 DFLD  POS=(6,9),LTH=4,                                        +        
               ATTR=(PROT)                                                      
DGIA0057 DFLD  POS=(6,14),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0071 DFLD  POS=(6,17),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0126 DFLD  POS=(6,23),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DGIA0139 DFLD  POS=(6,25),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0153 DFLD  POS=(6,28),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DGIA0003 DFLD  POS=(6,32),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DGIA0016 DFLD  POS=(6,35),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0030 DFLD  POS=(6,38),LTH=2,                                       +        
               ATTR=(PROT)                                                      
TRP1     DFLD  POS=(6,42),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DGIA0085 DFLD  POS=(6,50),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DGIA0098 DFLD  POS=(6,53),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0112 DFLD  POS=(6,56),LTH=2,                                       +        
               ATTR=(PROT)                                                      
PTID1    DFLD  POS=(6,65),LTH=2,                                       +        
               ATTR=(PROT)                                                      
PRC1     DFLD  POS=(6,69),LTH=4,                                       +        
               ATTR=(PROT)                                                      
RAD2     DFLD  POS=(7,3),LTH=4,                                        +        
               ATTR=(PROT)                                                      
DGIA0049 DFLD  POS=(7,9),LTH=4,                                        +        
               ATTR=(PROT)                                                      
DGIA0062 DFLD  POS=(7,14),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0076 DFLD  POS=(7,17),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0131 DFLD  POS=(7,23),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DGIA0144 DFLD  POS=(7,25),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0158 DFLD  POS=(7,28),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DGIA0008 DFLD  POS=(7,32),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DGIA0021 DFLD  POS=(7,35),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0035 DFLD  POS=(7,38),LTH=2,                                       +        
               ATTR=(PROT)                                                      
TRP2     DFLD  POS=(7,42),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DGIA0090 DFLD  POS=(7,50),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DGIA0103 DFLD  POS=(7,53),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0117 DFLD  POS=(7,56),LTH=2,                                       +        
               ATTR=(PROT)                                                      
PTID2    DFLD  POS=(7,65),LTH=2,                                       +        
               ATTR=(PROT)                                                      
PRC2     DFLD  POS=(7,69),LTH=4,                                       +        
               ATTR=(PROT)                                                      
RAD3     DFLD  POS=(8,3),LTH=4,                                        +        
               ATTR=(PROT)                                                      
DGIA0050 DFLD  POS=(8,9),LTH=4,                                        +        
               ATTR=(PROT)                                                      
DGIA0063 DFLD  POS=(8,14),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0077 DFLD  POS=(8,17),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0132 DFLD  POS=(8,23),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DGIA0145 DFLD  POS=(8,25),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0165 DFLD  POS=(8,28),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DGIA0009 DFLD  POS=(8,32),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DGIA0022 DFLD  POS=(8,35),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0036 DFLD  POS=(8,38),LTH=2,                                       +        
               ATTR=(PROT)                                                      
TRP3     DFLD  POS=(8,42),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DGIA0091 DFLD  POS=(8,50),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DGIA0104 DFLD  POS=(8,53),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0118 DFLD  POS=(8,56),LTH=2,                                       +        
               ATTR=(PROT)                                                      
PTID3    DFLD  POS=(8,65),LTH=2,                                       +        
               ATTR=(PROT)                                                      
PRC3     DFLD  POS=(8,69),LTH=4,                                       +        
               ATTR=(PROT)                                                      
RAD4     DFLD  POS=(9,3),LTH=4,                                        +        
               ATTR=(PROT)                                                      
DGIA0051 DFLD  POS=(9,9),LTH=4,                                        +        
               ATTR=(PROT)                                                      
DGIA0064 DFLD  POS=(9,14),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0078 DFLD  POS=(9,17),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0133 DFLD  POS=(9,23),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DGIA0146 DFLD  POS=(9,25),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0159 DFLD  POS=(9,28),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DGIA0010 DFLD  POS=(9,32),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DGIA0023 DFLD  POS=(9,35),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0037 DFLD  POS=(9,38),LTH=2,                                       +        
               ATTR=(PROT)                                                      
TRP4     DFLD  POS=(9,42),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DGIA0092 DFLD  POS=(9,50),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DGIA0105 DFLD  POS=(9,53),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0119 DFLD  POS=(9,56),LTH=2,                                       +        
               ATTR=(PROT)                                                      
PTID4    DFLD  POS=(9,65),LTH=2,                                       +        
               ATTR=(PROT)                                                      
PRC4     DFLD  POS=(9,69),LTH=4,                                       +        
               ATTR=(PROT)                                                      
RAD5     DFLD  POS=(10,3),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0052 DFLD  POS=(10,9),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0065 DFLD  POS=(10,14),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0079 DFLD  POS=(10,17),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0134 DFLD  POS=(10,23),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0147 DFLD  POS=(10,25),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0160 DFLD  POS=(10,28),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0011 DFLD  POS=(10,32),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0024 DFLD  POS=(10,35),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0038 DFLD  POS=(10,38),LTH=2,                                      +        
               ATTR=(PROT)                                                      
TRP5     DFLD  POS=(10,42),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0093 DFLD  POS=(10,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0106 DFLD  POS=(10,53),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0120 DFLD  POS=(10,56),LTH=2,                                      +        
               ATTR=(PROT)                                                      
PTID5    DFLD  POS=(10,65),LTH=2,                                      +        
               ATTR=(PROT)                                                      
PRC5     DFLD  POS=(10,69),LTH=4,                                      +        
               ATTR=(PROT)                                                      
RAD6     DFLD  POS=(11,3),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0053 DFLD  POS=(11,9),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0066 DFLD  POS=(11,14),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0080 DFLD  POS=(11,17),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0135 DFLD  POS=(11,23),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0148 DFLD  POS=(11,25),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0161 DFLD  POS=(11,28),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0012 DFLD  POS=(11,32),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0025 DFLD  POS=(11,35),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0039 DFLD  POS=(11,38),LTH=2,                                      +        
               ATTR=(PROT)                                                      
TRP6     DFLD  POS=(11,42),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0094 DFLD  POS=(11,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0107 DFLD  POS=(11,53),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0121 DFLD  POS=(11,56),LTH=2,                                      +        
               ATTR=(PROT)                                                      
PTID6    DFLD  POS=(11,65),LTH=2,                                      +        
               ATTR=(PROT)                                                      
PRC6     DFLD  POS=(11,69),LTH=4,                                      +        
               ATTR=(PROT)                                                      
RAD7     DFLD  POS=(12,3),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0054 DFLD  POS=(12,9),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0067 DFLD  POS=(12,14),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0081 DFLD  POS=(12,17),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0136 DFLD  POS=(12,23),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0149 DFLD  POS=(12,25),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0162 DFLD  POS=(12,28),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0013 DFLD  POS=(12,32),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0026 DFLD  POS=(12,35),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0040 DFLD  POS=(12,38),LTH=2,                                      +        
               ATTR=(PROT)                                                      
TRP7     DFLD  POS=(12,42),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0095 DFLD  POS=(12,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0108 DFLD  POS=(12,53),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0122 DFLD  POS=(12,56),LTH=2,                                      +        
               ATTR=(PROT)                                                      
PTID7    DFLD  POS=(12,65),LTH=2,                                      +        
               ATTR=(PROT)                                                      
PRC7     DFLD  POS=(12,69),LTH=4,                                      +        
               ATTR=(PROT)                                                      
RAD8     DFLD  POS=(13,3),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0055 DFLD  POS=(13,9),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0068 DFLD  POS=(13,14),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0082 DFLD  POS=(13,17),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0137 DFLD  POS=(13,23),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0150 DFLD  POS=(13,25),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0163 DFLD  POS=(13,28),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0014 DFLD  POS=(13,32),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0027 DFLD  POS=(13,35),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0041 DFLD  POS=(13,38),LTH=2,                                      +        
               ATTR=(PROT)                                                      
TRP8     DFLD  POS=(13,42),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0096 DFLD  POS=(13,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0109 DFLD  POS=(13,53),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0123 DFLD  POS=(13,56),LTH=2,                                      +        
               ATTR=(PROT)                                                      
PTID8    DFLD  POS=(13,65),LTH=2,                                      +        
               ATTR=(PROT)                                                      
PRC8     DFLD  POS=(13,69),LTH=4,                                      +        
               ATTR=(PROT)                                                      
RAD9     DFLD  POS=(14,3),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0056 DFLD  POS=(14,9),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0069 DFLD  POS=(14,14),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0083 DFLD  POS=(14,17),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0138 DFLD  POS=(14,23),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0151 DFLD  POS=(14,25),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0164 DFLD  POS=(14,28),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0015 DFLD  POS=(14,32),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0028 DFLD  POS=(14,35),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0042 DFLD  POS=(14,38),LTH=2,                                      +        
               ATTR=(PROT)                                                      
TRP9     DFLD  POS=(14,42),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0097 DFLD  POS=(14,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0110 DFLD  POS=(14,53),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0124 DFLD  POS=(14,56),LTH=2,                                      +        
               ATTR=(PROT)                                                      
PTID9    DFLD  POS=(14,65),LTH=2,                                      +        
               ATTR=(PROT)                                                      
PRC9     DFLD  POS=(14,69),LTH=4,                                      +        
               ATTR=(PROT)                                                      
RAD10    DFLD  POS=(15,3),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0045 DFLD  POS=(15,9),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0058 DFLD  POS=(15,14),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0072 DFLD  POS=(15,17),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0127 DFLD  POS=(15,23),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0140 DFLD  POS=(15,25),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0154 DFLD  POS=(15,28),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0004 DFLD  POS=(15,32),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0017 DFLD  POS=(15,35),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0031 DFLD  POS=(15,38),LTH=2,                                      +        
               ATTR=(PROT)                                                      
TRP10    DFLD  POS=(15,42),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0086 DFLD  POS=(15,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0099 DFLD  POS=(15,53),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0113 DFLD  POS=(15,56),LTH=2,                                      +        
               ATTR=(PROT)                                                      
PTID10   DFLD  POS=(15,65),LTH=2,                                      +        
               ATTR=(PROT)                                                      
PRC10    DFLD  POS=(15,69),LTH=4,                                      +        
               ATTR=(PROT)                                                      
RAD11    DFLD  POS=(16,3),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0046 DFLD  POS=(16,9),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0059 DFLD  POS=(16,14),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0073 DFLD  POS=(16,17),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0128 DFLD  POS=(16,23),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0141 DFLD  POS=(16,25),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0155 DFLD  POS=(16,28),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0005 DFLD  POS=(16,32),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0018 DFLD  POS=(16,35),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0032 DFLD  POS=(16,38),LTH=2,                                      +        
               ATTR=(PROT)                                                      
TRP11    DFLD  POS=(16,42),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0087 DFLD  POS=(16,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0100 DFLD  POS=(16,53),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0114 DFLD  POS=(16,56),LTH=2,                                      +        
               ATTR=(PROT)                                                      
PTID11   DFLD  POS=(16,65),LTH=2,                                      +        
               ATTR=(PROT)                                                      
PRC11    DFLD  POS=(16,69),LTH=4,                                      +        
               ATTR=(PROT)                                                      
RAD12    DFLD  POS=(17,3),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0047 DFLD  POS=(17,9),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0060 DFLD  POS=(17,14),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0074 DFLD  POS=(17,17),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0129 DFLD  POS=(17,23),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0142 DFLD  POS=(17,25),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0156 DFLD  POS=(17,28),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0006 DFLD  POS=(17,32),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0019 DFLD  POS=(17,35),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0033 DFLD  POS=(17,38),LTH=2,                                      +        
               ATTR=(PROT)                                                      
TRP12    DFLD  POS=(17,42),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0088 DFLD  POS=(17,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0101 DFLD  POS=(17,53),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0115 DFLD  POS=(17,56),LTH=2,                                      +        
               ATTR=(PROT)                                                      
PTID12   DFLD  POS=(17,65),LTH=2,                                      +        
               ATTR=(PROT)                                                      
PRC12    DFLD  POS=(17,69),LTH=4,                                      +        
               ATTR=(PROT)                                                      
RAD13    DFLD  POS=(18,3),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0048 DFLD  POS=(18,9),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0061 DFLD  POS=(18,14),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0075 DFLD  POS=(18,17),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0130 DFLD  POS=(18,23),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0143 DFLD  POS=(18,25),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0157 DFLD  POS=(18,28),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0007 DFLD  POS=(18,32),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0020 DFLD  POS=(18,35),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0034 DFLD  POS=(18,38),LTH=2,                                      +        
               ATTR=(PROT)                                                      
TRP13    DFLD  POS=(18,42),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0089 DFLD  POS=(18,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0102 DFLD  POS=(18,53),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0116 DFLD  POS=(18,56),LTH=2,                                      +        
               ATTR=(PROT)                                                      
PTID13   DFLD  POS=(18,65),LTH=2,                                      +        
               ATTR=(PROT)                                                      
PRC13    DFLD  POS=(18,69),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0168 DFLD  POS=(19,3),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0043 DFLD  POS=(19,9),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0070 DFLD  POS=(19,17),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0125 DFLD  POS=(19,23),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0152 DFLD  POS=(19,28),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0002 DFLD  POS=(19,32),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0029 DFLD  POS=(19,38),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0173 DFLD  POS=(19,42),LTH=5,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0084 DFLD  POS=(19,50),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0111 DFLD  POS=(19,56),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0167 DFLD  POS=(19,65),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0166 DFLD  POS=(19,69),LTH=4,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  ' ',                                                    +        
               POS=(19,74),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
         DFLD  '13 Prod class  14 Main area def.15 Pr.time def. 16 Rule+        
               s PRC    17 Print PRC',                                 +        
               POS=(21,2),LTH=76,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18 PRC table   19 Cust. file    20 Agr.work.hrs.21 Chan+        
               ge work  10 WHELP',                                     +        
               POS=(22,2),LTH=72,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4I366N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N366),                                           +        
               OPT=2,                                                  +        
               NXT=W4O366N1                                                     
MID      LPAGE SOR=(W4N366)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '43662',                                                +        
               LTH=5                                                            
         MFLD  (DGIA0171,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0172,                                               +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0000,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  DGIA0001,                                               +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  DGIA0169,                                               +        
               LTH=4                                                            
         MFLD  DGIA0170,                                               +        
               LTH=4                                                            
         MFLD  (DGIA0168,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0043,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0070,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0125,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0152,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0002,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0029,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0173,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0084,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0111,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0167,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0166,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
W4O366N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N366,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I366N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W4N366                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  DGIA0171,                                               +        
               LTH=2                                                            
         MFLD  DGIA0172,                                               +        
               LTH=2                                                            
         MFLD  DGIA0000,                                               +        
               LTH=2                                                            
         MFLD  DGIA0001,                                               +        
               LTH=2                                                            
         MFLD  DGIA0169,                                               +        
               LTH=4                                                            
         MFLD  DGIA0170,                                               +        
               LTH=4                                                            
         MFLD  RAD1,                                                   +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0044,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0057,                                               +        
               LTH=1                                                            
         MFLD  DGIA0071,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0126,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0139,                                               +        
               LTH=1                                                            
         MFLD  DGIA0153,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0003,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0016,                                               +        
               LTH=1                                                            
         MFLD  DGIA0030,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TRP1,                                                   +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0085,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0098,                                               +        
               LTH=1                                                            
         MFLD  DGIA0112,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PTID1,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRC1,                                                   +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RAD2,                                                   +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0049,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0062,                                               +        
               LTH=1                                                            
         MFLD  DGIA0076,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0131,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0144,                                               +        
               LTH=1                                                            
         MFLD  DGIA0158,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0008,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0021,                                               +        
               LTH=1                                                            
         MFLD  DGIA0035,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TRP2,                                                   +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0090,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0103,                                               +        
               LTH=1                                                            
         MFLD  DGIA0117,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PTID2,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRC2,                                                   +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RAD3,                                                   +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0050,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0063,                                               +        
               LTH=1                                                            
         MFLD  DGIA0077,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0132,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0145,                                               +        
               LTH=1                                                            
         MFLD  DGIA0165,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0009,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0022,                                               +        
               LTH=1                                                            
         MFLD  DGIA0036,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TRP3,                                                   +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0091,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0104,                                               +        
               LTH=1                                                            
         MFLD  DGIA0118,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PTID3,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRC3,                                                   +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RAD4,                                                   +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0051,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0064,                                               +        
               LTH=1                                                            
         MFLD  DGIA0078,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0133,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0146,                                               +        
               LTH=1                                                            
         MFLD  DGIA0159,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0010,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0023,                                               +        
               LTH=1                                                            
         MFLD  DGIA0037,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TRP4,                                                   +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0092,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0105,                                               +        
               LTH=1                                                            
         MFLD  DGIA0119,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PTID4,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRC4,                                                   +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RAD5,                                                   +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0052,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0065,                                               +        
               LTH=1                                                            
         MFLD  DGIA0079,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0134,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0147,                                               +        
               LTH=1                                                            
         MFLD  DGIA0160,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0011,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0024,                                               +        
               LTH=1                                                            
         MFLD  DGIA0038,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TRP5,                                                   +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0093,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0106,                                               +        
               LTH=1                                                            
         MFLD  DGIA0120,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PTID5,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRC5,                                                   +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RAD6,                                                   +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0053,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0066,                                               +        
               LTH=1                                                            
         MFLD  DGIA0080,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0135,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0148,                                               +        
               LTH=1                                                            
         MFLD  DGIA0161,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0012,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0025,                                               +        
               LTH=1                                                            
         MFLD  DGIA0039,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TRP6,                                                   +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0094,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0107,                                               +        
               LTH=1                                                            
         MFLD  DGIA0121,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PTID6,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRC6,                                                   +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RAD7,                                                   +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0054,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0067,                                               +        
               LTH=1                                                            
         MFLD  DGIA0081,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0136,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0149,                                               +        
               LTH=1                                                            
         MFLD  DGIA0162,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0013,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0026,                                               +        
               LTH=1                                                            
         MFLD  DGIA0040,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TRP7,                                                   +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0095,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0108,                                               +        
               LTH=1                                                            
         MFLD  DGIA0122,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PTID7,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRC7,                                                   +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RAD8,                                                   +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0055,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0068,                                               +        
               LTH=1                                                            
         MFLD  DGIA0082,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0137,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0150,                                               +        
               LTH=1                                                            
         MFLD  DGIA0163,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0014,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0027,                                               +        
               LTH=1                                                            
         MFLD  DGIA0041,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TRP8,                                                   +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0096,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0109,                                               +        
               LTH=1                                                            
         MFLD  DGIA0123,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PTID8,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRC8,                                                   +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RAD9,                                                   +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0056,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0069,                                               +        
               LTH=1                                                            
         MFLD  DGIA0083,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0138,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0151,                                               +        
               LTH=1                                                            
         MFLD  DGIA0164,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0015,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0028,                                               +        
               LTH=1                                                            
         MFLD  DGIA0042,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TRP9,                                                   +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0097,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0110,                                               +        
               LTH=1                                                            
         MFLD  DGIA0124,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PTID9,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRC9,                                                   +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RAD10,                                                  +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0045,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0058,                                               +        
               LTH=1                                                            
         MFLD  DGIA0072,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0127,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0140,                                               +        
               LTH=1                                                            
         MFLD  DGIA0154,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0004,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0017,                                               +        
               LTH=1                                                            
         MFLD  DGIA0031,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TRP10,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0086,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0099,                                               +        
               LTH=1                                                            
         MFLD  DGIA0113,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PTID10,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRC10,                                                  +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RAD11,                                                  +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0046,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0059,                                               +        
               LTH=1                                                            
         MFLD  DGIA0073,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0128,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0141,                                               +        
               LTH=1                                                            
         MFLD  DGIA0155,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0005,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0018,                                               +        
               LTH=1                                                            
         MFLD  DGIA0032,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TRP11,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0087,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0100,                                               +        
               LTH=1                                                            
         MFLD  DGIA0114,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PTID11,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRC11,                                                  +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RAD12,                                                  +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0047,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0060,                                               +        
               LTH=1                                                            
         MFLD  DGIA0074,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0129,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0142,                                               +        
               LTH=1                                                            
         MFLD  DGIA0156,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0006,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0019,                                               +        
               LTH=1                                                            
         MFLD  DGIA0033,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TRP12,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0088,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0101,                                               +        
               LTH=1                                                            
         MFLD  DGIA0115,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PTID12,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRC12,                                                  +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RAD13,                                                  +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0048,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0061,                                               +        
               LTH=1                                                            
         MFLD  DGIA0075,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0130,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0143,                                               +        
               LTH=1                                                            
         MFLD  DGIA0157,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0007,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0020,                                               +        
               LTH=1                                                            
         MFLD  DGIA0034,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TRP13,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0089,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0102,                                               +        
               LTH=1                                                            
         MFLD  DGIA0116,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PTID13,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRC13,                                                  +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0168,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0043,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0070,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0125,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0152,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0002,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0029,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0173,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0084,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0111,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0167,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0166,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
