***********************************************************************         
* CREATED BY V036147   ON 05/04/04  AT 15:39                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'PACKRAPPORTERING AV ORDERDELAR  '                               
W4N313   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T311  ',                                          +        
               14='W4T312  ',                                          +        
               15='W4T313  ',                                          +        
               16='W4T314  ',                                          +        
               17='W4T315  ',                                          +        
               18='W4T316  ',                                          +        
               19='W0T501  ',                                          +        
               20='W4T318  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((3,18)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'PACK REPORTING OF ORDER PARTS',                        +        
               POS=(1,10),LTH=29,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD0141  DFLD  POS=(1,40),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'DC',                                                   +        
               POS=(2,2),LTH=2,                                        +        
               ATTR=(PROT)                                                      
DGIA0065 DFLD  POS=(2,5),LTH=2,                                        +        
               ATTR=(PROT)                                                      
DGIA0066 DFLD  POS=(3,5),LTH=2,                                        +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Picker:',    ,                                         +        
               POS=(3,10),LTH=7,                                       +        
               ATTR=(PROT)                                                      
IDANSTNR DFLD  POS=(3,18),LTH=5,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Label print:',                                         +        
               POS=(3,24),LTH=12,                                      +        
               ATTR=(PROT)                                                      
PRTVALAF DFLD  POS=(3,37),LTH=2,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Del.Note:',                                            +        
               POS=(3,41),LTH=9,                                       +        
               ATTR=(PROT)                                                      
PRTVALFS DFLD  POS=(3,51),LTH=2,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'OP.',                                                  +        
               POS=(5,16),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Distr Prod    No.   Case  Casecode Grossw Type Length W+        
               idth Heigth',                                           +        
               POS=(6,2),LTH=66,                                       +        
               ATTR=(PROT)                                                      
COL0307  DFLD  POS=(7,3),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
COL0807  DFLD  POS=(7,8),LTH=7,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDPKLST DFLD   POS=(7,16),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
IDKOLLI1 DFLD  POS=(7,22),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
KDKOLLI1 DFLD  POS=(7,28),LTH=8,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0101 DFLD  POS=(7,37),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0084 DFLD  POS=(7,47),LTH=1,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0039 DFLD  POS=(7,50),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0013 DFLD  POS=(7,57),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0026 DFLD  POS=(7,62),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0000 DFLD  POS=(7,69),LTH=2,                                       +        
               ATTR=(PROT,NODISP)                                               
DGIA0052 DFLD  POS=(7,72),LTH=2,                                       +        
               ATTR=(NUM,PROT,NODISP)                                           
FLAVSP1  DFLD  POS=(7,75),LTH=1,                                       +        
               ATTR=(NUM,PROT,NODISP)                                           
COL0308  DFLD  POS=(8,3),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
COL0808  DFLD  POS=(8,8),LTH=7,                                        +        
               ATTR=(NUM,NOPROT)                                                
DGIA0076 DFLD  POS=(8,16),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
IDKOLLI2 DFLD  POS=(8,22),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
KDKOLLI2 DFLD  POS=(8,28),LTH=8,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0106 DFLD  POS=(8,37),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0089 DFLD  POS=(8,47),LTH=1,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0044 DFLD  POS=(8,50),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0018 DFLD  POS=(8,57),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0031 DFLD  POS=(8,62),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0005 DFLD  POS=(8,69),LTH=2,                                       +        
               ATTR=(PROT,NODISP)                                               
DGIA0057 DFLD  POS=(8,72),LTH=2,                                       +        
               ATTR=(NUM,PROT,NODISP)                                           
FLAVSP2  DFLD  POS=(8,75),LTH=1,                                       +        
               ATTR=(NUM,PROT,NODISP)                                           
COL0309  DFLD  POS=(9,3),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
COL0809  DFLD  POS=(9,8),LTH=7,                                        +        
               ATTR=(NUM,NOPROT)                                                
DGIA0077 DFLD  POS=(9,16),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
IDKOLLI3 DFLD  POS=(9,22),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
KDKOLLI3 DFLD  POS=(9,28),LTH=8,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0107 DFLD  POS=(9,37),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0090 DFLD  POS=(9,47),LTH=1,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0045 DFLD  POS=(9,50),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0019 DFLD  POS=(9,57),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0032 DFLD  POS=(9,62),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0006 DFLD  POS=(9,69),LTH=2,                                       +        
               ATTR=(PROT,NODISP)                                               
DGIA0058 DFLD  POS=(9,72),LTH=2,                                       +        
               ATTR=(NUM,PROT,NODISP)                                           
FLAVSP3  DFLD  POS=(9,75),LTH=1,                                       +        
               ATTR=(NUM,PROT,NODISP)                                           
COL0310  DFLD  POS=(10,3),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL0810  DFLD  POS=(10,8),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0078 DFLD  POS=(10,16),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
IDKOLLI4 DFLD  POS=(10,22),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
KDKOLLI4 DFLD  POS=(10,28),LTH=8,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0108 DFLD  POS=(10,37),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0091 DFLD  POS=(10,47),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0046 DFLD  POS=(10,50),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0020 DFLD  POS=(10,57),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0033 DFLD  POS=(10,62),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0007 DFLD  POS=(10,69),LTH=2,                                      +        
               ATTR=(PROT,NODISP)                                               
DGIA0059 DFLD  POS=(10,72),LTH=2,                                      +        
               ATTR=(NUM,PROT,NODISP)                                           
FLAVSP4  DFLD  POS=(10,75),LTH=1,                                      +        
               ATTR=(NUM,PROT,NODISP)                                           
COL0311  DFLD  POS=(11,3),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL0811  DFLD  POS=(11,8),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0079 DFLD  POS=(11,16),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
IDKOLLI5 DFLD  POS=(11,22),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
KDKOLLI5 DFLD  POS=(11,28),LTH=8,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0109 DFLD  POS=(11,37),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0092 DFLD  POS=(11,47),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0047 DFLD  POS=(11,50),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0021 DFLD  POS=(11,57),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0034 DFLD  POS=(11,62),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0008 DFLD  POS=(11,69),LTH=2,                                      +        
               ATTR=(PROT,NODISP)                                               
DGIA0060 DFLD  POS=(11,72),LTH=2,                                      +        
               ATTR=(NUM,PROT,NODISP)                                           
FLAVSP5  DFLD  POS=(11,75),LTH=1,                                      +        
               ATTR=(NUM,PROT,NODISP)                                           
COL0312  DFLD  POS=(12,3),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL0812  DFLD  POS=(12,8),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0080 DFLD  POS=(12,16),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
IDKOLLI6 DFLD  POS=(12,22),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
KDKOLLI6 DFLD  POS=(12,28),LTH=8,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0110 DFLD  POS=(12,37),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0093 DFLD  POS=(12,47),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0048 DFLD  POS=(12,50),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0022 DFLD  POS=(12,57),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0035 DFLD  POS=(12,62),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0009 DFLD  POS=(12,69),LTH=2,                                      +        
               ATTR=(PROT,NODISP)                                               
DGIA0061 DFLD  POS=(12,72),LTH=2,                                      +        
               ATTR=(NUM,PROT,NODISP)                                           
FLAVSP6  DFLD  POS=(12,75),LTH=1,                                      +        
               ATTR=(NUM,PROT,NODISP)                                           
COL0313  DFLD  POS=(13,3),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL0813  DFLD  POS=(13,8),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0081 DFLD  POS=(13,16),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
IDKOLLI7 DFLD  POS=(13,22),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
KDKOLLI7 DFLD  POS=(13,28),LTH=8,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0111 DFLD  POS=(13,37),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0094 DFLD  POS=(13,47),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0049 DFLD  POS=(13,50),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0023 DFLD  POS=(13,57),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0036 DFLD  POS=(13,62),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0010 DFLD  POS=(13,69),LTH=2,                                      +        
               ATTR=(PROT,NODISP)                                               
DGIA0062 DFLD  POS=(13,72),LTH=2,                                      +        
               ATTR=(NUM,PROT,NODISP)                                           
FLAVSP7  DFLD  POS=(13,75),LTH=1,                                      +        
               ATTR=(NUM,PROT,NODISP)                                           
COL0314  DFLD  POS=(14,3),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL0814  DFLD  POS=(14,8),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0082 DFLD  POS=(14,16),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
IDKOLLI8 DFLD  POS=(14,22),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
KDKOLLI8 DFLD  POS=(14,28),LTH=8,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0112 DFLD  POS=(14,37),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0095 DFLD  POS=(14,47),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0050 DFLD  POS=(14,50),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0024 DFLD  POS=(14,57),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0037 DFLD  POS=(14,62),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0011 DFLD  POS=(14,69),LTH=2,                                      +        
               ATTR=(PROT,NODISP)                                               
DGIA0063 DFLD  POS=(14,72),LTH=2,                                      +        
               ATTR=(NUM,PROT,NODISP)                                           
FLAVSP8  DFLD  POS=(14,75),LTH=1,                                      +        
               ATTR=(NUM,PROT,NODISP)                                           
COL0315  DFLD  POS=(15,3),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL0815  DFLD  POS=(15,8),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0083 DFLD  POS=(15,16),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
IDKOLLI9 DFLD  POS=(15,22),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
KDKOLLI9 DFLD  POS=(15,28),LTH=8,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0113 DFLD  POS=(15,37),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0096 DFLD  POS=(15,47),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0051 DFLD  POS=(15,50),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0025 DFLD  POS=(15,57),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0038 DFLD  POS=(15,62),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0012 DFLD  POS=(15,69),LTH=2,                                      +        
               ATTR=(PROT,NODISP)                                               
DGIA0064 DFLD  POS=(15,72),LTH=2,                                      +        
               ATTR=(NUM,PROT,NODISP)                                           
FLAVSP9  DFLD  POS=(15,75),LTH=1,                                      +        
               ATTR=(NUM,PROT,NODISP)                                           
COL0316  DFLD  POS=(16,3),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL0816  DFLD  POS=(16,8),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0072 DFLD  POS=(16,16),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0067 DFLD  POS=(16,22),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0097 DFLD  POS=(16,28),LTH=8,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0102 DFLD  POS=(16,37),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0085 DFLD  POS=(16,47),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0040 DFLD  POS=(16,50),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0014 DFLD  POS=(16,57),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0027 DFLD  POS=(16,62),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0001 DFLD  POS=(16,69),LTH=2,                                      +        
               ATTR=(PROT,NODISP)                                               
DGIA0053 DFLD  POS=(16,72),LTH=2,                                      +        
               ATTR=(NUM,PROT,NODISP)                                           
FLAVSP10 DFLD  POS=(16,75),LTH=1,                                      +        
               ATTR=(NUM,PROT,NODISP)                                           
COL0317  DFLD  POS=(17,3),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL0817  DFLD  POS=(17,8),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0073 DFLD  POS=(17,16),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0068 DFLD  POS=(17,22),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0098 DFLD  POS=(17,28),LTH=8,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0103 DFLD  POS=(17,37),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0086 DFLD  POS=(17,47),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0041 DFLD  POS=(17,50),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0015 DFLD  POS=(17,57),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0028 DFLD  POS=(17,62),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0002 DFLD  POS=(17,69),LTH=2,                                      +        
               ATTR=(PROT,NODISP)                                               
DGIA0054 DFLD  POS=(17,72),LTH=2,                                      +        
               ATTR=(NUM,PROT,NODISP)                                           
FLAVSP11 DFLD  POS=(17,75),LTH=1,                                      +        
               ATTR=(NUM,PROT,NODISP)                                           
COL0318  DFLD  POS=(18,3),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL0818  DFLD  POS=(18,8),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0074 DFLD  POS=(18,16),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0069 DFLD  POS=(18,22),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0099 DFLD  POS=(18,28),LTH=8,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0104 DFLD  POS=(18,37),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0087 DFLD  POS=(18,47),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0042 DFLD  POS=(18,50),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0016 DFLD  POS=(18,57),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0029 DFLD  POS=(18,62),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0003 DFLD  POS=(18,69),LTH=2,                                      +        
               ATTR=(PROT,NODISP)                                               
DGIA0055 DFLD  POS=(18,72),LTH=2,                                      +        
               ATTR=(NUM,PROT,NODISP)                                           
FLAVSP12 DFLD  POS=(18,75),LTH=1,                                      +        
               ATTR=(NUM,PROT,NODISP)                                           
COL0319  DFLD  POS=(19,3),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL0819  DFLD  POS=(19,8),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0075 DFLD  POS=(19,16),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0070 DFLD  POS=(19,22),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0100 DFLD  POS=(19,28),LTH=8,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0105 DFLD  POS=(19,37),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0088 DFLD  POS=(19,47),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0043 DFLD  POS=(19,50),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0017 DFLD  POS=(19,57),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0030 DFLD  POS=(19,62),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0004 DFLD  POS=(19,69),LTH=2,                                      +        
               ATTR=(PROT,NODISP)                                               
DGIA0056 DFLD  POS=(19,72),LTH=2,                                      +        
               ATTR=(NUM,PROT,NODISP)                                           
FLAVSP13 DFLD  POS=(19,75),LTH=1,                                      +        
               ATTR=(NUM,PROT,NODISP)                                           
         DFLD  '13 Split of ord 14 Split/Update 15 Case rep 3    16 Cas+        
               e rep 1  17 Case rep 2',                                +        
               POS=(21,2),LTH=77,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18 Case correct 19 Origin',                            +        
               POS=(22,2),LTH=25,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20 Control',                                           +        
               POS=(22,34),LTH=10,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,51),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4O313N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N313,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I313N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  DGIA0065,                                               +        
               LTH=2                                                            
         MFLD  DGIA0066,                                               +        
               LTH=2                                                            
         MFLD  IDANSTNR,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRTVALAF,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRTVALFS,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0307,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0807,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDPKLST,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDKOLLI1,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDKOLLI1,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0101,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0084,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0039,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0013,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0026,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0000,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0052,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLAVSP1,                                                +        
               LTH=1                                                            
         MFLD  COL0308,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0808,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0076,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDKOLLI2,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDKOLLI2,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0106,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0089,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0044,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0018,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0031,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0005,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0057,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLAVSP2,                                                +        
               LTH=1                                                            
         MFLD  COL0309,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0809,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0077,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDKOLLI3,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDKOLLI3,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0107,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0090,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0045,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0019,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0032,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0006,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0058,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLAVSP3,                                                +        
               LTH=1                                                            
         MFLD  COL0310,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0810,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0078,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDKOLLI4,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDKOLLI4,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0108,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0091,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0046,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0020,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0033,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0007,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0059,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLAVSP4,                                                +        
               LTH=1                                                            
         MFLD  COL0311,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0811,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0079,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDKOLLI5,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDKOLLI5,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0109,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0092,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0047,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0021,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0034,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0008,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0060,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLAVSP5,                                                +        
               LTH=1                                                            
         MFLD  COL0312,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0812,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0080,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDKOLLI6,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDKOLLI6,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0110,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0093,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0048,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0022,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0035,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0009,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0061,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLAVSP6,                                                +        
               LTH=1                                                            
         MFLD  COL0313,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0813,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0081,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDKOLLI7,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDKOLLI7,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0111,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0094,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0049,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0023,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0036,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0010,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0062,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLAVSP7,                                                +        
               LTH=1                                                            
         MFLD  COL0314,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0814,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0082,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDKOLLI8,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDKOLLI8,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0112,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0095,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0050,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0024,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0037,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0011,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0063,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLAVSP8,                                                +        
               LTH=1                                                            
         MFLD  COL0315,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0815,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0083,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDKOLLI9,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDKOLLI9,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0113,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0096,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0051,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0025,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0038,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0012,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0064,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLAVSP9,                                                +        
               LTH=1                                                            
         MFLD  COL0316,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0816,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0072,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0067,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0097,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0102,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0085,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0040,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0014,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0027,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0001,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0053,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLAVSP10,                                               +        
               LTH=1                                                            
         MFLD  COL0317,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0817,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0073,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0068,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0098,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0103,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0086,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0041,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0015,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0028,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0002,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0054,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLAVSP11,                                               +        
               LTH=1                                                            
         MFLD  COL0318,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0818,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0074,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0069,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0099,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0104,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0087,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0042,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0016,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0029,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0003,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0055,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLAVSP12,                                               +        
               LTH=1                                                            
         MFLD  COL0319,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0819,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0075,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0070,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0100,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0105,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0088,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0043,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0017,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0030,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0004,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0056,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLAVSP13,                                               +        
               LTH=1                                                            
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I313N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N313),                                           +        
               OPT=2,                                                  +        
               NXT=W4O313N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '43132',                                                +        
               LTH=5                                                            
         MFLD  (DGIA0065,                                              +        
               '++'),                                                  +        
               LTH=2                                                            
         MFLD  DGIA0066,                                               +        
               LTH=2                                                            
         MFLD  (IDANSTNR,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PRTVALAF,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (PRTVALFS,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL0307,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0807,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDPKLST,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDKOLLI1,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDKOLLI1,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0101,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0084,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0039,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0013,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0026,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0000,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0052,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLAVSP1,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL0308,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0808,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0076,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDKOLLI2,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDKOLLI2,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0106,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0089,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0044,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0018,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0031,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0005,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0057,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLAVSP2,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL0309,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0809,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0077,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDKOLLI3,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDKOLLI3,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0107,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0090,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0045,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0019,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0032,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0006,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0058,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLAVSP3,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL0310,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0810,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0078,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDKOLLI4,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDKOLLI4,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0108,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0091,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0046,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0020,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0033,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0007,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0059,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLAVSP4,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL0311,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0811,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0079,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDKOLLI5,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDKOLLI5,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0109,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0092,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0047,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0021,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0034,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0008,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0060,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLAVSP5,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL0312,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0812,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0080,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDKOLLI6,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDKOLLI6,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0110,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0093,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0048,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0022,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0035,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0009,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0061,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLAVSP6,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL0313,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0813,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0081,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDKOLLI7,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDKOLLI7,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0111,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0094,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0049,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0023,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0036,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0010,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0062,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLAVSP7,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL0314,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0814,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0082,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDKOLLI8,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDKOLLI8,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0112,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0095,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0050,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0024,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0037,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0011,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0063,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLAVSP8,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL0315,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0815,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0083,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDKOLLI9,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDKOLLI9,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0113,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0096,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0051,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0025,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0038,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0012,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0064,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLAVSP9,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL0316,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0816,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0072,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0067,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0097,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0102,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0085,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0040,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0014,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0027,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0001,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0053,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLAVSP10,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL0317,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0817,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0073,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0068,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0098,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0103,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0086,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0041,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0015,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0028,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0002,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0054,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLAVSP11,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL0318,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0818,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0074,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0069,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0099,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0104,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0087,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0042,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0016,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0029,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0003,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0055,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLAVSP12,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL0319,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0819,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0075,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0070,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0100,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0105,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0088,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0043,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0017,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0030,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0004,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0056,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLAVSP13,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
