***********************************************************************         
* CREATED BY PC36147   ON 96/03/11  AT 15:30                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'DELA ORDERFLAMLÄNDSKT FORMAT    '                               
W4N311   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T311  ',                                          +        
               14='W4T312  ',                                          +        
               15='W4T313  ',                                          +        
               16='W4T314  ',                                          +        
               17='W4T315  ',                                          +        
               18='W4T316  ',                                          +        
               19='W4T317  ',                                          +        
               20='W4T318  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((2,9)),                                         +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'SPLIT OF ORDER',                                       +        
               POS=(1,11),LTH=14,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Picker',                                               +        
               POS=(2,2),LTH=6,                                        +        
               ATTR=(NUM,PROT)                                                  
DGIA0000 DFLD  POS=(2,9),LTH=5,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Distr',                                                +        
               POS=(2,15),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
DISTRIN  DFLD  POS=(2,21),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Cust',                                                 +        
               POS=(2,26),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
KUNDIN   DFLD  POS=(2,31),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Order',                                                +        
               POS=(2,38),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
ORDERIN  DFLD  POS=(2,44),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Case',                                                 +        
               POS=(2,50),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
KOLLIIN  DFLD  POS=(2,55),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Prod',                                                 +        
               POS=(2,61),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0004 DFLD  POS=(2,66),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DC',                                                   +        
               POS=(2,74),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0002 DFLD  POS=(2,77),LTH=2,                                       +        
               ATTR=(ALPHA,NOPROT)                                              
DGIA0001 DFLD  POS=(3,9),LTH=5,                                        +        
               ATTR=(PROT,MOD)                                                  
DISTRUT  DFLD  POS=(3,21),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
KUNDUT   DFLD  POS=(3,31),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
ORDERUT  DFLD  POS=(3,44),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
KOLLIUT  DFLD  POS=(3,55),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0005 DFLD  POS=(3,66),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0003 DFLD  POS=(3,77),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Prod    Suffix',                                       +        
               POS=(5,3),LTH=14,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Line-from   Line-to',                                  +        
               POS=(5,22),LTH=19,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '-',                                                    +        
               POS=(6,10),LTH=1,                                       +        
               ATTR=(PROT)                                                      
PLKLST   DFLD  POS=(6,14),LTH=3,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
RADFOM   DFLD  POS=(6,24),LTH=4,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
RADTOM   DFLD  POS=(6,36),LTH=4,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
PRODNO   DFLD  POS=(7,2),LTH=7,                                        +        
               ATTR=(PROT,MOD)                                                  
         DFLD  '13 Split of ord 14 Split/Update 15 Case rep 3   16 Case+        
                rep 1   17 Case rep 2',                                +        
               POS=(21,2),LTH=77,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18 Case correct 19 Origin',                            +        
               POS=(22,2),LTH=25,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20 Control',                                           +        
               POS=(22,34),LTH=10,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4O311N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N311,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I311N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  DGIA0000,                                               +        
               LTH=5                                                            
         MFLD  DGIA0001,                                               +        
               LTH=5                                                            
         MFLD  DISTRIN,                                                +        
               LTH=4                                                            
         MFLD  DISTRUT,                                                +        
               LTH=4                                                            
         MFLD  KUNDIN,                                                 +        
               LTH=6                                                            
         MFLD  KUNDUT,                                                 +        
               LTH=6                                                            
         MFLD  ORDERIN,                                                +        
               LTH=5                                                            
         MFLD  ORDERUT,                                                +        
               LTH=5                                                            
         MFLD  KOLLIIN,                                                +        
               LTH=5                                                            
         MFLD  KOLLIUT,                                                +        
               LTH=5                                                            
         MFLD  DGIA0004,                                               +        
               LTH=7                                                            
         MFLD  DGIA0005,                                               +        
               LTH=7                                                            
         MFLD  DGIA0002,                                               +        
               LTH=2                                                            
         MFLD  DGIA0003,                                               +        
               LTH=2                                                            
         MFLD  PRODNO,                                                 +        
               LTH=7                                                            
         MFLD  PLKLST,                                                 +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RADFOM,                                                 +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RADTOM,                                                 +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I311N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N311),                                           +        
               OPT=2,                                                  +        
               NXT=W4O311N1                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '43112',                                                +        
               LTH=5                                                            
         MFLD  (DGIA0000,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0001,                                               +        
               LTH=5                                                            
         MFLD  (DISTRIN,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DISTRUT,                                                +        
               LTH=4                                                            
         MFLD  (KUNDIN,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KUNDUT,                                                 +        
               LTH=6                                                            
         MFLD  (ORDERIN,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  ORDERUT,                                                +        
               LTH=5                                                            
         MFLD  (KOLLIIN,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KOLLIUT,                                                +        
               LTH=5                                                            
         MFLD  (DGIA0004,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0005,                                               +        
               LTH=7                                                            
         MFLD  (DGIA0002,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  DGIA0003,                                               +        
               LTH=2                                                            
         MFLD  (PLKLST,                                                +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RADFOM,                                                +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RADTOM,                                                +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  PRODNO,                                                 +        
               LTH=7                                                            
         MSGEND                                                                 
         END                                                                    
