***********************************************************************         
* CREATED BY V073825   ON 99/11/08  AT 14:09                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE '                                '                               
W4N302   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T301  ',                                          +        
               14='W4T302  ',                                          +        
               15='W4T303  ',                                          +        
               16='W0T501  ',                                          +        
               17='W4T305  ',                                          +        
               18='W4T306  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((3,48)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'PACKING REPORTING PER ORDER',                          +        
               POS=(1,11),LTH=27,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'DC',                                                   +        
               POS=(2,2),LTH=2,                                        +        
               ATTR=(NUM,PROT)                                                  
DGIA0000 DFLD  POS=(2,5),LTH=2,                                        +        
               ATTR=(PROT)                                                      
DGIA0001 DFLD  POS=(3,5),LTH=2,                                        +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'AF-prin:',                                             +        
               POS=(3,39),LTH=8,                                       +        
               ATTR=(PROT)                                                      
PRTVALAF DFLD  POS=(3,48),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  '<-----------------  ONLY FOR ONE CASE  ----------------+        
               ------>',                                               +        
               POS=(5,19),LTH=62,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Distr Prod   Dev Case  Casecode Grossw  Address',      +        
               POS=(6,2),LTH=47,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Type Length Width Heigth',                             +        
               POS=(6,55),LTH=24,                                      +        
               ATTR=(PROT)                                                      
COL0307  DFLD  POS=(7,3),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
COL0807  DFLD  POS=(7,8),LTH=7,                                        +        
               ATTR=(NUM,NOPROT)                                                
COL1607  DFLD  POS=(7,16),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL1907  DFLD  POS=(7,19),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL2507  DFLD  POS=(7,25),LTH=8,                                       +        
               ATTR=(NOPROT)                                                    
COL3407  DFLD  POS=(7,34),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL4207  DFLD  POS=(7,42),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL4907  DFLD  POS=(7,49),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
COL5807  DFLD  POS=(7,58),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL6107  DFLD  POS=(7,61),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
COL6807  DFLD  POS=(7,68),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
COL7307  DFLD  POS=(7,73),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
COL0308  DFLD  POS=(8,3),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
COL0808  DFLD  POS=(8,8),LTH=7,                                        +        
               ATTR=(NUM,NOPROT)                                                
COL1608  DFLD  POS=(8,16),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL1908  DFLD  POS=(8,19),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL2508  DFLD  POS=(8,25),LTH=8,                                       +        
               ATTR=(NOPROT)                                                    
COL3408  DFLD  POS=(8,34),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL4208  DFLD  POS=(8,42),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL4908  DFLD  POS=(8,49),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
COL5808  DFLD  POS=(8,58),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL6108  DFLD  POS=(8,61),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
COL6808  DFLD  POS=(8,68),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
COL7308  DFLD  POS=(8,73),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
COL0309  DFLD  POS=(9,3),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
COL0809  DFLD  POS=(9,8),LTH=7,                                        +        
               ATTR=(NUM,NOPROT)                                                
COL1609  DFLD  POS=(9,16),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL1909  DFLD  POS=(9,19),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL2509  DFLD  POS=(9,25),LTH=8,                                       +        
               ATTR=(NOPROT)                                                    
COL3409  DFLD  POS=(9,34),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL4209  DFLD  POS=(9,42),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL4909  DFLD  POS=(9,49),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
COL5809  DFLD  POS=(9,58),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL6109  DFLD  POS=(9,61),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
COL6809  DFLD  POS=(9,68),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
COL7309  DFLD  POS=(9,73),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
COL0310  DFLD  POS=(10,3),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL0810  DFLD  POS=(10,8),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL1610  DFLD  POS=(10,16),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
COL1910  DFLD  POS=(10,19),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL2510  DFLD  POS=(10,25),LTH=8,                                      +        
               ATTR=(NOPROT)                                                    
COL3410  DFLD  POS=(10,34),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL4210  DFLD  POS=(10,42),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL4910  DFLD  POS=(10,49),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
COL5810  DFLD  POS=(10,58),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
COL6110  DFLD  POS=(10,61),LTH=4,                                      +        
               ATTR=(NOPROT)                                                    
COL6810  DFLD  POS=(10,68),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
COL7310  DFLD  POS=(10,73),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
COL0311  DFLD  POS=(11,3),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL0811  DFLD  POS=(11,8),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL1611  DFLD  POS=(11,16),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
COL1911  DFLD  POS=(11,19),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL2511  DFLD  POS=(11,25),LTH=8,                                      +        
               ATTR=(NOPROT)                                                    
COL3411  DFLD  POS=(11,34),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL4211  DFLD  POS=(11,42),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL4911  DFLD  POS=(11,49),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
COL5811  DFLD  POS=(11,58),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
COL6111  DFLD  POS=(11,61),LTH=4,                                      +        
               ATTR=(NOPROT)                                                    
COL6811  DFLD  POS=(11,68),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
COL7311  DFLD  POS=(11,73),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
COL0312  DFLD  POS=(12,3),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL0812  DFLD  POS=(12,8),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL1612  DFLD  POS=(12,16),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
COL1912  DFLD  POS=(12,19),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL2512  DFLD  POS=(12,25),LTH=8,                                      +        
               ATTR=(NOPROT)                                                    
COL3412  DFLD  POS=(12,34),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL4212  DFLD  POS=(12,42),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL4912  DFLD  POS=(12,49),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
COL5812  DFLD  POS=(12,58),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
COL6112  DFLD  POS=(12,61),LTH=4,                                      +        
               ATTR=(NOPROT)                                                    
COL6812  DFLD  POS=(12,68),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
COL7312  DFLD  POS=(12,73),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
COL0313  DFLD  POS=(13,3),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL0813  DFLD  POS=(13,8),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL1613  DFLD  POS=(13,16),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
COL1913  DFLD  POS=(13,19),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL2513  DFLD  POS=(13,25),LTH=8,                                      +        
               ATTR=(NOPROT)                                                    
COL3413  DFLD  POS=(13,34),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL4213  DFLD  POS=(13,42),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL4913  DFLD  POS=(13,49),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
COL5813  DFLD  POS=(13,58),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
COL6113  DFLD  POS=(13,61),LTH=4,                                      +        
               ATTR=(NOPROT)                                                    
COL6813  DFLD  POS=(13,68),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
COL7313  DFLD  POS=(13,73),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
COL0314  DFLD  POS=(14,3),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL0814  DFLD  POS=(14,8),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL1614  DFLD  POS=(14,16),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
COL1914  DFLD  POS=(14,19),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL2514  DFLD  POS=(14,25),LTH=8,                                      +        
               ATTR=(NOPROT)                                                    
COL3414  DFLD  POS=(14,34),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL4214  DFLD  POS=(14,42),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL4914  DFLD  POS=(14,49),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
COL5814  DFLD  POS=(14,58),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
COL6114  DFLD  POS=(14,61),LTH=4,                                      +        
               ATTR=(NOPROT)                                                    
COL6814  DFLD  POS=(14,68),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
COL7314  DFLD  POS=(14,73),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
COL0315  DFLD  POS=(15,3),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL0815  DFLD  POS=(15,8),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL1615  DFLD  POS=(15,16),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
COL1915  DFLD  POS=(15,19),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL2515  DFLD  POS=(15,25),LTH=8,                                      +        
               ATTR=(NOPROT)                                                    
COL3415  DFLD  POS=(15,34),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL4215  DFLD  POS=(15,42),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL4915  DFLD  POS=(15,49),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
COL5815  DFLD  POS=(15,58),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
COL6115  DFLD  POS=(15,61),LTH=4,                                      +        
               ATTR=(NOPROT)                                                    
COL6815  DFLD  POS=(15,68),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
COL7315  DFLD  POS=(15,73),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
COL0316  DFLD  POS=(16,3),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL0816  DFLD  POS=(16,8),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL1616  DFLD  POS=(16,16),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
COL1916  DFLD  POS=(16,19),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL2516  DFLD  POS=(16,25),LTH=8,                                      +        
               ATTR=(NOPROT)                                                    
COL3416  DFLD  POS=(16,34),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL4216  DFLD  POS=(16,42),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL4916  DFLD  POS=(16,49),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
COL5816  DFLD  POS=(16,58),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
COL6116  DFLD  POS=(16,61),LTH=4,                                      +        
               ATTR=(NOPROT)                                                    
COL6816  DFLD  POS=(16,68),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
COL7316  DFLD  POS=(16,73),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
COL0317  DFLD  POS=(17,3),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL0817  DFLD  POS=(17,8),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL1617  DFLD  POS=(17,16),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
COL1917  DFLD  POS=(17,19),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL2517  DFLD  POS=(17,25),LTH=8,                                      +        
               ATTR=(NOPROT)                                                    
COL3417  DFLD  POS=(17,34),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL4217  DFLD  POS=(17,42),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL4917  DFLD  POS=(17,49),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
COL5817  DFLD  POS=(17,58),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
COL6117  DFLD  POS=(17,61),LTH=4,                                      +        
               ATTR=(NOPROT)                                                    
COL6817  DFLD  POS=(17,68),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
COL7317  DFLD  POS=(17,73),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
COL0318  DFLD  POS=(18,3),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL0818  DFLD  POS=(18,8),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL1618  DFLD  POS=(18,16),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
COL1918  DFLD  POS=(18,19),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL2518  DFLD  POS=(18,25),LTH=8,                                      +        
               ATTR=(NOPROT)                                                    
COL3418  DFLD  POS=(18,34),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL4218  DFLD  POS=(18,42),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL4918  DFLD  POS=(18,49),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
COL5818  DFLD  POS=(18,58),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
COL6118  DFLD  POS=(18,61),LTH=4,                                      +        
               ATTR=(NOPROT)                                                    
COL6818  DFLD  POS=(18,68),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
COL7318  DFLD  POS=(18,73),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
COL0319  DFLD  POS=(19,3),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL0819  DFLD  POS=(19,8),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL1619  DFLD  POS=(19,16),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
COL1919  DFLD  POS=(19,19),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL2519  DFLD  POS=(19,25),LTH=8,                                      +        
               ATTR=(NOPROT)                                                    
COL3419  DFLD  POS=(19,34),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL4219  DFLD  POS=(19,42),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL4919  DFLD  POS=(19,49),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
COL5819  DFLD  POS=(19,58),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
COL6119  DFLD  POS=(19,61),LTH=4,                                      +        
               ATTR=(NOPROT)                                                    
COL6819  DFLD  POS=(19,68),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
COL7319  DFLD  POS=(19,73),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  '13 Basis Sweden 14 Basis export 15 Basis vario  16 Kit +        
               reportin 17 Re-start',                                  +        
               POS=(21,2),LTH=75,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4O302N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N302,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I302N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  DGIA0000,                                               +        
               LTH=2                                                            
         MFLD  DGIA0001,                                               +        
               LTH=2                                                            
         MFLD  PRTVALAF,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0307,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0807,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1607,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1907,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2507,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3407,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4207,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4907,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL5807,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL6107,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL6807,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL7307,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0308,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0808,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1608,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1908,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2508,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3408,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4208,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4908,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL5808,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL6108,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL6808,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL7308,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0309,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0809,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1609,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1909,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2509,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3409,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4209,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4909,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL5809,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL6109,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL6809,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL7309,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0310,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0810,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1610,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1910,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2510,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3410,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4210,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4910,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL5810,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL6110,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL6810,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL7310,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0311,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0811,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1611,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1911,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2511,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3411,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4211,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4911,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL5811,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL6111,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL6811,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL7311,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0312,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0812,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1612,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1912,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2512,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3412,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4212,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4912,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL5812,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL6112,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL6812,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL7312,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0313,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0813,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1613,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1913,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2513,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3413,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4213,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4913,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL5813,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL6113,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL6813,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL7313,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0314,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0814,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1614,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1914,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2514,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3414,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4214,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4914,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL5814,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL6114,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL6814,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL7314,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0315,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0815,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1615,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1915,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2515,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3415,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4215,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4915,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL5815,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL6115,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL6815,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL7315,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0316,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0816,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1616,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1916,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2516,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3416,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4216,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4916,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL5816,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL6116,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL6816,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL7316,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0317,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0817,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1617,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1917,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2517,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3417,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4217,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4917,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL5817,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL6117,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL6817,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL7317,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0318,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0818,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1618,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1918,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2518,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3418,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4218,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4918,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL5818,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL6118,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL6818,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL7318,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0319,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0819,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1619,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1919,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2519,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL3419,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4219,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4919,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL5819,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL6119,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL6819,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL7319,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4O302N2 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N302,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I302N1,                                           +        
               FILL=PT                                                          
DGI00003 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I302N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N302),                                           +        
               OPT=2,                                                  +        
               NXT=W4O302N1                                                     
DGI00004 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '43022',                                                +        
               LTH=5                                                            
         MFLD  (DGIA0000,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  DGIA0001,                                               +        
               LTH=2                                                            
         MFLD  (PRTVALAF,                                              +        
               '++'),                                                  +        
               LTH=2                                                            
         MFLD  (COL0307,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0807,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1607,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL1907,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2507,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL3407,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4207,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4907,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL5807,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL6107,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL6807,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL7307,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0308,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0808,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1608,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL1908,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2508,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL3408,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4208,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4908,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL5808,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL6108,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL6808,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL7308,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0309,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0809,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1609,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL1909,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2509,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL3409,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4209,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4909,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL5809,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL6109,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL6809,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL7309,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0310,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0810,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1610,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL1910,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2510,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL3410,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4210,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4910,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL5810,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL6110,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL6810,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL7310,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0311,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0811,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1611,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL1911,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2511,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL3411,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4211,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4911,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL5811,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL6111,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL6811,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL7311,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0312,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0812,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1612,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL1912,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2512,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL3412,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4212,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4912,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL5812,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL6112,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL6812,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL7312,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0313,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0813,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1613,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL1913,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2513,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL3413,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4213,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4913,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL5813,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL6113,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL6813,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL7313,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0314,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0814,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1614,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL1914,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2514,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL3414,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4214,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4914,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL5814,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL6114,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL6814,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL7314,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0315,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0815,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1615,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL1915,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2515,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL3415,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4215,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4915,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL5815,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL6115,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL6815,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL7315,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0316,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0816,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1616,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL1916,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2516,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL3416,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4216,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4916,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL5816,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL6116,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL6816,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL7316,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0317,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0817,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1617,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL1917,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2517,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL3417,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4217,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4917,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL5817,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL6117,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL6817,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL7317,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0318,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0818,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1618,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL1918,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2518,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL3418,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4218,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4918,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL5818,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL6118,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL6818,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL7318,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0319,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0819,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1619,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL1919,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2519,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL3419,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4219,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4919,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL5819,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL6119,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL6819,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL7319,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
