***********************************************************************         
* CREATED BY V036147   ON 10/05/12  AT 10:41                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'RULES FOR PRC                   '                               
W4N364   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYMSG,                                          +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W4T364 7',                                           +        
               8='W4T364 7',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T364U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T361  ',                                          +        
               14='W4T362  ',                                          +        
               15='W4T363  ',                                          +        
               16='W4T364  ',                                          +        
               17='W4T365  ',                                          +        
               18='W4T366  ',                                          +        
               19='W4T367  ',                                          +        
               20='W4T368  ',                                          +        
               21='W4T369  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W4N364   DPAGE CURSOR=((2,9)),                                         +        
               FILL=PT                                                          
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Rules For PRC',                                        +        
               POS=(1,11),LTH=13,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,40),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'PRC',                                                  +        
               POS=(2,2),LTH=3,                                        +        
               ATTR=(PROT)                                                      
FLD0209  DFLD  POS=(2,9),LTH=4,                                        +        
               ATTR=(NOPROT)                                                    
         DFLD  'DC',                                                   +        
               POS=(2,17),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DGIA0000 DFLD  POS=(2,21),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FLD0309  DFLD  POS=(3,9),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
DGIA0001 DFLD  POS=(3,21),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0402  DFLD  POS=(4,2),LTH=1,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0404  DFLD  POS=(4,4),LTH=1,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'Copy/delete',                                          +        
               POS=(5,2),LTH=11,                                       +        
               ATTR=(PROT)                                                      
PRCUPDAT DFLD  POS=(5,14),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Description',                                          +        
               POS=(5,19),LTH=11,                                      +        
               ATTR=(NUM,PROT)                                                  
BESKRIV  DFLD  POS=(5,31),LTH=15,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Prod.grp.',                                            +        
               POS=(5,47),LTH=9,                                       +        
               ATTR=(NUM,PROT)                                                  
PRODGRP  DFLD  POS=(5,57),LTH=5,                                       +        
               ATTR=(PROT)                                                      
PRODGRPU DFLD  POS=(5,63),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Prod.class',                                           +        
               POS=(7,2),LTH=10,                                       +        
               ATTR=(PROT)                                                      
PRODKLAS DFLD  POS=(7,13),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'PRC type',                                             +        
               POS=(7,16),LTH=8,                                       +        
               ATTR=(PROT)                                                      
PRCTYP   DFLD  POS=(7,25),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Main PRC',                                             +        
               POS=(7,30),LTH=8,                                       +        
               ATTR=(PROT)                                                      
HUVPRC   DFLD  POS=(7,39),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Limit own case',                                       +        
               POS=(7,46),LTH=14,                                      +        
               ATTR=(PROT)                                                      
KOLLIGR  DFLD  POS=(7,61),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'M3',                                                   +        
               POS=(7,66),LTH=2,                                       +        
               ATTR=(ALPHA,PROT)                                                
PRODKLAU DFLD  POS=(8,13),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
PRCTYPU  DFLD  POS=(8,25),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
HUVPRCU  DFLD  POS=(8,39),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
KOLLIGRU DFLD  POS=(8,61),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Pickup PRC',                                           +        
               POS=(9,2),LTH=10,                                       +        
               ATTR=(PROT)                                                      
DGIA0022 DFLD  POS=(9,16),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0023 DFLD  POS=(9,21),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0024 DFLD  POS=(9,26),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0025 DFLD  POS=(9,31),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0026 DFLD  POS=(9,36),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0027 DFLD  POS=(9,41),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0028 DFLD  POS=(9,46),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0029 DFLD  POS=(9,51),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0030 DFLD  POS=(9,56),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0031 DFLD  POS=(9,61),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0032 DFLD  POS=(10,16),LTH=4,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0033 DFLD  POS=(10,21),LTH=4,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0034 DFLD  POS=(10,26),LTH=4,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0035 DFLD  POS=(10,31),LTH=4,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0036 DFLD  POS=(10,36),LTH=4,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0037 DFLD  POS=(10,41),LTH=4,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0038 DFLD  POS=(10,46),LTH=4,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0039 DFLD  POS=(10,51),LTH=4,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0040 DFLD  POS=(10,56),LTH=4,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0041 DFLD  POS=(10,61),LTH=4,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Wait time',                                            +        
               POS=(11,2),LTH=9,                                       +        
               ATTR=(PROT)                                                      
VANTID   DFLD  POS=(11,13),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Splitfactor',                                          +        
               POS=(11,20),LTH=11,                                     +        
               ATTR=(PROT)                                                      
SPLIT    DFLD  POS=(11,32),LTH=4,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Consolidate Order (Y/N)',                              +        
               POS=(11,38),LTH=23,                                     +        
               ATTR=(PROT)                                                      
FLSTJUT  DFLD  POS=(11,62),LTH=1,                                      +        
               ATTR=(PROT)                                                      
VANTIDU  DFLD  POS=(12,13),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
SPLITU   DFLD  POS=(12,32),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
FLSTJIN  DFLD  POS=(12,62),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'P-time all WA',                                        +        
               POS=(13,2),LTH=13,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '(Y/N)',                                                +        
               POS=(13,23),LTH=5,                                      +        
               ATTR=(PROT)                                                      
JANEJSW  DFLD  POS=(13,29),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Only for',                                             +        
               POS=(13,32),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DGIA0002 DFLD  POS=(13,41),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0003 DFLD  POS=(13,44),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0004 DFLD  POS=(13,47),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0005 DFLD  POS=(13,50),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0006 DFLD  POS=(13,53),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0007 DFLD  POS=(13,56),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0008 DFLD  POS=(13,59),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0009 DFLD  POS=(13,62),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0010 DFLD  POS=(13,65),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0011 DFLD  POS=(13,68),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0012 DFLD  POS=(14,41),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0013 DFLD  POS=(14,44),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0014 DFLD  POS=(14,47),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0015 DFLD  POS=(14,50),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0016 DFLD  POS=(14,53),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0017 DFLD  POS=(14,56),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0018 DFLD  POS=(14,59),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0019 DFLD  POS=(14,62),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0020 DFLD  POS=(14,65),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0021 DFLD  POS=(14,68),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'PU rule:',                                             +        
               POS=(15,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
ORDER    DFLD  POS=(15,18),LTH=7,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Order',                                                +        
               POS=(15,26),LTH=5,                                      +        
               ATTR=(ALPHA,PROT)                                                
RADER    DFLD  POS=(15,32),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Lines',                                                +        
               POS=(15,38),LTH=5,                                      +        
               ATTR=(ALPHA,PROT)                                                
KG       DFLD  POS=(15,44),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Kg',                                                   +        
               POS=(15,53),LTH=2,                                      +        
               ATTR=(ALPHA,PROT)                                                
M3       DFLD  POS=(15,56),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'M3',                                                   +        
               POS=(15,65),LTH=2,                                      +        
               ATTR=(ALPHA,PROT)                                                
ORDERU   DFLD  POS=(16,18),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
RADERU   DFLD  POS=(16,32),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
KGU      DFLD  POS=(16,44),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
M3U      DFLD  POS=(16,56),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Limit own PU:',                                        +        
               POS=(17,18),LTH=13,                                     +        
               ATTR=(PROT)                                                      
RADERPS  DFLD  POS=(17,32),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Lines',                                                +        
               POS=(17,38),LTH=5,                                      +        
               ATTR=(ALPHA,PROT)                                                
KGPS     DFLD  POS=(17,44),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Kg',                                                   +        
               POS=(17,53),LTH=2,                                      +        
               ATTR=(ALPHA,PROT)                                                
M3PS     DFLD  POS=(17,56),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'M3',                                                   +        
               POS=(17,65),LTH=2,                                      +        
               ATTR=(ALPHA,PROT)                                                
RADERPSU DFLD  POS=(18,32),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
KGPSU    DFLD  POS=(18,44),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
M3PSU    DFLD  POS=(18,56),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '13 Prod class 14 Main area def.15 Pr.time def. 16 Rules+        
                PRC    17 Print PRC',                                  +        
               POS=(21,2),LTH=75,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18 PRC table  19 Cust.file',                           +        
               POS=(22,2),LTH=26,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20 Agr.work.hrs 21 Change work. 10 WHELP',             +        
               POS=(22,33),LTH=40,                                     +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYMSG   DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4I364N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N364),                                           +        
               OPT=2,                                                  +        
               NXT=W4O364N1                                                     
MID      LPAGE SOR=(W4N364),                                           +        
               NXT=W4O364N1                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '43642',                                                +        
               LTH=5                                                            
         MFLD  (FLD0209,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0309,                                                +        
               LTH=4                                                            
         MFLD  (DGIA0000,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  DGIA0001,                                               +        
               LTH=2                                                            
         MFLD  FLD0402,                                                +        
               LTH=1                                                            
         MFLD  FLD0404,                                                +        
               LTH=1                                                            
         MFLD  (JANEJSW,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (PRCUPDAT,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (BESKRIV,                                               +        
               '+++++++++++++++'),                                     +        
               LTH=15                                                           
         MFLD  (PRODGRPU,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PRODKLAU,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (PRCTYPU,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (HUVPRCU,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOLLIGRU,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0032,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0033,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0034,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0035,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0036,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0037,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0038,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0039,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0040,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0041,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (VANTIDU,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (SPLITU,                                                +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLSTJIN,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (DGIA0012,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0013,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0014,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0015,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0016,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0017,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0018,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0019,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0020,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0021,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ORDERU,                                                +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RADERU,                                                +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KGU,                                                   +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (M3U,                                                   +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RADERPSU,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KGPSU,                                                 +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (M3PSU,                                                 +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
W4O364N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N364,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I364N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W4N364,                                             +        
               NXT=W4I364N1                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  FLD0209,                                                +        
               LTH=4                                                            
         MFLD  FLD0309,                                                +        
               LTH=4                                                            
         MFLD  DGIA0000,                                               +        
               LTH=2                                                            
         MFLD  DGIA0001,                                               +        
               LTH=2                                                            
         MFLD  FLD0402,                                                +        
               LTH=1                                                            
         MFLD  FLD0404,                                                +        
               LTH=1                                                            
         MFLD  PRCUPDAT,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BESKRIV,                                                +        
               LTH=17,                                                 +        
               ATTR=(YES)                                                       
         MFLD  PRODGRP,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRODGRPU,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRODKLAS,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRCTYP,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  HUVPRC,                                                 +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLIGR,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRODKLAU,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRCTYPU,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  HUVPRCU,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLIGRU,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0022,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0023,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0024,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0025,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0026,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0027,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0028,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0029,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0030,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0031,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0032,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0033,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0034,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0035,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0036,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0037,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0038,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0039,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0040,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0041,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VANTID,                                                 +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SPLIT,                                                  +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLSTJUT,                                                +        
               LTH=1                                                            
         MFLD  VANTIDU,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SPLITU,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLSTJIN,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  JANEJSW,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0002,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0003,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0004,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0005,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0006,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0007,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0008,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0009,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0010,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0011,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0012,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0013,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0014,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0015,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0016,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0017,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0018,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0019,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0020,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0021,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ORDER,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RADER,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KG,                                                     +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  M3,                                                     +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ORDERU,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RADERU,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KGU,                                                    +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  M3U,                                                    +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RADERPS,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KGPS,                                                   +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  M3PS,                                                   +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  RADERPSU,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KGPSU,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  M3PSU,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  FSYMSG,                                                 +        
               LTH=79                                                           
         MSGEND                                                                 
         END                                                                    
