***********************************************************************         
* CREATED BY PCC4448   ON 95/04/06  AT 09:50                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE '                                '                               
W4N303   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T301  ',                                          +        
               14='W4T302  ',                                          +        
               15='W4T303  ',                                          +        
               16='W0T501  ',                                          +        
               17='W4T305  ',                                          +        
               18='W4T306  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((6,2)),                                         +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'PACKING REPORTING VARIOUS',                            +        
               POS=(1,12),LTH=25,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'DC',                                                   +        
               POS=(2,2),LTH=2,                                        +        
               ATTR=(NUM,PROT)                                                  
DGIA0000 DFLD  POS=(2,5),LTH=2,                                        +        
               ATTR=(PROT)                                                      
DGIA0001 DFLD  POS=(3,5),LTH=2,                                        +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Distr  Prod',                                          +        
               POS=(5,2),LTH=11,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Dev',                                                  +        
               POS=(5,18),LTH=3,                                       +        
               ATTR=(PROT)                                                      
COL0206  DFLD  POS=(6,2),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
COL0906  DFLD  POS=(6,9),LTH=7,                                        +        
               ATTR=(NUM,NOPROT)                                                
COL1906  DFLD  POS=(6,19),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL0207  DFLD  POS=(7,2),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
COL0907  DFLD  POS=(7,9),LTH=7,                                        +        
               ATTR=(NUM,NOPROT)                                                
COL1907  DFLD  POS=(7,19),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL0208  DFLD  POS=(8,2),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
COL0908  DFLD  POS=(8,9),LTH=7,                                        +        
               ATTR=(NUM,NOPROT)                                                
COL1908  DFLD  POS=(8,19),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL0209  DFLD  POS=(9,2),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
COL0909  DFLD  POS=(9,9),LTH=7,                                        +        
               ATTR=(NUM,NOPROT)                                                
COL1909  DFLD  POS=(9,19),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL0210  DFLD  POS=(10,2),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL0910  DFLD  POS=(10,9),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL1910  DFLD  POS=(10,19),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
COL0211  DFLD  POS=(11,2),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL0911  DFLD  POS=(11,9),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL1911  DFLD  POS=(11,19),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
COL0212  DFLD  POS=(12,2),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL0912  DFLD  POS=(12,9),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL1912  DFLD  POS=(12,19),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
COL0213  DFLD  POS=(13,2),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL0913  DFLD  POS=(13,9),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL1913  DFLD  POS=(13,19),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
COL0214  DFLD  POS=(14,2),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL0914  DFLD  POS=(14,9),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL1914  DFLD  POS=(14,19),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
COL0215  DFLD  POS=(15,2),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL0915  DFLD  POS=(15,9),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL1915  DFLD  POS=(15,19),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
COL0216  DFLD  POS=(16,2),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL0916  DFLD  POS=(16,9),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL1916  DFLD  POS=(16,19),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
COL0217  DFLD  POS=(17,2),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL0917  DFLD  POS=(17,9),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL1917  DFLD  POS=(17,19),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
COL0218  DFLD  POS=(18,2),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL0918  DFLD  POS=(18,9),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL1918  DFLD  POS=(18,19),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  '13 Basis Sweden 14 Basis export 15 Basis vario  16',   +        
               POS=(21,2),LTH=50,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17 Re-start',                                          +        
               POS=(21,66),LTH=11,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4O303N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N303,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I303N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  DGIA0000,                                               +        
               LTH=2                                                            
         MFLD  DGIA0001,                                               +        
               LTH=2                                                            
         MFLD  COL0206,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0906,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1906,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0207,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0907,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1907,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0208,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0908,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1908,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0209,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0909,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1909,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0210,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0910,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1910,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0211,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0911,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1911,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0212,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0912,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1912,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0213,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0913,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1913,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0214,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0914,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1914,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0215,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0915,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1915,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0216,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0916,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1916,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0217,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0917,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1917,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0218,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0918,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1918,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4O303N2 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N303,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I303N1,                                           +        
               FILL=PT                                                          
DGI00003 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  DGIA0000,                                               +        
               LTH=2                                                            
         MFLD  DGIA0001,                                               +        
               LTH=2                                                            
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I303N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N303),                                           +        
               OPT=2,                                                  +        
               NXT=W4O303N1                                                     
DGI00004 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '43032',                                                +        
               LTH=5                                                            
         MFLD  (DGIA0000,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  DGIA0001,                                               +        
               LTH=2                                                            
         MFLD  (COL0206,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0906,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1906,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL0207,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0907,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1907,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL0208,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0908,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1908,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL0209,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0909,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1909,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL0210,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0910,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1910,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL0211,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0911,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1911,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL0212,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0912,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1912,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL0213,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0913,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1913,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL0214,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0914,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1914,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL0215,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0915,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1915,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL0216,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0916,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1916,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL0217,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0917,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1917,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL0218,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0918,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1918,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
