***********************************************************************         
* CREATED BY PC36147   ON 94/12/04  AT 15:32                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE '                                '                               
W4N393   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='WHELP   ',                                           +        
               2='WHELP   ',                                           +        
               3='WHELP   ',                                           +        
               4='WHELP   ',                                           +        
               5='WHELP   ',                                           +        
               6='WHELP   ',                                           +        
               7='WHELP   ',                                           +        
               8='WHELP   ',                                           +        
               9='WHELP   ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T393U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T305  ',                                          +        
               14='WHELP   ',                                          +        
               15='WHELP   ',                                          +        
               16='WHELP   ',                                          +        
               17='WHELP   ',                                          +        
               18='WHELP   ',                                          +        
               19='WHELP   ',                                          +        
               20='WHELP   ',                                          +        
               21='WHELP   ',                                          +        
               22='WHELP   ',                                          +        
               23='W4T393U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((7,7)),                                         +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  'PACKING REPORTING PER LINE',                           +        
               POS=(1,11),LTH=26,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Prod',                                                 +        
               POS=(2,2),LTH=4,                                        +        
               ATTR=(NUM,PROT)                                                  
FLD0209  DFLD  POS=(2,7),LTH=7,                                        +        
               ATTR=(PROT,NODISP)                                               
         DFLD  'Distr',                                                +        
               POS=(2,15),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Cust',                                                 +        
               POS=(2,26),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'FC    Order',                                          +        
               POS=(2,37),LTH=11,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Class    DC',                                          +        
               POS=(2,55),LTH=11,                                      +        
               ATTR=(PROT)                                                      
FLD0309  DFLD  POS=(3,7),LTH=7,                                        +        
               ATTR=(PROT,MOD)                                                  
FLD0323  DFLD  POS=(3,21),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0333  DFLD  POS=(3,31),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0342  DFLD  POS=(3,40),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0351  DFLD  POS=(3,49),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0363  DFLD  POS=(3,62),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0000 DFLD  POS=(3,67),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0402  DFLD  POS=(4,2),LTH=1,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0404  DFLD  POS=(4,4),LTH=5,                                        +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
         DFLD  'Latest line reported',                                 +        
               POS=(5,2),LTH=20,                                       +        
               ATTR=(PROT)                                                      
FLD0521  DFLD  POS=(5,23),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
PRTVALAF DFLD  POS=(5,34),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Line-from  -  Line-to   Case',                         +        
               POS=(6,2),LTH=28,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Qty.packed   Split',                                   +        
               POS=(6,36),LTH=18,                                      +        
               ATTR=(PROT)                                                      
COL0707  DFLD  POS=(7,7),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
COL1907  DFLD  POS=(7,19),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL2607  DFLD  POS=(7,26),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL4007  DFLD  POS=(7,40),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL5007  DFLD  POS=(7,50),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL0708  DFLD  POS=(8,7),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
COL1908  DFLD  POS=(8,19),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL2608  DFLD  POS=(8,26),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL4008  DFLD  POS=(8,40),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL5008  DFLD  POS=(8,50),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL0709  DFLD  POS=(9,7),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
COL1909  DFLD  POS=(9,19),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL2609  DFLD  POS=(9,26),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL4009  DFLD  POS=(9,40),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL5009  DFLD  POS=(9,50),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL0710  DFLD  POS=(10,7),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL1910  DFLD  POS=(10,19),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL2610  DFLD  POS=(10,26),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL4010  DFLD  POS=(10,40),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL5010  DFLD  POS=(10,50),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
COL0711  DFLD  POS=(11,7),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL1911  DFLD  POS=(11,19),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL2611  DFLD  POS=(11,26),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL4011  DFLD  POS=(11,40),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL5011  DFLD  POS=(11,50),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
COL0712  DFLD  POS=(12,7),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL1912  DFLD  POS=(12,19),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL2612  DFLD  POS=(12,26),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL4012  DFLD  POS=(12,40),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL5012  DFLD  POS=(12,50),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
COL0713  DFLD  POS=(13,7),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL1913  DFLD  POS=(13,19),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL2613  DFLD  POS=(13,26),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL4013  DFLD  POS=(13,40),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL5013  DFLD  POS=(13,50),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
COL0714  DFLD  POS=(14,7),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL1914  DFLD  POS=(14,19),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL2614  DFLD  POS=(14,26),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL4014  DFLD  POS=(14,40),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL5014  DFLD  POS=(14,50),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
COL0715  DFLD  POS=(15,7),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL1915  DFLD  POS=(15,19),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL2615  DFLD  POS=(15,26),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL4015  DFLD  POS=(15,40),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL5015  DFLD  POS=(15,50),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
COL0716  DFLD  POS=(16,7),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL1916  DFLD  POS=(16,19),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL2616  DFLD  POS=(16,26),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL4016  DFLD  POS=(16,40),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL5016  DFLD  POS=(16,50),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
COL0717  DFLD  POS=(17,7),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL1917  DFLD  POS=(17,19),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL2617  DFLD  POS=(17,26),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL4017  DFLD  POS=(17,40),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL5017  DFLD  POS=(17,50),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
COL0718  DFLD  POS=(18,7),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL1918  DFLD  POS=(18,19),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL2618  DFLD  POS=(18,26),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL4018  DFLD  POS=(18,40),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL5018  DFLD  POS=(18,50),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
COL0719  DFLD  POS=(19,7),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL1919  DFLD  POS=(19,19),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL2619  DFLD  POS=(19,26),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL4019  DFLD  POS=(19,40),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
COL5019  DFLD  POS=(19,50),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  '13 Re-start',                                          +        
               POS=(21,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '14',                                                   +        
               POS=(21,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '15',                                                   +        
               POS=(21,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16',                                                   +        
               POS=(21,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4O393N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N393,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I393N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  FLD0209,                                                +        
               LTH=7                                                            
         MFLD  FLD0309,                                                +        
               LTH=7                                                            
         MFLD  FLD0323,                                                +        
               LTH=4                                                            
         MFLD  FLD0333,                                                +        
               LTH=6                                                            
         MFLD  FLD0342,                                                +        
               LTH=2                                                            
         MFLD  FLD0351,                                                +        
               LTH=5                                                            
         MFLD  FLD0363,                                                +        
               LTH=1                                                            
         MFLD  DGIA0000,                                               +        
               LTH=2                                                            
         MFLD  PRTVALAF,                                               +        
               LTH=2                                                            
         MFLD  FLD0402,                                                +        
               LTH=1                                                            
         MFLD  FLD0404,                                                +        
               LTH=5                                                            
         MFLD  FLD0521,                                                +        
               LTH=4                                                            
         MFLD  COL0707,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1907,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2607,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4007,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL5007,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0708,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1908,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2608,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4008,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL5008,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0709,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1909,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2609,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4009,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL5009,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0710,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1910,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2610,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4010,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL5010,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0711,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1911,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2611,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4011,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL5011,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0712,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1912,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2612,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4012,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL5012,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0713,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1913,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2613,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4013,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL5013,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0714,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1914,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2614,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4014,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL5014,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0715,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1915,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2615,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4015,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL5015,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0716,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1916,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2616,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4016,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL5016,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0717,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1917,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2617,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4017,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL5017,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0718,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1918,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2618,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4018,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL5018,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0719,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1919,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL2619,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL4019,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL5019,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I393N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N393),                                           +        
               OPT=2,                                                  +        
               NXT=W4O393N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F9'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  'U ',                                                   +        
               LTH=2                                                            
         MFLD  '43932',                                                +        
               LTH=5                                                            
         MFLD  (FLD0209,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0309,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0323,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0333,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0342,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0351,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0363,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0000,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (PRTVALAF,                                              +        
               '++'),                                                  +        
               LTH=2                                                            
         MFLD  (FLD0402,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (FLD0404,                                               +        
               '+++++'),                                               +        
               LTH=5                                                            
         MFLD  (FLD0521,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL0707,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1907,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2607,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4007,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL5007,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL0708,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1908,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2608,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4008,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL5008,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL0709,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1909,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2609,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4009,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL5009,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL0710,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1910,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2610,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4010,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL5010,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL0711,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1911,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2611,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4011,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL5011,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL0712,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1912,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2612,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4012,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL5012,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL0713,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1913,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2613,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4013,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL5013,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL0714,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1914,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2614,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4014,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL5014,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL0715,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1915,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2615,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4015,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL5015,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL0716,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1916,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2616,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4016,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL5016,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL0717,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1917,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2617,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4017,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL5017,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL0718,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1918,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2618,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4018,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL5018,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL0719,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1919,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2619,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4019,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL5019,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
