***********************************************************************         
* CREATED BY PCC8448   ON 99/05/12  AT 09:08                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE '                                '                               
W4N336   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W4T336 4',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W4T336 7',                                           +        
               8='W4T336 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T336U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T331  ',                                          +        
               14='W4T332  ',                                          +        
               15='W4T333  ',                                          +        
               16='W4T334  ',                                          +        
               17='W4T335  ',                                          +        
               18='W4T336  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,8)),                                         +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'CORRECT COLL. CASE STRAPPING',                         +        
               POS=(1,10),LTH=28,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD0140  DFLD  POS=(1,40),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Distr',                                                +        
               POS=(2,2),LTH=5,                                        +        
               ATTR=(PROT)                                                      
FLD0208  DFLD  POS=(2,8),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Cust',                                                 +        
               POS=(2,14),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FLD0219  DFLD  POS=(2,19),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Order',                                                +        
               POS=(2,27),LTH=5,                                       +        
               ATTR=(PROT)                                                      
FLD0233  DFLD  POS=(2,33),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Case',                                                 +        
               POS=(2,43),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FLD0248  DFLD  POS=(2,48),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DC',                                                   +        
               POS=(2,54),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DCI      DFLD  POS=(2,58),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
FLD0308  DFLD  POS=(3,8),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
FLD0319  DFLD  POS=(3,19),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0333  DFLD  POS=(3,33),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0348  DFLD  POS=(3,48),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
DCO      DFLD  POS=(3,58),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0408  DFLD  POS=(4,8),LTH=5,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0415  DFLD  POS=(4,15),LTH=5,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0422  DFLD  POS=(4,22),LTH=5,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0429  DFLD  POS=(4,29),LTH=7,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'Printer',                                              +        
               POS=(5,2),LTH=7,                                        +        
               ATTR=(PROT)                                                      
FLD0510  DFLD  POS=(5,10),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
FLD0610  DFLD  POS=(6,10),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Coll.Case  Case Code',                                 +        
               POS=(7,2),LTH=20,                                       +        
               ATTR=(PROT)                                                      
FLD0723  DFLD  POS=(7,23),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Type',                                                 +        
               POS=(7,33),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FLD0737  DFLD  POS=(7,38),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'L',                                                    +        
               POS=(7,41),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0746  DFLD  POS=(7,46),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'B',                                                    +        
               POS=(7,54),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0758  DFLD  POS=(7,58),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'H',                                                    +        
               POS=(7,65),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0768  DFLD  POS=(7,68),LTH=3,                                       +        
               ATTR=(PROT)                                                      
FLD0823  DFLD  POS=(8,23),LTH=8,                                       +        
               ATTR=(NOPROT)                                                    
FLD0837  DFLD  POS=(8,37),LTH=1,                                       +        
               ATTR=(NUM,NOPROT)                                                
FLD0846  DFLD  POS=(8,46),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
FLD0858  DFLD  POS=(8,58),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
FLD0868  DFLD  POS=(8,68),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Code  Case   Gross W   Case-Code  Type    L',          +        
               POS=(9,2),LTH=43,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'W',                                                    +        
               POS=(9,50),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'H',                                                    +        
               POS=(9,57),LTH=1,                                       +        
               ATTR=(PROT)                                                      
COL0710  DFLD  POS=(10,7),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1610  DFLD  POS=(10,16),LTH=8,                                      +        
               ATTR=(PROT)                                                      
COL2610  DFLD  POS=(10,26),LTH=8,                                      +        
               ATTR=(PROT)                                                      
COL3710  DFLD  POS=(10,37),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL4210  DFLD  POS=(10,42),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL5010  DFLD  POS=(10,50),LTH=3,                                      +        
               ATTR=(PROT)                                                      
COL5610  DFLD  POS=(10,56),LTH=3,                                      +        
               ATTR=(PROT)                                                      
COL0711  DFLD  POS=(11,7),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1611  DFLD  POS=(11,16),LTH=8,                                      +        
               ATTR=(PROT)                                                      
COL2611  DFLD  POS=(11,26),LTH=8,                                      +        
               ATTR=(PROT)                                                      
COL3711  DFLD  POS=(11,37),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL4211  DFLD  POS=(11,42),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL5011  DFLD  POS=(11,50),LTH=3,                                      +        
               ATTR=(PROT)                                                      
COL5611  DFLD  POS=(11,56),LTH=3,                                      +        
               ATTR=(PROT)                                                      
COL0712  DFLD  POS=(12,7),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1612  DFLD  POS=(12,16),LTH=8,                                      +        
               ATTR=(PROT)                                                      
COL2612  DFLD  POS=(12,26),LTH=8,                                      +        
               ATTR=(PROT)                                                      
COL3712  DFLD  POS=(12,37),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL4212  DFLD  POS=(12,42),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL5012  DFLD  POS=(12,50),LTH=3,                                      +        
               ATTR=(PROT)                                                      
COL5612  DFLD  POS=(12,56),LTH=3,                                      +        
               ATTR=(PROT)                                                      
COL0713  DFLD  POS=(13,7),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1613  DFLD  POS=(13,16),LTH=8,                                      +        
               ATTR=(PROT)                                                      
COL2613  DFLD  POS=(13,26),LTH=8,                                      +        
               ATTR=(PROT)                                                      
COL3713  DFLD  POS=(13,37),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL4213  DFLD  POS=(13,42),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL5013  DFLD  POS=(13,50),LTH=3,                                      +        
               ATTR=(PROT)                                                      
COL5613  DFLD  POS=(13,56),LTH=3,                                      +        
               ATTR=(PROT)                                                      
COL0714  DFLD  POS=(14,7),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1614  DFLD  POS=(14,16),LTH=8,                                      +        
               ATTR=(PROT)                                                      
COL2614  DFLD  POS=(14,26),LTH=8,                                      +        
               ATTR=(PROT)                                                      
COL3714  DFLD  POS=(14,37),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL4214  DFLD  POS=(14,42),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL5014  DFLD  POS=(14,50),LTH=3,                                      +        
               ATTR=(PROT)                                                      
COL5614  DFLD  POS=(14,56),LTH=3,                                      +        
               ATTR=(PROT)                                                      
COL0715  DFLD  POS=(15,7),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1615  DFLD  POS=(15,16),LTH=8,                                      +        
               ATTR=(PROT)                                                      
COL2615  DFLD  POS=(15,26),LTH=8,                                      +        
               ATTR=(PROT)                                                      
COL3715  DFLD  POS=(15,37),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL4215  DFLD  POS=(15,42),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL5015  DFLD  POS=(15,50),LTH=3,                                      +        
               ATTR=(PROT)                                                      
COL5615  DFLD  POS=(15,56),LTH=3,                                      +        
               ATTR=(PROT)                                                      
COL0716  DFLD  POS=(16,7),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1616  DFLD  POS=(16,16),LTH=8,                                      +        
               ATTR=(PROT)                                                      
COL2616  DFLD  POS=(16,26),LTH=8,                                      +        
               ATTR=(PROT)                                                      
COL3716  DFLD  POS=(16,37),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL4216  DFLD  POS=(16,42),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL5016  DFLD  POS=(16,50),LTH=3,                                      +        
               ATTR=(PROT)                                                      
COL5616  DFLD  POS=(16,56),LTH=3,                                      +        
               ATTR=(PROT)                                                      
COL0717  DFLD  POS=(17,7),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1617  DFLD  POS=(17,16),LTH=8,                                      +        
               ATTR=(PROT)                                                      
COL2617  DFLD  POS=(17,26),LTH=8,                                      +        
               ATTR=(PROT)                                                      
COL3717  DFLD  POS=(17,37),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL4217  DFLD  POS=(17,42),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL5017  DFLD  POS=(17,50),LTH=3,                                      +        
               ATTR=(PROT)                                                      
COL5617  DFLD  POS=(17,56),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD1803  DFLD  POS=(18,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
FLD1807  DFLD  POS=(18,7),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
FLD1816  DFLD  POS=(18,16),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
FLD1826  DFLD  POS=(18,26),LTH=8,                                      +        
               ATTR=(NOPROT)                                                    
FLD1837  DFLD  POS=(18,37),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
FLD1842  DFLD  POS=(18,42),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
FLD1850  DFLD  POS=(18,50),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
FLD1856  DFLD  POS=(18,56),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
FLD1902  DFLD  POS=(19,2),LTH=7,                                       +        
               ATTR=(PROT,NODISP)                                               
FLD1910  DFLD  POS=(19,10),LTH=3,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
FLD1914  DFLD  POS=(19,14),LTH=3,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
FLD1918  DFLD  POS=(19,18),LTH=3,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
FLD1922  DFLD  POS=(19,22),LTH=3,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
FLD1926  DFLD  POS=(19,26),LTH=3,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
FLD1930  DFLD  POS=(19,30),LTH=3,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
FLD1934  DFLD  POS=(19,34),LTH=3,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
FLD1938  DFLD  POS=(19,38),LTH=3,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
FLD1942  DFLD  POS=(19,42),LTH=1,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
         DFLD  '13 Strap Station 14 Correct',                          +        
               POS=(21,2),LTH=27,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '15 Info',                                              +        
               POS=(21,34),LTH=7,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16 Move Cases   17 Coll. Case',                        +        
               POS=(21,50),LTH=29,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '18 Corr Cod.Case 19',                                  +        
               POS=(22,2),LTH=19,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4O336N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N336,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I336N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0140,                                                +        
               LTH=40                                                           
         MFLD  FLD0208,                                                +        
               LTH=2                                                            
         MFLD  FLD0308,                                                +        
               LTH=4                                                            
         MFLD  FLD0219,                                                +        
               LTH=2                                                            
         MFLD  FLD0319,                                                +        
               LTH=6                                                            
         MFLD  FLD0233,                                                +        
               LTH=2                                                            
         MFLD  FLD0333,                                                +        
               LTH=5                                                            
         MFLD  FLD0248,                                                +        
               LTH=2                                                            
         MFLD  FLD0348,                                                +        
               LTH=5                                                            
         MFLD  DCI,                                                    +        
               LTH=2                                                            
         MFLD  DCO,                                                    +        
               LTH=2                                                            
         MFLD  FLD0408,                                                +        
               LTH=5                                                            
         MFLD  FLD0415,                                                +        
               LTH=5                                                            
         MFLD  FLD0422,                                                +        
               LTH=5                                                            
         MFLD  FLD0429,                                                +        
               LTH=7                                                            
         MFLD  FLD0510,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0610,                                                +        
               LTH=2                                                            
         MFLD  FLD0723,                                                +        
               LTH=8                                                            
         MFLD  FLD0823,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0737,                                                +        
               LTH=1                                                            
         MFLD  FLD0837,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0746,                                                +        
               LTH=4                                                            
         MFLD  FLD0846,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0758,                                                +        
               LTH=3                                                            
         MFLD  FLD0858,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0768,                                                +        
               LTH=3                                                            
         MFLD  FLD0868,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0710,                                                +        
               LTH=5                                                            
         MFLD  COL1610,                                                +        
               LTH=8                                                            
         MFLD  COL2610,                                                +        
               LTH=8                                                            
         MFLD  COL3710,                                                +        
               LTH=1                                                            
         MFLD  COL4210,                                                +        
               LTH=4                                                            
         MFLD  COL5010,                                                +        
               LTH=3                                                            
         MFLD  COL5610,                                                +        
               LTH=3                                                            
         MFLD  COL0711,                                                +        
               LTH=5                                                            
         MFLD  COL1611,                                                +        
               LTH=8                                                            
         MFLD  COL2611,                                                +        
               LTH=8                                                            
         MFLD  COL3711,                                                +        
               LTH=1                                                            
         MFLD  COL4211,                                                +        
               LTH=4                                                            
         MFLD  COL5011,                                                +        
               LTH=3                                                            
         MFLD  COL5611,                                                +        
               LTH=3                                                            
         MFLD  COL0712,                                                +        
               LTH=5                                                            
         MFLD  COL1612,                                                +        
               LTH=8                                                            
         MFLD  COL2612,                                                +        
               LTH=8                                                            
         MFLD  COL3712,                                                +        
               LTH=1                                                            
         MFLD  COL4212,                                                +        
               LTH=4                                                            
         MFLD  COL5012,                                                +        
               LTH=3                                                            
         MFLD  COL5612,                                                +        
               LTH=3                                                            
         MFLD  COL0713,                                                +        
               LTH=5                                                            
         MFLD  COL1613,                                                +        
               LTH=8                                                            
         MFLD  COL2613,                                                +        
               LTH=8                                                            
         MFLD  COL3713,                                                +        
               LTH=1                                                            
         MFLD  COL4213,                                                +        
               LTH=4                                                            
         MFLD  COL5013,                                                +        
               LTH=3                                                            
         MFLD  COL5613,                                                +        
               LTH=3                                                            
         MFLD  COL0714,                                                +        
               LTH=5                                                            
         MFLD  COL1614,                                                +        
               LTH=8                                                            
         MFLD  COL2614,                                                +        
               LTH=8                                                            
         MFLD  COL3714,                                                +        
               LTH=1                                                            
         MFLD  COL4214,                                                +        
               LTH=4                                                            
         MFLD  COL5014,                                                +        
               LTH=3                                                            
         MFLD  COL5614,                                                +        
               LTH=3                                                            
         MFLD  COL0715,                                                +        
               LTH=5                                                            
         MFLD  COL1615,                                                +        
               LTH=8                                                            
         MFLD  COL2615,                                                +        
               LTH=8                                                            
         MFLD  COL3715,                                                +        
               LTH=1                                                            
         MFLD  COL4215,                                                +        
               LTH=4                                                            
         MFLD  COL5015,                                                +        
               LTH=3                                                            
         MFLD  COL5615,                                                +        
               LTH=3                                                            
         MFLD  COL0716,                                                +        
               LTH=5                                                            
         MFLD  COL1616,                                                +        
               LTH=8                                                            
         MFLD  COL2616,                                                +        
               LTH=8                                                            
         MFLD  COL3716,                                                +        
               LTH=1                                                            
         MFLD  COL4216,                                                +        
               LTH=4                                                            
         MFLD  COL5016,                                                +        
               LTH=3                                                            
         MFLD  COL5616,                                                +        
               LTH=3                                                            
         MFLD  COL0717,                                                +        
               LTH=5                                                            
         MFLD  COL1617,                                                +        
               LTH=8                                                            
         MFLD  COL2617,                                                +        
               LTH=8                                                            
         MFLD  COL3717,                                                +        
               LTH=1                                                            
         MFLD  COL4217,                                                +        
               LTH=4                                                            
         MFLD  COL5017,                                                +        
               LTH=3                                                            
         MFLD  COL5617,                                                +        
               LTH=3                                                            
         MFLD  FLD1803,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1807,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1816,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1826,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1837,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1842,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1850,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1856,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1902,                                                +        
               LTH=7                                                            
         MFLD  FLD1910,                                                +        
               LTH=3                                                            
         MFLD  FLD1914,                                                +        
               LTH=3                                                            
         MFLD  FLD1918,                                                +        
               LTH=3                                                            
         MFLD  FLD1922,                                                +        
               LTH=3                                                            
         MFLD  FLD1926,                                                +        
               LTH=3                                                            
         MFLD  FLD1930,                                                +        
               LTH=3                                                            
         MFLD  FLD1934,                                                +        
               LTH=3                                                            
         MFLD  FLD1938,                                                +        
               LTH=3                                                            
         MFLD  FLD1942,                                                +        
               LTH=1                                                            
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I336N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N336),                                           +        
               OPT=2,                                                  +        
               NXT=W4O336N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '43362',                                                +        
               LTH=5                                                            
         MFLD  (FLD0208,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0308,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0219,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0319,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0233,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0333,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0248,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0348,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (DCI,                                                   +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  DCO,                                                    +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0510,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  FLD0610,                                                +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  FLD0408,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0415,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0422,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0429,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0823,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0837,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0846,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0858,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0868,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL0710,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL0711,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL0712,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL0713,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL0714,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL0715,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL0716,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL0717,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD1803,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1807,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1816,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1826,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1837,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1842,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1850,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1856,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD1910,                                                +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  FLD1914,                                                +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD1918,                                                +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD1922,                                                +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD1926,                                                +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD1930,                                                +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD1934,                                                +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD1938,                                                +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD1942,                                                +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
