***********************************************************************         
* CREATED BY PC36146   ON 96/06/26  AT 13:24                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'GOODS RECEIVER DC INFORMATION   '                               
W4N415   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W4T415 7',                                           +        
               8='W4T415 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T415U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T411  ',                                          +        
               14='W4T412  ',                                          +        
               15='W4T413  ',                                          +        
               16='W0T501  ',                                          +        
               17='W4T415  ',                                          +        
               18='W0T501  ',                                          +        
               19='W4T417  ',                                          +        
               20='W4T418  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W4N415   DPAGE CURSOR=((2,5)),                                         +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'GOODS RECEIVER DC INF.',                               +        
               POS=(1,12),LTH=22,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'DC',                                                   +        
               POS=(2,2),LTH=2,                                        +        
               ATTR=(NUM,PROT)                                                  
DGIA0000 DFLD  POS=(2,5),LTH=2,                                        +        
               ATTR=(ALPHA,NOPROT)                                              
         DFLD  'District',                                             +        
               POS=(2,8),LTH=8,                                        +        
               ATTR=(NUM,PROT)                                                  
DGIA0002 DFLD  POS=(2,17),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Customer',                                             +        
               POS=(2,22),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0005 DFLD  POS=(2,31),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0001 DFLD  POS=(3,5),LTH=2,                                        +        
               ATTR=(PROT,MOD)                                                  
DGIA0003 DFLD  POS=(3,17),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0006 DFLD  POS=(3,31),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Vo Do Bu Lead   Lead   Lead   Lead   Lead',            +        
               POS=(4,23),LTH=41,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'BO',                                                   +        
               POS=(4,77),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Cust Area TD PT RT Fc Fc Fc Time-0 Time-1 Time-2 Time-3+        
                Time-4 Dec E C V D B',                                 +        
               POS=(5,4),LTH=76,                                       +        
               ATTR=(PROT)                                                      
         DO    11,SUF=06                                                        
KUNDNR   DFLD  POS=(6,2),LTH=6,                                        +        
               ATTR=(PROT)                                                      
GMTOMR   DFLD  POS=(6,09),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
TRPDAY   DFLD  POS=(6,14),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
PKLTAB   DFLD  POS=(6,17),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
PRCTAB   DFLD  POS=(6,20),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
VORFC    DFLD  POS=(6,23),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DOFC     DFLD  POS=(6,26),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
MOFC     DFLD  POS=(6,29),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
LEDTI0   DFLD  POS=(6,32),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
LEDTI1   DFLD  POS=(6,39),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
LEDTI2   DFLD  POS=(6,46),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
LEDTI3   DFLD  POS=(6,53),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
LEDTI4   DFLD  POS=(6,60),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
FORSKN   DFLD  POS=(6,67),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
SPFKTK   DFLD  POS=(6,71),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
TULLVE   DFLD  POS=(6,73),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
MOMSIN   DFLD  POS=(6,75),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
DAPACK   DFLD  POS=(6,77),LTH=1,                                       +        
               ATTR=(PROT)                                                      
BUPACK   DFLD  POS=(6,79),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
         ENDDO                                                                  
         DFLD  'DEF',                                                  +        
               POS=(18,2),LTH=3,                                       +        
               ATTR=(PROT)                                                      
KDCMD    DFLD  POS=(18,6),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
GMTOMRUT DFLD  POS=(18,09),LTH=4,                                      +        
               ATTR=(PROT)                                                      
TRPDAYUT DFLD  POS=(18,14),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
PKLTABUT DFLD  POS=(18,17),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
PRCTABUT DFLD  POS=(18,20),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
GENFRVUT DFLD  POS=(18,23),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
GENFRDUT DFLD  POS=(18,26),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
GENFRMUT DFLD  POS=(18,29),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
LEDTI0UT DFLD  POS=(18,32),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
LEDTI1UT DFLD  POS=(18,39),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
LEDTI2UT DFLD  POS=(18,46),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
LEDTI3UT DFLD  POS=(18,53),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
LEDTI4UT DFLD  POS=(18,60),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
FORSKNUT DFLD  POS=(18,67),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
SPFKTKUT DFLD  POS=(18,71),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
TULLVEUT DFLD  POS=(18,73),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
MOMSINUT DFLD  POS=(18,75),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
DAPACKUT DFLD  POS=(18,77),LTH=1,                                      +        
               ATTR=(PROT)                                                      
BUPACKUT DFLD  POS=(18,79),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
KUNDNR   DFLD  POS=(19,2),LTH=6,                                       +        
               ATTR=(NOPROT)                                                    
GMTOMR   DFLD  POS=(19,09),LTH=4,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
TRPDAY   DFLD  POS=(19,14),LTH=2,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
PKLTAB   DFLD  POS=(19,17),LTH=2,                                      +        
               ATTR=(NOPROT,MOD)                                                
PRCTAB   DFLD  POS=(19,20),LTH=2,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
VORFC    DFLD  POS=(19,23),LTH=2,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DOFC     DFLD  POS=(19,26),LTH=2,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
MOFC     DFLD  POS=(19,29),LTH=2,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
TIME0    DFLD  POS=(19,32),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
TIME1    DFLD  POS=(19,39),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
TIME2    DFLD  POS=(19,46),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
TIME3    DFLD  POS=(19,53),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
TIME4    DFLD  POS=(19,60),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FORSKN   DFLD  POS=(19,67),LTH=3,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
SPFKTK   DFLD  POS=(19,71),LTH=1,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
TULLVE   DFLD  POS=(19,73),LTH=1,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
MOMSIN   DFLD  POS=(19,75),LTH=1,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DAPACK   DFLD  POS=(19,77),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
BUPACK   DFLD  POS=(19,79),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  '13 Goods r. 1   14 Goods r.dist 15 Goods r. 2   16',   +        
               POS=(21,2),LTH=50,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17 Goods r. dc',                                       +        
               POS=(21,66),LTH=14,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19 Goods r.fc   20 Goods mark   21',                   +        
               POS=(22,18),LTH=34,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4O415N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N415,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I415N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W4N415,                                             +        
               NXT=W4I415N1                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  DGIA0000,                                               +        
               LTH=2                                                            
         MFLD  DGIA0001,                                               +        
               LTH=2                                                            
         MFLD  DGIA0002,                                               +        
               LTH=4                                                            
         MFLD  DGIA0003,                                               +        
               LTH=4                                                            
         MFLD  DGIA0005,                                               +        
               LTH=6                                                            
         MFLD  DGIA0006,                                               +        
               LTH=6                                                            
         DO    11,SUF=06                                                        
         MFLD  KUNDNR,                                                 +        
               LTH=6                                                            
         MFLD  GMTOMR,                                                 +        
               LTH=4                                                            
         MFLD  TRPDAY,                                                 +        
               LTH=2                                                            
         MFLD  PKLTAB,                                                 +        
               LTH=2                                                            
         MFLD  PRCTAB,                                                 +        
               LTH=2                                                            
         MFLD  VORFC,                                                  +        
               LTH=2                                                            
         MFLD  DOFC,                                                   +        
               LTH=2                                                            
         MFLD  MOFC,                                                   +        
               LTH=2                                                            
         MFLD  LEDTI0,                                                 +        
               LTH=6                                                            
         MFLD  LEDTI1,                                                 +        
               LTH=6                                                            
         MFLD  LEDTI2,                                                 +        
               LTH=6                                                            
         MFLD  LEDTI3,                                                 +        
               LTH=6                                                            
         MFLD  LEDTI4,                                                 +        
               LTH=6                                                            
         MFLD  FORSKN,                                                 +        
               LTH=3                                                            
         MFLD  SPFKTK,                                                 +        
               LTH=1                                                            
         MFLD  TULLVE,                                                 +        
               LTH=1                                                            
         MFLD  MOMSIN,                                                 +        
               LTH=1                                                            
         MFLD  DAPACK,                                                 +        
               LTH=1                                                            
         MFLD  BUPACK,                                                 +        
               LTH=1                                                            
         ENDDO                                                                  
         MFLD  GMTOMRUT,                                               +        
               LTH=4                                                            
         MFLD  TRPDAYUT,                                               +        
               LTH=2                                                            
         MFLD  PKLTABUT,                                               +        
               LTH=2                                                            
         MFLD  PRCTABUT,                                               +        
               LTH=2                                                            
         MFLD  GENFRVUT,                                               +        
               LTH=2                                                            
         MFLD  GENFRDUT,                                               +        
               LTH=2                                                            
         MFLD  GENFRMUT,                                               +        
               LTH=2                                                            
         MFLD  LEDTI0UT,                                               +        
               LTH=6                                                            
         MFLD  LEDTI1UT,                                               +        
               LTH=6                                                            
         MFLD  LEDTI2UT,                                               +        
               LTH=6                                                            
         MFLD  LEDTI3UT,                                               +        
               LTH=6                                                            
         MFLD  LEDTI4UT,                                               +        
               LTH=6                                                            
         MFLD  FORSKNUT,                                               +        
               LTH=3                                                            
         MFLD  SPFKTKUT,                                               +        
               LTH=1                                                            
         MFLD  TULLVEUT,                                               +        
               LTH=1                                                            
         MFLD  MOMSINUT,                                               +        
               LTH=1                                                            
         MFLD  DAPACKUT,                                               +        
               LTH=1                                                            
         MFLD  BUPACKUT,                                               +        
               LTH=1                                                            
         MFLD  KDCMD,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KUNDNR,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  GMTOMR,                                                 +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TRPDAY,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PKLTAB,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRCTAB,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VORFC,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DOFC,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  MOFC,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TIME0,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TIME1,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TIME2,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TIME3,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TIME4,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FORSKN,                                                 +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SPFKTK,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TULLVE,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  MOMSIN,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DAPACK,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BUPACK,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I415N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N415),                                           +        
               OPT=2,                                                  +        
               NXT=W4O415N1                                                     
MID      LPAGE SOR=(W4N415),                                           +        
               NXT=W4O415N1                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '44152',                                                +        
               LTH=5                                                            
         MFLD  (DGIA0000,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  DGIA0001,                                               +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0002,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0005,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDCMD,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KUNDNR,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (GMTOMR,                                                +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TRPDAY,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PKLTAB,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (PRCTAB,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (VORFC,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DOFC,                                                  +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (MOFC,                                                  +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TIME0,                                                 +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TIME1,                                                 +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TIME2,                                                 +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TIME3,                                                 +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TIME4,                                                 +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FORSKN,                                                +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (SPFKTK,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TULLVE,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (MOMSIN,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DAPACK,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (BUPACK,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
