***********************************************************************         
* CREATED BY V030174   ON 04/12/23  AT 08:30                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'First DC Connections            '                               
W4N416   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W4T416 7',                                           +        
               8='W4T416 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T411  ',                                          +        
               14='W4T412  ',                                          +        
               15='W4T413  ',                                          +        
               16='W4T414  ',                                          +        
               17='W4T415  ',                                          +        
               18='W4T416  ',                                          +        
               19='W4T417  ',                                          +        
               20='W4T418  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W4N416   DPAGE CURSOR=((2,11)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'FIRST DC CONNECTIONS',                                 +        
               POS=(1,12),LTH=20,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'District',                                             +        
               POS=(2,2),LTH=8,                                        +        
               ATTR=(NUM,PROT)                                                  
IDDISTRI DFLD  POS=(2,11),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DC day',                                               +        
               POS=(2,17),LTH=6,                                       +        
               ATTR=(PROT)                                                      
IDDCDAYI DFLD  POS=(2,24),LTH=2,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'DC bulk',                                              +        
               POS=(2,28),LTH=7,                                       +        
               ATTR=(PROT)                                                      
IDDCBULI DFLD  POS=(2,36),LTH=2,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'LDC only',                                             +        
               POS=(2,40),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FLLDCKI  DFLD  POS=(2,49),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDDISTRU DFLD  POS=(3,11),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
IDDCDAYU DFLD  POS=(3,24),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
IDDCBULU DFLD  POS=(3,36),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
FLLDCKU  DFLD  POS=(3,49),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Customer  Bulk  Day  VOR  LDC',                        +        
               POS=(5,2),LTH=29,                                       +        
               ATTR=(PROT)                                                      
KUNDNR1  DFLD  POS=(6,4),LTH=6,                                        +        
               ATTR=(PROT)                                                      
IDDCB1   DFLD  POS=(6,14),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDDCD1   DFLD  POS=(6,19),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDDCV1   DFLD  POS=(6,24),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FLLDCK1  DFLD  POS=(6,29),LTH=1,                                       +        
               ATTR=(PROT)                                                      
KUNDNR2  DFLD  POS=(7,4),LTH=6,                                        +        
               ATTR=(PROT)                                                      
IDDCB2   DFLD  POS=(7,14),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDDCD2   DFLD  POS=(7,19),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDDCV2   DFLD  POS=(7,24),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FLLDCK2  DFLD  POS=(7,29),LTH=1,                                       +        
               ATTR=(PROT)                                                      
KUNDNR3  DFLD  POS=(8,4),LTH=6,                                        +        
               ATTR=(PROT)                                                      
IDDCB3   DFLD  POS=(8,14),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDDCD3   DFLD  POS=(8,19),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDDCV3   DFLD  POS=(8,24),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FLLDCK3  DFLD  POS=(8,29),LTH=1,                                       +        
               ATTR=(PROT)                                                      
KUNDNR4  DFLD  POS=(9,4),LTH=6,                                        +        
               ATTR=(PROT)                                                      
IDDCB4   DFLD  POS=(9,14),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDDCD4   DFLD  POS=(9,19),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDDCV4   DFLD  POS=(9,24),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FLLDCK4  DFLD  POS=(9,29),LTH=1,                                       +        
               ATTR=(PROT)                                                      
KUNDNR5  DFLD  POS=(10,4),LTH=6,                                       +        
               ATTR=(PROT)                                                      
IDDCB5   DFLD  POS=(10,14),LTH=2,                                      +        
               ATTR=(PROT)                                                      
IDDCD5   DFLD  POS=(10,19),LTH=2,                                      +        
               ATTR=(PROT)                                                      
IDDCV5   DFLD  POS=(10,24),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLLDCK5  DFLD  POS=(10,29),LTH=1,                                      +        
               ATTR=(PROT)                                                      
KUNDNR6  DFLD  POS=(11,4),LTH=6,                                       +        
               ATTR=(PROT)                                                      
IDDCB6   DFLD  POS=(11,14),LTH=2,                                      +        
               ATTR=(PROT)                                                      
IDDCD6   DFLD  POS=(11,19),LTH=2,                                      +        
               ATTR=(PROT)                                                      
IDDCV6   DFLD  POS=(11,24),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLLDCK6  DFLD  POS=(11,29),LTH=1,                                      +        
               ATTR=(PROT)                                                      
KUNDNR7  DFLD  POS=(12,4),LTH=6,                                       +        
               ATTR=(PROT)                                                      
IDDCB7   DFLD  POS=(12,14),LTH=2,                                      +        
               ATTR=(PROT)                                                      
IDDCD7   DFLD  POS=(12,19),LTH=2,                                      +        
               ATTR=(PROT)                                                      
IDDCV7   DFLD  POS=(12,24),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLLDCK7  DFLD  POS=(12,29),LTH=1,                                      +        
               ATTR=(PROT)                                                      
KUNDNR8  DFLD  POS=(13,4),LTH=6,                                       +        
               ATTR=(PROT)                                                      
IDDCB8   DFLD  POS=(13,14),LTH=2,                                      +        
               ATTR=(PROT)                                                      
IDDCD8   DFLD  POS=(13,19),LTH=2,                                      +        
               ATTR=(PROT)                                                      
IDDCV8   DFLD  POS=(13,24),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLLDCK8  DFLD  POS=(13,29),LTH=1,                                      +        
               ATTR=(PROT)                                                      
KUNDNR9  DFLD  POS=(14,4),LTH=6,                                       +        
               ATTR=(PROT)                                                      
IDDCB9   DFLD  POS=(14,14),LTH=2,                                      +        
               ATTR=(PROT)                                                      
IDDCD9   DFLD  POS=(14,19),LTH=2,                                      +        
               ATTR=(PROT)                                                      
IDDCV9   DFLD  POS=(14,24),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLLDCK9  DFLD  POS=(14,29),LTH=1,                                      +        
               ATTR=(PROT)                                                      
KUNDNR10 DFLD  POS=(15,4),LTH=6,                                       +        
               ATTR=(PROT)                                                      
IDDCB10  DFLD  POS=(15,14),LTH=2,                                      +        
               ATTR=(PROT)                                                      
IDDCD10  DFLD  POS=(15,19),LTH=2,                                      +        
               ATTR=(PROT)                                                      
IDDCV10  DFLD  POS=(15,24),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLLDCK10 DFLD  POS=(15,29),LTH=1,                                      +        
               ATTR=(PROT)                                                      
KUNDNR11 DFLD  POS=(16,4),LTH=6,                                       +        
               ATTR=(PROT)                                                      
IDDCB11  DFLD  POS=(16,14),LTH=2,                                      +        
               ATTR=(PROT)                                                      
IDDCD11  DFLD  POS=(16,19),LTH=2,                                      +        
               ATTR=(PROT)                                                      
IDDCV11  DFLD  POS=(16,24),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLLDCK11 DFLD  POS=(16,29),LTH=1,                                      +        
               ATTR=(PROT)                                                      
KUNDNR12 DFLD  POS=(17,4),LTH=6,                                       +        
               ATTR=(PROT)                                                      
IDDCB12  DFLD  POS=(17,14),LTH=2,                                      +        
               ATTR=(PROT)                                                      
IDDCD12  DFLD  POS=(17,19),LTH=2,                                      +        
               ATTR=(PROT)                                                      
IDDCV12  DFLD  POS=(17,24),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLLDCK12 DFLD  POS=(17,29),LTH=1,                                      +        
               ATTR=(PROT)                                                      
KUNDNR13 DFLD  POS=(18,4),LTH=6,                                       +        
               ATTR=(PROT)                                                      
IDDCB13  DFLD  POS=(18,14),LTH=2,                                      +        
               ATTR=(PROT)                                                      
IDDCD13  DFLD  POS=(18,19),LTH=2,                                      +        
               ATTR=(PROT)                                                      
IDDCV13  DFLD  POS=(18,24),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLLDCK13 DFLD  POS=(18,29),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '13 Goods r. 1   14 Goods r.dist 15 Goods r. 2   16 Good+        
               s r.LDC  17 Goods r. dc',                               +        
               POS=(20,2),LTH=78,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18 DC connect.  19 Goods r.fc   20 Goods mark   21',   +        
               POS=(21,2),LTH=50,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(21,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(22,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(22,59),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(22,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(22,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(23,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4O416N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N416,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I416N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W4N416,                                             +        
               NXT=W4I416N1                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDDISTRI,                                               +        
               LTH=4                                                            
         MFLD  IDDISTRU,                                               +        
               LTH=4                                                            
         MFLD  IDDCDAYI,                                               +        
               LTH=2                                                            
         MFLD  IDDCDAYU,                                               +        
               LTH=2                                                            
         MFLD  IDDCBULI,                                               +        
               LTH=2                                                            
         MFLD  IDDCBULU,                                               +        
               LTH=2                                                            
         MFLD  FLLDCKI,                                                +        
               LTH=1                                                            
         MFLD  FLLDCKU,                                                +        
               LTH=1                                                            
         MFLD  KUNDNR1,                                                +        
               LTH=6                                                            
         MFLD  IDDCB1,                                                 +        
               LTH=2                                                            
         MFLD  IDDCD1,                                                 +        
               LTH=2                                                            
         MFLD  IDDCV1,                                                 +        
               LTH=2                                                            
         MFLD  FLLDCK1,                                                +        
               LTH=1                                                            
         MFLD  KUNDNR2,                                                +        
               LTH=6                                                            
         MFLD  IDDCB2,                                                 +        
               LTH=2                                                            
         MFLD  IDDCD2,                                                 +        
               LTH=2                                                            
         MFLD  IDDCV2,                                                 +        
               LTH=2                                                            
         MFLD  FLLDCK2,                                                +        
               LTH=1                                                            
         MFLD  KUNDNR3,                                                +        
               LTH=6                                                            
         MFLD  IDDCB3,                                                 +        
               LTH=2                                                            
         MFLD  IDDCD3,                                                 +        
               LTH=2                                                            
         MFLD  IDDCV3,                                                 +        
               LTH=2                                                            
         MFLD  FLLDCK3,                                                +        
               LTH=1                                                            
         MFLD  KUNDNR4,                                                +        
               LTH=6                                                            
         MFLD  IDDCB4,                                                 +        
               LTH=2                                                            
         MFLD  IDDCD4,                                                 +        
               LTH=2                                                            
         MFLD  IDDCV4,                                                 +        
               LTH=2                                                            
         MFLD  FLLDCK4,                                                +        
               LTH=1                                                            
         MFLD  KUNDNR5,                                                +        
               LTH=6                                                            
         MFLD  IDDCB5,                                                 +        
               LTH=2                                                            
         MFLD  IDDCD5,                                                 +        
               LTH=2                                                            
         MFLD  IDDCV5,                                                 +        
               LTH=2                                                            
         MFLD  FLLDCK5,                                                +        
               LTH=1                                                            
         MFLD  KUNDNR6,                                                +        
               LTH=6                                                            
         MFLD  IDDCB6,                                                 +        
               LTH=2                                                            
         MFLD  IDDCD6,                                                 +        
               LTH=2                                                            
         MFLD  IDDCV6,                                                 +        
               LTH=2                                                            
         MFLD  FLLDCK6,                                                +        
               LTH=1                                                            
         MFLD  KUNDNR7,                                                +        
               LTH=6                                                            
         MFLD  IDDCB7,                                                 +        
               LTH=2                                                            
         MFLD  IDDCD7,                                                 +        
               LTH=2                                                            
         MFLD  IDDCV7,                                                 +        
               LTH=2                                                            
         MFLD  FLLDCK7,                                                +        
               LTH=1                                                            
         MFLD  KUNDNR8,                                                +        
               LTH=6                                                            
         MFLD  IDDCB8,                                                 +        
               LTH=2                                                            
         MFLD  IDDCD8,                                                 +        
               LTH=2                                                            
         MFLD  IDDCV8,                                                 +        
               LTH=2                                                            
         MFLD  FLLDCK8,                                                +        
               LTH=1                                                            
         MFLD  KUNDNR9,                                                +        
               LTH=6                                                            
         MFLD  IDDCB9,                                                 +        
               LTH=2                                                            
         MFLD  IDDCD9,                                                 +        
               LTH=2                                                            
         MFLD  IDDCV9,                                                 +        
               LTH=2                                                            
         MFLD  FLLDCK9,                                                +        
               LTH=1                                                            
         MFLD  KUNDNR10,                                               +        
               LTH=6                                                            
         MFLD  IDDCB10,                                                +        
               LTH=2                                                            
         MFLD  IDDCD10,                                                +        
               LTH=2                                                            
         MFLD  IDDCV10,                                                +        
               LTH=2                                                            
         MFLD  FLLDCK10,                                               +        
               LTH=1                                                            
         MFLD  KUNDNR11,                                               +        
               LTH=6                                                            
         MFLD  IDDCB11,                                                +        
               LTH=2                                                            
         MFLD  IDDCD11,                                                +        
               LTH=2                                                            
         MFLD  IDDCV11,                                                +        
               LTH=2                                                            
         MFLD  FLLDCK11,                                               +        
               LTH=1                                                            
         MFLD  KUNDNR12,                                               +        
               LTH=6                                                            
         MFLD  IDDCB12,                                                +        
               LTH=2                                                            
         MFLD  IDDCD12,                                                +        
               LTH=2                                                            
         MFLD  IDDCV12,                                                +        
               LTH=2                                                            
         MFLD  FLLDCK12,                                               +        
               LTH=1                                                            
         MFLD  KUNDNR13,                                               +        
               LTH=6                                                            
         MFLD  IDDCB13,                                                +        
               LTH=2                                                            
         MFLD  IDDCD13,                                                +        
               LTH=2                                                            
         MFLD  IDDCV13,                                                +        
               LTH=2                                                            
         MFLD  FLLDCK13,                                               +        
               LTH=1                                                            
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I416N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N416),                                           +        
               OPT=2,                                                  +        
               NXT=W4O416N1                                                     
MID      LPAGE SOR=(W4N416),                                           +        
               NXT=W4O416N1                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '44162',                                                +        
               LTH=5                                                            
         MFLD  (IDDISTRI,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDDCDAYI,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (IDDCBULI,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLLDCKI,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
