***********************************************************************         
* CREATED BY PC36146   ON 96/06/11  AT 16:10                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'GOODS RECEIVER FC INFORMATION   '                               
W4N417   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W4T417 7',                                           +        
               8='W4T417 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T417U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T411  ',                                          +        
               14='W4T412  ',                                          +        
               15='W4T413  ',                                          +        
               16='W0T501  ',                                          +        
               17='W4T415  ',                                          +        
               18='W0T501  ',                                          +        
               19='W4T417  ',                                          +        
               20='W4T418  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W4N417   DPAGE CURSOR=((2,5)),                                         +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'GOODS RECEIVER FC INF.',                               +        
               POS=(1,12),LTH=22,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'DC',                                                   +        
               POS=(2,2),LTH=2,                                        +        
               ATTR=(NUM,PROT)                                                  
DGIA0000 DFLD  POS=(2,5),LTH=2,                                        +        
               ATTR=(NOPROT)                                                    
         DFLD  'FC',                                                   +        
               POS=(2,8),LTH=2,                                        +        
               ATTR=(NUM,PROT)                                                  
DGIA0004 DFLD  POS=(2,11),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'District',                                             +        
               POS=(2,14),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0002 DFLD  POS=(2,23),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Cust',                                                 +        
               POS=(2,28),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0006 DFLD  POS=(2,33),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0001 DFLD  POS=(3,5),LTH=2,                                        +        
               ATTR=(PROT,MOD)                                                  
DGIA0005 DFLD  POS=(3,11),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0003 DFLD  POS=(3,23),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0007 DFLD  POS=(3,33),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'T',                                                    +        
               POS=(4,12),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Bor',                                                  +        
               POS=(4,48),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Cust C Trp-0 Trp-1 Trp-2 Trp-3 Trp-4  FD der I.fact   L+        
               eg.cost',                                               +        
               POS=(5,7),LTH=62,                                       +        
               ATTR=(PROT)                                                      
KUNDNR1  DFLD  POS=(6,5),LTH=6,                                        +        
               ATTR=(PROT)                                                      
TRPKAT1  DFLD  POS=(6,12),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0009 DFLD  POS=(6,14),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0021 DFLD  POS=(6,20),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0033 DFLD  POS=(6,26),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0045 DFLD  POS=(6,32),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0057 DFLD  POS=(6,38),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
FDKRAV1  DFLD  POS=(6,44),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
KDGRANS1 DFLD  POS=(6,48),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
REFOERS1 DFLD  POS=(6,52),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
LEGKST1  DFLD  POS=(6,60),LTH=10,                                      +        
               ATTR=(PROT)                                                      
KUNDNR2  DFLD  POS=(7,5),LTH=6,                                        +        
               ATTR=(PROT)                                                      
TRPKAT2  DFLD  POS=(7,12),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0012 DFLD  POS=(7,14),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0024 DFLD  POS=(7,20),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0036 DFLD  POS=(7,26),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0048 DFLD  POS=(7,32),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0060 DFLD  POS=(7,38),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
FDKRAV2  DFLD  POS=(7,44),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
KDGRANS2 DFLD  POS=(7,48),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
REFOERS2 DFLD  POS=(7,52),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
LEGKST2  DFLD  POS=(7,60),LTH=10,                                      +        
               ATTR=(PROT)                                                      
KUNDNR3  DFLD  POS=(8,5),LTH=6,                                        +        
               ATTR=(PROT)                                                      
TRPKAT3  DFLD  POS=(8,12),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0013 DFLD  POS=(8,14),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0025 DFLD  POS=(8,20),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0037 DFLD  POS=(8,26),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0049 DFLD  POS=(8,32),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0061 DFLD  POS=(8,38),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
FDKRAV3  DFLD  POS=(8,44),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
KDGRANS3 DFLD  POS=(8,48),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
REFOERS3 DFLD  POS=(8,52),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
LEGKST3  DFLD  POS=(8,60),LTH=10,                                      +        
               ATTR=(PROT)                                                      
KUNDNR4  DFLD  POS=(9,5),LTH=6,                                        +        
               ATTR=(PROT)                                                      
TRPKAT4  DFLD  POS=(9,12),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0014 DFLD  POS=(9,14),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0026 DFLD  POS=(9,20),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0038 DFLD  POS=(9,26),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0050 DFLD  POS=(9,32),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0062 DFLD  POS=(9,38),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
FDKRAV4  DFLD  POS=(9,44),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
KDGRANS4 DFLD  POS=(9,48),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
REFOERS4 DFLD  POS=(9,52),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
LEGKST4  DFLD  POS=(9,60),LTH=10,                                      +        
               ATTR=(PROT)                                                      
KUNDNR5  DFLD  POS=(10,5),LTH=6,                                       +        
               ATTR=(PROT)                                                      
TRPKAT5  DFLD  POS=(10,12),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0015 DFLD  POS=(10,14),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0027 DFLD  POS=(10,20),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0039 DFLD  POS=(10,26),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0051 DFLD  POS=(10,32),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0063 DFLD  POS=(10,38),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FDKRAV5  DFLD  POS=(10,44),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
KDGRANS5 DFLD  POS=(10,48),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
REFOERS5 DFLD  POS=(10,52),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
LEGKST5  DFLD  POS=(10,60),LTH=10,                                     +        
               ATTR=(PROT)                                                      
KUNDNR6  DFLD  POS=(11,5),LTH=6,                                       +        
               ATTR=(PROT)                                                      
TRPKAT6  DFLD  POS=(11,12),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0016 DFLD  POS=(11,14),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0028 DFLD  POS=(11,20),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0040 DFLD  POS=(11,26),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0052 DFLD  POS=(11,32),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0064 DFLD  POS=(11,38),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FDKRAV6  DFLD  POS=(11,44),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
KDGRANS6 DFLD  POS=(11,48),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
REFOER6  DFLD  POS=(11,52),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
LEGKST6  DFLD  POS=(11,60),LTH=10,                                     +        
               ATTR=(PROT)                                                      
KUNDNR7  DFLD  POS=(12,5),LTH=6,                                       +        
               ATTR=(PROT)                                                      
TRPKAT7  DFLD  POS=(12,12),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0017 DFLD  POS=(12,14),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0029 DFLD  POS=(12,20),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0041 DFLD  POS=(12,26),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0053 DFLD  POS=(12,32),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0065 DFLD  POS=(12,38),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FDKRAV7  DFLD  POS=(12,44),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
KDGRANS7 DFLD  POS=(12,48),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
REFOERS7 DFLD  POS=(12,52),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
LEGKST7  DFLD  POS=(12,60),LTH=10,                                     +        
               ATTR=(PROT)                                                      
KUNDNR8  DFLD  POS=(13,5),LTH=6,                                       +        
               ATTR=(PROT)                                                      
TRPKAT8  DFLD  POS=(13,12),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0018 DFLD  POS=(13,14),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0030 DFLD  POS=(13,20),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0042 DFLD  POS=(13,26),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0054 DFLD  POS=(13,32),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0066 DFLD  POS=(13,38),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FDKRAV8  DFLD  POS=(13,44),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
KDGRANS8 DFLD  POS=(13,48),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
REFOERS8 DFLD  POS=(13,52),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
LEGKST8  DFLD  POS=(13,60),LTH=10,                                     +        
               ATTR=(PROT)                                                      
KUNDNR9  DFLD  POS=(14,5),LTH=6,                                       +        
               ATTR=(PROT)                                                      
TRPKAT9  DFLD  POS=(14,12),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0019 DFLD  POS=(14,14),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0031 DFLD  POS=(14,20),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0043 DFLD  POS=(14,26),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0055 DFLD  POS=(14,32),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0067 DFLD  POS=(14,38),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FDKRAV9  DFLD  POS=(14,44),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
KDGRANS9 DFLD  POS=(14,48),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
REFOERS9 DFLD  POS=(14,52),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
LEGKST9  DFLD  POS=(14,60),LTH=10,                                     +        
               ATTR=(PROT)                                                      
KUNDNR10 DFLD  POS=(15,5),LTH=6,                                       +        
               ATTR=(PROT)                                                      
TRPKAT10 DFLD  POS=(15,12),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0010 DFLD  POS=(15,14),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0022 DFLD  POS=(15,20),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0034 DFLD  POS=(15,26),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0046 DFLD  POS=(15,32),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0058 DFLD  POS=(15,38),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FDKRAV10 DFLD  POS=(15,44),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
GRANS10  DFLD  POS=(15,48),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
REFOER10 DFLD  POS=(15,52),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
LEGKST10 DFLD  POS=(15,60),LTH=10,                                     +        
               ATTR=(PROT)                                                      
KUNDNR11 DFLD  POS=(16,5),LTH=6,                                       +        
               ATTR=(PROT)                                                      
TRPKAT11 DFLD  POS=(16,12),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0011 DFLD  POS=(16,14),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0023 DFLD  POS=(16,20),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0035 DFLD  POS=(16,26),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0047 DFLD  POS=(16,32),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0059 DFLD  POS=(16,38),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FDKRAV11 DFLD  POS=(16,44),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
GRANS11  DFLD  POS=(16,48),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
REFOER11 DFLD  POS=(16,52),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
LEGKST11 DFLD  POS=(16,60),LTH=10,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'DEFAULT',                                              +        
               POS=(18,4),LTH=7,                                       +        
               ATTR=(PROT)                                                      
TRPKATUT DFLD  POS=(18,12),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0008 DFLD  POS=(18,14),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0020 DFLD  POS=(18,20),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0032 DFLD  POS=(18,26),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0044 DFLD  POS=(18,32),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0056 DFLD  POS=(18,38),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FDKRAVUT DFLD  POS=(18,44),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
GRANSUT  DFLD  POS=(18,48),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
REFOERUT DFLD  POS=(18,52),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
LEGKSTUT DFLD  POS=(18,60),LTH=10,                                     +        
               ATTR=(PROT)                                                      
KDCMD    DFLD  POS=(19,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
KUND     DFLD  POS=(19,4),LTH=7,                                       +        
               ATTR=(NOPROT)                                                    
TRPKAT   DFLD  POS=(19,12),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
TRP0     DFLD  POS=(19,14),LTH=5,                                      +        
               ATTR=(NOPROT,MOD)                                                
TRP1     DFLD  POS=(19,20),LTH=5,                                      +        
               ATTR=(NOPROT,MOD)                                                
TRP2     DFLD  POS=(19,26),LTH=5,                                      +        
               ATTR=(NOPROT,MOD)                                                
TRP3     DFLD  POS=(19,32),LTH=5,                                      +        
               ATTR=(NOPROT,MOD)                                                
TRP4     DFLD  POS=(19,38),LTH=5,                                      +        
               ATTR=(NOPROT,MOD)                                                
KDFDKRAV DFLD  POS=(19,44),LTH=3,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
KDGRANS  DFLD  POS=(19,48),LTH=3,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
REFOERS  DFLD  POS=(19,52),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
PRLEGKST DFLD  POS=(19,60),LTH=10,                                     +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  '13 Goods r. 1   14 Goods r.dist 15 Goods r. 2   16',   +        
               POS=(21,2),LTH=50,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17 Goods r. dc',                                       +        
               POS=(21,66),LTH=14,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19 Goods r.fc   20 Goods mark   21',                   +        
               POS=(22,18),LTH=34,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4O417N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N417,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I417N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W4N417,                                             +        
               NXT=W4I417N1                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  DGIA0000,                                               +        
               LTH=2                                                            
         MFLD  DGIA0001,                                               +        
               LTH=2                                                            
         MFLD  DGIA0004,                                               +        
               LTH=2                                                            
         MFLD  DGIA0005,                                               +        
               LTH=2                                                            
         MFLD  DGIA0002,                                               +        
               LTH=4                                                            
         MFLD  DGIA0003,                                               +        
               LTH=4                                                            
         MFLD  DGIA0006,                                               +        
               LTH=6                                                            
         MFLD  DGIA0007,                                               +        
               LTH=6                                                            
         MFLD  KUNDNR1,                                                +        
               LTH=6                                                            
         MFLD  TRPKAT1,                                                +        
               LTH=1                                                            
         MFLD  DGIA0009,                                               +        
               LTH=5                                                            
         MFLD  DGIA0021,                                               +        
               LTH=5                                                            
         MFLD  DGIA0033,                                               +        
               LTH=5                                                            
         MFLD  DGIA0045,                                               +        
               LTH=5                                                            
         MFLD  DGIA0057,                                               +        
               LTH=5                                                            
         MFLD  FDKRAV1,                                                +        
               LTH=3                                                            
         MFLD  KDGRANS1,                                               +        
               LTH=3                                                            
         MFLD  REFOERS1,                                               +        
               LTH=6                                                            
         MFLD  LEGKST1,                                                +        
               LTH=10                                                           
         MFLD  KUNDNR2,                                                +        
               LTH=6                                                            
         MFLD  TRPKAT2,                                                +        
               LTH=1                                                            
         MFLD  DGIA0012,                                               +        
               LTH=5                                                            
         MFLD  DGIA0024,                                               +        
               LTH=5                                                            
         MFLD  DGIA0036,                                               +        
               LTH=5                                                            
         MFLD  DGIA0048,                                               +        
               LTH=5                                                            
         MFLD  DGIA0060,                                               +        
               LTH=5                                                            
         MFLD  FDKRAV2,                                                +        
               LTH=3                                                            
         MFLD  KDGRANS2,                                               +        
               LTH=3                                                            
         MFLD  REFOERS2,                                               +        
               LTH=6                                                            
         MFLD  LEGKST2,                                                +        
               LTH=10                                                           
         MFLD  KUNDNR3,                                                +        
               LTH=6                                                            
         MFLD  TRPKAT3,                                                +        
               LTH=1                                                            
         MFLD  DGIA0013,                                               +        
               LTH=5                                                            
         MFLD  DGIA0025,                                               +        
               LTH=5                                                            
         MFLD  DGIA0037,                                               +        
               LTH=5                                                            
         MFLD  DGIA0049,                                               +        
               LTH=5                                                            
         MFLD  DGIA0061,                                               +        
               LTH=5                                                            
         MFLD  FDKRAV3,                                                +        
               LTH=3                                                            
         MFLD  KDGRANS3,                                               +        
               LTH=3                                                            
         MFLD  REFOERS3,                                               +        
               LTH=6                                                            
         MFLD  LEGKST3,                                                +        
               LTH=10                                                           
         MFLD  KUNDNR4,                                                +        
               LTH=6                                                            
         MFLD  TRPKAT4,                                                +        
               LTH=1                                                            
         MFLD  DGIA0014,                                               +        
               LTH=5                                                            
         MFLD  DGIA0026,                                               +        
               LTH=5                                                            
         MFLD  DGIA0038,                                               +        
               LTH=5                                                            
         MFLD  DGIA0050,                                               +        
               LTH=5                                                            
         MFLD  DGIA0062,                                               +        
               LTH=5                                                            
         MFLD  FDKRAV4,                                                +        
               LTH=3                                                            
         MFLD  KDGRANS4,                                               +        
               LTH=3                                                            
         MFLD  REFOERS4,                                               +        
               LTH=6                                                            
         MFLD  LEGKST4,                                                +        
               LTH=10                                                           
         MFLD  KUNDNR5,                                                +        
               LTH=6                                                            
         MFLD  TRPKAT5,                                                +        
               LTH=1                                                            
         MFLD  DGIA0015,                                               +        
               LTH=5                                                            
         MFLD  DGIA0027,                                               +        
               LTH=5                                                            
         MFLD  DGIA0039,                                               +        
               LTH=5                                                            
         MFLD  DGIA0051,                                               +        
               LTH=5                                                            
         MFLD  DGIA0063,                                               +        
               LTH=5                                                            
         MFLD  FDKRAV5,                                                +        
               LTH=3                                                            
         MFLD  KDGRANS5,                                               +        
               LTH=3                                                            
         MFLD  REFOERS5,                                               +        
               LTH=6                                                            
         MFLD  LEGKST5,                                                +        
               LTH=10                                                           
         MFLD  KUNDNR6,                                                +        
               LTH=6                                                            
         MFLD  TRPKAT6,                                                +        
               LTH=1                                                            
         MFLD  DGIA0016,                                               +        
               LTH=5                                                            
         MFLD  DGIA0028,                                               +        
               LTH=5                                                            
         MFLD  DGIA0040,                                               +        
               LTH=5                                                            
         MFLD  DGIA0052,                                               +        
               LTH=5                                                            
         MFLD  DGIA0064,                                               +        
               LTH=5                                                            
         MFLD  FDKRAV6,                                                +        
               LTH=3                                                            
         MFLD  KDGRANS6,                                               +        
               LTH=3                                                            
         MFLD  REFOER6,                                                +        
               LTH=6                                                            
         MFLD  LEGKST6,                                                +        
               LTH=10                                                           
         MFLD  KUNDNR7,                                                +        
               LTH=6                                                            
         MFLD  TRPKAT7,                                                +        
               LTH=1                                                            
         MFLD  DGIA0017,                                               +        
               LTH=5                                                            
         MFLD  DGIA0029,                                               +        
               LTH=5                                                            
         MFLD  DGIA0041,                                               +        
               LTH=5                                                            
         MFLD  DGIA0053,                                               +        
               LTH=5                                                            
         MFLD  DGIA0065,                                               +        
               LTH=5                                                            
         MFLD  FDKRAV7,                                                +        
               LTH=3                                                            
         MFLD  KDGRANS7,                                               +        
               LTH=3                                                            
         MFLD  REFOERS7,                                               +        
               LTH=6                                                            
         MFLD  LEGKST7,                                                +        
               LTH=10                                                           
         MFLD  KUNDNR8,                                                +        
               LTH=6                                                            
         MFLD  TRPKAT8,                                                +        
               LTH=1                                                            
         MFLD  DGIA0018,                                               +        
               LTH=5                                                            
         MFLD  DGIA0030,                                               +        
               LTH=5                                                            
         MFLD  DGIA0042,                                               +        
               LTH=5                                                            
         MFLD  DGIA0054,                                               +        
               LTH=5                                                            
         MFLD  DGIA0066,                                               +        
               LTH=5                                                            
         MFLD  FDKRAV8,                                                +        
               LTH=3                                                            
         MFLD  KDGRANS8,                                               +        
               LTH=3                                                            
         MFLD  REFOERS8,                                               +        
               LTH=6                                                            
         MFLD  LEGKST8,                                                +        
               LTH=10                                                           
         MFLD  KUNDNR9,                                                +        
               LTH=6                                                            
         MFLD  TRPKAT9,                                                +        
               LTH=1                                                            
         MFLD  DGIA0019,                                               +        
               LTH=5                                                            
         MFLD  DGIA0031,                                               +        
               LTH=5                                                            
         MFLD  DGIA0043,                                               +        
               LTH=5                                                            
         MFLD  DGIA0055,                                               +        
               LTH=5                                                            
         MFLD  DGIA0067,                                               +        
               LTH=5                                                            
         MFLD  FDKRAV9,                                                +        
               LTH=3                                                            
         MFLD  KDGRANS9,                                               +        
               LTH=3                                                            
         MFLD  REFOERS9,                                               +        
               LTH=6                                                            
         MFLD  LEGKST9,                                                +        
               LTH=10                                                           
         MFLD  KUNDNR10,                                               +        
               LTH=6                                                            
         MFLD  TRPKAT10,                                               +        
               LTH=1                                                            
         MFLD  DGIA0010,                                               +        
               LTH=5                                                            
         MFLD  DGIA0022,                                               +        
               LTH=5                                                            
         MFLD  DGIA0034,                                               +        
               LTH=5                                                            
         MFLD  DGIA0046,                                               +        
               LTH=5                                                            
         MFLD  DGIA0058,                                               +        
               LTH=5                                                            
         MFLD  FDKRAV10,                                               +        
               LTH=3                                                            
         MFLD  GRANS10,                                                +        
               LTH=3                                                            
         MFLD  REFOER10,                                               +        
               LTH=6                                                            
         MFLD  LEGKST10,                                               +        
               LTH=10                                                           
         MFLD  KUNDNR11,                                               +        
               LTH=6                                                            
         MFLD  TRPKAT11,                                               +        
               LTH=1                                                            
         MFLD  DGIA0011,                                               +        
               LTH=5                                                            
         MFLD  DGIA0023,                                               +        
               LTH=5                                                            
         MFLD  DGIA0035,                                               +        
               LTH=5                                                            
         MFLD  DGIA0047,                                               +        
               LTH=5                                                            
         MFLD  DGIA0059,                                               +        
               LTH=5                                                            
         MFLD  FDKRAV11,                                               +        
               LTH=3                                                            
         MFLD  GRANS11,                                                +        
               LTH=3                                                            
         MFLD  REFOER11,                                               +        
               LTH=6                                                            
         MFLD  LEGKST11,                                               +        
               LTH=10                                                           
         MFLD  TRPKATUT,                                               +        
               LTH=1                                                            
         MFLD  DGIA0008,                                               +        
               LTH=5                                                            
         MFLD  DGIA0020,                                               +        
               LTH=5                                                            
         MFLD  DGIA0032,                                               +        
               LTH=5                                                            
         MFLD  DGIA0044,                                               +        
               LTH=5                                                            
         MFLD  DGIA0056,                                               +        
               LTH=5                                                            
         MFLD  FDKRAVUT,                                               +        
               LTH=3                                                            
         MFLD  GRANSUT,                                                +        
               LTH=3                                                            
         MFLD  REFOERUT,                                               +        
               LTH=6                                                            
         MFLD  LEGKSTUT,                                               +        
               LTH=10                                                           
         MFLD  KDCMD,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KUND,                                                   +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TRPKAT,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TRP0,                                                   +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TRP1,                                                   +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TRP2,                                                   +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TRP3,                                                   +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TRP4,                                                   +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDFDKRAV,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDGRANS,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  REFOERS,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRLEGKST,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I417N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N417),                                           +        
               OPT=2,                                                  +        
               NXT=W4O417N1                                                     
MID      LPAGE SOR=(W4N417),                                           +        
               NXT=W4O417N1                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F7'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '44172',                                                +        
               LTH=5                                                            
         MFLD  (DGIA0000,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  DGIA0001,                                               +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0004,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0005,                                               +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0002,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0003,                                               +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0006,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0007,                                               +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDCMD,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KUND,                                                  +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TRPKAT,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TRP0,                                                  +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TRP1,                                                  +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TRP2,                                                  +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TRP3,                                                  +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TRP4,                                                  +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KDFDKRAV,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDGRANS,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (REFOERS,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PRLEGKST,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
