***********************************************************************         
* CREATED BY PC36146   ON 96/06/26  AT 09:20                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'GOODS RECEIVER INFORMATION 1    '                               
W4N411   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T411U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T411  ',                                          +        
               14='W4T412  ',                                          +        
               15='W4T413  ',                                          +        
               16='W0T501  ',                                          +        
               17='W4T415  ',                                          +        
               18='W0T501  ',                                          +        
               19='W4T417  ',                                          +        
               20='W4T418  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='WT411V  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W4N411   DPAGE CURSOR=((2,11)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'GOODS RECEIVER INF. 1',                                +        
               POS=(1,12),LTH=21,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'District',                                             +        
               POS=(2,2),LTH=8,                                        +        
               ATTR=(NUM,PROT)                                                  
DGIA0002 DFLD  POS=(2,11),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Cust',                                                 +        
               POS=(2,17),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0007 DFLD  POS=(2,22),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Copy from cust',                                       +        
               POS=(2,31),LTH=14,                                      +        
               ATTR=(PROT)                                                      
DGIA0006 DFLD  POS=(2,46),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0003 DFLD  POS=(3,11),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0008 DFLD  POS=(3,22),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Goods receiver',                                       +        
               POS=(5,2),LTH=14,                                       +        
               ATTR=(PROT)                                                      
BEGMT1   DFLD  POS=(5,17),LTH=35,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Partner Code',                                         +        
               POS=(5,53),LTH=12,                                      +        
               ATTR=(PROT)                                                      
PARTNRID DFLD  POS=(5,67),LTH=9,                                       +        
               ATTR=(NOPROT)                                                    
BEGMT2   DFLD  POS=(6,17),LTH=35,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Partner ID',                                           +        
               POS=(6,53),LTH=10,                                      +        
               ATTR=(PROT)                                                      
VIPSCUST DFLD  POS=(6,67),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Street ',                                              +        
               POS=(7,2),LTH=7,                                        +        
               ATTR=(PROT)                                                      
ADGMT1   DFLD  POS=(7,17),LTH=35,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'ISO Code',                                             +        
               POS=(7,53),LTH=8,                                       +        
               ATTR=(PROT)                                                      
ISOCD    DFLD  POS=(7,67),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Postal Code',                                          +        
               POS=(8,2),LTH=11,                                       +        
               ATTR=(PROT)                                                      
POSTNR   DFLD  POS=(8,17),LTH=10,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Align',                                                +        
               POS=(8,28),LTH=5,                                       +        
               ATTR=(PROT)                                                      
FLJUST   DFLD  POS=(8,34),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Cust Category',                                        +        
               POS=(8,53),LTH=13,                                      +        
               ATTR=(PROT)                                                      
CUSTCATC DFLD  POS=(8,67),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
CUSTCATD DFLD  POS=(8,70),LTH=10,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'City',                                                 +        
               POS=(9,2),LTH=4,                                        +        
               ATTR=(PROT)                                                      
ADGMT2   DFLD  POS=(9,17),LTH=25,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Longitude',                                            +        
               POS=(9,53),LTH=9,                                       +        
               ATTR=(PROT)                                                      
LONGITUD DFLD  POS=(9,67),LTH=10,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Country',                                              +        
               POS=(10,2),LTH=7,                                       +        
               ATTR=(PROT)                                                      
ADLAND   DFLD  POS=(10,17),LTH=35,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'Latitude',                                             +        
               POS=(10,53),LTH=8,                                      +        
               ATTR=(PROT)                                                      
LATITUDE DFLD  POS=(10,67),LTH=10,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'Tel No.',                                              +        
               POS=(11,2),LTH=7,                                       +        
               ATTR=(PROT)                                                      
IDTFN    DFLD  POS=(11,17),LTH=20,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'Info',                                                 +        
               POS=(11,41),LTH=4,                                      +        
               ATTR=(PROT)                                                      
INFORMN  DFLD  POS=(11,46),LTH=35,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'Back order',                                           +        
               POS=(13,2),LTH=10,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '(Y N)',                                                +        
               POS=(13,19),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FLRESTN  DFLD  POS=(13,25),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Zone',                                                 +        
               POS=(13,41),LTH=4,                                      +        
               ATTR=(PROT)                                                      
IDZON    DFLD  POS=(13,48),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Prel bo conf.    (Y N)',                               +        
               POS=(14,2),LTH=22,                                      +        
               ATTR=(PROT)                                                      
PRELRO   DFLD  POS=(14,25),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Depote',                                               +        
               POS=(14,41),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DEPOT    DFLD  POS=(14,48),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Bo drop limit %',                                      +        
               POS=(15,2),LTH=15,                                      +        
               ATTR=(PROT)                                                      
DGIA0001 DFLD  POS=(15,21),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0000 DFLD  POS=(15,25),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Route',                                                +        
               POS=(15,41),LTH=5,                                      +        
               ATTR=(PROT)                                                      
IDROUTE  DFLD  POS=(15,49),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Branch to cust',                                       +        
               POS=(17,2),LTH=14,                                      +        
               ATTR=(PROT)                                                      
DGIA0005 DFLD  POS=(17,17),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0004 DFLD  POS=(17,25),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Order conf alt',                                       +        
               POS=(18,2),LTH=14,                                      +        
               ATTR=(PROT)                                                      
BEKALTU  DFLD  POS=(18,22),LTH=1,                                      +        
               ATTR=(PROT)                                                      
BEKALTI  DFLD  POS=(18,25),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'TACDIS (Y N)',                                         +        
               POS=(17,35),LTH=12,                                     +        
               ATTR=(PROT)                                                      
TACDISU  DFLD  POS=(17,49),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TACDISI  DFLD  POS=(17,51),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'VCOM   (Y N)',                                         +        
               POS=(18,35),LTH=12,                                     +        
               ATTR=(PROT)                                                      
VCOMU    DFLD  POS=(18,49),LTH=1,                                      +        
               ATTR=(PROT)                                                      
VCOMI    DFLD  POS=(18,51),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'OrderCl (Y N)   1  2  3  4',                           +        
               POS=(13,54),LTH=26,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Forced Amend.',                                        +        
               POS=(14,54),LTH=13,                                     +        
               ATTR=(PROT)                                                      
FLORDTI1 DFLD  POS=(14,70),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
FLORDTI2 DFLD  POS=(14,73),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
FLORDTI3 DFLD  POS=(14,76),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
FLORDTI4 DFLD  POS=(14,79),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  '13 Goods r. 1   14 Goods r.dist 15 Goods r. 2   16',   +        
               POS=(20,2),LTH=50,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17 Goods r. dc',                                       +        
               POS=(20,66),LTH=14,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(21,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19 Goods r.fc   20 Goods mark   21',                   +        
               POS=(21,18),LTH=34,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(21,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(22,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(22,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(22,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(22,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(23,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4O411N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N411,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I411N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W4N411,                                             +        
               NXT=W4I411N1                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  DGIA0002,                                               +        
               LTH=4                                                            
         MFLD  DGIA0003,                                               +        
               LTH=4                                                            
         MFLD  DGIA0007,                                               +        
               LTH=6                                                            
         MFLD  DGIA0008,                                               +        
               LTH=6                                                            
         MFLD  DGIA0006,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BEGMT1,                                                 +        
               LTH=37,                                                 +        
               ATTR=(YES)                                                       
         MFLD  PARTNRID,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  BEGMT2,                                                 +        
               LTH=37,                                                 +        
               ATTR=(YES)                                                       
         MFLD  VIPSCUST,                                               +        
               LTH=6                                                            
         MFLD  ADGMT1,                                                 +        
               LTH=37,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ISOCD,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  POSTNR,                                                 +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLJUST,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CUSTCATC,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CUSTCATD,                                               +        
               LTH=10                                                           
         MFLD  ADGMT2,                                                 +        
               LTH=27,                                                 +        
               ATTR=(YES)                                                       
         MFLD  LONGITUD,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ADLAND,                                                 +        
               LTH=37,                                                 +        
               ATTR=(YES)                                                       
         MFLD  LATITUDE,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDTFN,                                                  +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  INFORMN,                                                +        
               LTH=37,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLRESTN,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDZON,                                                  +        
               LTH=2                                                            
         MFLD  PRELRO,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DEPOT,                                                  +        
               LTH=2                                                            
         MFLD  DGIA0001,                                               +        
               LTH=2                                                            
         MFLD  DGIA0000,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDROUTE,                                                +        
               LTH=1                                                            
         MFLD  DGIA0005,                                               +        
               LTH=6                                                            
         MFLD  DGIA0004,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BEKALTU,                                                +        
               LTH=1                                                            
         MFLD  BEKALTI,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TACDISU,                                                +        
               LTH=1                                                            
         MFLD  TACDISI,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VCOMU,                                                  +        
               LTH=1                                                            
         MFLD  VCOMI,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLORDTI1,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLORDTI2,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLORDTI3,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLORDTI4,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I411N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N411),                                           +        
               OPT=2,                                                  +        
               NXT=W4O411N1                                                     
MID      LPAGE SOR=(W4N411),                                           +        
               NXT=W4O411N1                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '44112',                                                +        
               LTH=5                                                            
         MFLD  (DGIA0002,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0003,                                               +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0007,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0008,                                               +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0006,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (BEGMT1,                                                +        
               '+++++++++++++++++++++++++++++++++++'),                 +        
               LTH=35,                                                 +        
               FILL=X'40'                                                       
         MFLD  (PARTNRID,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               FILL=X'40'                                                       
         MFLD  (BEGMT2,                                                +        
               '+++++++++++++++++++++++++++++++++++'),                 +        
               LTH=35,                                                 +        
               FILL=X'40'                                                       
         MFLD  (ADGMT1,                                                +        
               '+++++++++++++++++++++++++++++++++++'),                 +        
               LTH=35,                                                 +        
               FILL=X'40'                                                       
         MFLD  (ISOCD,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (POSTNR,                                                +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLJUST,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CUSTCATC,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ADGMT2,                                                +        
               '+++++++++++++++++++++++++'),                           +        
               LTH=25,                                                 +        
               FILL=X'40'                                                       
         MFLD  (LONGITUD,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               FILL=X'40'                                                       
         MFLD  (ADLAND,                                                +        
               '+++++++++++++++++++++++++++++++++++'),                 +        
               LTH=35,                                                 +        
               FILL=X'40'                                                       
         MFLD  (LATITUDE,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDTFN,                                                 +        
               '++++++++++++++++++++'),                                +        
               LTH=20,                                                 +        
               FILL=X'40'                                                       
         MFLD  (INFORMN,                                               +        
               '+++++++++++++++++++++++++++++++++++'),                 +        
               LTH=35,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLRESTN,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (PRELRO,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0000,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0004,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (BEKALTI,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TACDISI,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (VCOMI, ,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLORDTI1,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLORDTI2,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLORDTI3,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLORDTI4,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
