***********************************************************************         
* CREATED BY PCC6483   ON 00/10/24  AT 10:18                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'Direct delivery maintenance     '                               
W4N431   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W4T431 7',                                           +        
               8='W4T431 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T431U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,11)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'DIRECT DEL PARAMETER MAINTEN',                         +        
               POS=(1,11),LTH=28,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Supplier',                                             +        
               POS=(2,2),LTH=8,                                        +        
               ATTR=(NUM,PROT)                                                  
LEVNRIN  DFLD  POS=(2,11),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Distr',                                                +        
               POS=(2,17),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
DISTRIN  DFLD  POS=(2,23),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Class',                                                +        
               POS=(2,28),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
ORDKLIN  DFLD  POS=(2,34),LTH=1,                                       +        
               ATTR=(NUM,NOPROT)                                                
LEVNRUT  DFLD  POS=(3,11),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
DISTRUT  DFLD  POS=(3,23),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
ORDKLUT  DFLD  POS=(3,34),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  '                                   --- Days to deliver +        
               ---      ',                                             +        
               POS=(5,2),LTH=64,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'C Class Distr Cust  DC Type CO time   RFS calc    TPO S+        
               end Calc  +- Transp day diff',                          +        
               POS=(6,2),LTH=78,                                       +        
               ATTR=(PROT)                                                      
CMD      DFLD  POS=(7,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
ORDKLE   DFLD  POS=(7,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
DISTRE   DFLD  POS=(7,10),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
KUNDE    DFLD  POS=(7,15),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
IDDCE    DFLD  POS=(7,22),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
KDVIAE   DFLD  POS=(7,26),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
TIMINUTE DFLD  POS=(7,30),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
DAGLEVE  DFLD  POS=(7,41),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
DAGTPOE  DFLD  POS=(7,53),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
TECKEN   DFLD  POS=(7,68),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DAGDIFE  DFLD  POS=(7,73),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
ORDKL1   DFLD  POS=(9,6),LTH=1,                                        +        
               ATTR=(PROT,MOD)                                                  
DISTR1   DFLD  POS=(9,10),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
KUND1    DFLD  POS=(9,15),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
IDDC1    DFLD  POS=(9,22),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
KDVIA1   DFLD  POS=(9,26),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
TID1     DFLD  POS=(9,30),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
DAGLEV1  DFLD  POS=(9,40),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DAGTPO1  DFLD  POS=(9,52),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DAGDIF1  DFLD  POS=(9,72),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
ORDKL2   DFLD  POS=(10,6),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
DISTR2   DFLD  POS=(10,10),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
KUND2    DFLD  POS=(10,15),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
IDDC2    DFLD  POS=(10,22),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
KDVIA2   DFLD  POS=(10,26),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
TID2     DFLD  POS=(10,30),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
DAGLEV2  DFLD  POS=(10,40),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DAGTPO2  DFLD  POS=(10,52),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DAGDIF2  DFLD  POS=(10,72),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
ORDKL3   DFLD  POS=(11,6),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
DISTR3   DFLD  POS=(11,10),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
KUND3    DFLD  POS=(11,15),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
IDDC3    DFLD  POS=(11,22),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
KDVIA3   DFLD  POS=(11,26),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
TID3     DFLD  POS=(11,30),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
DAGLEV3  DFLD  POS=(11,40),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DAGTPO3  DFLD  POS=(11,52),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DAGDIF3  DFLD  POS=(11,72),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
ORDKL4   DFLD  POS=(12,6),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
DISTR4   DFLD  POS=(12,10),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
KUND4    DFLD  POS=(12,15),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
IDDC4    DFLD  POS=(12,22),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
KDVIA4   DFLD  POS=(12,26),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
TID4     DFLD  POS=(12,30),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
DAGLEV4  DFLD  POS=(12,40),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DAGTPO4  DFLD  POS=(12,52),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DAGDIF4  DFLD  POS=(12,72),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
ORDKL5   DFLD  POS=(13,6),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
DISTR5   DFLD  POS=(13,10),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
KUND5    DFLD  POS=(13,15),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
IDDC5    DFLD  POS=(13,22),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
KDVIA5   DFLD  POS=(13,26),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
TID5     DFLD  POS=(13,30),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
DAGLEV5  DFLD  POS=(13,40),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DAGTPO5  DFLD  POS=(13,52),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DAGDIF5  DFLD  POS=(13,72),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
ORDKL6   DFLD  POS=(14,6),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
DISTR6   DFLD  POS=(14,10),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
KUND6    DFLD  POS=(14,15),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
IDDC6    DFLD  POS=(14,22),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
KDVIA6   DFLD  POS=(14,26),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
TID6     DFLD  POS=(14,30),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
DAGLEV6  DFLD  POS=(14,40),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DAGTPO6  DFLD  POS=(14,52),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DAGDIF6  DFLD  POS=(14,72),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
ORDKL7   DFLD  POS=(15,6),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
DISTR7   DFLD  POS=(15,10),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
KUND7    DFLD  POS=(15,15),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
IDDC7    DFLD  POS=(15,22),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
KDVIA7   DFLD  POS=(15,26),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
TID7     DFLD  POS=(15,30),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
DAGLEV7  DFLD  POS=(15,40),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DAGTPO7  DFLD  POS=(15,52),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DAGDIF7  DFLD  POS=(15,72),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
ORDKL8   DFLD  POS=(16,6),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
DISTR8   DFLD  POS=(16,10),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
KUND8    DFLD  POS=(16,15),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
IDDC8    DFLD  POS=(16,22),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
KDVIA8   DFLD  POS=(16,26),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
TID8     DFLD  POS=(16,30),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
DAGLEV8  DFLD  POS=(16,40),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DAGTPO8  DFLD  POS=(16,52),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DAGDIF8  DFLD  POS=(16,72),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
ORDKL9   DFLD  POS=(17,6),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
DISTR9   DFLD  POS=(17,10),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
KUND9    DFLD  POS=(17,15),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
IDDC9    DFLD  POS=(17,22),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
KDVIA9   DFLD  POS=(17,26),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
TID9     DFLD  POS=(17,30),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
DAGLEV9  DFLD  POS=(17,40),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DAGTPO9  DFLD  POS=(17,52),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DAGDIF9  DFLD  POS=(17,72),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
ORDKL10  DFLD  POS=(18,6),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
DISTR10  DFLD  POS=(18,10),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
KUND10   DFLD  POS=(18,15),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
IDDC10   DFLD  POS=(18,22),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
KDVIA10  DFLD  POS=(18,26),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
TID10    DFLD  POS=(18,30),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
DAGLEV10 DFLD  POS=(18,40),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DAGTPO10 DFLD  POS=(18,52),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DAGDIF10 DFLD  POS=(18,72),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'F10=WHELP  F11=Update',                                +        
               POS=(22,2),LTH=21,                                      +        
               ATTR=(PROT)                                                      
FLD2306  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,58),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
DATE     DFLD  POS=(23,63),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4O431N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N431,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I431N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  LEVNRIN,                                                +        
               LTH=2                                                            
         MFLD  LEVNRUT,                                                +        
               LTH=5                                                            
         MFLD  DISTRIN,                                                +        
               LTH=2                                                            
         MFLD  DISTRUT,                                                +        
               LTH=4                                                            
         MFLD  ORDKLIN,                                                +        
               LTH=2                                                            
         MFLD  ORDKLUT,                                                +        
               LTH=1                                                            
         MFLD  CMD,                                                    +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ORDKLE,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DISTRE,                                                 +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KUNDE,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDDCE,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDVIAE,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TIMINUTE,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DAGLEVE,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DAGTPOE,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TECKEN,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DAGDIFE,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ORDKL1,                                                 +        
               LTH=1                                                            
         MFLD  DISTR1,                                                 +        
               LTH=4                                                            
         MFLD  KUND1,                                                  +        
               LTH=6                                                            
         MFLD  IDDC1,                                                  +        
               LTH=2                                                            
         MFLD  KDVIA1,                                                 +        
               LTH=2                                                            
         MFLD  TID1,                                                   +        
               LTH=5                                                            
         MFLD  DAGLEV1,                                                +        
               LTH=4                                                            
         MFLD  DAGTPO1,                                                +        
               LTH=4                                                            
         MFLD  DAGDIF1,                                                +        
               LTH=4                                                            
         MFLD  ORDKL2,                                                 +        
               LTH=1                                                            
         MFLD  DISTR2,                                                 +        
               LTH=4                                                            
         MFLD  KUND2,                                                  +        
               LTH=6                                                            
         MFLD  IDDC2,                                                  +        
               LTH=2                                                            
         MFLD  KDVIA2,                                                 +        
               LTH=2                                                            
         MFLD  TID2,                                                   +        
               LTH=5                                                            
         MFLD  DAGLEV2,                                                +        
               LTH=4                                                            
         MFLD  DAGTPO2,                                                +        
               LTH=4                                                            
         MFLD  DAGDIF2,                                                +        
               LTH=4                                                            
         MFLD  ORDKL3,                                                 +        
               LTH=1                                                            
         MFLD  DISTR3,                                                 +        
               LTH=4                                                            
         MFLD  KUND3,                                                  +        
               LTH=6                                                            
         MFLD  IDDC3,                                                  +        
               LTH=2                                                            
         MFLD  KDVIA3,                                                 +        
               LTH=2                                                            
         MFLD  TID3,                                                   +        
               LTH=5                                                            
         MFLD  DAGLEV3,                                                +        
               LTH=4                                                            
         MFLD  DAGTPO3,                                                +        
               LTH=4                                                            
         MFLD  DAGDIF3,                                                +        
               LTH=4                                                            
         MFLD  ORDKL4,                                                 +        
               LTH=1                                                            
         MFLD  DISTR4,                                                 +        
               LTH=4                                                            
         MFLD  KUND4,                                                  +        
               LTH=6                                                            
         MFLD  IDDC4,                                                  +        
               LTH=2                                                            
         MFLD  KDVIA4,                                                 +        
               LTH=2                                                            
         MFLD  TID4,                                                   +        
               LTH=5                                                            
         MFLD  DAGLEV4,                                                +        
               LTH=4                                                            
         MFLD  DAGTPO4,                                                +        
               LTH=4                                                            
         MFLD  DAGDIF4,                                                +        
               LTH=4                                                            
         MFLD  ORDKL5,                                                 +        
               LTH=1                                                            
         MFLD  DISTR5,                                                 +        
               LTH=4                                                            
         MFLD  KUND5,                                                  +        
               LTH=6                                                            
         MFLD  IDDC5,                                                  +        
               LTH=2                                                            
         MFLD  KDVIA5,                                                 +        
               LTH=2                                                            
         MFLD  TID5,                                                   +        
               LTH=5                                                            
         MFLD  DAGLEV5,                                                +        
               LTH=4                                                            
         MFLD  DAGTPO5,                                                +        
               LTH=4                                                            
         MFLD  DAGDIF5,                                                +        
               LTH=4                                                            
         MFLD  ORDKL6,                                                 +        
               LTH=1                                                            
         MFLD  DISTR6,                                                 +        
               LTH=4                                                            
         MFLD  KUND6,                                                  +        
               LTH=6                                                            
         MFLD  IDDC6,                                                  +        
               LTH=2                                                            
         MFLD  KDVIA6,                                                 +        
               LTH=2                                                            
         MFLD  TID6,                                                   +        
               LTH=5                                                            
         MFLD  DAGLEV6,                                                +        
               LTH=4                                                            
         MFLD  DAGTPO6,                                                +        
               LTH=4                                                            
         MFLD  DAGDIF6,                                                +        
               LTH=4                                                            
         MFLD  ORDKL7,                                                 +        
               LTH=1                                                            
         MFLD  DISTR7,                                                 +        
               LTH=4                                                            
         MFLD  KUND7,                                                  +        
               LTH=6                                                            
         MFLD  IDDC7,                                                  +        
               LTH=2                                                            
         MFLD  KDVIA7,                                                 +        
               LTH=2                                                            
         MFLD  TID7,                                                   +        
               LTH=5                                                            
         MFLD  DAGLEV7,                                                +        
               LTH=4                                                            
         MFLD  DAGTPO7,                                                +        
               LTH=4                                                            
         MFLD  DAGDIF7,                                                +        
               LTH=4                                                            
         MFLD  ORDKL8,                                                 +        
               LTH=1                                                            
         MFLD  DISTR8,                                                 +        
               LTH=4                                                            
         MFLD  KUND8,                                                  +        
               LTH=6                                                            
         MFLD  IDDC8,                                                  +        
               LTH=2                                                            
         MFLD  KDVIA8,                                                 +        
               LTH=2                                                            
         MFLD  TID8,                                                   +        
               LTH=5                                                            
         MFLD  DAGLEV8,                                                +        
               LTH=4                                                            
         MFLD  DAGTPO8,                                                +        
               LTH=4                                                            
         MFLD  DAGDIF8,                                                +        
               LTH=4                                                            
         MFLD  ORDKL9,                                                 +        
               LTH=1                                                            
         MFLD  DISTR9,                                                 +        
               LTH=4                                                            
         MFLD  KUND9,                                                  +        
               LTH=6                                                            
         MFLD  IDDC9,                                                  +        
               LTH=2                                                            
         MFLD  KDVIA9,                                                 +        
               LTH=2                                                            
         MFLD  TID9,                                                   +        
               LTH=5                                                            
         MFLD  DAGLEV9,                                                +        
               LTH=4                                                            
         MFLD  DAGTPO9,                                                +        
               LTH=4                                                            
         MFLD  DAGDIF9,                                                +        
               LTH=4                                                            
         MFLD  ORDKL10,                                                +        
               LTH=1                                                            
         MFLD  DISTR10,                                                +        
               LTH=4                                                            
         MFLD  KUND10,                                                 +        
               LTH=6                                                            
         MFLD  IDDC10,                                                 +        
               LTH=2                                                            
         MFLD  KDVIA10,                                                +        
               LTH=2                                                            
         MFLD  TID10,                                                  +        
               LTH=5                                                            
         MFLD  DAGLEV10,                                               +        
               LTH=4                                                            
         MFLD  DAGTPO10,                                               +        
               LTH=4                                                            
         MFLD  DAGDIF10,                                               +        
               LTH=4                                                            
         MFLD  FLD2306,                                                +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I431N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N431),                                           +        
               OPT=2,                                                  +        
               NXT=W4O431N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '44312',                                                +        
               LTH=5                                                            
         MFLD  (LEVNRIN,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (LEVNRUT,                                               +        
               '     '),                                               +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (DISTRIN,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DISTRUT,                                               +        
               '    '),                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (ORDKLIN,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (ORDKLUT,                                               +        
               ' '),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (CMD,                                                   +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (ORDKLE,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DISTRE,                                                +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KUNDE,                                                 +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDDCE,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KDVIAE,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TIMINUTE,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DAGLEVE,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DAGTPOE,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TECKEN,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DAGDIFE,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
