***********************************************************************         
* CREATED BY V065708   ON 02/03/22  AT 07:42                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'QUESTION CUSTOMER MASTER DC     '                               
W4N422   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T421  ',                                          +        
               14='W4T422  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W4N422   DPAGE CURSOR=((2,11)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'QUESTION CUSTOMER MASTER DC',                          +        
               POS=(1,12),LTH=27,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'District',                                             +        
               POS=(2,2),LTH=8,                                        +        
               ATTR=(NUM,PROT)                                                  
DGIA0000 DFLD  POS=(2,11),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Cust',                                                 +        
               POS=(2,17),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0002 DFLD  POS=(2,22),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DC',                                                   +        
               POS=(2,31),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DGIA0004 DFLD  POS=(2,34),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'FC',                                                   +        
               POS=(2,38),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DGIA0006 DFLD  POS=(2,41),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0001 DFLD  POS=(3,11),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0003 DFLD  POS=(3,22),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0005 DFLD  POS=(3,34),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0007 DFLD  POS=(3,41),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Goods receiver',                                       +        
               POS=(5,2),LTH=14,                                       +        
               ATTR=(PROT)                                                      
BEGMT1   DFLD  POS=(5,17),LTH=35,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'DC support from:',                                     +        
               POS=(4,56),LTH=16,                                      +        
               ATTR=(PROT)                                                      
BEGMT2   DFLD  POS=(6,17),LTH=35,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Bulk   Day    Vor',                                    +        
               POS=(5,56),LTH=17,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Address',                                              +        
               POS=(7,2),LTH=7,                                        +        
               ATTR=(PROT)                                                      
ADGMT1   DFLD  POS=(7,17),LTH=35,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'DC Fc  DC Fc  DC Fc',                                  +        
               POS=(6,56),LTH=19,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Post address',                                         +        
               POS=(8,2),LTH=12,                                       +        
               ATTR=(PROT)                                                      
ADGMT2   DFLD  POS=(8,17),LTH=35,                                      +        
               ATTR=(PROT)                                                      
BUDC1    DFLD  POS=(7,56),LTH=2,                                       +        
               ATTR=(PROT)                                                      
BUFC1    DFLD  POS=(7,59),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DAYDC1   DFLD  POS=(7,63),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DAYFC1   DFLD  POS=(7,66),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
VORDC1   DFLD  POS=(7,70),LTH=2,                                       +        
               ATTR=(PROT)                                                      
VORFC1   DFLD  POS=(7,73),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
BUDC2    DFLD  POS=(8,56),LTH=2,                                       +        
               ATTR=(PROT)                                                      
BUFC2    DFLD  POS=(8,59),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DAYDC2   DFLD  POS=(8,63),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DAYFC2   DFLD  POS=(8,66),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
VORDC2   DFLD  POS=(8,70),LTH=2,                                       +        
               ATTR=(PROT)                                                      
VORFC2   DFLD  POS=(8,73),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Country',                                              +        
               POS=(9,2),LTH=7,                                        +        
               ATTR=(PROT)                                                      
ADLAND   DFLD  POS=(9,17),LTH=35,                                      +        
               ATTR=(PROT)                                                      
BUDC3    DFLD  POS=(9,56),LTH=2,                                       +        
               ATTR=(PROT)                                                      
BUFC3    DFLD  POS=(9,59),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DAYDC3   DFLD  POS=(9,63),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DAYFC3   DFLD  POS=(9,66),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
VORDC3   DFLD  POS=(9,70),LTH=2,                                       +        
               ATTR=(PROT)                                                      
VORFC3   DFLD  POS=(9,73),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
BUDC4    DFLD  POS=(10,56),LTH=2,                                      +        
               ATTR=(PROT)                                                      
BUFC4    DFLD  POS=(10,59),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DAYDC4   DFLD  POS=(10,63),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DAYFC4   DFLD  POS=(10,66),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
VORDC4   DFLD  POS=(10,70),LTH=2,                                      +        
               ATTR=(PROT)                                                      
VORFC4   DFLD  POS=(10,73),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Packing',                                              +        
               POS=(11,2),LTH=7,                                       +        
               ATTR=(PROT)                                                      
KDFDKOD  DFLD  POS=(11,17),LTH=3,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '(',                                                    +        
               POS=(11,21),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
BEFDKRAV DFLD  POS=(11,23),LTH=30,                                     +        
               ATTR=(PROT)                                                      
         DFLD  ')',                                                    +        
               POS=(11,54),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
BUDC5    DFLD  POS=(11,56),LTH=2,                                      +        
               ATTR=(PROT)                                                      
BUFC5    DFLD  POS=(11,59),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DAYDC5   DFLD  POS=(11,63),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DAYFC5   DFLD  POS=(11,66),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
VORDC5   DFLD  POS=(11,70),LTH=2,                                      +        
               ATTR=(PROT)                                                      
VORFC5   DFLD  POS=(11,73),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Terms of payment',                                     +        
               POS=(12,2),LTH=16,                                      +        
               ATTR=(PROT)                                                      
KDBETVIL DFLD  POS=(12,19),LTH=4,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '(',                                                    +        
               POS=(12,24),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
BEBETVIL DFLD  POS=(12,26),LTH=27,                                     +        
               ATTR=(PROT)                                                      
         DFLD  ')',                                                    +        
               POS=(12,54),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
BUDC6    DFLD  POS=(12,56),LTH=2,                                      +        
               ATTR=(PROT)                                                      
BUFC6    DFLD  POS=(12,59),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DAYDC6   DFLD  POS=(12,63),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DAYFC6   DFLD  POS=(12,66),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
VORDC6   DFLD  POS=(12,70),LTH=2,                                      +        
               ATTR=(PROT)                                                      
VORFC6   DFLD  POS=(12,73),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
BUDC7    DFLD  POS=(13,56),LTH=2,                                      +        
               ATTR=(PROT)                                                      
BUFC7    DFLD  POS=(13,59),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DAYDC7   DFLD  POS=(13,63),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DAYFC7   DFLD  POS=(13,66),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
VORDC7   DFLD  POS=(13,70),LTH=2,                                      +        
               ATTR=(PROT)                                                      
VORFC7   DFLD  POS=(13,73),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Trp. cat.',                                            +        
               POS=(14,2),LTH=9,                                       +        
               ATTR=(PROT)                                                      
KDTRPKAT DFLD  POS=(14,17),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Carrier:',                                             +        
               POS=(15,27),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Alt. carrier:',                                        +        
               POS=(15,52),LTH=13,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Transp.-id',                                           +        
               POS=(16,2),LTH=10,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '0',                                                    +        
               POS=(16,17),LTH=1,                                      +        
               ATTR=(PROT)                                                      
IDTRP0   DFLD  POS=(16,20),LTH=5,                                      +        
               ATTR=(PROT)                                                      
TRPFIR0  DFLD  POS=(16,27),LTH=15,                                     +        
               ATTR=(PROT)                                                      
IDTRPA0  DFLD  POS=(16,45),LTH=5,                                      +        
               ATTR=(PROT)                                                      
TRPFIRA0 DFLD  POS=(16,52),LTH=15,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '1',                                                    +        
               POS=(17,17),LTH=1,                                      +        
               ATTR=(PROT)                                                      
IDTRP1   DFLD  POS=(17,20),LTH=5,                                      +        
               ATTR=(PROT)                                                      
TRPFIR1  DFLD  POS=(17,27),LTH=15,                                     +        
               ATTR=(PROT)                                                      
IDTRPA1  DFLD  POS=(17,45),LTH=5,                                      +        
               ATTR=(PROT)                                                      
TRPFIRA1 DFLD  POS=(17,52),LTH=15,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '2',                                                    +        
               POS=(18,17),LTH=1,                                      +        
               ATTR=(PROT)                                                      
IDTRP2   DFLD  POS=(18,20),LTH=5,                                      +        
               ATTR=(PROT)                                                      
TRPFIR2  DFLD  POS=(18,27),LTH=15,                                     +        
               ATTR=(PROT)                                                      
IDTRPA2  DFLD  POS=(18,45),LTH=5,                                      +        
               ATTR=(PROT)                                                      
TRPFIRA2 DFLD  POS=(18,52),LTH=15,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '3',                                                    +        
               POS=(19,17),LTH=1,                                      +        
               ATTR=(PROT)                                                      
IDTRP3   DFLD  POS=(19,20),LTH=5,                                      +        
               ATTR=(PROT)                                                      
TRPFIR3  DFLD  POS=(19,27),LTH=15,                                     +        
               ATTR=(PROT)                                                      
IDTRPA3  DFLD  POS=(19,45),LTH=5,                                      +        
               ATTR=(PROT)                                                      
TRPFIRA3 DFLD  POS=(19,52),LTH=15,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '4',                                                    +        
               POS=(20,17),LTH=1,                                      +        
               ATTR=(PROT)                                                      
IDTRP4   DFLD  POS=(20,20),LTH=5,                                      +        
               ATTR=(PROT)                                                      
TRPFIR4  DFLD  POS=(20,27),LTH=15,                                     +        
               ATTR=(PROT)                                                      
IDTRPA4  DFLD  POS=(20,45),LTH=5,                                      +        
               ATTR=(PROT)                                                      
TRPFIRA4 DFLD  POS=(20,52),LTH=15,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '13 Master DC    14 Master FC    15',                   +        
               POS=(21,2),LTH=34,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16',                                                   +        
               POS=(21,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4O422N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N422,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I422N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W4N422,                                             +        
               NXT=W4I422N1                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  DGIA0000,                                               +        
               LTH=4                                                            
         MFLD  DGIA0001,                                               +        
               LTH=4                                                            
         MFLD  DGIA0002,                                               +        
               LTH=6                                                            
         MFLD  DGIA0003,                                               +        
               LTH=6                                                            
         MFLD  DGIA0004,                                               +        
               LTH=2                                                            
         MFLD  DGIA0005,                                               +        
               LTH=2                                                            
         MFLD  DGIA0006,                                               +        
               LTH=2                                                            
         MFLD  DGIA0007,                                               +        
               LTH=2                                                            
         MFLD  BEGMT1,                                                 +        
               LTH=35                                                           
         MFLD  BEGMT2,                                                 +        
               LTH=35                                                           
         MFLD  ADGMT1,                                                 +        
               LTH=35                                                           
         MFLD  ADGMT2,                                                 +        
               LTH=35                                                           
         MFLD  ADLAND,                                                 +        
               LTH=35                                                           
         MFLD  KDFDKOD,                                                +        
               LTH=3                                                            
         MFLD  BEFDKRAV,                                               +        
               LTH=30                                                           
         MFLD  KDBETVIL,                                               +        
               LTH=4                                                            
         MFLD  BEBETVIL,                                               +        
               LTH=27                                                           
         MFLD  KDTRPKAT,                                               +        
               LTH=1                                                            
         MFLD  IDTRP0,                                                 +        
               LTH=5                                                            
         MFLD  TRPFIR0,                                                +        
               LTH=15                                                           
         MFLD  IDTRPA0,                                                +        
               LTH=5                                                            
         MFLD  TRPFIRA0,                                               +        
               LTH=15                                                           
         MFLD  IDTRP1,                                                 +        
               LTH=5                                                            
         MFLD  TRPFIR1,                                                +        
               LTH=15                                                           
         MFLD  IDTRPA1,                                                +        
               LTH=5                                                            
         MFLD  TRPFIRA1,                                               +        
               LTH=15                                                           
         MFLD  IDTRP2,                                                 +        
               LTH=5                                                            
         MFLD  TRPFIR2,                                                +        
               LTH=15                                                           
         MFLD  IDTRPA2,                                                +        
               LTH=5                                                            
         MFLD  TRPFIRA2,                                               +        
               LTH=15                                                           
         MFLD  IDTRP3,                                                 +        
               LTH=5                                                            
         MFLD  TRPFIR3,                                                +        
               LTH=15                                                           
         MFLD  IDTRPA3,                                                +        
               LTH=5                                                            
         MFLD  TRPFIRA3,                                               +        
               LTH=15                                                           
         MFLD  IDTRP4,                                                 +        
               LTH=5                                                            
         MFLD  TRPFIR4,                                                +        
               LTH=15                                                           
         MFLD  IDTRPA4,                                                +        
               LTH=5                                                            
         MFLD  TRPFIRA4,                                               +        
               LTH=15                                                           
         MFLD  BUDC1,                                                  +        
               LTH=2                                                            
         MFLD  BUFC1,                                                  +        
               LTH=2                                                            
         MFLD  DAYDC1,                                                 +        
               LTH=2                                                            
         MFLD  DAYFC1,                                                 +        
               LTH=2                                                            
         MFLD  VORDC1,                                                 +        
               LTH=2                                                            
         MFLD  VORFC1,                                                 +        
               LTH=2                                                            
         MFLD  BUDC2,                                                  +        
               LTH=2                                                            
         MFLD  BUFC2,                                                  +        
               LTH=2                                                            
         MFLD  DAYDC2,                                                 +        
               LTH=2                                                            
         MFLD  DAYFC2,                                                 +        
               LTH=2                                                            
         MFLD  VORDC2,                                                 +        
               LTH=2                                                            
         MFLD  VORFC2,                                                 +        
               LTH=2                                                            
         MFLD  BUDC3,                                                  +        
               LTH=2                                                            
         MFLD  BUFC3,                                                  +        
               LTH=2                                                            
         MFLD  DAYDC3,                                                 +        
               LTH=2                                                            
         MFLD  DAYFC3,                                                 +        
               LTH=2                                                            
         MFLD  VORDC3,                                                 +        
               LTH=2                                                            
         MFLD  VORFC3,                                                 +        
               LTH=2                                                            
         MFLD  BUDC4,                                                  +        
               LTH=2                                                            
         MFLD  BUFC4,                                                  +        
               LTH=2                                                            
         MFLD  DAYDC4,                                                 +        
               LTH=2                                                            
         MFLD  DAYFC4,                                                 +        
               LTH=2                                                            
         MFLD  VORDC4,                                                 +        
               LTH=2                                                            
         MFLD  VORFC4,                                                 +        
               LTH=2                                                            
         MFLD  BUDC5,                                                  +        
               LTH=2                                                            
         MFLD  BUFC5,                                                  +        
               LTH=2                                                            
         MFLD  DAYDC5,                                                 +        
               LTH=2                                                            
         MFLD  DAYFC5,                                                 +        
               LTH=2                                                            
         MFLD  VORDC5,                                                 +        
               LTH=2                                                            
         MFLD  VORFC5,                                                 +        
               LTH=2                                                            
         MFLD  BUDC6,                                                  +        
               LTH=2                                                            
         MFLD  BUFC6,                                                  +        
               LTH=2                                                            
         MFLD  DAYDC6,                                                 +        
               LTH=2                                                            
         MFLD  DAYFC6,                                                 +        
               LTH=2                                                            
         MFLD  VORDC6,                                                 +        
               LTH=2                                                            
         MFLD  VORFC6,                                                 +        
               LTH=2                                                            
         MFLD  BUDC7,                                                  +        
               LTH=2                                                            
         MFLD  BUFC7,                                                  +        
               LTH=2                                                            
         MFLD  DAYDC7,                                                 +        
               LTH=2                                                            
         MFLD  DAYFC7,                                                 +        
               LTH=2                                                            
         MFLD  VORDC7,                                                 +        
               LTH=2                                                            
         MFLD  VORFC7,                                                 +        
               LTH=2                                                            
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I422N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N422),                                           +        
               OPT=2,                                                  +        
               NXT=W4O422N1                                                     
MID      LPAGE SOR=(W4N422),                                           +        
               NXT=W4O422N1                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '44222',                                                +        
               LTH=5                                                            
         MFLD  (DGIA0000,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0001,                                               +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0002,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0003,                                               +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0004,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0005,                                               +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0006,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0007,                                               +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
