***********************************************************************         
* CREATED BY V030174   ON 04/12/30  AT 10:07                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'DC Leadtime and Freight Cost    '                               
W4N408   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T408U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W4N408   DPAGE CURSOR=((2,5)),                                         +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DC Leadtime and Freight Cost',                         +        
               POS=(1,11),LTH=28,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'DC',                                                   +        
               POS=(2,2),LTH=2,                                        +        
               ATTR=(NUM,PROT)                                                  
IDDCIN   DFLD  POS=(2,5),LTH=2,                                        +        
               ATTR=(NOPROT)                                                    
IDDCUT   DFLD  POS=(3,5),LTH=2,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'Refilling DC',                                         +        
               POS=(2,11),LTH=12,                                      +        
               ATTR=(NUM,PROT)                                                  
IDDCSIN  DFLD  POS=(2,24),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
IDDCSUT  DFLD  POS=(3,24),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'ID:',                                                  +        
               POS=(3,48),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
CHUSER   DFLD  POS=(3,52),LTH=7,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Date changed:',                                        +        
               POS=(3,60),LTH=13,                                      +        
               ATTR=(NUM,PROT)                                                  
CHDATE   DFLD  POS=(3,75),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Air',                                                  +        
               POS=(05,36),LTH=3,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Boat/Truck',                                           +        
               POS=(05,43),LTH=10,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Packtime (workingdays)          ',                     +        
               POS=(06,02),LTH=32,                                     +        
               ATTR=(PROT)                                                      
AIRPAC   DFLD  POS=(06,36),LTH=2,                                      +        
               ATTR=(PROT)                                                      
AIRPACI  DFLD  POS=(06,39),LTH=2,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
BOATPAC  DFLD  POS=(06,43),LTH=2,                                      +        
               ATTR=(PROT)                                                      
BOATPACI DFLD  POS=(06,46),LTH=2,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Transporttime (calenderdays)    ',                     +        
               POS=(07,02),LTH=32,                                     +        
               ATTR=(PROT)                                                      
AIRTRP   DFLD  POS=(07,36),LTH=2,                                      +        
               ATTR=(PROT)                                                      
AIRTRPI  DFLD  POS=(07,39),LTH=2,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
BOATTRP  DFLD  POS=(07,43),LTH=2,                                      +        
               ATTR=(PROT)                                                      
BOATTRPI DFLD  POS=(07,46),LTH=2,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Harbour to DC (workingdays)     ',                     +        
               POS=(08,02),LTH=32,                                     +        
               ATTR=(PROT)                                                      
BOAT2DC  DFLD  POS=(08,43),LTH=2,                                      +        
               ATTR=(PROT)                                                      
BOAT2DCI DFLD  POS=(08,46),LTH=2,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Binningtime (workingdays)       ',                     +        
               POS=(09,02),LTH=32,                                     +        
               ATTR=(PROT)                                                      
AIRINS   DFLD  POS=(09,36),LTH=2,                                      +        
               ATTR=(PROT)                                                      
AIRINSI  DFLD  POS=(09,39),LTH=2,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
BOATINS  DFLD  POS=(09,43),LTH=2,                                      +        
               ATTR=(PROT)                                                      
BOATINSI DFLD  POS=(09,46),LTH=2,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Buffer days (workingdays)       ',                     +        
               POS=(10,02),LTH=32,                                     +        
               ATTR=(PROT)                                                      
BUFFER   DFLD  POS=(10,43),LTH=2,                                      +        
               ATTR=(PROT)                                                      
BUFFERI  DFLD  POS=(10,46),LTH=2,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'On the shelf (if ordered today) ',                     +        
               POS=(11,02),LTH=32,                                     +        
               ATTR=(PROT)                                                      
AIRSHLF  DFLD  POS=(11,36),LTH=6,                                      +        
               ATTR=(PROT)                                                      
BOATSHLF DFLD  POS=(11,43),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Buffer',                                               +        
               POS=(11,51),LTH=6,                                      +        
               ATTR=(PROT)                                                      
BUFFSHLF DFLD  POS=(11,58),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Customs total (workingdays)     ',                     +        
               POS=(13,02),LTH=32,                                     +        
               ATTR=(PROT)                                                      
CUST     DFLD  POS=(13,43),LTH=2,                                      +        
               ATTR=(PROT)                                                      
CUSTI    DFLD  POS=(13,46),LTH=2,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Customs waiting (workingdays)   ',                     +        
               POS=(14,02),LTH=32,                                     +        
               ATTR=(PROT)                                                      
CUSTW    DFLD  POS=(14,43),LTH=2,                                      +        
               ATTR=(PROT)                                                      
CUSTWI   DFLD  POS=(14,46),LTH=2,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Customs to gate (workingdays)   ',                     +        
               POS=(15,02),LTH=32,                                     +        
               ATTR=(PROT)                                                      
CUST2DC  DFLD  POS=(15,43),LTH=2,                                      +        
               ATTR=(PROT)                                                      
CUST2DCI DFLD  POS=(15,46),LTH=2,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Total leadtime (calenderdays)   ',                     +        
               POS=(17,02),LTH=32,                                     +        
               ATTR=(PROT)                                                      
AIRETA   DFLD  POS=(17,36),LTH=2,                                      +        
               ATTR=(PROT)                                                      
AIRETAI  DFLD  POS=(17,39),LTH=2,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
TOT      DFLD  POS=(17,42),LTH=3,                                      +        
               ATTR=(PROT)                                                      
TOTI     DFLD  POS=(17,46),LTH=3,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Batch time',                                           +        
               POS=(17,60),LTH=10,                                     +        
               ATTR=(PROT)                                                      
REFBAT   DFLD  POS=(17,71),LTH=2,                                      +        
               ATTR=(PROT)                                                      
REFBATI  DFLD  POS=(17,75),LTH=2,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Air proposal (calenderdays)     ',                     +        
               POS=(18,02),LTH=32,                                     +        
               ATTR=(PROT)                                                      
AIRREQ   DFLD  POS=(18,36),LTH=2,                                      +        
               ATTR=(PROT)                                                      
AIRREQI  DFLD  POS=(18,39),LTH=2,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'SS factor ',                                           +        
               POS=(18,60),LTH=10,                                     +        
               ATTR=(PROT)                                                      
SSFACO   DFLD  POS=(18,71),LTH=4,                                      +        
               ATTR=(PROT)                                                      
SSFACI   DFLD  POS=(18,76),LTH=4,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Air Freight cost factor',                              +        
               POS=(19,02),LTH=23,                                     +        
               ATTR=(PROT)                                                      
AIRCO    DFLD  POS=(19,31),LTH=7,                                      +        
               ATTR=(PROT)                                                      
AIRCOI   DFLD  POS=(19,39),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Warn AirCost>SEK',                                     +        
               POS=(19,48),LTH=16,                                     +        
               ATTR=(PROT)                                                      
FRAKTO   DFLD  POS=(19,65),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FRAKTI   DFLD  POS=(19,73),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Comments:',                                            +        
               POS=(20,02),LTH=9,                                      +        
               ATTR=(PROT)                                                      
BETEXT   DFLD  POS=(20,12),LTH=55,                                     +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'F10=WHELP  F11=Update  F12=Logoff',                    +        
               POS=(22,2),LTH=33,                                      +        
               ATTR=(PROT)                                                      
TEMSINF  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4O408N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N408,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I408N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W4N408,                                             +        
               NXT=W4I408N1                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDDCIN,                                                 +        
               LTH=2                                                            
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  IDDCSIN,                                                +        
               LTH=2                                                            
         MFLD  IDDCSUT,                                                +        
               LTH=2                                                            
         MFLD  CHUSER,                                                 +        
               LTH=8                                                            
         MFLD  CHDATE,                                                 +        
               LTH=6                                                            
         MFLD  AIRPAC,                                                 +        
               LTH=2                                                            
         MFLD  AIRPACI,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BOATPAC,                                                +        
               LTH=2                                                            
         MFLD  BOATPACI,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AIRTRP,                                                 +        
               LTH=2                                                            
         MFLD  AIRTRPI,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BOATTRP,                                                +        
               LTH=2                                                            
         MFLD  BOATTRPI,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BOAT2DC,                                                +        
               LTH=2                                                            
         MFLD  BOAT2DCI,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AIRINS,                                                 +        
               LTH=2                                                            
         MFLD  AIRINSI,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BOATINS,                                                +        
               LTH=2                                                            
         MFLD  BOATINSI,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BUFFER,                                                 +        
               LTH=2                                                            
         MFLD  BUFFERI,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AIRSHLF,                                                +        
               LTH=6                                                            
         MFLD  BOATSHLF,                                               +        
               LTH=6                                                            
         MFLD  BUFFSHLF,                                               +        
               LTH=6                                                            
         MFLD  CUST,                                                   +        
               LTH=2                                                            
         MFLD  CUSTI,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CUSTW,                                                  +        
               LTH=2                                                            
         MFLD  CUSTWI,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CUST2DC,                                                +        
               LTH=2                                                            
         MFLD  CUST2DCI,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AIRETA,                                                 +        
               LTH=2                                                            
         MFLD  AIRETAI,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TOT,                                                    +        
               LTH=3                                                            
         MFLD  TOTI,                                                   +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  REFBAT,                                                 +        
               LTH=2                                                            
         MFLD  REFBATI,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AIRCO,                                                  +        
               LTH=7                                                            
         MFLD  AIRCOI,                                                 +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AIRREQ,                                                 +        
               LTH=2                                                            
         MFLD  AIRREQI,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SSFACO,                                                 +        
               LTH=4                                                            
         MFLD  SSFACI,                                                 +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FRAKTO,                                                 +        
               LTH=7                                                            
         MFLD  FRAKTI,                                                 +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BETEXT,                                                 +        
               LTH=55                                                           
         MFLD  TEMSINF,                                                +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I408N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N408),                                           +        
               OPT=2,                                                  +        
               NXT=W4O408N1                                                     
MID      LPAGE SOR=(W4N408),                                           +        
               NXT=W4O408N1                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  (FLD0102,                                               +        
               '4'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  (FLD0104,                                               +        
               '4'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  (FLD0106,                                               +        
               '0'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0108,                                               +        
               '8'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F8'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '44082',                                                +        
               LTH=5                                                            
         MFLD  (IDDCIN,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (IDDCSIN,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (AIRPACI,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (BOATPACI,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AIRTRPI,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (BOATTRPI,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (BOAT2DCI,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AIRINSI,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (BOATINSI,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (BUFFERI,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CUSTI,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CUSTWI,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CUST2DCI,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AIRETAI,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TOTI,                                                  +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (REFBATI,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AIRCOI,                                                +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AIRREQI,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (SSFACI,                                                +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FRAKTI,                                                +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (BETEXT,'++++++++++++++++++++++++++++++++++++++++++++++++        
               ++++++++'),                                             +        
               LTH=55,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
