***********************************************************************         
*                                                                               
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'Shipping Document Parameter Maint'                              
W4N456   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W4T456 7',                                           +        
               8='W4T456 8',                                           +        
               9='W4T456 9',                                           +        
               10='WHELP   ',                                          +        
               11='W4T456U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W4N456   DPAGE CURSOR=((2,5)),                                         +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'SHIPPING DOCUMENT',                                    +        
               POS=(1,11),LTH=17,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'DC',                                                   +        
               POS=(2,2),LTH=2,                                        +        
               ATTR=(PROT)                                                      
DCIN     DFLD  POS=(2,5),LTH=2,                                        +        
               ATTR=(NOPROT)                                                    
         DFLD  'Dist',                                                 +        
               POS=(2,9),LTH=4,                                        +        
               ATTR=(NUM,PROT)                                                  
DISTRIN  DFLD  POS=(2,15),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Document',                                             +        
               POS=(2,26),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DOKIN    DFLD  POS=(2,35),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DCUT     DFLD  POS=(3,5),LTH=2,                                        +        
               ATTR=(PROT,MOD)                                                  
DISTRUT  DFLD  POS=(3,15),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DOKUT    DFLD  POS=(3,35),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'CMD',                                                  +        
               POS=(5,2),LTH=3,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'DC Dist Cust',                                         +        
               POS=(5,6),LTH=12,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'A B C D E F G H I J',                                  +        
               POS=(5,22),LTH=19,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'DC Printer   Days User     Date',                      +        
               POS=(5,42),LTH=31,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Ondem',                                                +        
               POS=(5,75),LTH=5,                                       +        
               ATTR=(PROT)                                                      
CMDIN1   DFLD  POS=(6,3),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
DC1      DFLD  POS=(6,6),LTH=2,                                        +        
               ATTR=(PROT)                                                      
DISTR1   DFLD  POS=(6,9),LTH=4,                                        +        
               ATTR=(NUM,PROT)                                                  
KUND1    DFLD  POS=(6,14),LTH=6,                                       +        
               ATTR=(PROT)                                                      
DOCA1    DFLD  POS=(6,22),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DOCB1    DFLD  POS=(6,24),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DOCC1    DFLD  POS=(6,26),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DOCD1    DFLD  POS=(6,28),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DOCE1    DFLD  POS=(6,30),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DOCF1    DFLD  POS=(6,32),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DOCG1    DFLD  POS=(6,34),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DOCH1    DFLD  POS=(6,36),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DOCI1    DFLD  POS=(6,38),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DOCJ1    DFLD  POS=(6,40),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DCREC1   DFLD  POS=(6,42),LTH=2,                                       +        
               ATTR=(PROT)                                                      
PRTLST1  DFLD  POS=(6,45),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DAYS1    DFLD  POS=(6,54),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
USER1    DFLD  POS=(6,59),LTH=8,                                       +        
               ATTR=(PROT)                                                      
UPDAT1   DFLD  POS=(6,68),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
ONDEM1   DFLD  POS=(6,76),LTH=1,                                       +        
               ATTR=(PROT)                                                      
CMDIN2   DFLD  POS=(7,3),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
DC2      DFLD  POS=(7,6),LTH=2,                                        +        
               ATTR=(PROT)                                                      
DISTR2   DFLD  POS=(7,9),LTH=4,                                        +        
               ATTR=(NUM,PROT)                                                  
KUND2    DFLD  POS=(7,14),LTH=6,                                       +        
               ATTR=(PROT)                                                      
DOCA2    DFLD  POS=(7,22),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DOCB2    DFLD  POS=(7,24),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DOCC2    DFLD  POS=(7,26),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DOCD2    DFLD  POS=(7,28),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DOCE2    DFLD  POS=(7,30),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DOCF2    DFLD  POS=(7,32),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DOCG2    DFLD  POS=(7,34),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DOCH2    DFLD  POS=(7,36),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DOCI2    DFLD  POS=(7,38),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DOCJ2    DFLD  POS=(7,40),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DCREC2   DFLD  POS=(7,42),LTH=2,                                       +        
               ATTR=(PROT)                                                      
PRTLST2  DFLD  POS=(7,45),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DAYS2    DFLD  POS=(7,54),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
USER2    DFLD  POS=(7,59),LTH=8,                                       +        
               ATTR=(PROT)                                                      
UPDAT2   DFLD  POS=(7,68),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
ONDEM2   DFLD  POS=(7,76),LTH=1,                                       +        
               ATTR=(PROT)                                                      
CMDIN3   DFLD  POS=(8,3),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
DC3      DFLD  POS=(8,6),LTH=2,                                        +        
               ATTR=(PROT)                                                      
DISTR3   DFLD  POS=(8,9),LTH=4,                                        +        
               ATTR=(NUM,PROT)                                                  
KUND3    DFLD  POS=(8,14),LTH=6,                                       +        
               ATTR=(PROT)                                                      
DOCA3    DFLD  POS=(8,22),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DOCB3    DFLD  POS=(8,24),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DOCC3    DFLD  POS=(8,26),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DOCD3    DFLD  POS=(8,28),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DOCE3    DFLD  POS=(8,30),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DOCF3    DFLD  POS=(8,32),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DOCG3    DFLD  POS=(8,34),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DOCH3    DFLD  POS=(8,36),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DOCI3    DFLD  POS=(8,38),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DOCJ3    DFLD  POS=(8,40),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DCREC3   DFLD  POS=(8,42),LTH=2,                                       +        
               ATTR=(PROT)                                                      
PRTLST3  DFLD  POS=(8,45),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DAYS3    DFLD  POS=(8,54),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
USER3    DFLD  POS=(8,59),LTH=8,                                       +        
               ATTR=(PROT)                                                      
UPDAT3   DFLD  POS=(8,68),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
ONDEM3   DFLD  POS=(8,76),LTH=1,                                       +        
               ATTR=(PROT)                                                      
CMDIN4   DFLD  POS=(9,3),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
DC4      DFLD  POS=(9,6),LTH=2,                                        +        
               ATTR=(PROT)                                                      
DISTR4   DFLD  POS=(9,9),LTH=4,                                        +        
               ATTR=(NUM,PROT)                                                  
KUND4    DFLD  POS=(9,14),LTH=6,                                       +        
               ATTR=(PROT)                                                      
DOCA4    DFLD  POS=(9,22),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DOCB4    DFLD  POS=(9,24),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DOCC4    DFLD  POS=(9,26),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DOCD4    DFLD  POS=(9,28),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DOCE4    DFLD  POS=(9,30),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DOCF4    DFLD  POS=(9,32),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DOCG4    DFLD  POS=(9,34),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DOCH4    DFLD  POS=(9,36),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DOCI4    DFLD  POS=(9,38),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DOCJ4    DFLD  POS=(9,40),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DCREC4   DFLD  POS=(9,42),LTH=2,                                       +        
               ATTR=(PROT)                                                      
PRTLST4  DFLD  POS=(9,45),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DAYS4    DFLD  POS=(9,54),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
USER4    DFLD  POS=(9,59),LTH=8,                                       +        
               ATTR=(PROT)                                                      
UPDAT4   DFLD  POS=(9,68),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
ONDEM4   DFLD  POS=(9,76),LTH=1,                                       +        
               ATTR=(PROT)                                                      
CMDIN5   DFLD  POS=(10,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
DC5      DFLD  POS=(10,6),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DISTR5   DFLD  POS=(10,9),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
KUND5    DFLD  POS=(10,14),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DOCA5    DFLD  POS=(10,22),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DOCB5    DFLD  POS=(10,24),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DOCC5    DFLD  POS=(10,26),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DOCD5    DFLD  POS=(10,28),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DOCE5    DFLD  POS=(10,30),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DOCF5    DFLD  POS=(10,32),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DOCG5    DFLD  POS=(10,34),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DOCH5    DFLD  POS=(10,36),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DOCI5    DFLD  POS=(10,38),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DOCJ5    DFLD  POS=(10,40),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DCREC5   DFLD  POS=(10,42),LTH=2,                                      +        
               ATTR=(PROT)                                                      
PRTLST5  DFLD  POS=(10,45),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DAYS5    DFLD  POS=(10,54),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
USER5    DFLD  POS=(10,59),LTH=8,                                      +        
               ATTR=(PROT)                                                      
UPDAT5   DFLD  POS=(10,68),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
ONDEM5   DFLD  POS=(10,76),LTH=1,                                      +        
               ATTR=(PROT)                                                      
CMDIN6   DFLD  POS=(11,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
DC6      DFLD  POS=(11,6),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DISTR6   DFLD  POS=(11,9),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
KUND6    DFLD  POS=(11,14),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DOCA6    DFLD  POS=(11,22),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DOCB6    DFLD  POS=(11,24),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DOCC6    DFLD  POS=(11,26),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DOCD6    DFLD  POS=(11,28),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DOCE6    DFLD  POS=(11,30),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DOCF6    DFLD  POS=(11,32),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DOCG6    DFLD  POS=(11,34),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DOCH6    DFLD  POS=(11,36),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DOCI6    DFLD  POS=(11,38),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DOCJ6    DFLD  POS=(11,40),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DCREC6   DFLD  POS=(11,42),LTH=2,                                      +        
               ATTR=(PROT)                                                      
PRTLST6  DFLD  POS=(11,45),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DAYS6    DFLD  POS=(11,54),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
USER6    DFLD  POS=(11,59),LTH=8,                                      +        
               ATTR=(PROT)                                                      
UPDAT6   DFLD  POS=(11,68),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
ONDEM6   DFLD  POS=(11,76),LTH=1,                                      +        
               ATTR=(PROT)                                                      
CMDIN7   DFLD  POS=(12,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
DC7      DFLD  POS=(12,6),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DISTR7   DFLD  POS=(12,9),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
KUND7    DFLD  POS=(12,14),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DOCA7    DFLD  POS=(12,22),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DOCB7    DFLD  POS=(12,24),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DOCC7    DFLD  POS=(12,26),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DOCD7    DFLD  POS=(12,28),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DOCE7    DFLD  POS=(12,30),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DOCF7    DFLD  POS=(12,32),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DOCG7    DFLD  POS=(12,34),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DOCH7    DFLD  POS=(12,36),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DOCI7    DFLD  POS=(12,38),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DOCJ7    DFLD  POS=(12,40),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DCREC7   DFLD  POS=(12,42),LTH=2,                                      +        
               ATTR=(PROT)                                                      
PRTLST7  DFLD  POS=(12,45),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DAYS7    DFLD  POS=(12,54),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
USER7    DFLD  POS=(12,59),LTH=8,                                      +        
               ATTR=(PROT)                                                      
UPDAT7   DFLD  POS=(12,68),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
ONDEM7   DFLD  POS=(12,76),LTH=1,                                      +        
               ATTR=(PROT)                                                      
CMDIN8   DFLD  POS=(13,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
DC8      DFLD  POS=(13,6),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DISTR8   DFLD  POS=(13,9),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
KUND8    DFLD  POS=(13,14),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DOCA8    DFLD  POS=(13,22),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DOCB8    DFLD  POS=(13,24),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DOCC8    DFLD  POS=(13,26),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DOCD8    DFLD  POS=(13,28),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DOCE8    DFLD  POS=(13,30),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DOCF8    DFLD  POS=(13,32),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DOCG8    DFLD  POS=(13,34),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DOCH8    DFLD  POS=(13,36),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DOCI8    DFLD  POS=(13,38),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DOCJ8    DFLD  POS=(13,40),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DCREC8   DFLD  POS=(13,42),LTH=2,                                      +        
               ATTR=(PROT)                                                      
PRTLST8  DFLD  POS=(13,45),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DAYS8    DFLD  POS=(13,54),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
USER8    DFLD  POS=(13,59),LTH=8,                                      +        
               ATTR=(PROT)                                                      
UPDAT8   DFLD  POS=(13,68),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
ONDEM8   DFLD  POS=(13,76),LTH=1,                                      +        
               ATTR=(PROT)                                                      
CMDIN9   DFLD  POS=(14,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
DC9      DFLD  POS=(14,6),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DISTR9   DFLD  POS=(14,9),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
KUND9    DFLD  POS=(14,14),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DOCA9    DFLD  POS=(14,22),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DOCB9    DFLD  POS=(14,24),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DOCC9    DFLD  POS=(14,26),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DOCD9    DFLD  POS=(14,28),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DOCE9    DFLD  POS=(14,30),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DOCF9    DFLD  POS=(14,32),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DOCG9    DFLD  POS=(14,34),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DOCH9    DFLD  POS=(14,36),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DOCI9    DFLD  POS=(14,38),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DOCJ9    DFLD  POS=(14,40),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DCREC9   DFLD  POS=(14,42),LTH=2,                                      +        
               ATTR=(PROT)                                                      
PRTLST9  DFLD  POS=(14,45),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DAYS9    DFLD  POS=(14,54),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
USER9    DFLD  POS=(14,59),LTH=8,                                      +        
               ATTR=(PROT)                                                      
UPDAT9   DFLD  POS=(14,68),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
ONDEM9   DFLD  POS=(14,76),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'DC Dist Cust',                                         +        
               POS=(16,6),LTH=12,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'A B C D E F G H I J',                                  +        
               POS=(16,22),LTH=19,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'DC Printer   Days',                                    +        
               POS=(16,42),LTH=17,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Ondem',POS=(16,75),LTH=5,                              +        
               ATTR=(PROT)                                                      
         DFLD  'NEW',POS=(17,2),LTH=3,                                 +        
               ATTR=(PROT)                                                      
DC15     DFLD  POS=(17,6),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
DISTR15  DFLD  POS=(17,9),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
KUND15   DFLD  POS=(17,14),LTH=6,                                      +        
               ATTR=(NOPROT)                                                    
DOCA15   DFLD  POS=(17,22),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
DOCB15   DFLD  POS=(17,24),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
DOCC15   DFLD  POS=(17,26),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
DOCD15   DFLD  POS=(17,28),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
DOCE15   DFLD  POS=(17,30),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
DOCF15   DFLD  POS=(17,32),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
DOCG15   DFLD  POS=(17,34),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
DOCH15   DFLD  POS=(17,36),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
DOCI15   DFLD  POS=(17,38),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
DOCJ15   DFLD  POS=(17,40),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
DCREC15  DFLD  POS=(17,42),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
PRTLST15 DFLD  POS=(17,45),LTH=8,                                      +        
               ATTR=(NOPROT)                                                    
DAYS15   DFLD  POS=(17,54),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
ONDEM15  DFLD  POS=(17,76),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Documents  A=Cargo spec.   B=Cargo Value spec.',       +        
               POS=(19,2),LTH=46,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'C=Custom Info.  D=Booking doc.',                       +        
               POS=(19,49),LTH=30,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '           E=Packing spec. F=Goods rec. list',         +        
               POS=(20,2),LTH=46,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'G=Ball & roller H=Amer.proforma',                      +        
               POS=(20,49),LTH=32,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'I= Div.        J=Loading report',                      +        
               POS=(21,49),LTH=32,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'F7=First  F8=Next  F10=WHELP  F11=Update',             +        
               POS=(22,2),LTH=45,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,MOD)                                                  
         FMTEND                                                                 
W4I456N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N456),                                           +        
               OPT=2,                                                  +        
               NXT=W4O456N1                                                     
MID      LPAGE SOR=(W4N456)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  (IDTRANS1,                                              +        
               '4'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  (IDTRANS2,                                              +        
               '4'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  (IDTRANS3,                                              +        
               '5'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  (IDTRANS4,                                              +        
               '6'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '44562',                                                +        
               LTH=5                                                            
         MFLD  (DCIN,                                                  +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DCUT,                                                  +        
               '  '),                                                  +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (DISTRIN,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DISTRUT,                                               +        
               '    '),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DOKIN,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (DOKUT,                                                 +        
               ' '),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (CMDIN1,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMDIN2,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMDIN3,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMDIN4,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMDIN5,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMDIN6,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMDIN7,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMDIN8,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMDIN9,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DC15,                                                  +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DISTR15,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KUND15,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DOCA15,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DOCB15,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DOCC15,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DOCD15,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DOCE15,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DOCF15,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DOCG15,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DOCH15,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DOCI15,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DOCJ15,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DCREC15,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (PRTLST15,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DAYS15,                                                +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (ONDEM15,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
W4O456N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N456,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I456N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W4N456                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  DCIN,                                                   +        
               LTH=2                                                            
         MFLD  DCUT,                                                   +        
               LTH=2                                                            
         MFLD  DISTRIN,                                                +        
               LTH=4                                                            
         MFLD  DISTRUT,                                                +        
               LTH=4                                                            
         MFLD  DOKIN,                                                  +        
               LTH=1                                                            
         MFLD  DOKUT,                                                  +        
               LTH=1                                                            
         MFLD  CMDIN1,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DC1,                                                    +        
               LTH=2                                                            
         MFLD  DISTR1,                                                 +        
               LTH=4                                                            
         MFLD  KUND1,                                                  +        
               LTH=6                                                            
         MFLD  DOCA1,                                                  +        
               LTH=1                                                            
         MFLD  DOCB1,                                                  +        
               LTH=1                                                            
         MFLD  DOCC1,                                                  +        
               LTH=1                                                            
         MFLD  DOCD1,                                                  +        
               LTH=1                                                            
         MFLD  DOCE1,                                                  +        
               LTH=1                                                            
         MFLD  DOCF1,                                                  +        
               LTH=1                                                            
         MFLD  DOCG1,                                                  +        
               LTH=1                                                            
         MFLD  DOCH1,                                                  +        
               LTH=1                                                            
         MFLD  DOCI1,                                                  +        
               LTH=1                                                            
         MFLD  DOCJ1,                                                  +        
               LTH=1                                                            
         MFLD  DCREC1,                                                 +        
               LTH=2                                                            
         MFLD  PRTLST1,                                                +        
               LTH=8                                                            
         MFLD  DAYS1,                                                  +        
               LTH=3                                                            
         MFLD  USER1,                                                  +        
               LTH=8                                                            
         MFLD  UPDAT1,                                                 +        
               LTH=6                                                            
         MFLD  ONDEM1,                                                 +        
               LTH=1                                                            
         MFLD  CMDIN2,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DC2,                                                    +        
               LTH=2                                                            
         MFLD  DISTR2,                                                 +        
               LTH=4                                                            
         MFLD  KUND2,                                                  +        
               LTH=6                                                            
         MFLD  DOCA2,                                                  +        
               LTH=1                                                            
         MFLD  DOCB2,                                                  +        
               LTH=1                                                            
         MFLD  DOCC2,                                                  +        
               LTH=1                                                            
         MFLD  DOCD2,                                                  +        
               LTH=1                                                            
         MFLD  DOCE2,                                                  +        
               LTH=1                                                            
         MFLD  DOCF2,                                                  +        
               LTH=1                                                            
         MFLD  DOCG2,                                                  +        
               LTH=1                                                            
         MFLD  DOCH2,                                                  +        
               LTH=1                                                            
         MFLD  DOCI2,                                                  +        
               LTH=1                                                            
         MFLD  DOCJ2,                                                  +        
               LTH=1                                                            
         MFLD  DCREC2,                                                 +        
               LTH=2                                                            
         MFLD  PRTLST2,                                                +        
               LTH=8                                                            
         MFLD  DAYS2,                                                  +        
               LTH=3                                                            
         MFLD  USER2,                                                  +        
               LTH=8                                                            
         MFLD  UPDAT2,                                                 +        
               LTH=6                                                            
         MFLD  ONDEM2,                                                 +        
               LTH=1                                                            
         MFLD  CMDIN3,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DC3,                                                    +        
               LTH=2                                                            
         MFLD  DISTR3,                                                 +        
               LTH=4                                                            
         MFLD  KUND3,                                                  +        
               LTH=6                                                            
         MFLD  DOCA3,                                                  +        
               LTH=1                                                            
         MFLD  DOCB3,                                                  +        
               LTH=1                                                            
         MFLD  DOCC3,                                                  +        
               LTH=1                                                            
         MFLD  DOCD3,                                                  +        
               LTH=1                                                            
         MFLD  DOCE3,                                                  +        
               LTH=1                                                            
         MFLD  DOCF3,                                                  +        
               LTH=1                                                            
         MFLD  DOCG3,                                                  +        
               LTH=1                                                            
         MFLD  DOCH3,                                                  +        
               LTH=1                                                            
         MFLD  DOCI3,                                                  +        
               LTH=1                                                            
         MFLD  DOCJ3,                                                  +        
               LTH=1                                                            
         MFLD  DCREC3,                                                 +        
               LTH=2                                                            
         MFLD  PRTLST3,                                                +        
               LTH=8                                                            
         MFLD  DAYS3,                                                  +        
               LTH=3                                                            
         MFLD  USER3,                                                  +        
               LTH=8                                                            
         MFLD  UPDAT3,                                                 +        
               LTH=6                                                            
         MFLD  ONDEM3,                                                 +        
               LTH=1                                                            
         MFLD  CMDIN4,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DC4,                                                    +        
               LTH=2                                                            
         MFLD  DISTR4,                                                 +        
               LTH=4                                                            
         MFLD  KUND4,                                                  +        
               LTH=6                                                            
         MFLD  DOCA4,                                                  +        
               LTH=1                                                            
         MFLD  DOCB4,                                                  +        
               LTH=1                                                            
         MFLD  DOCC4,                                                  +        
               LTH=1                                                            
         MFLD  DOCD4,                                                  +        
               LTH=1                                                            
         MFLD  DOCE4,                                                  +        
               LTH=1                                                            
         MFLD  DOCF4,                                                  +        
               LTH=1                                                            
         MFLD  DOCG4,                                                  +        
               LTH=1                                                            
         MFLD  DOCH4,                                                  +        
               LTH=1                                                            
         MFLD  DOCI4,                                                  +        
               LTH=1                                                            
         MFLD  DOCJ4,                                                  +        
               LTH=1                                                            
         MFLD  DCREC4,                                                 +        
               LTH=2                                                            
         MFLD  PRTLST4,                                                +        
               LTH=8                                                            
         MFLD  DAYS4,                                                  +        
               LTH=3                                                            
         MFLD  USER4,                                                  +        
               LTH=8                                                            
         MFLD  UPDAT4,                                                 +        
               LTH=6                                                            
         MFLD  ONDEM4,                                                 +        
               LTH=1                                                            
         MFLD  CMDIN5,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DC5,                                                    +        
               LTH=2                                                            
         MFLD  DISTR5,                                                 +        
               LTH=4                                                            
         MFLD  KUND5,                                                  +        
               LTH=6                                                            
         MFLD  DOCA5,                                                  +        
               LTH=1                                                            
         MFLD  DOCB5,                                                  +        
               LTH=1                                                            
         MFLD  DOCC5,                                                  +        
               LTH=1                                                            
         MFLD  DOCD5,                                                  +        
               LTH=1                                                            
         MFLD  DOCE5,                                                  +        
               LTH=1                                                            
         MFLD  DOCF5,                                                  +        
               LTH=1                                                            
         MFLD  DOCG5,                                                  +        
               LTH=1                                                            
         MFLD  DOCH5,                                                  +        
               LTH=1                                                            
         MFLD  DOCI5,                                                  +        
               LTH=1                                                            
         MFLD  DOCJ5,                                                  +        
               LTH=1                                                            
         MFLD  DCREC5,                                                 +        
               LTH=2                                                            
         MFLD  PRTLST5,                                                +        
               LTH=8                                                            
         MFLD  DAYS5,                                                  +        
               LTH=3                                                            
         MFLD  USER5,                                                  +        
               LTH=8                                                            
         MFLD  UPDAT5,                                                 +        
               LTH=6                                                            
         MFLD  ONDEM5,                                                 +        
               LTH=1                                                            
         MFLD  CMDIN6,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DC6,                                                    +        
               LTH=2                                                            
         MFLD  DISTR6,                                                 +        
               LTH=4                                                            
         MFLD  KUND6,                                                  +        
               LTH=6                                                            
         MFLD  DOCA6,                                                  +        
               LTH=1                                                            
         MFLD  DOCB6,                                                  +        
               LTH=1                                                            
         MFLD  DOCC6,                                                  +        
               LTH=1                                                            
         MFLD  DOCD6,                                                  +        
               LTH=1                                                            
         MFLD  DOCE6,                                                  +        
               LTH=1                                                            
         MFLD  DOCF6,                                                  +        
               LTH=1                                                            
         MFLD  DOCG6,                                                  +        
               LTH=1                                                            
         MFLD  DOCH6,                                                  +        
               LTH=1                                                            
         MFLD  DOCI6,                                                  +        
               LTH=1                                                            
         MFLD  DOCJ6,                                                  +        
               LTH=1                                                            
         MFLD  DCREC6,                                                 +        
               LTH=2                                                            
         MFLD  PRTLST6,                                                +        
               LTH=8                                                            
         MFLD  DAYS6,                                                  +        
               LTH=3                                                            
         MFLD  USER6,                                                  +        
               LTH=8                                                            
         MFLD  UPDAT6,                                                 +        
               LTH=6                                                            
         MFLD  ONDEM6,                                                 +        
               LTH=1                                                            
         MFLD  CMDIN7,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DC7,                                                    +        
               LTH=2                                                            
         MFLD  DISTR7,                                                 +        
               LTH=4                                                            
         MFLD  KUND7,                                                  +        
               LTH=6                                                            
         MFLD  DOCA7,                                                  +        
               LTH=1                                                            
         MFLD  DOCB7,                                                  +        
               LTH=1                                                            
         MFLD  DOCC7,                                                  +        
               LTH=1                                                            
         MFLD  DOCD7,                                                  +        
               LTH=1                                                            
         MFLD  DOCE7,                                                  +        
               LTH=1                                                            
         MFLD  DOCF7,                                                  +        
               LTH=1                                                            
         MFLD  DOCG7,                                                  +        
               LTH=1                                                            
         MFLD  DOCH7,                                                  +        
               LTH=1                                                            
         MFLD  DOCI7,                                                  +        
               LTH=1                                                            
         MFLD  DOCJ7,                                                  +        
               LTH=1                                                            
         MFLD  DCREC7,                                                 +        
               LTH=2                                                            
         MFLD  PRTLST7,                                                +        
               LTH=8                                                            
         MFLD  DAYS7,                                                  +        
               LTH=3                                                            
         MFLD  USER7,                                                  +        
               LTH=8                                                            
         MFLD  UPDAT7,                                                 +        
               LTH=6                                                            
         MFLD  ONDEM7,                                                 +        
               LTH=1                                                            
         MFLD  CMDIN8,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DC8,                                                    +        
               LTH=2                                                            
         MFLD  DISTR8,                                                 +        
               LTH=4                                                            
         MFLD  KUND8,                                                  +        
               LTH=6                                                            
         MFLD  DOCA8,                                                  +        
               LTH=1                                                            
         MFLD  DOCB8,                                                  +        
               LTH=1                                                            
         MFLD  DOCC8,                                                  +        
               LTH=1                                                            
         MFLD  DOCD8,                                                  +        
               LTH=1                                                            
         MFLD  DOCE8,                                                  +        
               LTH=1                                                            
         MFLD  DOCF8,                                                  +        
               LTH=1                                                            
         MFLD  DOCG8,                                                  +        
               LTH=1                                                            
         MFLD  DOCH8,                                                  +        
               LTH=1                                                            
         MFLD  DOCI8,                                                  +        
               LTH=1                                                            
         MFLD  DOCJ8,                                                  +        
               LTH=1                                                            
         MFLD  DCREC8,                                                 +        
               LTH=2                                                            
         MFLD  PRTLST8,                                                +        
               LTH=8                                                            
         MFLD  DAYS8,                                                  +        
               LTH=3                                                            
         MFLD  USER8,                                                  +        
               LTH=8                                                            
         MFLD  UPDAT8,                                                 +        
               LTH=6                                                            
         MFLD  ONDEM8,                                                 +        
               LTH=1                                                            
         MFLD  CMDIN9,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DC9,                                                    +        
               LTH=2                                                            
         MFLD  DISTR9,                                                 +        
               LTH=4                                                            
         MFLD  KUND9,                                                  +        
               LTH=6                                                            
         MFLD  DOCA9,                                                  +        
               LTH=1                                                            
         MFLD  DOCB9,                                                  +        
               LTH=1                                                            
         MFLD  DOCC9,                                                  +        
               LTH=1                                                            
         MFLD  DOCD9,                                                  +        
               LTH=1                                                            
         MFLD  DOCE9,                                                  +        
               LTH=1                                                            
         MFLD  DOCF9,                                                  +        
               LTH=1                                                            
         MFLD  DOCG9,                                                  +        
               LTH=1                                                            
         MFLD  DOCH9,                                                  +        
               LTH=1                                                            
         MFLD  DOCI9,                                                  +        
               LTH=1                                                            
         MFLD  DOCJ9,                                                  +        
               LTH=1                                                            
         MFLD  DCREC9,                                                 +        
               LTH=2                                                            
         MFLD  PRTLST9,                                                +        
               LTH=8                                                            
         MFLD  DAYS9,                                                  +        
               LTH=3                                                            
         MFLD  USER9,                                                  +        
               LTH=8                                                            
         MFLD  UPDAT9,                                                 +        
               LTH=6                                                            
         MFLD  ONDEM9,                                                 +        
               LTH=1                                                            
         MFLD  DC15,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DISTR15,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KUND15,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DOCA15,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DOCB15,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DOCC15,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DOCD15,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DOCE15,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DOCF15,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DOCG15,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DOCH15,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DOCI15,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DOCJ15,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DCREC15,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRTLST15,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DAYS15,                                                 +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ONDEM15,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
