***********************************************************************         
* CREATED BY PCCS433   ON 29/06/23  AT 13:42                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'REFILL AND TRANSFER RELEASE DAYS'                               
W4N401   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T401U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W4N401   DPAGE CURSOR=((2,5)),                                         +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Refill/transfer ord-rel. days',                        +        
               POS=(1,11),LTH=29,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'DC',                                                   +        
               POS=(2,2),LTH=2,                                        +        
               ATTR=(NUM,PROT)                                                  
RECDCIN  DFLD  POS=(2,5),LTH=2,                                        +        
               ATTR=(NUM,NOPROT)                                                
RECDCUT  DFLD  POS=(3,5),LTH=2,                                        +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Refilling DC',                                         +        
               POS=(2,11),LTH=12,                                      +        
               ATTR=(PROT)                                                      
REFDCIN  DFLD  POS=(2,24),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
REFDCUT  DFLD  POS=(3,24),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'M     T     W     T     F     S     S',                +        
               POS=(06,26),LTH=37,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '          Day  (Y/N):',                                +        
               POS=(07,02),LTH=21,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '          Bulk (Y/N):',                                +        
               POS=(08,02),LTH=21,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Dangerous Goods Bulk:',                                +        
               POS=(10,02),LTH=21,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '  (Y/(E)ven/(O)dd/N)',                                 +        
               POS=(11,02),LTH=20,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Dang. Goods Freight Code:',                            +        
               POS=(13,02),LTH=25,                                     +        
               ATTR=(PROT)                                                      
DWKDY1   DFLD  POS=(07,26),LTH=1,ATTR=(PROT)                                    
BWKDY1   DFLD  POS=(08,26),LTH=1,ATTR=(PROT)                                    
DGWKDY1  DFLD  POS=(11,26),LTH=1,ATTR=(PROT)                                    
DWKDY2   DFLD  POS=(07,32),LTH=1,ATTR=(NOPROT)                                  
BWKDY2   DFLD  POS=(08,32),LTH=1,ATTR=(NOPROT)                                  
DGWKDY2  DFLD  POS=(11,32),LTH=1,ATTR=(NOPROT)                                  
DWKDY3   DFLD  POS=(07,38),LTH=1,ATTR=(NOPROT)                                  
BWKDY3   DFLD  POS=(08,38),LTH=1,ATTR=(NOPROT)                                  
DGWKDY3  DFLD  POS=(11,38),LTH=1,ATTR=(NOPROT)                                  
DWKDY4   DFLD  POS=(07,44),LTH=1,ATTR=(NOPROT)                                  
BWKDY4   DFLD  POS=(08,44),LTH=1,ATTR=(NOPROT)                                  
DGWKDY4  DFLD  POS=(11,44),LTH=1,ATTR=(NOPROT)                                  
DWKDY5   DFLD  POS=(07,50),LTH=1,ATTR=(NOPROT)                                  
BWKDY5   DFLD  POS=(08,50),LTH=1,ATTR=(NOPROT)                                  
DGWKDY5  DFLD  POS=(11,50),LTH=1,ATTR=(NOPROT)                                  
DWKDY6   DFLD  POS=(07,56),LTH=1,ATTR=(PROT)                                    
BWKDY6   DFLD  POS=(08,56),LTH=1,ATTR=(PROT)                                    
DGWKDY6  DFLD  POS=(11,56),LTH=1,ATTR=(PROT)                                    
DWKDY7   DFLD  POS=(07,62),LTH=1,ATTR=(NOPROT)                                  
BWKDY7   DFLD  POS=(08,62),LTH=1,ATTR=(NOPROT)                                  
DGWKDY7  DFLD  POS=(11,62),LTH=1,ATTR=(NOPROT)                                  
FLFRAKDG DFLD  POS=(13,28),LTH=1,ATTR=(NOPROT)                                  
         DFLD  'F10=WHELP  F11=Update  F12=Logoff',                    +        
               POS=(22,2),LTH=33,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4O401N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N401,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I401N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W4N401,                                             +        
               NXT=W4I401N1                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  RECDCIN,                                                +        
               LTH=2                                                            
         MFLD  RECDCUT,                                                +        
               LTH=2                                                            
         MFLD  REFDCIN,                                                +        
               LTH=2                                                            
         MFLD  REFDCUT,                                                +        
               LTH=2                                                            
         MFLD  DWKDY1,LTH=3,ATTR=(YES)                                          
         MFLD  BWKDY1,LTH=3,ATTR=(YES)                                          
         MFLD  DGWKDY1,LTH=3,ATTR=(YES)                                         
         MFLD  DWKDY2,LTH=3,ATTR=(YES)                                          
         MFLD  BWKDY2,LTH=3,ATTR=(YES)                                          
         MFLD  DGWKDY2,LTH=3,ATTR=(YES)                                         
         MFLD  DWKDY3,LTH=3,ATTR=(YES)                                          
         MFLD  BWKDY3,LTH=3,ATTR=(YES)                                          
         MFLD  DGWKDY3,LTH=3,ATTR=(YES)                                         
         MFLD  DWKDY4,LTH=3,ATTR=(YES)                                          
         MFLD  BWKDY4,LTH=3,ATTR=(YES)                                          
         MFLD  DGWKDY4,LTH=3,ATTR=(YES)                                         
         MFLD  DWKDY5,LTH=3,ATTR=(YES)                                          
         MFLD  BWKDY5,LTH=3,ATTR=(YES)                                          
         MFLD  DGWKDY5,LTH=3,ATTR=(YES)                                         
         MFLD  DWKDY6,LTH=3,ATTR=(YES)                                          
         MFLD  BWKDY6,LTH=3,ATTR=(YES)                                          
         MFLD  DGWKDY6,LTH=3,ATTR=(YES)                                         
         MFLD  DWKDY7,LTH=3,ATTR=(YES)                                          
         MFLD  BWKDY7,LTH=3,ATTR=(YES)                                          
         MFLD  DGWKDY7,LTH=3,ATTR=(YES)                                         
         MFLD  FLFRAKDG,LTH=3,ATTR=(YES)                                        
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I401N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N401),                                           +        
               OPT=2,                                                  +        
               NXT=W4O401N1                                                     
MID      LPAGE SOR=(W4N401),                                           +        
               NXT=W4O401N1                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '44012',                                                +        
               LTH=5                                                            
         MFLD  (RECDCIN,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (REFDCIN,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DWKDY1,'+'),LTH=1,FILL=X'40'                                    
         MFLD  (BWKDY1,'+'),LTH=1,FILL=X'40'                                    
         MFLD  (DGWKDY1,'+'),LTH=1,FILL=X'40'                                   
         MFLD  (DWKDY2,'+'),LTH=1,FILL=X'40'                                    
         MFLD  (BWKDY2,'+'),LTH=1,FILL=X'40'                                    
         MFLD  (DGWKDY2,'+'),LTH=1,FILL=X'40'                                   
         MFLD  (DWKDY3,'+'),LTH=1,FILL=X'40'                                    
         MFLD  (BWKDY3,'+'),LTH=1,FILL=X'40'                                    
         MFLD  (DGWKDY3,'+'),LTH=1,FILL=X'40'                                   
         MFLD  (DWKDY4,'+'),LTH=1,FILL=X'40'                                    
         MFLD  (BWKDY4,'+'),LTH=1,FILL=X'40'                                    
         MFLD  (DGWKDY4,'+'),LTH=1,FILL=X'40'                                   
         MFLD  (DWKDY5,'+'),LTH=1,FILL=X'40'                                    
         MFLD  (BWKDY5,'+'),LTH=1,FILL=X'40'                                    
         MFLD  (DGWKDY5,'+'),LTH=1,FILL=X'40'                                   
         MFLD  (DWKDY6,'+'),LTH=1,FILL=X'40'                                    
         MFLD  (BWKDY6,'+'),LTH=1,FILL=X'40'                                    
         MFLD  (DGWKDY6,'+'),LTH=1,FILL=X'40'                                   
         MFLD  (DWKDY7,'+'),LTH=1,FILL=X'40'                                    
         MFLD  (BWKDY7,'+'),LTH=1,FILL=X'40'                                    
         MFLD  (DGWKDY7,'+'),LTH=1,FILL=X'40'                                   
         MFLD  (FLFRAKDG,'+'),LTH=1,FILL=X'40'                                  
         MSGEND                                                                 
         END                                                                    
