***********************************************************************         
* CREATED BY V030174   ON 04/12/30  AT 10:07                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'DC INFORMATION 3                '                               
W4N404   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T404U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W4N404   DPAGE CURSOR=((2,5)),                                         +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DC INFORMATION 3',                                     +        
               POS=(1,11),LTH=19,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'DC',                                                   +        
               POS=(2,2),LTH=2,                                        +        
               ATTR=(NUM,PROT)                                                  
IDDCIN   DFLD  POS=(2,5),LTH=2,                                        +        
               ATTR=(NOPROT)                                                    
IDDCUT   DFLD  POS=(3,5),LTH=2,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'Refilling DC',                                         +        
               POS=(2,11),LTH=12,                                      +        
               ATTR=(NUM,PROT)                                                  
IDDCSIN  DFLD  POS=(2,24),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
IDDCSUT  DFLD  POS=(3,24),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '      ',                                               +        
               POS=(02,42),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TABORT   DFLD  POS=(02,49),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  'Freight-bp',                                           +        
               POS=(05,42),LTH=10,                                     +        
               ATTR=(PROT)                                                      
FRAKTB   DFLD  POS=(05,53),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FRAKTBI  DFLD  POS=(05,56),LTH=2,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'bpf',                                                  +        
               POS=(05,62),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FRAKTBS  DFLD  POS=(05,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FRAKTBSI DFLD  POS=(05,69),LTH=2,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Districts:',                                           +        
               POS=(05,2),LTH=10,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Ref  ',                                                +        
               POS=(06,02),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DISREF   DFLD  POS=(06,10),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DISREFI  DFLD  POS=(06,15),LTH=4,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Ret  ',                                                +        
               POS=(07,02),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DISRET   DFLD  POS=(07,10),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DISRETI  DFLD  POS=(07,15),LTH=4,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Ret-q',                                                +        
               POS=(08,02),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DISRETQ  DFLD  POS=(08,10),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DISRETQI DFLD  POS=(08,15),LTH=4,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Scr',                                                  +        
               POS=(09,02),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DISSKR   DFLD  POS=(09,10),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DISSKRI  DFLD  POS=(09,15),LTH=4,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Scr-q',                                                +        
               POS=(10,02),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DISSKRQ  DFLD  POS=(10,10),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DISSKRQI DFLD  POS=(10,15),LTH=4,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Scr-r',                                                +        
               POS=(11,02),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DISSKRR  DFLD  POS=(11,10),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DISSKRRI DFLD  POS=(11,15),LTH=4,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DISMIX   DFLD  POS=(12,10),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DISMIXI  DFLD  POS=(12,15),LTH=4,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DISPADJ  DFLD  POS=(13,10),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DISPADJI DFLD  POS=(13,15),LTH=4,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Customers:',                                           +        
               POS=(05,20),LTH=10,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Ord-f',                                                +        
               POS=(06,20),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KNDORDF  DFLD  POS=(06,28),LTH=6,                                      +        
               ATTR=(PROT)                                                      
KNDORDFI DFLD  POS=(06,35),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Ret  ',                                                +        
               POS=(07,20),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KNDRET   DFLD  POS=(07,28),LTH=6,                                      +        
               ATTR=(PROT)                                                      
KNDRETI  DFLD  POS=(07,35),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Ret-q',                                                +        
               POS=(08,20),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KNDRETQ  DFLD  POS=(08,28),LTH=6,                                      +        
               ATTR=(PROT)                                                      
KNDRETQI DFLD  POS=(08,35),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Scr',                                                  +        
               POS=(09,20),LTH=3,                                      +        
               ATTR=(PROT)                                                      
KNDSKR   DFLD  POS=(09,28),LTH=6,                                      +        
               ATTR=(PROT)                                                      
KNDSKRI  DFLD  POS=(09,35),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Scr-q',                                                +        
               POS=(10,20),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KNDSKRQ  DFLD  POS=(10,28),LTH=6,                                      +        
               ATTR=(PROT)                                                      
KNDSKRQI DFLD  POS=(10,35),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Scr-r',                                                +        
               POS=(11,20),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KNDSKRR  DFLD  POS=(11,28),LTH=6,                                      +        
               ATTR=(PROT)                                                      
KNDSKRRI DFLD  POS=(11,35),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'M Stock',                                              +        
               POS=(12,20),LTH=7,                                      +        
               ATTR=(PROT)                                                      
KNDMIX   DFLD  POS=(12,28),LTH=6,                                      +        
               ATTR=(PROT)                                                      
KNDMIXI  DFLD  POS=(12,35),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'P Adj',                                                +        
               POS=(13,20),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KNDPADJ  DFLD  POS=(13,28),LTH=6,                                      +        
               ATTR=(PROT)                                                      
KNDPADJI DFLD  POS=(13,35),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Byp  ',                                                +        
               POS=(06,42),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KNDBYP   DFLD  POS=(06,48),LTH=6,                                      +        
               ATTR=(PROT)                                                      
KNDBYPI  DFLD  POS=(06,55),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Ret-t',                                                +        
               POS=(07,42),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KNDRETT  DFLD  POS=(07,48),LTH=6,                                      +        
               ATTR=(PROT)                                                      
KNDRETTI DFLD  POS=(07,55),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Re-qf',                                                +        
               POS=(08,42),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KNDREQF  DFLD  POS=(08,48),LTH=6,                                      +        
               ATTR=(PROT)                                                      
KNDREQFI DFLD  POS=(08,55),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Byp-f',                                                +        
               POS=(06,62),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KNDBYPF  DFLD  POS=(06,68),LTH=6,                                      +        
               ATTR=(PROT)                                                      
KNDBYPFI DFLD  POS=(06,75),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Ret-f',                                                +        
               POS=(07,62),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KNDRETF  DFLD  POS=(07,68),LTH=6,                                      +        
               ATTR=(PROT)                                                      
KNDRETFI DFLD  POS=(07,75),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'M Stock',                                              +        
               POS=(12,02),LTH=7,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'P Adj',                                                +        
               POS=(13,02),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Ref. Resp. ID',                                        +        
               POS=(13,42),LTH=13,                                     +        
               ATTR=(PROT)                                                      
IDPERS   DFLD  POS=(13,56),LTH=3,                                      +        
               ATTR=(PROT)                                                      
IDPERSI  DFLD  POS=(13,60),LTH=3,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Type',                                                 +        
               POS=(14,02),LTH=4,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Cost Center',                                          +        
               POS=(14,12),LTH=11,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Account No.',                                          +        
               POS=(14,25),LTH=11,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Analysis No.',                                         +        
               POS=(14,48),LTH=12,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'AT',                                                   +        
               POS=(14,75),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'P Adjust',                                             +        
               POS=(19,02),LTH=8,                                      +        
               ATTR=(PROT)                                                      
KSTADJ   DFLD  POS=(19,12),LTH=10,                                     +        
               ATTR=(PROT)                                                      
KSTADJI  DFLD  POS=(20,12),LTH=10,                                     +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDKTOA   DFLD  POS=(19,25),LTH=10,                                     +        
               ATTR=(PROT)                                                      
IDKTOAI  DFLD  POS=(20,25),LTH=10,                                     +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDANALA  DFLD  POS=(19,48),LTH=12,                                     +        
               ATTR=(PROT)                                                      
IDANALAI DFLD  POS=(20,48),LTH=12,                                     +        
               ATTR=(NUM,NOPROT,MOD)                                            
KDRTADJ  DFLD  POS=(19,75),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KDRTADJI DFLD  POS=(20,75),LTH=2,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Scrap',                                                +        
               POS=(15,02),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KSTSKR   DFLD  POS=(15,12),LTH=10,                                     +        
               ATTR=(PROT)                                                      
KSTSKRI  DFLD  POS=(16,12),LTH=10,                                     +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDKTSKR  DFLD  POS=(15,25),LTH=10,                                     +        
               ATTR=(PROT)                                                      
IDKTSKRI DFLD  POS=(16,25),LTH=10,                                     +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDANALS  DFLD  POS=(15,48),LTH=12,                                     +        
               ATTR=(PROT)                                                      
IDANALSI DFLD  POS=(16,48),LTH=12,                                     +        
               ATTR=(NUM,NOPROT,MOD)                                            
KDRTSCR  DFLD  POS=(15,75),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KDRTSCRI DFLD  POS=(16,75),LTH=2,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Mix Stock',                                            +        
               POS=(17,02),LTH=9,                                      +        
               ATTR=(PROT)                                                      
KSTM     DFLD  POS=(17,12),LTH=10,                                     +        
               ATTR=(PROT)                                                      
KSTMI    DFLD  POS=(18,12),LTH=10,                                     +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDKTOM   DFLD  POS=(17,25),LTH=10,                                     +        
               ATTR=(PROT)                                                      
IDKTOMI  DFLD  POS=(18,25),LTH=10,                                     +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDANALM  DFLD  POS=(17,48),LTH=12,                                     +        
               ATTR=(PROT)                                                      
IDANALMI DFLD  POS=(18,48),LTH=12,                                     +        
               ATTR=(NUM,NOPROT,MOD)                                            
KDRTMIX  DFLD  POS=(17,75),LTH=2,                                      +        
               ATTR=(PROT)                                                      
KDRTMIXI DFLD  POS=(18,75),LTH=2,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'F10=WHELP  F11=Update  F12=Logoff',                    +        
               POS=(22,2),LTH=33,                                      +        
               ATTR=(PROT)                                                      
TEMSINF  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4O404N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N404,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I404N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W4N404,                                             +        
               NXT=W4I404N1                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDDCIN,                                                 +        
               LTH=2                                                            
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  IDDCSIN,                                                +        
               LTH=2                                                            
         MFLD  IDDCSUT,                                                +        
               LTH=2                                                            
         MFLD  TABORT,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FRAKTB,                                                 +        
               LTH=2                                                            
         MFLD  FRAKTBI,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FRAKTBS,                                                +        
               LTH=2                                                            
         MFLD  FRAKTBSI,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DISREF,                                                 +        
               LTH=4                                                            
         MFLD  DISREFI,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DISRET,                                                 +        
               LTH=4                                                            
         MFLD  DISRETI,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DISRETQ,                                                +        
               LTH=4                                                            
         MFLD  DISRETQI,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DISSKR,                                                 +        
               LTH=4                                                            
         MFLD  DISSKRI,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DISSKRQ,                                                +        
               LTH=4                                                            
         MFLD  DISSKRQI,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DISSKRR,                                                +        
               LTH=4                                                            
         MFLD  DISSKRRI,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DISMIX,                                                 +        
               LTH=4                                                            
         MFLD  DISMIXI,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DISPADJ,                                                +        
               LTH=4                                                            
         MFLD  DISPADJI,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KNDORDF,                                                +        
               LTH=6                                                            
         MFLD  KNDORDFI,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KNDRET,                                                 +        
               LTH=6                                                            
         MFLD  KNDRETI,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KNDRETQ,                                                +        
               LTH=6                                                            
         MFLD  KNDRETQI,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KNDSKR,                                                 +        
               LTH=6                                                            
         MFLD  KNDSKRI,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KNDSKRQ,                                                +        
               LTH=6                                                            
         MFLD  KNDSKRQI,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KNDSKRR,                                                +        
               LTH=6                                                            
         MFLD  KNDSKRRI,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KNDMIX,                                                 +        
               LTH=6                                                            
         MFLD  KNDMIXI,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KNDPADJ,                                                +        
               LTH=6                                                            
         MFLD  KNDPADJI,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KNDBYP,                                                 +        
               LTH=6                                                            
         MFLD  KNDBYPI,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KNDRETT,                                                +        
               LTH=6                                                            
         MFLD  KNDRETTI,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KNDREQF,                                                +        
               LTH=6                                                            
         MFLD  KNDREQFI,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KNDBYPF,                                                +        
               LTH=6                                                            
         MFLD  KNDBYPFI,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KNDRETF,                                                +        
               LTH=6                                                            
         MFLD  KNDRETFI,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDPERS,                                                 +        
               LTH=3                                                            
         MFLD  IDPERSI,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KSTADJ,                                                 +        
               LTH=10                                                           
         MFLD  KSTADJI,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDKTOA,                                                 +        
               LTH=10                                                           
         MFLD  IDKTOAI,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDANALA,                                                +        
               LTH=12                                                           
         MFLD  IDANALAI,                                               +        
               LTH=14,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRTADJ,                                                +        
               LTH=2                                                            
         MFLD  KDRTADJI,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KSTSKR,                                                 +        
               LTH=10                                                           
         MFLD  KSTSKRI,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDKTSKR,                                                +        
               LTH=10                                                           
         MFLD  IDKTSKRI,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDANALS,                                                +        
               LTH=12                                                           
         MFLD  IDANALSI,                                               +        
               LTH=14,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRTSCR,                                                +        
               LTH=2                                                            
         MFLD  KDRTSCRI,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KSTM,                                                   +        
               LTH=10                                                           
         MFLD  KSTMI,                                                  +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDKTOM,                                                 +        
               LTH=10                                                           
         MFLD  IDKTOMI,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDANALM,                                                +        
               LTH=12                                                           
         MFLD  IDANALMI,                                               +        
               LTH=14,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRTMIX,                                                +        
               LTH=2                                                            
         MFLD  KDRTMIXI,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMSINF,                                                +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I404N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N404),                                           +        
               OPT=2,                                                  +        
               NXT=W4O404N1                                                     
MID      LPAGE SOR=(W4N404),                                           +        
               NXT=W4O404N1                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  (FLD0102,                                               +        
               '4'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  (FLD0104,                                               +        
               '4'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  (FLD0106,                                               +        
               '0'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0108,                                               +        
               '4'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '44042',                                                +        
               LTH=5                                                            
         MFLD  (IDDCIN,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (IDDCSIN,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TABORT,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FRAKTBI,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FRAKTBSI,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DISREFI,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DISRETI,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DISRETQI,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DISSKRI,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DISSKRQI,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DISSKRRI,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DISMIXI,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DISPADJI,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KNDORDFI,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KNDRETI,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KNDRETQI,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KNDSKRI,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KNDSKRQI,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KNDSKRRI,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KNDMIXI,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KNDPADJI,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KNDBYPI,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KNDRETTI,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KNDREQFI,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KNDBYPFI,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KNDRETFI,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDPERSI,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KSTADJI,                                               +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDKTOAI,                                               +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDANALAI,                                              +        
               '++++++++++++'),                                        +        
               LTH=12,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KDRTADJI,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KSTSKRI,                                               +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDKTSKRI,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDANALSI,                                              +        
               '++++++++++++'),                                        +        
               LTH=12,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KDRTSCRI,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KSTMI,                                                 +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDKTOMI,                                               +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDANALMI,                                              +        
               '++++++++++++'),                                        +        
               LTH=12,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KDRTMIXI,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
