***********************************************************************         
* CREATED BY V036147   ON 11/06/27  AT 10:41                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'DESTOCKING PARAMETERS           '                               
W4N407   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T407U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W4N407   DPAGE CURSOR=((2,5)),                                         +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'DC DESTOCKING PARAMETERS',                             +        
               POS=(1,11),LTH=24,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'DC',                                                   +        
               POS=(2,2),LTH=2,                                        +        
               ATTR=(NUM,PROT)                                                  
IDDCIN   DFLD  POS=(2,5),LTH=2,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDDCUT   DFLD  POS=(3,5),LTH=2,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'Day',                                                  +        
               POS=(5,2),LTH=3,                                        +        
               ATTR=(PROT)                                                      
TIDTRSUT DFLD  POS=(5,18),LTH=2,                                       +        
               ATTR=(PROT)                                                      
TIDTRSIN DFLD  POS=(5,21),LTH=2,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Last sales(w) >',                                      +        
               POS=(6,2),LTH=15,                                       +        
               ATTR=(PROT)                                                      
TIVVUT   DFLD  POS=(6,18),LTH=2,                                       +        
               ATTR=(PROT)                                                      
TIVVIN   DFLD  POS=(6,21),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Last bin date(w) >',                                   +        
               POS=(6,28),LTH=18,                                      +        
               ATTR=(PROT)                                                      
KVVECKUT DFLD  POS=(6,47),LTH=3,                                       +        
               ATTR=(PROT)                                                      
KVVECKIN DFLD  POS=(6,51),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Transfer:',                                            +        
               POS=(8,2),LTH=9,                                        +        
               ATTR=(PROT)                                                      
DGIA0007 DFLD  POS=(8,19),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DGIA0006 DFLD  POS=(8,21),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Return:',                                              +        
               POS=(8,28),LTH=7,                                       +        
               ATTR=(PROT)                                                      
DGIA0003 DFLD  POS=(8,43),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DGIA0002 DFLD  POS=(8,45),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Scrap:',                                               +        
               POS=(8,55),LTH=6,                                       +        
               ATTR=(PROT)                                                      
DGIA0005 DFLD  POS=(8,72),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DGIA0004 DFLD  POS=(8,74),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'DC 1',                                                 +        
               POS=(9,2),LTH=4,                                        +        
               ATTR=(PROT)                                                      
DGIA0009 DFLD  POS=(9,18),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DGIA0008 DFLD  POS=(9,21),LTH=2,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Value',                                                +        
               POS=(9,28),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '>',                                                    +        
               POS=(9,36),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DGIA0025 DFLD  POS=(9,38),LTH=6,                                       +        
               ATTR=(PROT)                                                      
DGIA0024 DFLD  POS=(9,45),LTH=6,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Passive(w) >',                                         +        
               POS=(9,55),LTH=12,                                      +        
               ATTR=(PROT)                                                      
PWEEKOUT DFLD  POS=(9,70),LTH=3,                                       +        
               ATTR=(PROT)                                                      
PWEEKIN  DFLD  POS=(9,74),LTH=3,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'DC 2',                                                 +        
               POS=(10,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0011 DFLD  POS=(10,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0010 DFLD  POS=(10,21),LTH=2,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Repl(w) >',                                            +        
               POS=(10,28),LTH=9,                                      +        
               ATTR=(PROT)                                                      
DGIA0021 DFLD  POS=(10,42),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0020 DFLD  POS=(10,45),LTH=2,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'DC 3',                                                 +        
               POS=(11,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0013 DFLD  POS=(11,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0012 DFLD  POS=(11,21),LTH=2,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Value',                                                +        
               POS=(12,2),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '>',                                                    +        
               POS=(12,12),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0027 DFLD  POS=(12,14),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0026 DFLD  POS=(12,21),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Price',                                                +        
               POS=(11,55),LTH=5,                                      +        
               ATTR=(PROT)                                                      
SIGNOUT  DFLD  POS=(11,66),LTH=1,                                      +        
               ATTR=(PROT)                                                      
PRICEOUT DFLD  POS=(11,68),LTH=5,                                      +        
               ATTR=(PROT)                                                      
SIGNIN   DFLD  POS=(11,74),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
PRICEIN  DFLD  POS=(11,76),LTH=5,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Area',                                                 +        
               POS=(12,55),LTH=4,                                      +        
               ATTR=(PROT)                                                      
AREAOUT  DFLD  POS=(12,71),LTH=2,                                      +        
               ATTR=(PROT)                                                      
AREAIN   DFLD  POS=(12,74),LTH=2,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Repl Y/N',                                             +        
               POS=(13,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DGIA0001 DFLD  POS=(13,19),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0000 DFLD  POS=(13,21),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Buyer',                                                +        
               POS=(13,55),LTH=5,                                      +        
               ATTR=(PROT)                                                      
BUYEROUT DFLD  POS=(13,70),LTH=3,                                      +        
               ATTR=(PROT)                                                      
BUYERIN  DFLD  POS=(13,74),LTH=3,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Sales(w)',                                             +        
               POS=(14,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DGIA0023 DFLD  POS=(14,17),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0022 DFLD  POS=(14,21),LTH=3,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'PG',                                                   +        
               POS=(14,55),LTH=2,                                      +        
               ATTR=(PROT)                                                      
PGOUT    DFLD  POS=(14,71),LTH=2,                                      +        
               ATTR=(PROT)                                                      
PGIN     DFLD  POS=(14,74),LTH=2,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Stock(p)  <',                                          +        
               POS=(16,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
DGIA0017 DFLD  POS=(16,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0016 DFLD  POS=(16,21),LTH=2,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Max',                                                  +        
               POS=(16,55),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0019 DFLD  POS=(16,70),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0018 DFLD  POS=(16,74),LTH=3,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'or',                                                   +        
               POS=(17,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'F/C Limit <',                                          +        
               POS=(18,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
DGIA0015 DFLD  POS=(18,14),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DGIA0014 DFLD  POS=(18,23),LTH=8,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'and',                                                  +        
               POS=(18,32),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Qty Limit <',                                          +        
               POS=(19,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
DGIA0029 DFLD  POS=(19,16),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0028 DFLD  POS=(19,23),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'F10=WHELP  F11=Update  F12=Logoff',                    +        
               POS=(22,2),LTH=33,                                      +        
               ATTR=(PROT)                                                      
TEMSINF  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4O407N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N407,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I407N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W4N407,                                             +        
               NXT=W4I407N1                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDDCIN,                                                 +        
               LTH=2                                                            
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  TIDTRSUT,                                               +        
               LTH=2                                                            
         MFLD  TIDTRSIN,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TIVVUT,                                                 +        
               LTH=2                                                            
         MFLD  TIVVIN,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVVECKUT,                                               +        
               LTH=3                                                            
         MFLD  KVVECKIN,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0007,                                               +        
               LTH=1                                                            
         MFLD  DGIA0006,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0009,                                               +        
               LTH=2                                                            
         MFLD  DGIA0008,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0011,                                               +        
               LTH=2                                                            
         MFLD  DGIA0010,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0013,                                               +        
               LTH=2                                                            
         MFLD  DGIA0012,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0027,                                               +        
               LTH=6                                                            
         MFLD  DGIA0026,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0017,                                               +        
               LTH=2                                                            
         MFLD  DGIA0016,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0023,                                               +        
               LTH=3                                                            
         MFLD  DGIA0022,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0001,                                               +        
               LTH=1                                                            
         MFLD  DGIA0000,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0015,                                               +        
               LTH=8                                                            
         MFLD  DGIA0014,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0029,                                               +        
               LTH=6                                                            
         MFLD  DGIA0028,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0003,                                               +        
               LTH=1                                                            
         MFLD  DGIA0002,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0025,                                               +        
               LTH=6                                                            
         MFLD  DGIA0024,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0021,                                               +        
               LTH=2                                                            
         MFLD  DGIA0020,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0005,                                               +        
               LTH=1                                                            
         MFLD  DGIA0004,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0019,                                               +        
               LTH=3                                                            
         MFLD  DGIA0018,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PWEEKOUT,                                               +        
               LTH=3                                                            
         MFLD  PWEEKIN,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SIGNOUT,                                                +        
               LTH=1                                                            
         MFLD  SIGNIN,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRICEOUT,                                               +        
               LTH=5                                                            
         MFLD  PRICEIN,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AREAOUT,                                                +        
               LTH=2                                                            
         MFLD  AREAIN,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BUYEROUT,                                               +        
               LTH=3                                                            
         MFLD  BUYERIN,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PGOUT,                                                  +        
               LTH=2                                                            
         MFLD  PGIN,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMSINF,                                                +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I407N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N407),                                           +        
               OPT=2,                                                  +        
               NXT=W4O404N1                                                     
MID      LPAGE SOR=(W4N407),                                           +        
               NXT=W4O404N1                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  (FLD0102,                                               +        
               '4'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  (FLD0104,                                               +        
               '4'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  (FLD0106,                                               +        
               '0'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0108,                                               +        
               '7'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F7'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '44072',                                                +        
               LTH=5                                                            
         MFLD  (IDDCIN,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TIDTRSIN,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (TIVVIN,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVVECKIN,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0006,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0008,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0010,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0012,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0026,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0016,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0022,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0000,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0014,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0028,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0002,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0024,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0020,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0004,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0018,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PWEEKIN,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (SIGNIN,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (PRICEIN,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AREAIN,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (BUYERIN,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PGIN,                                                  +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
