***********************************************************************         
* CREATED BY PC36147   oN 98/08/31  AT 12:57                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE '                                '                               
W4N592   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080'                                                     
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((7,20)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  'Invoice Supplement 2',                                 +        
               POS=(1,11),LTH=20,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'District',                                             +        
               POS=(3,2),LTH=8,                                        +        
               ATTR=(PROT)                                                      
FLD0311  DFLD  POS=(3,11),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Customer',                                             +        
               POS=(3,17),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FLD0324  DFLD  POS=(3,26),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'FC',                                                   +        
               POS=(3,34),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FLD0335  DFLD  POS=(3,37),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Shipment',                                             +        
               POS=(3,41),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FLD0347  DFLD  POS=(3,50),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'DC',                                                   +        
               POS=(3,59),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDDC     DFLD  POS=(3,62),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0402  DFLD  POS=(4,2),LTH=3,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0406  DFLD  POS=(4,6),LTH=1,                                        +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
FLD0410  DFLD  POS=(4,10),LTH=1,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'Tot. ord. val.',                                       +        
               POS=(5,2),LTH=14,                                       +        
               ATTR=(PROT)                                                      
FLD0515  DFLD  POS=(5,17),LTH=12,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Gross KG',                                             +        
               POS=(5,30),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0539  DFLD  POS=(5,39),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Gross M3',                                             +        
               POS=(5,48),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0559  DFLD  POS=(5,57),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'No. of cse',                                           +        
               POS=(5,66),LTH=10,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD0577  DFLD  POS=(5,77),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Letter of Credit?',                                    +        
               POS=(7,2),LTH=17,                                       +        
               ATTR=(PROT)                                                      
FLCREDL  DFLD  POS=(7,20),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Exchange code',                                        +        
               POS=(7,26),LTH=13,                                      +        
               ATTR=(PROT)                                                      
KDVALUT  DFLD  POS=(7,40),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Exchange rate',                                        +        
               POS=(7,47),LTH=13,                                      +        
               ATTR=(PROT)                                                      
KURSVAL  DFLD  POS=(7,61),LTH=10,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'SEK',                                                  +        
               POS=(9,29),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '%',                                                    +        
               POS=(9,37),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Freight cost',                                         +        
               POS=(10,2),LTH=12,                                      +        
               ATTR=(PROT)                                                      
FLD1022  DFLD  POS=(10,22),LTH=10,                                     +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Legal cost',                                           +        
               POS=(11,2),LTH=10,                                      +        
               ATTR=(PROT)                                                      
FLD1122  DFLD  POS=(11,22),LTH=10,                                     +        
               ATTR=(NUM,NOPROT)                                                
FLD1135  DFLD  POS=(11,35),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Pack. handl. cost',                                    +        
               POS=(12,2),LTH=17,                                      +        
               ATTR=(PROT)                                                      
FLD1222  DFLD  POS=(12,22),LTH=10,                                     +        
               ATTR=(NUM,NOPROT)                                                
FLD1235  DFLD  POS=(12,35),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Insurance premium',                                    +        
               POS=(13,2),LTH=17,                                      +        
               ATTR=(PROT)                                                      
FLD1322  DFLD  POS=(13,22),LTH=10,                                     +        
               ATTR=(NUM,NOPROT)                                                
FLD1335  DFLD  POS=(13,35),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Over-insurance %',                                     +        
               POS=(13,43),LTH=16,                                     +        
               ATTR=(PROT)                                                      
FLD1357  DFLD  POS=(13,62),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Reduction',                                            +        
               POS=(14,2),LTH=9,                                       +        
               ATTR=(PROT)                                                      
FLD1422  DFLD  POS=(14,22),LTH=10,                                     +        
               ATTR=(NUM,NOPROT)                                                
FLD1435  DFLD  POS=(14,35),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Account',                                              +        
               POS=(14,43),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FLD1449  DFLD  POS=(14,53),LTH=10,                                     +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Cost',                                                 +        
               POS=(14,65),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD1465  DFLD  POS=(14,70),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Goods cert. No.',                                      +        
               POS=(15,2),LTH=15,                                      +        
               ATTR=(PROT)                                                      
FLD1522  DFLD  POS=(15,22),LTH=16,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'AnNo',                                                 +        
               POS=(15,43),LTH=4,                                      +        
               ATTR=(PROT)                                                      
IDANALYS DFLD  POS=(15,49),LTH=12,                                     +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Delivery conds.',                                      +        
               POS=(16,2),LTH=15,                                      +        
               ATTR=(PROT)                                                      
FLD1622  DFLD  POS=(16,22),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Freight bill No.',                                     +        
               POS=(16,43),LTH=16,                                     +        
               ATTR=(PROT)                                                      
FLD1661  DFLD  POS=(16,60),LTH=15,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'Final delivery',                                       +        
               POS=(17,2),LTH=14,                                      +        
               ATTR=(PROT)                                                      
FLD1722  DFLD  POS=(17,22),LTH=20,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'More invoices',                                        +        
               POS=(19,2),LTH=13,                                      +        
               ATTR=(PROT)                                                      
FLD1917  DFLD  POS=(19,17),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W4O592N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N592,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I592N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  FLD0311,                                                +        
               LTH=4                                                            
         MFLD  FLD0324,                                                +        
               LTH=6                                                            
         MFLD  FLD0335,                                                +        
               LTH=2                                                            
         MFLD  FLD0347,                                                +        
               LTH=7                                                            
         MFLD  IDDC,                                                   +        
               LTH=2                                                            
         MFLD  FLD0402,                                                +        
               LTH=3                                                            
         MFLD  FLD0406,                                                +        
               LTH=1                                                            
         MFLD  FLD0410,                                                +        
               LTH=1                                                            
         MFLD  FLD0515,                                                +        
               LTH=12                                                           
         MFLD  FLD0539,                                                +        
               LTH=8                                                            
         MFLD  FLD0559,                                                +        
               LTH=8                                                            
         MFLD  FLD0577,                                                +        
               LTH=4                                                            
         MFLD  FLCREDL,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDVALUT,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KURSVAL,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1022,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1122,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1135,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1222,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1235,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1322,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1335,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1357,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1422,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1435,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1449,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1465,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1522,                                                +        
               LTH=18,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDANALYS,                                               +        
               LTH=14,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1622,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1661,                                                +        
               LTH=17,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1722,                                                +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1917,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I592N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N592),                                           +        
               OPT=2,                                                  +        
               NXT=W4O592N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F9'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '45922',                                                +        
               LTH=5                                                            
         MFLD  (FLD0311,                                               +        
               '    '),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0324,                                               +        
               '      '),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0335,                                               +        
               '  '),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0347,                                               +        
               '       '),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDDC,                                                   +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0402,                                               +        
               '   '),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0406,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MFLD  (FLD0410,                                               +        
               'N'),                                                   +        
               LTH=1                                                            
         MFLD  FLD0515,                                                +        
               LTH=12,                                                 +        
               FILL=X'40'                                                       
         MFLD  FLD0539,                                                +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  FLD0559,                                                +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  FLD0577,                                                +        
               LTH=4,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLCREDL,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KDVALUT,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KURSVAL,                                               +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1022,                                               +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1122,                                               +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1135,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1222,                                               +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1235,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1322,                                               +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1335,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1357,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1422,                                               +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1435,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1449,                                               +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1465,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1522,                                               +        
               '++++++++++++++++'),                                    +        
               LTH=16,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDANALYS,                                              +        
               '+++++++++++++++'),                                     +        
               LTH=12,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLD1622,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1661,                                               +        
               '+++++++++++++++'),                                     +        
               LTH=15,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1722,                                               +        
               '++++++++++++++++++++'),                                +        
               LTH=20,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLD1917,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
