***********************************************************************         
* CREATED BY PCC4448   ON 95/01/26  AT 16:29                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE '                                '                               
W4N521   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W4T521  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W4T521 7',                                           +        
               8='W4T521 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T521U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T521  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W4T521U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,15)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'NOT INVOICED ORDERS',                                  +        
               POS=(1,11),LTH=19,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Pers. code',                                           +        
               POS=(2,2),LTH=10,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0215  DFLD  POS=(2,15),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'FC',                                                   +        
               POS=(2,20),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FLD0223  DFLD  POS=(2,23),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Dist',                                                 +        
               POS=(2,27),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FLD0233  DFLD  POS=(2,33),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Cust',                                                 +        
               POS=(2,41),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FLD0247  DFLD  POS=(2,47),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DC',                                                   +        
               POS=(2,55),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDDCIN   DFLD  POS=(2,58),LTH=2,                                       +        
               ATTR=(ALPHA,NOPROT)                                              
         DFLD  ' Printed',                                             +        
               POS=(2,63),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FLD0270  DFLD  POS=(2,72),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
FLD0315  DFLD  POS=(3,15),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0323  DFLD  POS=(3,23),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0333  DFLD  POS=(3,33),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0347  DFLD  POS=(3,47),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
IDDCUT   DFLD  POS=(3,58),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0370  DFLD  POS=(3,72),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0402  DFLD  POS=(4,2),LTH=26,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'Qty   Lines  Qty  ',                                   +        
               POS=(5,38),LTH=18,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Cases  Cases',                                         +        
               POS=(5,65),LTH=12,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Dist    Cust  FC Cl Order Prod',                       +        
               POS=(6,3),LTH=30,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'lines packed cases  RFS    inv.   loaded',             +        
               POS=(6,38),LTH=40,                                      +        
               ATTR=(PROT)                                                      
COL0307  DFLD  POS=(7,3),LTH=4,                                        +        
               ATTR=(PROT)                                                      
COL0907  DFLD  POS=(7,9),LTH=6,                                        +        
               ATTR=(PROT)                                                      
COL1707  DFLD  POS=(7,17),LTH=2,                                       +        
               ATTR=(PROT)                                                      
COL2107  DFLD  POS=(7,21),LTH=1,                                       +        
               ATTR=(PROT)                                                      
COL2307  DFLD  POS=(7,23),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
COL2907  DFLD  POS=(7,29),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
COL3807  DFLD  POS=(7,38),LTH=5,                                       +        
               ATTR=(PROT)                                                      
COL4507  DFLD  POS=(7,45),LTH=5,                                       +        
               ATTR=(PROT)                                                      
COL5207  DFLD  POS=(7,52),LTH=4,                                       +        
               ATTR=(PROT)                                                      
COL5807  DFLD  POS=(7,58),LTH=6,                                       +        
               ATTR=(PROT)                                                      
COL6607  DFLD  POS=(7,66),LTH=4,                                       +        
               ATTR=(PROT)                                                      
COL7307  DFLD  POS=(7,73),LTH=4,                                       +        
               ATTR=(PROT)                                                      
COL0308  DFLD  POS=(8,3),LTH=4,                                        +        
               ATTR=(PROT)                                                      
COL0908  DFLD  POS=(8,9),LTH=6,                                        +        
               ATTR=(PROT)                                                      
COL1708  DFLD  POS=(8,17),LTH=2,                                       +        
               ATTR=(PROT)                                                      
COL2108  DFLD  POS=(8,21),LTH=1,                                       +        
               ATTR=(PROT)                                                      
COL2308  DFLD  POS=(8,23),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
COL2908  DFLD  POS=(8,29),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
COL3808  DFLD  POS=(8,38),LTH=5,                                       +        
               ATTR=(PROT)                                                      
COL4508  DFLD  POS=(8,45),LTH=5,                                       +        
               ATTR=(PROT)                                                      
COL5208  DFLD  POS=(8,52),LTH=4,                                       +        
               ATTR=(PROT)                                                      
COL5808  DFLD  POS=(8,58),LTH=6,                                       +        
               ATTR=(PROT)                                                      
COL6608  DFLD  POS=(8,66),LTH=4,                                       +        
               ATTR=(PROT)                                                      
COL7308  DFLD  POS=(8,73),LTH=4,                                       +        
               ATTR=(PROT)                                                      
COL0309  DFLD  POS=(9,3),LTH=4,                                        +        
               ATTR=(PROT)                                                      
COL0909  DFLD  POS=(9,9),LTH=6,                                        +        
               ATTR=(PROT)                                                      
COL1709  DFLD  POS=(9,17),LTH=2,                                       +        
               ATTR=(PROT)                                                      
COL2109  DFLD  POS=(9,21),LTH=1,                                       +        
               ATTR=(PROT)                                                      
COL2309  DFLD  POS=(9,23),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
COL2909  DFLD  POS=(9,29),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
COL3809  DFLD  POS=(9,38),LTH=5,                                       +        
               ATTR=(PROT)                                                      
COL4509  DFLD  POS=(9,45),LTH=5,                                       +        
               ATTR=(PROT)                                                      
COL5209  DFLD  POS=(9,52),LTH=4,                                       +        
               ATTR=(PROT)                                                      
COL5809  DFLD  POS=(9,58),LTH=6,                                       +        
               ATTR=(PROT)                                                      
COL6609  DFLD  POS=(9,66),LTH=4,                                       +        
               ATTR=(PROT)                                                      
COL7309  DFLD  POS=(9,73),LTH=4,                                       +        
               ATTR=(PROT)                                                      
COL0310  DFLD  POS=(10,3),LTH=4,                                       +        
               ATTR=(PROT)                                                      
COL0910  DFLD  POS=(10,9),LTH=6,                                       +        
               ATTR=(PROT)                                                      
COL1710  DFLD  POS=(10,17),LTH=2,                                      +        
               ATTR=(PROT)                                                      
COL2110  DFLD  POS=(10,21),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL2310  DFLD  POS=(10,23),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
COL2910  DFLD  POS=(10,29),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
COL3810  DFLD  POS=(10,38),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL4510  DFLD  POS=(10,45),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL5210  DFLD  POS=(10,52),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL5810  DFLD  POS=(10,58),LTH=6,                                      +        
               ATTR=(PROT)                                                      
COL6610  DFLD  POS=(10,66),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL7310  DFLD  POS=(10,73),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL0311  DFLD  POS=(11,3),LTH=4,                                       +        
               ATTR=(PROT)                                                      
COL0911  DFLD  POS=(11,9),LTH=6,                                       +        
               ATTR=(PROT)                                                      
COL1711  DFLD  POS=(11,17),LTH=2,                                      +        
               ATTR=(PROT)                                                      
COL2111  DFLD  POS=(11,21),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL2311  DFLD  POS=(11,23),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
COL2911  DFLD  POS=(11,29),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
COL3811  DFLD  POS=(11,38),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL4511  DFLD  POS=(11,45),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL5211  DFLD  POS=(11,52),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL5811  DFLD  POS=(11,58),LTH=6,                                      +        
               ATTR=(PROT)                                                      
COL6611  DFLD  POS=(11,66),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL7311  DFLD  POS=(11,73),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL0312  DFLD  POS=(12,3),LTH=4,                                       +        
               ATTR=(PROT)                                                      
COL0912  DFLD  POS=(12,9),LTH=6,                                       +        
               ATTR=(PROT)                                                      
COL1712  DFLD  POS=(12,17),LTH=2,                                      +        
               ATTR=(PROT)                                                      
COL2112  DFLD  POS=(12,21),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL2312  DFLD  POS=(12,23),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
COL2912  DFLD  POS=(12,29),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
COL3812  DFLD  POS=(12,38),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL4512  DFLD  POS=(12,45),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL5212  DFLD  POS=(12,52),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL5812  DFLD  POS=(12,58),LTH=6,                                      +        
               ATTR=(PROT)                                                      
COL6612  DFLD  POS=(12,66),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL7312  DFLD  POS=(12,73),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL0313  DFLD  POS=(13,3),LTH=4,                                       +        
               ATTR=(PROT)                                                      
COL0913  DFLD  POS=(13,9),LTH=6,                                       +        
               ATTR=(PROT)                                                      
COL1713  DFLD  POS=(13,17),LTH=2,                                      +        
               ATTR=(PROT)                                                      
COL2113  DFLD  POS=(13,21),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL2313  DFLD  POS=(13,23),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
COL2913  DFLD  POS=(13,29),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
COL3813  DFLD  POS=(13,38),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL4513  DFLD  POS=(13,45),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL5213  DFLD  POS=(13,52),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL5813  DFLD  POS=(13,58),LTH=6,                                      +        
               ATTR=(PROT)                                                      
COL6613  DFLD  POS=(13,66),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL7313  DFLD  POS=(13,73),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL0314  DFLD  POS=(14,3),LTH=4,                                       +        
               ATTR=(PROT)                                                      
COL0914  DFLD  POS=(14,9),LTH=6,                                       +        
               ATTR=(PROT)                                                      
COL1714  DFLD  POS=(14,17),LTH=2,                                      +        
               ATTR=(PROT)                                                      
COL2114  DFLD  POS=(14,21),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL2314  DFLD  POS=(14,23),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
COL2914  DFLD  POS=(14,29),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
COL3814  DFLD  POS=(14,38),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL4514  DFLD  POS=(14,45),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL5214  DFLD  POS=(14,52),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL5814  DFLD  POS=(14,58),LTH=6,                                      +        
               ATTR=(PROT)                                                      
COL6614  DFLD  POS=(14,66),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL7314  DFLD  POS=(14,73),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL0315  DFLD  POS=(15,3),LTH=4,                                       +        
               ATTR=(PROT)                                                      
COL0915  DFLD  POS=(15,9),LTH=6,                                       +        
               ATTR=(PROT)                                                      
COL1715  DFLD  POS=(15,17),LTH=2,                                      +        
               ATTR=(PROT)                                                      
COL2115  DFLD  POS=(15,21),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL2315  DFLD  POS=(15,23),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
COL2915  DFLD  POS=(15,29),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
COL3815  DFLD  POS=(15,38),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL4515  DFLD  POS=(15,45),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL5215  DFLD  POS=(15,52),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL5815  DFLD  POS=(15,58),LTH=6,                                      +        
               ATTR=(PROT)                                                      
COL6615  DFLD  POS=(15,66),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL7315  DFLD  POS=(15,73),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL0316  DFLD  POS=(16,3),LTH=4,                                       +        
               ATTR=(PROT)                                                      
COL0916  DFLD  POS=(16,9),LTH=6,                                       +        
               ATTR=(PROT)                                                      
COL1716  DFLD  POS=(16,17),LTH=2,                                      +        
               ATTR=(PROT)                                                      
COL2116  DFLD  POS=(16,21),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL2316  DFLD  POS=(16,23),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
COL2916  DFLD  POS=(16,29),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
COL3816  DFLD  POS=(16,38),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL4516  DFLD  POS=(16,45),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL5216  DFLD  POS=(16,52),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL5816  DFLD  POS=(16,58),LTH=6,                                      +        
               ATTR=(PROT)                                                      
COL6616  DFLD  POS=(16,66),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL7316  DFLD  POS=(16,73),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL0317  DFLD  POS=(17,3),LTH=4,                                       +        
               ATTR=(PROT)                                                      
COL0917  DFLD  POS=(17,9),LTH=6,                                       +        
               ATTR=(PROT)                                                      
COL1717  DFLD  POS=(17,17),LTH=2,                                      +        
               ATTR=(PROT)                                                      
COL2117  DFLD  POS=(17,21),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL2317  DFLD  POS=(17,23),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
COL2917  DFLD  POS=(17,29),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
COL3817  DFLD  POS=(17,38),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL4517  DFLD  POS=(17,45),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL5217  DFLD  POS=(17,52),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL5817  DFLD  POS=(17,58),LTH=6,                                      +        
               ATTR=(PROT)                                                      
COL6617  DFLD  POS=(17,66),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL7317  DFLD  POS=(17,73),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL0318  DFLD  POS=(18,3),LTH=4,                                       +        
               ATTR=(PROT)                                                      
COL0918  DFLD  POS=(18,9),LTH=6,                                       +        
               ATTR=(PROT)                                                      
COL1718  DFLD  POS=(18,17),LTH=2,                                      +        
               ATTR=(PROT)                                                      
COL2118  DFLD  POS=(18,21),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL2318  DFLD  POS=(18,23),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
COL2918  DFLD  POS=(18,29),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
COL3818  DFLD  POS=(18,38),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL4518  DFLD  POS=(18,45),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL5218  DFLD  POS=(18,52),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL5818  DFLD  POS=(18,58),LTH=6,                                      +        
               ATTR=(PROT)                                                      
COL6618  DFLD  POS=(18,66),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL7318  DFLD  POS=(18,73),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL0319  DFLD  POS=(19,3),LTH=4,                                       +        
               ATTR=(PROT)                                                      
COL0919  DFLD  POS=(19,9),LTH=6,                                       +        
               ATTR=(PROT)                                                      
COL1719  DFLD  POS=(19,17),LTH=2,                                      +        
               ATTR=(PROT)                                                      
COL2119  DFLD  POS=(19,21),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL2319  DFLD  POS=(19,23),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
COL2919  DFLD  POS=(19,29),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
COL3819  DFLD  POS=(19,38),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL4519  DFLD  POS=(19,45),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COL5219  DFLD  POS=(19,52),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL5819  DFLD  POS=(19,58),LTH=6,                                      +        
               ATTR=(PROT)                                                      
COL6619  DFLD  POS=(19,66),LTH=4,                                      +        
               ATTR=(PROT)                                                      
COL7319  DFLD  POS=(19,73),LTH=4,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '13 Not inv. ord 14',                                   +        
               POS=(21,2),LTH=18,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '15',                                                   +        
               POS=(21,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16',                                                   +        
               POS=(21,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4O521N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N521,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I521N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  FLD0215,                                                +        
               LTH=3                                                            
         MFLD  FLD0315,                                                +        
               LTH=3                                                            
         MFLD  FLD0223,                                                +        
               LTH=2                                                            
         MFLD  FLD0323,                                                +        
               LTH=2                                                            
         MFLD  FLD0233,                                                +        
               LTH=4                                                            
         MFLD  FLD0333,                                                +        
               LTH=4                                                            
         MFLD  FLD0247,                                                +        
               LTH=6                                                            
         MFLD  FLD0347,                                                +        
               LTH=6                                                            
         MFLD  IDDCIN,                                                 +        
               LTH=2                                                            
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  FLD0270,                                                +        
               LTH=1                                                            
         MFLD  FLD0370,                                                +        
               LTH=1                                                            
         MFLD  FLD0402,                                                +        
               LTH=26                                                           
         MFLD  COL0307,                                                +        
               LTH=4                                                            
         MFLD  COL0907,                                                +        
               LTH=6                                                            
         MFLD  COL1707,                                                +        
               LTH=2                                                            
         MFLD  COL2107,                                                +        
               LTH=1                                                            
         MFLD  COL2307,                                                +        
               LTH=5                                                            
         MFLD  COL2907,                                                +        
               LTH=7                                                            
         MFLD  COL3807,                                                +        
               LTH=5                                                            
         MFLD  COL4507,                                                +        
               LTH=5                                                            
         MFLD  COL5207,                                                +        
               LTH=4                                                            
         MFLD  COL5807,                                                +        
               LTH=6                                                            
         MFLD  COL6607,                                                +        
               LTH=4                                                            
         MFLD  COL7307,                                                +        
               LTH=4                                                            
         MFLD  COL0308,                                                +        
               LTH=4                                                            
         MFLD  COL0908,                                                +        
               LTH=6                                                            
         MFLD  COL1708,                                                +        
               LTH=2                                                            
         MFLD  COL2108,                                                +        
               LTH=1                                                            
         MFLD  COL2308,                                                +        
               LTH=5                                                            
         MFLD  COL2908,                                                +        
               LTH=7                                                            
         MFLD  COL3808,                                                +        
               LTH=5                                                            
         MFLD  COL4508,                                                +        
               LTH=5                                                            
         MFLD  COL5208,                                                +        
               LTH=4                                                            
         MFLD  COL5808,                                                +        
               LTH=6                                                            
         MFLD  COL6608,                                                +        
               LTH=4                                                            
         MFLD  COL7308,                                                +        
               LTH=4                                                            
         MFLD  COL0309,                                                +        
               LTH=4                                                            
         MFLD  COL0909,                                                +        
               LTH=6                                                            
         MFLD  COL1709,                                                +        
               LTH=2                                                            
         MFLD  COL2109,                                                +        
               LTH=1                                                            
         MFLD  COL2309,                                                +        
               LTH=5                                                            
         MFLD  COL2909,                                                +        
               LTH=7                                                            
         MFLD  COL3809,                                                +        
               LTH=5                                                            
         MFLD  COL4509,                                                +        
               LTH=5                                                            
         MFLD  COL5209,                                                +        
               LTH=4                                                            
         MFLD  COL5809,                                                +        
               LTH=6                                                            
         MFLD  COL6609,                                                +        
               LTH=4                                                            
         MFLD  COL7309,                                                +        
               LTH=4                                                            
         MFLD  COL0310,                                                +        
               LTH=4                                                            
         MFLD  COL0910,                                                +        
               LTH=6                                                            
         MFLD  COL1710,                                                +        
               LTH=2                                                            
         MFLD  COL2110,                                                +        
               LTH=1                                                            
         MFLD  COL2310,                                                +        
               LTH=5                                                            
         MFLD  COL2910,                                                +        
               LTH=7                                                            
         MFLD  COL3810,                                                +        
               LTH=5                                                            
         MFLD  COL4510,                                                +        
               LTH=5                                                            
         MFLD  COL5210,                                                +        
               LTH=4                                                            
         MFLD  COL5810,                                                +        
               LTH=6                                                            
         MFLD  COL6610,                                                +        
               LTH=4                                                            
         MFLD  COL7310,                                                +        
               LTH=4                                                            
         MFLD  COL0311,                                                +        
               LTH=4                                                            
         MFLD  COL0911,                                                +        
               LTH=6                                                            
         MFLD  COL1711,                                                +        
               LTH=2                                                            
         MFLD  COL2111,                                                +        
               LTH=1                                                            
         MFLD  COL2311,                                                +        
               LTH=5                                                            
         MFLD  COL2911,                                                +        
               LTH=7                                                            
         MFLD  COL3811,                                                +        
               LTH=5                                                            
         MFLD  COL4511,                                                +        
               LTH=5                                                            
         MFLD  COL5211,                                                +        
               LTH=4                                                            
         MFLD  COL5811,                                                +        
               LTH=6                                                            
         MFLD  COL6611,                                                +        
               LTH=4                                                            
         MFLD  COL7311,                                                +        
               LTH=4                                                            
         MFLD  COL0312,                                                +        
               LTH=4                                                            
         MFLD  COL0912,                                                +        
               LTH=6                                                            
         MFLD  COL1712,                                                +        
               LTH=2                                                            
         MFLD  COL2112,                                                +        
               LTH=1                                                            
         MFLD  COL2312,                                                +        
               LTH=5                                                            
         MFLD  COL2912,                                                +        
               LTH=7                                                            
         MFLD  COL3812,                                                +        
               LTH=5                                                            
         MFLD  COL4512,                                                +        
               LTH=5                                                            
         MFLD  COL5212,                                                +        
               LTH=4                                                            
         MFLD  COL5812,                                                +        
               LTH=6                                                            
         MFLD  COL6612,                                                +        
               LTH=4                                                            
         MFLD  COL7312,                                                +        
               LTH=4                                                            
         MFLD  COL0313,                                                +        
               LTH=4                                                            
         MFLD  COL0913,                                                +        
               LTH=6                                                            
         MFLD  COL1713,                                                +        
               LTH=2                                                            
         MFLD  COL2113,                                                +        
               LTH=1                                                            
         MFLD  COL2313,                                                +        
               LTH=5                                                            
         MFLD  COL2913,                                                +        
               LTH=7                                                            
         MFLD  COL3813,                                                +        
               LTH=5                                                            
         MFLD  COL4513,                                                +        
               LTH=5                                                            
         MFLD  COL5213,                                                +        
               LTH=4                                                            
         MFLD  COL5813,                                                +        
               LTH=6                                                            
         MFLD  COL6613,                                                +        
               LTH=4                                                            
         MFLD  COL7313,                                                +        
               LTH=4                                                            
         MFLD  COL0314,                                                +        
               LTH=4                                                            
         MFLD  COL0914,                                                +        
               LTH=6                                                            
         MFLD  COL1714,                                                +        
               LTH=2                                                            
         MFLD  COL2114,                                                +        
               LTH=1                                                            
         MFLD  COL2314,                                                +        
               LTH=5                                                            
         MFLD  COL2914,                                                +        
               LTH=7                                                            
         MFLD  COL3814,                                                +        
               LTH=5                                                            
         MFLD  COL4514,                                                +        
               LTH=5                                                            
         MFLD  COL5214,                                                +        
               LTH=4                                                            
         MFLD  COL5814,                                                +        
               LTH=6                                                            
         MFLD  COL6614,                                                +        
               LTH=4                                                            
         MFLD  COL7314,                                                +        
               LTH=4                                                            
         MFLD  COL0315,                                                +        
               LTH=4                                                            
         MFLD  COL0915,                                                +        
               LTH=6                                                            
         MFLD  COL1715,                                                +        
               LTH=2                                                            
         MFLD  COL2115,                                                +        
               LTH=1                                                            
         MFLD  COL2315,                                                +        
               LTH=5                                                            
         MFLD  COL2915,                                                +        
               LTH=7                                                            
         MFLD  COL3815,                                                +        
               LTH=5                                                            
         MFLD  COL4515,                                                +        
               LTH=5                                                            
         MFLD  COL5215,                                                +        
               LTH=4                                                            
         MFLD  COL5815,                                                +        
               LTH=6                                                            
         MFLD  COL6615,                                                +        
               LTH=4                                                            
         MFLD  COL7315,                                                +        
               LTH=4                                                            
         MFLD  COL0316,                                                +        
               LTH=4                                                            
         MFLD  COL0916,                                                +        
               LTH=6                                                            
         MFLD  COL1716,                                                +        
               LTH=2                                                            
         MFLD  COL2116,                                                +        
               LTH=1                                                            
         MFLD  COL2316,                                                +        
               LTH=5                                                            
         MFLD  COL2916,                                                +        
               LTH=7                                                            
         MFLD  COL3816,                                                +        
               LTH=5                                                            
         MFLD  COL4516,                                                +        
               LTH=5                                                            
         MFLD  COL5216,                                                +        
               LTH=4                                                            
         MFLD  COL5816,                                                +        
               LTH=6                                                            
         MFLD  COL6616,                                                +        
               LTH=4                                                            
         MFLD  COL7316,                                                +        
               LTH=4                                                            
         MFLD  COL0317,                                                +        
               LTH=4                                                            
         MFLD  COL0917,                                                +        
               LTH=6                                                            
         MFLD  COL1717,                                                +        
               LTH=2                                                            
         MFLD  COL2117,                                                +        
               LTH=1                                                            
         MFLD  COL2317,                                                +        
               LTH=5                                                            
         MFLD  COL2917,                                                +        
               LTH=7                                                            
         MFLD  COL3817,                                                +        
               LTH=5                                                            
         MFLD  COL4517,                                                +        
               LTH=5                                                            
         MFLD  COL5217,                                                +        
               LTH=4                                                            
         MFLD  COL5817,                                                +        
               LTH=6                                                            
         MFLD  COL6617,                                                +        
               LTH=4                                                            
         MFLD  COL7317,                                                +        
               LTH=4                                                            
         MFLD  COL0318,                                                +        
               LTH=4                                                            
         MFLD  COL0918,                                                +        
               LTH=6                                                            
         MFLD  COL1718,                                                +        
               LTH=2                                                            
         MFLD  COL2118,                                                +        
               LTH=1                                                            
         MFLD  COL2318,                                                +        
               LTH=5                                                            
         MFLD  COL2918,                                                +        
               LTH=7                                                            
         MFLD  COL3818,                                                +        
               LTH=5                                                            
         MFLD  COL4518,                                                +        
               LTH=5                                                            
         MFLD  COL5218,                                                +        
               LTH=4                                                            
         MFLD  COL5818,                                                +        
               LTH=6                                                            
         MFLD  COL6618,                                                +        
               LTH=4                                                            
         MFLD  COL7318,                                                +        
               LTH=4                                                            
         MFLD  COL0319,                                                +        
               LTH=4                                                            
         MFLD  COL0919,                                                +        
               LTH=6                                                            
         MFLD  COL1719,                                                +        
               LTH=2                                                            
         MFLD  COL2119,                                                +        
               LTH=1                                                            
         MFLD  COL2319,                                                +        
               LTH=5                                                            
         MFLD  COL2919,                                                +        
               LTH=7                                                            
         MFLD  COL3819,                                                +        
               LTH=5                                                            
         MFLD  COL4519,                                                +        
               LTH=5                                                            
         MFLD  COL5219,                                                +        
               LTH=4                                                            
         MFLD  COL5819,                                                +        
               LTH=6                                                            
         MFLD  COL6619,                                                +        
               LTH=4                                                            
         MFLD  COL7319,                                                +        
               LTH=4                                                            
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I521N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N521),                                           +        
               OPT=2,                                                  +        
               NXT=W4O521N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '45212',                                                +        
               LTH=5                                                            
         MFLD  (FLD0215,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0315,                                                +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0223,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0323,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0233,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0333,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0247,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0347,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (IDDCIN,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDDCUT,                                                 +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0270,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  FLD0370,                                                +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  FLD0402,                                                +        
               LTH=26,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
