***********************************************************************         
* CREATED BY PC36147   ON 95/03/09  AT 15:27                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'QUERY ON TRANSPORT W4N582    '                                  
W4N582   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W4T582 7',                                           +        
               8='W4T582 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T581  ',                                          +        
               14='W4T582  ',                                          +        
               15='W4T583  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((2,8)),                                         +        
               FILL=PT                                                          
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(1,10),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
         DFLD  'QUERY TRANSPORT      ',                                +        
               POS=(1,12),LTH=21,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Trpid',                                                +        
               POS=(2,2),LTH=5,                                        +        
               ATTR=(ALPHA,PROT)                                                
DGIA0024 DFLD  POS=(2,8),LTH=5,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Dest',                                                 +        
               POS=(2,15),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0000 DFLD  POS=(2,20),LTH=15,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'DC',                                                   +        
               POS=(2,37),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DGIA0027 DFLD  POS=(2,40),LTH=2,                                       +        
               ATTR=(NOPROT,MOD)                                                
DGIA0026 DFLD  POS=(3,8),LTH=5,                                        +        
               ATTR=(PROT,MOD)                                                  
DGIA0001 DFLD  POS=(3,20),LTH=15,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0028 DFLD  POS=(3,40),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0025 DFLD  POS=(4,2),LTH=5,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0022 DFLD  POS=(4,9),LTH=7,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0023 DFLD  POS=(4,18),LTH=5,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0021 DFLD  POS=(4,25),LTH=7,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'Trpid  Loadtime Admbl   Admal   Departure    Dg   Min-v+        
               ol   Transporter',                                      +        
               POS=(5,2),LTH=71,                                       +        
               ATTR=(PROT)                                                      
TRPID1   DFLD  POS=(6,2),LTH=5,                                        +        
               ATTR=(PROT)                                                      
LASTTID1 DFLD  POS=(6,10),LTH=5,                                       +        
               ATTR=(PROT)                                                      
ADMFL1   DFLD  POS=(6,18),LTH=5,                                       +        
               ATTR=(PROT)                                                      
ADMEL1   DFLD  POS=(6,26),LTH=5,                                       +        
               ATTR=(PROT)                                                      
TRPAVG1  DFLD  POS=(6,34),LTH=10,                                      +        
               ATTR=(PROT)                                                      
FG1      DFLD  POS=(6,48),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DGIA0007 DFLD  POS=(6,54),LTH=3,                                       +        
               ATTR=(PROT)                                                      
TRPFIR1  DFLD  POS=(6,62),LTH=15,                                      +        
               ATTR=(PROT)                                                      
TRPID2   DFLD  POS=(7,2),LTH=5,                                        +        
               ATTR=(PROT)                                                      
LASTTID2 DFLD  POS=(7,10),LTH=5,                                       +        
               ATTR=(PROT)                                                      
ADMFL2   DFLD  POS=(7,18),LTH=5,                                       +        
               ATTR=(PROT)                                                      
ADMEL2   DFLD  POS=(7,26),LTH=5,                                       +        
               ATTR=(PROT)                                                      
TRPAVG2  DFLD  POS=(7,34),LTH=10,                                      +        
               ATTR=(PROT)                                                      
FG2      DFLD  POS=(7,48),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DGIA0013 DFLD  POS=(7,54),LTH=3,                                       +        
               ATTR=(PROT)                                                      
TRPFIR2  DFLD  POS=(7,62),LTH=15,                                      +        
               ATTR=(PROT)                                                      
TRPID3   DFLD  POS=(8,2),LTH=5,                                        +        
               ATTR=(PROT)                                                      
LASTTID3 DFLD  POS=(8,10),LTH=5,                                       +        
               ATTR=(PROT)                                                      
ADMFL3   DFLD  POS=(8,18),LTH=5,                                       +        
               ATTR=(PROT)                                                      
ADMEL3   DFLD  POS=(8,26),LTH=5,                                       +        
               ATTR=(PROT)                                                      
TRPAVG3  DFLD  POS=(8,34),LTH=10,                                      +        
               ATTR=(PROT)                                                      
FG3      DFLD  POS=(8,48),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DGIA0014 DFLD  POS=(8,54),LTH=3,                                       +        
               ATTR=(PROT)                                                      
TRPFIR3  DFLD  POS=(8,62),LTH=15,                                      +        
               ATTR=(PROT)                                                      
TRPID4   DFLD  POS=(9,2),LTH=5,                                        +        
               ATTR=(PROT)                                                      
LASTTID4 DFLD  POS=(9,10),LTH=5,                                       +        
               ATTR=(PROT)                                                      
ADMFL4   DFLD  POS=(9,18),LTH=5,                                       +        
               ATTR=(PROT)                                                      
ADMEL4   DFLD  POS=(9,26),LTH=5,                                       +        
               ATTR=(PROT)                                                      
TRPAVG4  DFLD  POS=(9,34),LTH=10,                                      +        
               ATTR=(PROT)                                                      
FG4      DFLD  POS=(9,48),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DGIA0015 DFLD  POS=(9,54),LTH=3,                                       +        
               ATTR=(PROT)                                                      
TRPFIR4  DFLD  POS=(9,62),LTH=15,                                      +        
               ATTR=(PROT)                                                      
TRPID5   DFLD  POS=(10,2),LTH=5,                                       +        
               ATTR=(PROT)                                                      
LASTTID5 DFLD  POS=(10,10),LTH=5,                                      +        
               ATTR=(PROT)                                                      
ADMFL5   DFLD  POS=(10,18),LTH=5,                                      +        
               ATTR=(PROT)                                                      
ADMEL5   DFLD  POS=(10,26),LTH=5,                                      +        
               ATTR=(PROT)                                                      
TRPAVG5  DFLD  POS=(10,34),LTH=10,                                     +        
               ATTR=(PROT)                                                      
FG5      DFLD  POS=(10,48),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0016 DFLD  POS=(10,54),LTH=3,                                      +        
               ATTR=(PROT)                                                      
TRPFIR5  DFLD  POS=(10,62),LTH=15,                                     +        
               ATTR=(PROT)                                                      
TRPID6   DFLD  POS=(11,2),LTH=5,                                       +        
               ATTR=(PROT)                                                      
LASTTID6 DFLD  POS=(11,10),LTH=5,                                      +        
               ATTR=(PROT)                                                      
ADMFL6   DFLD  POS=(11,18),LTH=5,                                      +        
               ATTR=(PROT)                                                      
ADMEL6   DFLD  POS=(11,26),LTH=5,                                      +        
               ATTR=(PROT)                                                      
TRPAVG6  DFLD  POS=(11,34),LTH=10,                                     +        
               ATTR=(PROT)                                                      
FG6      DFLD  POS=(11,48),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0017 DFLD  POS=(11,54),LTH=3,                                      +        
               ATTR=(PROT)                                                      
TRPFIR6  DFLD  POS=(11,62),LTH=15,                                     +        
               ATTR=(PROT)                                                      
TRPID7   DFLD  POS=(12,2),LTH=5,                                       +        
               ATTR=(PROT)                                                      
LASTTID7 DFLD  POS=(12,10),LTH=5,                                      +        
               ATTR=(PROT)                                                      
ADMFL7   DFLD  POS=(12,18),LTH=5,                                      +        
               ATTR=(PROT)                                                      
ADMEL7   DFLD  POS=(12,26),LTH=5,                                      +        
               ATTR=(PROT)                                                      
TRPAVG7  DFLD  POS=(12,34),LTH=10,                                     +        
               ATTR=(PROT)                                                      
FG7      DFLD  POS=(12,48),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0018 DFLD  POS=(12,54),LTH=3,                                      +        
               ATTR=(PROT)                                                      
TRPFIR7  DFLD  POS=(12,62),LTH=15,                                     +        
               ATTR=(PROT)                                                      
TRPID8   DFLD  POS=(13,2),LTH=5,                                       +        
               ATTR=(PROT)                                                      
LASTTID8 DFLD  POS=(13,10),LTH=5,                                      +        
               ATTR=(PROT)                                                      
ADMFL8   DFLD  POS=(13,18),LTH=5,                                      +        
               ATTR=(PROT)                                                      
ADMEL8   DFLD  POS=(13,26),LTH=5,                                      +        
               ATTR=(PROT)                                                      
TRPAVG8  DFLD  POS=(13,34),LTH=10,                                     +        
               ATTR=(PROT)                                                      
FG8      DFLD  POS=(13,48),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0019 DFLD  POS=(13,54),LTH=3,                                      +        
               ATTR=(PROT)                                                      
TRPFIR8  DFLD  POS=(13,62),LTH=15,                                     +        
               ATTR=(PROT)                                                      
TRPID9   DFLD  POS=(14,2),LTH=5,                                       +        
               ATTR=(PROT)                                                      
LASTTID9 DFLD  POS=(14,10),LTH=5,                                      +        
               ATTR=(PROT)                                                      
ADMFL9   DFLD  POS=(14,18),LTH=5,                                      +        
               ATTR=(PROT)                                                      
ADMEL9   DFLD  POS=(14,26),LTH=5,                                      +        
               ATTR=(PROT)                                                      
TRPAVG9  DFLD  POS=(14,34),LTH=10,                                     +        
               ATTR=(PROT)                                                      
FG9      DFLD  POS=(14,48),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0020 DFLD  POS=(14,54),LTH=3,                                      +        
               ATTR=(PROT)                                                      
TRPFIR9  DFLD  POS=(14,62),LTH=15,                                     +        
               ATTR=(PROT)                                                      
TRPID10  DFLD  POS=(15,2),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DGIA0002 DFLD  POS=(15,10),LTH=5,                                      +        
               ATTR=(PROT)                                                      
ADMFL10  DFLD  POS=(15,18),LTH=5,                                      +        
               ATTR=(PROT)                                                      
ADMEL10  DFLD  POS=(15,26),LTH=5,                                      +        
               ATTR=(PROT)                                                      
TRPAVG10 DFLD  POS=(15,34),LTH=10,                                     +        
               ATTR=(PROT)                                                      
FG10     DFLD  POS=(15,48),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0008 DFLD  POS=(15,54),LTH=3,                                      +        
               ATTR=(PROT)                                                      
TRPFIR10 DFLD  POS=(15,62),LTH=15,                                     +        
               ATTR=(PROT)                                                      
TRPID11  DFLD  POS=(16,2),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DGIA0003 DFLD  POS=(16,10),LTH=5,                                      +        
               ATTR=(PROT)                                                      
ADMFL11  DFLD  POS=(16,18),LTH=5,                                      +        
               ATTR=(PROT)                                                      
ADMEL11  DFLD  POS=(16,26),LTH=5,                                      +        
               ATTR=(PROT)                                                      
TRPAVG11 DFLD  POS=(16,34),LTH=10,                                     +        
               ATTR=(PROT)                                                      
FG11     DFLD  POS=(16,48),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0009 DFLD  POS=(16,54),LTH=3,                                      +        
               ATTR=(PROT)                                                      
TRPFIR11 DFLD  POS=(16,62),LTH=15,                                     +        
               ATTR=(PROT)                                                      
TRPID12  DFLD  POS=(17,2),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DGIA0004 DFLD  POS=(17,10),LTH=5,                                      +        
               ATTR=(PROT)                                                      
ADMFL12  DFLD  POS=(17,18),LTH=5,                                      +        
               ATTR=(PROT)                                                      
ADMEL12  DFLD  POS=(17,26),LTH=5,                                      +        
               ATTR=(PROT)                                                      
TRPAVG12 DFLD  POS=(17,34),LTH=10,                                     +        
               ATTR=(PROT)                                                      
FG12     DFLD  POS=(17,48),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0010 DFLD  POS=(17,54),LTH=3,                                      +        
               ATTR=(PROT)                                                      
TRPFIR12 DFLD  POS=(17,62),LTH=15,                                     +        
               ATTR=(PROT)                                                      
TRPID13  DFLD  POS=(18,2),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DGIA0005 DFLD  POS=(18,10),LTH=5,                                      +        
               ATTR=(PROT)                                                      
ADMFL13  DFLD  POS=(18,18),LTH=5,                                      +        
               ATTR=(PROT)                                                      
ADMEL13  DFLD  POS=(18,26),LTH=5,                                      +        
               ATTR=(PROT)                                                      
TRPAVG13 DFLD  POS=(18,34),LTH=10,                                     +        
               ATTR=(PROT)                                                      
FG13     DFLD  POS=(18,48),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0011 DFLD  POS=(18,54),LTH=3,                                      +        
               ATTR=(PROT)                                                      
TRPFIR13 DFLD  POS=(18,62),LTH=15,                                     +        
               ATTR=(PROT)                                                      
TRPID14  DFLD  POS=(19,2),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DGIA0006 DFLD  POS=(19,10),LTH=5,                                      +        
               ATTR=(PROT)                                                      
ADMFL14  DFLD  POS=(19,18),LTH=5,                                      +        
               ATTR=(PROT)                                                      
ADMEL14  DFLD  POS=(19,26),LTH=5,                                      +        
               ATTR=(PROT)                                                      
TRPAVG14 DFLD  POS=(19,34),LTH=10,                                     +        
               ATTR=(PROT)                                                      
FG14     DFLD  POS=(19,48),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0012 DFLD  POS=(19,54),LTH=3,                                      +        
               ATTR=(PROT)                                                      
TRPFIR14 DFLD  POS=(19,62),LTH=15,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '13 Q/U Transp  14 Query TRP/DST 15 Query DISTR 16',    +        
               POS=(21,2),LTH=49,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,65),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,17),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,49),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,65),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W4I582N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N582),                                           +        
               OPT=2,                                                  +        
               NXT=W4O582N1                                                     
MID      LPAGE SOR=(FORMAT),                                           +        
               NXT=W4O582N1                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F8'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '45822',                                                +        
               LTH=5                                                            
         MFLD  (DGIA0024,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0026,                                               +        
               LTH=5                                                            
         MFLD  (DGIA0000,                                              +        
               '+++++++++++++++'),                                     +        
               LTH=15,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  DGIA0001,                                               +        
               LTH=15                                                           
         MFLD  (DGIA0027,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  DGIA0028,                                               +        
               LTH=2                                                            
         MFLD  DGIA0025,                                               +        
               LTH=5                                                            
         MFLD  DGIA0022,                                               +        
               LTH=7                                                            
         MFLD  DGIA0023,                                               +        
               LTH=5                                                            
         MFLD  DGIA0021,                                               +        
               LTH=7                                                            
         MSGEND                                                                 
W4O582N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N582,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I582N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT,                                             +        
               NXT=W4I582N1                                                     
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  DGIA0024,                                               +        
               LTH=5                                                            
         MFLD  DGIA0026,                                               +        
               LTH=5                                                            
         MFLD  DGIA0000,                                               +        
               LTH=15                                                           
         MFLD  DGIA0001,                                               +        
               LTH=15                                                           
         MFLD  DGIA0027,                                               +        
               LTH=2                                                            
         MFLD  DGIA0028,                                               +        
               LTH=2                                                            
         MFLD  DGIA0025,                                               +        
               LTH=5                                                            
         MFLD  DGIA0022,                                               +        
               LTH=7                                                            
         MFLD  DGIA0023,                                               +        
               LTH=5                                                            
         MFLD  DGIA0021,                                               +        
               LTH=7                                                            
         MFLD  TRPID1,                                                 +        
               LTH=5                                                            
         MFLD  LASTTID1,                                               +        
               LTH=5                                                            
         MFLD  ADMFL1,                                                 +        
               LTH=5                                                            
         MFLD  ADMEL1,                                                 +        
               LTH=5                                                            
         MFLD  TRPAVG1,                                                +        
               LTH=10                                                           
         MFLD  FG1,                                                    +        
               LTH=1                                                            
         MFLD  DGIA0007,                                               +        
               LTH=3                                                            
         MFLD  TRPFIR1,                                                +        
               LTH=15                                                           
         MFLD  TRPID2,                                                 +        
               LTH=5                                                            
         MFLD  LASTTID2,                                               +        
               LTH=5                                                            
         MFLD  ADMFL2,                                                 +        
               LTH=5                                                            
         MFLD  ADMEL2,                                                 +        
               LTH=5                                                            
         MFLD  TRPAVG2,                                                +        
               LTH=10                                                           
         MFLD  FG2,                                                    +        
               LTH=1                                                            
         MFLD  DGIA0013,                                               +        
               LTH=3                                                            
         MFLD  TRPFIR2,                                                +        
               LTH=15                                                           
         MFLD  TRPID3,                                                 +        
               LTH=5                                                            
         MFLD  LASTTID3,                                               +        
               LTH=5                                                            
         MFLD  ADMFL3,                                                 +        
               LTH=5                                                            
         MFLD  ADMEL3,                                                 +        
               LTH=5                                                            
         MFLD  TRPAVG3,                                                +        
               LTH=10                                                           
         MFLD  FG3,                                                    +        
               LTH=1                                                            
         MFLD  DGIA0014,                                               +        
               LTH=3                                                            
         MFLD  TRPFIR3,                                                +        
               LTH=15                                                           
         MFLD  TRPID4,                                                 +        
               LTH=5                                                            
         MFLD  LASTTID4,                                               +        
               LTH=5                                                            
         MFLD  ADMFL4,                                                 +        
               LTH=5                                                            
         MFLD  ADMEL4,                                                 +        
               LTH=5                                                            
         MFLD  TRPAVG4,                                                +        
               LTH=10                                                           
         MFLD  FG4,                                                    +        
               LTH=1                                                            
         MFLD  DGIA0015,                                               +        
               LTH=3                                                            
         MFLD  TRPFIR4,                                                +        
               LTH=15                                                           
         MFLD  TRPID5,                                                 +        
               LTH=5                                                            
         MFLD  LASTTID5,                                               +        
               LTH=5                                                            
         MFLD  ADMFL5,                                                 +        
               LTH=5                                                            
         MFLD  ADMEL5,                                                 +        
               LTH=5                                                            
         MFLD  TRPAVG5,                                                +        
               LTH=10                                                           
         MFLD  FG5,                                                    +        
               LTH=1                                                            
         MFLD  DGIA0016,                                               +        
               LTH=3                                                            
         MFLD  TRPFIR5,                                                +        
               LTH=15                                                           
         MFLD  TRPID6,                                                 +        
               LTH=5                                                            
         MFLD  LASTTID6,                                               +        
               LTH=5                                                            
         MFLD  ADMFL6,                                                 +        
               LTH=5                                                            
         MFLD  ADMEL6,                                                 +        
               LTH=5                                                            
         MFLD  TRPAVG6,                                                +        
               LTH=10                                                           
         MFLD  FG6,                                                    +        
               LTH=1                                                            
         MFLD  DGIA0017,                                               +        
               LTH=3                                                            
         MFLD  TRPFIR6,                                                +        
               LTH=15                                                           
         MFLD  TRPID7,                                                 +        
               LTH=5                                                            
         MFLD  LASTTID7,                                               +        
               LTH=5                                                            
         MFLD  ADMFL7,                                                 +        
               LTH=5                                                            
         MFLD  ADMEL7,                                                 +        
               LTH=5                                                            
         MFLD  TRPAVG7,                                                +        
               LTH=10                                                           
         MFLD  FG7,                                                    +        
               LTH=1                                                            
         MFLD  DGIA0018,                                               +        
               LTH=3                                                            
         MFLD  TRPFIR7,                                                +        
               LTH=15                                                           
         MFLD  TRPID8,                                                 +        
               LTH=5                                                            
         MFLD  LASTTID8,                                               +        
               LTH=5                                                            
         MFLD  ADMFL8,                                                 +        
               LTH=5                                                            
         MFLD  ADMEL8,                                                 +        
               LTH=5                                                            
         MFLD  TRPAVG8,                                                +        
               LTH=10                                                           
         MFLD  FG8,                                                    +        
               LTH=1                                                            
         MFLD  DGIA0019,                                               +        
               LTH=3                                                            
         MFLD  TRPFIR8,                                                +        
               LTH=15                                                           
         MFLD  TRPID9,                                                 +        
               LTH=5                                                            
         MFLD  LASTTID9,                                               +        
               LTH=5                                                            
         MFLD  ADMFL9,                                                 +        
               LTH=5                                                            
         MFLD  ADMEL9,                                                 +        
               LTH=5                                                            
         MFLD  TRPAVG9,                                                +        
               LTH=10                                                           
         MFLD  FG9,                                                    +        
               LTH=1                                                            
         MFLD  DGIA0020,                                               +        
               LTH=3                                                            
         MFLD  TRPFIR9,                                                +        
               LTH=15                                                           
         MFLD  TRPID10,                                                +        
               LTH=5                                                            
         MFLD  DGIA0002,                                               +        
               LTH=5                                                            
         MFLD  ADMFL10,                                                +        
               LTH=5                                                            
         MFLD  ADMEL10,                                                +        
               LTH=5                                                            
         MFLD  TRPAVG10,                                               +        
               LTH=10                                                           
         MFLD  FG10,                                                   +        
               LTH=1                                                            
         MFLD  DGIA0008,                                               +        
               LTH=3                                                            
         MFLD  TRPFIR10,                                               +        
               LTH=15                                                           
         MFLD  TRPID11,                                                +        
               LTH=5                                                            
         MFLD  DGIA0003,                                               +        
               LTH=5                                                            
         MFLD  ADMFL11,                                                +        
               LTH=5                                                            
         MFLD  ADMEL11,                                                +        
               LTH=5                                                            
         MFLD  TRPAVG11,                                               +        
               LTH=10                                                           
         MFLD  FG11,                                                   +        
               LTH=1                                                            
         MFLD  DGIA0009,                                               +        
               LTH=3                                                            
         MFLD  TRPFIR11,                                               +        
               LTH=15                                                           
         MFLD  TRPID12,                                                +        
               LTH=5                                                            
         MFLD  DGIA0004,                                               +        
               LTH=5                                                            
         MFLD  ADMFL12,                                                +        
               LTH=5                                                            
         MFLD  ADMEL12,                                                +        
               LTH=5                                                            
         MFLD  TRPAVG12,                                               +        
               LTH=10                                                           
         MFLD  FG12,                                                   +        
               LTH=1                                                            
         MFLD  DGIA0010,                                               +        
               LTH=3                                                            
         MFLD  TRPFIR12,                                               +        
               LTH=15                                                           
         MFLD  TRPID13,                                                +        
               LTH=5                                                            
         MFLD  DGIA0005,                                               +        
               LTH=5                                                            
         MFLD  ADMFL13,                                                +        
               LTH=5                                                            
         MFLD  ADMEL13,                                                +        
               LTH=5                                                            
         MFLD  TRPAVG13,                                               +        
               LTH=10                                                           
         MFLD  FG13,                                                   +        
               LTH=1                                                            
         MFLD  DGIA0011,                                               +        
               LTH=3                                                            
         MFLD  TRPFIR13,                                               +        
               LTH=15                                                           
         MFLD  TRPID14,                                                +        
               LTH=5                                                            
         MFLD  DGIA0006,                                               +        
               LTH=5                                                            
         MFLD  ADMFL14,                                                +        
               LTH=5                                                            
         MFLD  ADMEL14,                                                +        
               LTH=5                                                            
         MFLD  TRPAVG14,                                               +        
               LTH=10                                                           
         MFLD  FG14,                                                   +        
               LTH=1                                                            
         MFLD  DGIA0012,                                               +        
               LTH=3                                                            
         MFLD  TRPFIR14,                                               +        
               LTH=15                                                           
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
