***********************************************************************         
* CREATED BY PCC4448   ON 94/11/11  AT 14:13                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE '                                '                               
W4N542   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W4T542 7',                                           +        
               8='W4T542 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T541  ',                                          +        
               14='W4T542  ',                                          +        
               15='W4T543  ',                                          +        
               16='W4T544  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W4T542  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W4N542   DPAGE CURSOR=((2,8)),                                         +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'QUERY SHIPMENT 2   ',                                  +        
               POS=(1,13),LTH=19,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Distr',                                                +        
               POS=(2,2),LTH=5,                                        +        
               ATTR=(ALPHA,PROT)                                                
FLD0208  DFLD  POS=(2,8),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Cust',                                                 +        
               POS=(2,13),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0220  DFLD  POS=(2,20),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Shipment',                                             +        
               POS=(2,27),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0237  DFLD  POS=(2,37),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Prod',                                                 +        
               POS=(2,50),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FLD0257  DFLD  POS=(2,57),LTH=7,                                       +        
               ATTR=(ALPHA,NOPROT)                                              
         DFLD  'DC',                                                   +        
               POS=(2,66),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDDCIN   DFLD  POS=(2,69),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
FLD0308  DFLD  POS=(3,8),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
FLD0320  DFLD  POS=(3,20),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0337  DFLD  POS=(3,37),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0357  DFLD  POS=(3,57),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
IDDCUT   DFLD  POS=(3,69),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0402  DFLD  POS=(4,2),LTH=7,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0410  DFLD  POS=(4,10),LTH=7,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0418  DFLD  POS=(4,18),LTH=5,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0424  DFLD  POS=(4,24),LTH=5,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'Prod-case Invoice   Carr-type Carrier name Freight bill+        
                   Load No. Load date',                                +        
               POS=(5,4),LTH=77,                                       +        
               ATTR=(PROT)                                                      
FLD0602  DFLD  POS=(6,2),LTH=76,                                       +        
               ATTR=(PROT)                                                      
FLD0702  DFLD  POS=(7,2),LTH=76,                                       +        
               ATTR=(PROT)                                                      
FLD0802  DFLD  POS=(8,2),LTH=76,                                       +        
               ATTR=(PROT)                                                      
FLD0902  DFLD  POS=(9,2),LTH=76,                                       +        
               ATTR=(PROT)                                                      
FLD1002  DFLD  POS=(10,2),LTH=76,                                      +        
               ATTR=(PROT)                                                      
FLD1102  DFLD  POS=(11,2),LTH=76,                                      +        
               ATTR=(PROT)                                                      
FLD1202  DFLD  POS=(12,2),LTH=76,                                      +        
               ATTR=(PROT)                                                      
FLD1302  DFLD  POS=(13,2),LTH=76,                                      +        
               ATTR=(PROT)                                                      
FLD1402  DFLD  POS=(14,2),LTH=76,                                      +        
               ATTR=(PROT)                                                      
FLD1502  DFLD  POS=(15,2),LTH=76,                                      +        
               ATTR=(PROT)                                                      
FLD1602  DFLD  POS=(16,2),LTH=76,                                      +        
               ATTR=(PROT)                                                      
FLD1702  DFLD  POS=(17,2),LTH=76,                                      +        
               ATTR=(PROT)                                                      
FLD1802  DFLD  POS=(18,2),LTH=76,                                      +        
               ATTR=(PROT)                                                      
FLD1902  DFLD  POS=(19,2),LTH=76,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '13 Query ship 1 14 Query ship 2 15 Q dist/ship  16 Q di+        
               st/trp   17',                                           +        
               POS=(21,2),LTH=66,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W4O542N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N542,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I542N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W4N542                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  FLD0208,                                                +        
               LTH=4                                                            
         MFLD  FLD0308,                                                +        
               LTH=4                                                            
         MFLD  FLD0220,                                                +        
               LTH=6                                                            
         MFLD  FLD0320,                                                +        
               LTH=6                                                            
         MFLD  FLD0237,                                                +        
               LTH=9                                                            
         MFLD  FLD0337,                                                +        
               LTH=9                                                            
         MFLD  FLD0257,                                                +        
               LTH=7                                                            
         MFLD  FLD0357,                                                +        
               LTH=7                                                            
         MFLD  IDDCIN,                                                 +        
               LTH=2                                                            
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  FLD0402,                                                +        
               LTH=7                                                            
         MFLD  FLD0410,                                                +        
               LTH=7                                                            
         MFLD  FLD0418,                                                +        
               LTH=5                                                            
         MFLD  FLD0424,                                                +        
               LTH=5                                                            
         MFLD  FLD0602,                                                +        
               LTH=76                                                           
         MFLD  FLD0702,                                                +        
               LTH=76                                                           
         MFLD  FLD0802,                                                +        
               LTH=76                                                           
         MFLD  FLD0902,                                                +        
               LTH=76                                                           
         MFLD  FLD1002,                                                +        
               LTH=76                                                           
         MFLD  FLD1102,                                                +        
               LTH=76                                                           
         MFLD  FLD1202,                                                +        
               LTH=76                                                           
         MFLD  FLD1302,                                                +        
               LTH=76                                                           
         MFLD  FLD1402,                                                +        
               LTH=76                                                           
         MFLD  FLD1502,                                                +        
               LTH=76                                                           
         MFLD  FLD1602,                                                +        
               LTH=76                                                           
         MFLD  FLD1702,                                                +        
               LTH=76                                                           
         MFLD  FLD1802,                                                +        
               LTH=76                                                           
         MFLD  FLD1902,                                                +        
               LTH=76                                                           
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  FSYSMSG,                                                +        
               LTH=79                                                           
         MSGEND                                                                 
W4I542N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N542),                                           +        
               OPT=2,                                                  +        
               NXT=W4O542N1                                                     
MID      LPAGE SOR=(W4N542)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '45422',                                                +        
               LTH=5                                                            
         MFLD  (FLD0208,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0308,                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0220,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0320,                                                +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0237,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0337,                                                +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDDCIN,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDDCUT,                                                 +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0257,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0357,                                                +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0402,                                                +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0410,                                                +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0418,                                                +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0424,                                                +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
