         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'LDC Backorder Release'                                          
W4N578   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W4T578 7',                                           +        
               8='W4T578 8',                                           +        
               9='W4T578 9',                                           +        
               10='WHELP   ',                                          +        
               11='W4T578U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W4N578   DPAGE CURSOR=((3,11)),                                        +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'LDC Backorder Release',                                +        
               POS=(1,10),LTH=21,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=38,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'District',                                             +        
               POS=(03,02),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DISTIN   DFLD  POS=(03,11),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
DISTUT   DFLD  POS=(04,11),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  'Customer',                                             +        
               POS=(3,16),LTH=8,                                       +        
               ATTR=(PROT)                                                      
KUNDIN   DFLD  POS=(3,25),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
KUNDUT   DFLD  POS=(4,25),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  'Part Number',                                          +        
               POS=(3,33),LTH=11,                                      +        
               ATTR=(PROT)                                                      
ARTIN    DFLD  POS=(3,45),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
ARTUT    DFLD  POS=(4,45),LTH=9,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  'DG Y/N',                                               +        
               POS=(3,55),LTH=6,                                       +        
               ATTR=(PROT)                                                      
KDFARLIN DFLD  POS=(3,62),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
KDFARLUT DFLD  POS=(4,62),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'DC11 RFS',                                             +        
               POS=(3,64),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DC11RFSI DFLD  POS=(3,73),LTH=6,                                       +        
               ATTR=(NOPROT)                                                    
DC11RFSU DFLD  POS=(4,73),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
*                                                                               
*Rader                                                                          
*                                                                               
         DFLD  'CMD',                                                  +        
               POS=(06,01),LTH=3,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Dist',                                                 +        
               POS=(06,05),LTH=4,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '  Cust',                                               +        
               POS=(06,10),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '   PartNo',                                            +        
               POS=(06,17),LTH=9,                                      +        
               ATTR=(PROT)                                                      
         DFLD  ' Qty',                                                 +        
               POS=(06,27),LTH=4,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Order',                                                +        
               POS=(06,32),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Cl',                                                   +        
               POS=(06,38),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'DG',                                                   +        
               POS=(06,44),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'DC11',                                                 +        
               POS=(05,48),LTH=4,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'RFS',                                                  +        
               POS=(06,48),LTH=3,                                      +        
               ATTR=(PROT)                                                      
RUBVAR   DFLD  POS=(06,54),LTH=6,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
         DFLD  'Rep dt',                                               +        
               POS=(06,61),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Work order',                                           +        
               POS=(06,68),LTH=10,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'DC',                                                   +        
               POS=(06,79),LTH=2,                                      +        
               ATTR=(PROT)                                                      
CMD01    DFLD  POS=(08,02),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
DIST01   DFLD  POS=(08,05),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KUND01   DFLD  POS=(08,10),LTH=6,                                      +        
               ATTR=(PROT)                                                      
ART01    DFLD  POS=(08,17),LTH=9,                                      +        
               ATTR=(PROT)                                                      
BEART01  DFLD  POS=(08,27),LTH=4,                                      +        
               ATTR=(PROT)                                                      
ORDER01  DFLD  POS=(08,32),LTH=5,                                      +        
               ATTR=(PROT)                                                      
ORDKL01  DFLD  POS=(08,39),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
KFARLI01 DFLD  POS=(08,45),LTH=1,                                      +        
               ATTR=(PROT)                                                      
RFS01    DFLD  POS=(08,47),LTH=6,                                      +        
               ATTR=(PROT)                                                      
RFSLDC01 DFLD  POS=(08,54),LTH=6,                                      +        
               ATTR=(PROT)                                                      
REPDAT01 DFLD  POS=(08,61),LTH=6,                                      +        
               ATTR=(PROT)                                                      
KUNDRF01 DFLD  POS=(08,68),LTH=10,                                     +        
               ATTR=(PROT)                                                      
DC01    DFLD  POS=(08,79),LTH=2,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'WH',                                                   +        
               POS=(09,02),LTH=2,                                      +        
               ATTR=(PROT)                                                      
WHTXT01  DFLD  POS=(09,05),LTH=60,                                     +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Note',                                                 +        
               POS=(09,66),LTH=4,                                      +        
               ATTR=(PROT)                                                      
TEXT01   DFLD  POS=(09,71),LTH=10,                                     +        
               ATTR=(NOPROT,MOD)                                                
CMD02    DFLD  POS=(10,02),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
DIST02   DFLD  POS=(10,05),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KUND02   DFLD  POS=(10,10),LTH=6,                                      +        
               ATTR=(PROT)                                                      
ART02    DFLD  POS=(10,17),LTH=9,                                      +        
               ATTR=(PROT)                                                      
BEART02  DFLD  POS=(10,27),LTH=4,                                      +        
               ATTR=(PROT)                                                      
ORDER02  DFLD  POS=(10,32),LTH=5,                                      +        
               ATTR=(PROT)                                                      
ORDKL02  DFLD  POS=(10,39),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
KFARLI02 DFLD  POS=(10,45),LTH=1,                                      +        
               ATTR=(PROT)                                                      
RFS02    DFLD  POS=(10,47),LTH=6,                                      +        
               ATTR=(PROT)                                                      
RFSLDC02 DFLD  POS=(10,54),LTH=6,                                      +        
               ATTR=(PROT)                                                      
REPDAT02 DFLD  POS=(10,61),LTH=6,                                      +        
               ATTR=(PROT)                                                      
KUNDRF02 DFLD  POS=(10,68),LTH=10,                                     +        
               ATTR=(PROT)                                                      
DC02    DFLD  POS=(10,79),LTH=2,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'WH',                                                   +        
               POS=(11,02),LTH=2,                                      +        
               ATTR=(PROT)                                                      
WHTXT02  DFLD  POS=(11,05),LTH=60,                                     +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Note',                                                 +        
               POS=(11,66),LTH=4,                                      +        
               ATTR=(PROT)                                                      
TEXT02   DFLD  POS=(11,71),LTH=10,                                     +        
               ATTR=(NOPROT,MOD)                                                
CMD03    DFLD  POS=(12,02),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
DIST03   DFLD  POS=(12,05),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KUND03   DFLD  POS=(12,10),LTH=6,                                      +        
               ATTR=(PROT)                                                      
ART03    DFLD  POS=(12,17),LTH=9,                                      +        
               ATTR=(PROT)                                                      
BEART03  DFLD  POS=(12,27),LTH=4,                                      +        
               ATTR=(PROT)                                                      
ORDER03  DFLD  POS=(12,32),LTH=5,                                      +        
               ATTR=(PROT)                                                      
ORDKL03  DFLD  POS=(12,39),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
KFARLI03 DFLD  POS=(12,45),LTH=1,                                      +        
               ATTR=(PROT)                                                      
RFS03    DFLD  POS=(12,47),LTH=6,                                      +        
               ATTR=(PROT)                                                      
RFSLDC03 DFLD  POS=(12,54),LTH=6,                                      +        
               ATTR=(PROT)                                                      
REPDAT03 DFLD  POS=(12,61),LTH=6,                                      +        
               ATTR=(PROT)                                                      
KUNDRF03 DFLD  POS=(12,68),LTH=10,                                     +        
               ATTR=(PROT)                                                      
DC03    DFLD  POS=(12,79),LTH=2,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'WH',                                                   +        
               POS=(13,02),LTH=2,                                      +        
               ATTR=(PROT)                                                      
WHTXT03  DFLD  POS=(13,05),LTH=60,                                     +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Note',                                                 +        
               POS=(13,66),LTH=4,                                      +        
               ATTR=(PROT)                                                      
TEXT03   DFLD  POS=(13,71),LTH=10,                                     +        
               ATTR=(NOPROT,MOD)                                                
CMD04    DFLD  POS=(14,02),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
DIST04   DFLD  POS=(14,05),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KUND04   DFLD  POS=(14,10),LTH=6,                                      +        
               ATTR=(PROT)                                                      
ART04    DFLD  POS=(14,17),LTH=9,                                      +        
               ATTR=(PROT)                                                      
BEART04  DFLD  POS=(14,27),LTH=4,                                      +        
               ATTR=(PROT)                                                      
ORDER04  DFLD  POS=(14,32),LTH=5,                                      +        
               ATTR=(PROT)                                                      
ORDKL04  DFLD  POS=(14,39),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
KFARLI04 DFLD  POS=(14,45),LTH=1,                                      +        
               ATTR=(PROT)                                                      
RFS04    DFLD  POS=(14,47),LTH=6,                                      +        
               ATTR=(PROT)                                                      
RFSLDC04 DFLD  POS=(14,54),LTH=6,                                      +        
               ATTR=(PROT)                                                      
REPDAT04 DFLD  POS=(14,61),LTH=6,                                      +        
               ATTR=(PROT)                                                      
KUNDRF04 DFLD  POS=(14,68),LTH=10,                                     +        
               ATTR=(PROT)                                                      
DC04    DFLD  POS=(14,79),LTH=2,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'WH',                                                   +        
               POS=(15,02),LTH=2,                                      +        
               ATTR=(PROT)                                                      
WHTXT04  DFLD  POS=(15,05),LTH=60,                                     +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Note',                                                 +        
               POS=(15,66),LTH=4,                                      +        
               ATTR=(PROT)                                                      
TEXT04   DFLD  POS=(15,71),LTH=10,                                     +        
               ATTR=(NOPROT,MOD)                                                
CMD05    DFLD  POS=(16,02),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
DIST05   DFLD  POS=(16,05),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KUND05   DFLD  POS=(16,10),LTH=6,                                      +        
               ATTR=(PROT)                                                      
ART05    DFLD  POS=(16,17),LTH=9,                                      +        
               ATTR=(PROT)                                                      
BEART05  DFLD  POS=(16,27),LTH=4,                                      +        
               ATTR=(PROT)                                                      
ORDER05  DFLD  POS=(16,32),LTH=5,                                      +        
               ATTR=(PROT)                                                      
ORDKL05  DFLD  POS=(16,39),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
KFARLI05 DFLD  POS=(16,45),LTH=1,                                      +        
               ATTR=(PROT)                                                      
RFS05    DFLD  POS=(16,47),LTH=6,                                      +        
               ATTR=(PROT)                                                      
RFSLDC05 DFLD  POS=(16,54),LTH=6,                                      +        
               ATTR=(PROT)                                                      
REPDAT05 DFLD  POS=(16,61),LTH=6,                                      +        
               ATTR=(PROT)                                                      
KUNDRF05 DFLD  POS=(16,68),LTH=10,                                     +        
               ATTR=(PROT)                                                      
DC05    DFLD  POS=(16,79),LTH=2,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'WH',                                                   +        
               POS=(17,02),LTH=2,                                      +        
               ATTR=(PROT)                                                      
WHTXT05  DFLD  POS=(17,05),LTH=60,                                     +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Note',                                                 +        
               POS=(17,66),LTH=4,                                      +        
               ATTR=(PROT)                                                      
TEXT05   DFLD  POS=(17,71),LTH=10,                                     +        
               ATTR=(NOPROT,MOD)                                                
CMD06    DFLD  POS=(18,02),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
DIST06   DFLD  POS=(18,05),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KUND06   DFLD  POS=(18,10),LTH=6,                                      +        
               ATTR=(PROT)                                                      
ART06    DFLD  POS=(18,17),LTH=9,                                      +        
               ATTR=(PROT)                                                      
BEART06  DFLD  POS=(18,27),LTH=4,                                      +        
               ATTR=(PROT)                                                      
ORDER06  DFLD  POS=(18,32),LTH=5,                                      +        
               ATTR=(PROT)                                                      
ORDKL06  DFLD  POS=(18,39),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
KFARLI06 DFLD  POS=(18,45),LTH=1,                                      +        
               ATTR=(PROT)                                                      
RFS06    DFLD  POS=(18,47),LTH=6,                                      +        
               ATTR=(PROT)                                                      
RFSLDC06 DFLD  POS=(18,54),LTH=6,                                      +        
               ATTR=(PROT)                                                      
REPDAT06 DFLD  POS=(18,61),LTH=6,                                      +        
               ATTR=(PROT)                                                      
KUNDRF06 DFLD  POS=(18,68),LTH=10,                                     +        
               ATTR=(PROT)                                                      
DC06    DFLD  POS=(18,79),LTH=2,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'WH',                                                   +        
               POS=(19,02),LTH=2,                                      +        
               ATTR=(PROT)                                                      
WHTXT06  DFLD  POS=(19,05),LTH=60,                                     +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Note',                                                 +        
               POS=(19,66),LTH=4,                                      +        
               ATTR=(PROT)                                                      
TEXT06   DFLD  POS=(19,71),LTH=10,                                     +        
               ATTR=(NOPROT,MOD)                                                
*                                                                               
*PF-Rader                                                                       
*                                                                               
         DFLD  'F7=First  F8=Next                   F10=WHELP  F11=Upda+        
               te',                                                    +        
               POS=(21,2),LTH=57,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4I578N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N578),                                           +        
               OPT=2,                                                  +        
               NXT=W4O578N1                                                     
MID      LPAGE SOR=(W4N578)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F7'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F8'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '45781',                                                +        
               LTH=5                                                            
         MFLD  (DISTIN,                                                +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KUNDIN,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTIN,                                                 +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDFARLIN,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DC11RFSI,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CMD01,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (ORDKL01,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (DC01,                                                  +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (WHTXT01,                                               +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++'),                                                +        
               LTH=60,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TEXT01,                                                +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (CMD02,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (ORDKL02,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (DC02,                                                  +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (WHTXT02,                                               +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++'),                                                +        
               LTH=60,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TEXT02,                                                +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (CMD03,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (ORDKL03,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (DC03,                                                  +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (WHTXT03,                                               +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++'),                                                +        
               LTH=60,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TEXT03,                                                +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (CMD04,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (ORDKL04,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (DC04,                                                  +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (WHTXT04,                                               +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++'),                                                +        
               LTH=60,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TEXT04,                                                +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (CMD05,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (ORDKL05,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (DC05,                                                  +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (WHTXT05,                                               +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++'),                                                +        
               LTH=60,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TEXT05,                                                +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (CMD06,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (ORDKL06,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (DC06,                                                  +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (WHTXT06,                                               +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++'),                                                +        
               LTH=60,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TEXT06,                                                +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  RUBVAR,                                                 +        
               LTH=6,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
W4O578N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N578,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I578N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W4N578                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  DISTIN,                                                 +        
               LTH=4                                                            
         MFLD  DISTUT,                                                 +        
               LTH=4                                                            
         MFLD  KUNDIN,                                                 +        
               LTH=6                                                            
         MFLD  KUNDUT,                                                 +        
               LTH=6                                                            
         MFLD  ARTIN,                                                  +        
               LTH=9                                                            
         MFLD  ARTUT,                                                  +        
               LTH=9                                                            
         MFLD  KDFARLIN,                                               +        
               LTH=1                                                            
         MFLD  KDFARLUT,                                               +        
               LTH=1                                                            
         MFLD  DC11RFSI,                                               +        
               LTH=6                                                            
         MFLD  DC11RFSU,                                               +        
               LTH=6                                                            
         MFLD  CMD01,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DIST01,                                                 +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KUND01,                                                 +        
               LTH=6                                                            
         MFLD  ART01,                                                  +        
               LTH=9                                                            
         MFLD  BEART01,                                                +        
               LTH=4                                                            
         MFLD  ORDER01,                                                +        
               LTH=5                                                            
         MFLD  ORDKL01,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KFARLI01,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RFS01,                                                  +        
               LTH=6                                                            
         MFLD  RFSLDC01,                                               +        
               LTH=6                                                            
         MFLD  REPDAT01,                                               +        
               LTH=6                                                            
         MFLD  KUNDRF01,                                               +        
               LTH=10                                                           
         MFLD  DC01,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  WHTXT01,                                                +        
               LTH=62,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TEXT01,                                                 +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  CMD02,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DIST02,                                                 +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KUND02,                                                 +        
               LTH=6                                                            
         MFLD  ART02,                                                  +        
               LTH=9                                                            
         MFLD  BEART02,                                                +        
               LTH=4                                                            
         MFLD  ORDER02,                                                +        
               LTH=5                                                            
         MFLD  ORDKL02,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KFARLI02,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RFS02,                                                  +        
               LTH=6                                                            
         MFLD  RFSLDC02,                                               +        
               LTH=6                                                            
         MFLD  REPDAT02,                                               +        
               LTH=6                                                            
         MFLD  KUNDRF02,                                               +        
               LTH=10                                                           
         MFLD  DC02,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  WHTXT02,                                                +        
               LTH=62,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TEXT02,                                                 +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  CMD03,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DIST03,                                                 +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KUND03,                                                 +        
               LTH=6                                                            
         MFLD  ART03,                                                  +        
               LTH=9                                                            
         MFLD  BEART03,                                                +        
               LTH=4                                                            
         MFLD  ORDER03,                                                +        
               LTH=5                                                            
         MFLD  ORDKL03,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KFARLI03,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RFS03,                                                  +        
               LTH=6                                                            
         MFLD  RFSLDC03,                                               +        
               LTH=6                                                            
         MFLD  REPDAT03,                                               +        
               LTH=6                                                            
         MFLD  KUNDRF03,                                               +        
               LTH=10                                                           
         MFLD  DC03,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  WHTXT03,                                                +        
               LTH=62,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TEXT03,                                                 +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  CMD04,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DIST04,                                                 +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KUND04,                                                 +        
               LTH=6                                                            
         MFLD  ART04,                                                  +        
               LTH=9                                                            
         MFLD  BEART04,                                                +        
               LTH=4                                                            
         MFLD  ORDER04,                                                +        
               LTH=5                                                            
         MFLD  ORDKL04,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KFARLI04,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RFS04,                                                  +        
               LTH=6                                                            
         MFLD  RFSLDC04,                                               +        
               LTH=6                                                            
         MFLD  REPDAT04,                                               +        
               LTH=6                                                            
         MFLD  KUNDRF04,                                               +        
               LTH=10                                                           
         MFLD  DC04,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  WHTXT04,                                                +        
               LTH=62,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TEXT04,                                                 +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  CMD05,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DIST05,                                                 +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KUND05,                                                 +        
               LTH=6                                                            
         MFLD  ART05,                                                  +        
               LTH=9                                                            
         MFLD  BEART05,                                                +        
               LTH=4                                                            
         MFLD  ORDER05,                                                +        
               LTH=5                                                            
         MFLD  ORDKL05,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KFARLI05,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RFS05,                                                  +        
               LTH=6                                                            
         MFLD  RFSLDC05,                                               +        
               LTH=6                                                            
         MFLD  REPDAT05,                                               +        
               LTH=6                                                            
         MFLD  KUNDRF05,                                               +        
               LTH=10                                                           
         MFLD  DC05,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  WHTXT05,                                                +        
               LTH=62,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TEXT05,                                                 +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  CMD06,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DIST06,                                                 +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KUND06,                                                 +        
               LTH=6                                                            
         MFLD  ART06,                                                  +        
               LTH=9                                                            
         MFLD  BEART06,                                                +        
               LTH=4                                                            
         MFLD  ORDER06,                                                +        
               LTH=5                                                            
         MFLD  ORDKL06,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KFARLI06,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RFS06,                                                  +        
               LTH=6                                                            
         MFLD  RFSLDC06,                                               +        
               LTH=6                                                            
         MFLD  REPDAT06,                                               +        
               LTH=6                                                            
         MFLD  KUNDRF06,                                               +        
               LTH=10                                                           
         MFLD  DC06,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  WHTXT06,                                                +        
               LTH=62,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TEXT06,                                                 +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  RUBVAR,                                                 +        
               LTH=6                                                            
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  FSYSMSG,                                                +        
               LTH=79                                                           
         MSGEND                                                                 
         END                                                                    
