***********************************************************************         
* CREATED BY PCC4448   ON 94/11/11  AT 15:41                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE '                                '                               
W4N591   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080'                                                     
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((7,23)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  'INVOICE SUPPLEMENT 1',                                 +        
               POS=(1,11),LTH=20,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'District',                                             +        
               POS=(3,2),LTH=8,                                        +        
               ATTR=(PROT)                                                      
FLD0311  DFLD  POS=(3,11),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Customer',                                             +        
               POS=(3,16),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0324  DFLD  POS=(3,25),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'FC',                                                   +        
               POS=(3,33),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FLD0335  DFLD  POS=(3,36),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Shipment',                                             +        
               POS=(3,41),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FLD0347  DFLD  POS=(3,50),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'DC',                                                   +        
               POS=(3,60),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDDC     DFLD  POS=(3,63),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0402  DFLD  POS=(4,2),LTH=3,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0406  DFLD  POS=(4,6),LTH=1,                                        +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
FLD0410  DFLD  POS=(4,10),LTH=1,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'Tot ord. val.',                                        +        
               POS=(5,2),LTH=13,                                       +        
               ATTR=(PROT)                                                      
FLD0515  DFLD  POS=(5,16),LTH=12,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Gross KG',                                             +        
               POS=(5,29),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0539  DFLD  POS=(5,38),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Gross M3',                                             +        
               POS=(5,47),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0559  DFLD  POS=(5,56),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'No. of cse',                                           +        
               POS=(5,65),LTH=10,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD0577  DFLD  POS=(5,77),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Batch invoice',                                        +        
               POS=(7,2),LTH=13,                                       +        
               ATTR=(PROT)                                                      
FLD0723  DFLD  POS=(7,23),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Load',                                                 +        
               POS=(7,53),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FLD0766  DFLD  POS=(7,66),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'L/C No.',                                              +        
               POS=(8,2),LTH=7,                                        +        
               ATTR=(PROT)                                                      
FLD0823  DFLD  POS=(8,23),LTH=15,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Licence No.',                                          +        
               POS=(8,53),LTH=11,                                      +        
               ATTR=(PROT)                                                      
FLD0866  DFLD  POS=(8,66),LTH=15,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Route, destination',                                   +        
               POS=(9,2),LTH=18,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0923  DFLD  POS=(9,23),LTH=25,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Contract No.',                                         +        
               POS=(9,53),LTH=12,                                      +        
               ATTR=(PROT)                                                      
FLD0966  DFLD  POS=(9,66),LTH=15,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Ref. to quotation',                                    +        
               POS=(10,2),LTH=17,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1023  DFLD  POS=(10,23),LTH=15,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'Booking No.',                                          +        
               POS=(10,53),LTH=11,                                     +        
               ATTR=(PROT)                                                      
FLD1066  DFLD  POS=(10,66),LTH=15,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'Shipment date',                                        +        
               POS=(11,2),LTH=13,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1123  DFLD  POS=(11,23),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Transp. name',                                         +        
               POS=(12,2),LTH=12,                                      +        
               ATTR=(PROT)                                                      
FLD1223  DFLD  POS=(12,23),LTH=15,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'Assurance in accordance with contract/LC',             +        
               POS=(15,2),LTH=40,                                      +        
               ATTR=(PROT)                                                      
FLD1702  DFLD  POS=(17,2),LTH=50,                                      +        
               ATTR=(NOPROT)                                                    
FLD1802  DFLD  POS=(18,2),LTH=50,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4O591N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N591,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I591N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  FLD0311,                                                +        
               LTH=4                                                            
         MFLD  FLD0324,                                                +        
               LTH=6                                                            
         MFLD  FLD0335,                                                +        
               LTH=2                                                            
         MFLD  FLD0347,                                                +        
               LTH=7                                                            
         MFLD  IDDC,                                                   +        
               LTH=2                                                            
         MFLD  FLD0402,                                                +        
               LTH=3                                                            
         MFLD  FLD0406,                                                +        
               LTH=1                                                            
         MFLD  FLD0410,                                                +        
               LTH=1                                                            
         MFLD  FLD0515,                                                +        
               LTH=12                                                           
         MFLD  FLD0539,                                                +        
               LTH=8                                                            
         MFLD  FLD0559,                                                +        
               LTH=8                                                            
         MFLD  FLD0577,                                                +        
               LTH=4                                                            
         MFLD  FLD0723,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0766,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0823,                                                +        
               LTH=17,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD0866,                                                +        
               LTH=17,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD0923,                                                +        
               LTH=27,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD0966,                                                +        
               LTH=17,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1023,                                                +        
               LTH=17,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1066,                                                +        
               LTH=17,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1123,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1223,                                                +        
               LTH=17,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1702,                                                +        
               LTH=52,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1802,                                                +        
               LTH=52,                                                 +        
               ATTR=(YES)                                                       
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I591N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N591),                                           +        
               OPT=2,                                                  +        
               NXT=W4O591N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F9'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '45912',                                                +        
               LTH=5                                                            
         MFLD  (FLD0311,                                               +        
               '    '),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0324,                                               +        
               '      '),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0335,                                               +        
               '  '),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0347,                                               +        
               '       '),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDDC,                                                  +        
               '  '),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0402,                                               +        
               '   '),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0406,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MFLD  (FLD0410,                                               +        
               'N'),                                                   +        
               LTH=1                                                            
         MFLD  FLD0515,                                                +        
               LTH=12,                                                 +        
               FILL=X'40'                                                       
         MFLD  FLD0539,                                                +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  FLD0559,                                                +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  FLD0577,                                                +        
               LTH=4,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0723,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0766,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0823,                                               +        
               '+++++++++++++++'),                                     +        
               LTH=15,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLD0866,                                               +        
               '+++++++++++++++'),                                     +        
               LTH=15,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLD0923,                                               +        
               '+++++++++++++++++++++++++'),                           +        
               LTH=25,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLD0966,                                               +        
               '+++++++++++++++'),                                     +        
               LTH=15,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLD1023,                                               +        
               '+++++++++++++++'),                                     +        
               LTH=15,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLD1066,                                               +        
               '+++++++++++++++'),                                     +        
               LTH=15,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLD1123,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD1223,                                               +        
               '+++++++++++++++'),                                     +        
               LTH=15,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLD1702,                                               +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++'),  +        
               LTH=50,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLD1802,                                               +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++'),  +        
               LTH=50,                                                 +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
