***********************************************************************         
* CREATED BY PC36147   ON 95/03/09  AT 15:27                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'QUERY/UPDATE TRANSPORT          '                               
W4N581   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W4T581 7',                                           +        
               8='W4T581 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T581U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T581  ',                                          +        
               14='W4T582  ',                                          +        
               15='W4T583  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((2,8)),                                         +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'QUERY/UPDATE TRANSPORT   ',                            +        
               POS=(1,12),LTH=25,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Trpid',                                                +        
               POS=(2,2),LTH=5,                                        +        
               ATTR=(ALPHA,PROT)                                                
IDTRPIN  DFLD  POS=(2,8),LTH=5,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Dest',                                                 +        
               POS=(2,15),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0004 DFLD  POS=(2,20),LTH=15,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'DC',                                                   +        
               POS=(2,37),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DGIA0061 DFLD  POS=(2,40),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
IDTRPUT  DFLD  POS=(3,8),LTH=5,                                        +        
               ATTR=(PROT,MOD)                                                  
DGIA0005 DFLD  POS=(3,20),LTH=15,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0062 DFLD  POS=(3,40),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0037 DFLD  POS=(4,2),LTH=7,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0035 DFLD  POS=(4,10),LTH=7,                                       +        
               ATTR=(ALPHA,PROT,NODISP,MOD)                                     
         DFLD  'Loadtime(HH.MM)  Adm. bl (HH.MM)  Adm. al (HH.MM)  Dest+        
               ination',                                               +        
               POS=(5,2),LTH=62,                                       +        
               ATTR=(PROT)                                                      
DGIA0019 DFLD  POS=(6,4),LTH=5,                                        +        
               ATTR=(NUM,NOPROT)                                                
DGIA0020 DFLD  POS=(6,10),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0002 DFLD  POS=(6,21),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0003 DFLD  POS=(6,27),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0000 DFLD  POS=(6,38),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0001 DFLD  POS=(6,44),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0006 DFLD  POS=(6,53),LTH=15,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Remove ?',                                             +        
               POS=(6,70),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DGIA0034 DFLD  POS=(6,79),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  '(WW D HH MM)   Transporter',                           +        
               POS=(7,1),LTH=26,                                       +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  'H',                                                    +        
               POS=(7,35),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Vol',                                                  +        
               POS=(7,41),LTH=3,                                       +        
               ATTR=(PROT)                                                      
DGIA0038 DFLD  POS=(8,2),LTH=10,                                       +        
               ATTR=(PROT)                                                      
DGIA0050 DFLD  POS=(8,16),LTH=15,                                      +        
               ATTR=(PROT)                                                      
DGIA0008 DFLD  POS=(8,35),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DGIA0022 DFLD  POS=(8,41),LTH=3,                                       +        
               ATTR=(PROT)                                                      
DGIA0039 DFLD  POS=(9,2),LTH=10,                                       +        
               ATTR=(PROT)                                                      
DGIA0051 DFLD  POS=(9,16),LTH=15,                                      +        
               ATTR=(PROT)                                                      
DGIA0009 DFLD  POS=(9,35),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DGIA0023 DFLD  POS=(9,41),LTH=3,                                       +        
               ATTR=(PROT)                                                      
DGIA0041 DFLD  POS=(10,2),LTH=10,                                      +        
               ATTR=(PROT)                                                      
DGIA0053 DFLD  POS=(10,16),LTH=15,                                     +        
               ATTR=(PROT)                                                      
DGIA0011 DFLD  POS=(10,35),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0025 DFLD  POS=(10,41),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0042 DFLD  POS=(11,2),LTH=10,                                      +        
               ATTR=(PROT)                                                      
DGIA0054 DFLD  POS=(11,16),LTH=15,                                     +        
               ATTR=(PROT)                                                      
DGIA0012 DFLD  POS=(11,35),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0026 DFLD  POS=(11,41),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0043 DFLD  POS=(12,2),LTH=10,                                      +        
               ATTR=(PROT)                                                      
DGIA0055 DFLD  POS=(12,16),LTH=15,                                     +        
               ATTR=(PROT)                                                      
DGIA0013 DFLD  POS=(12,35),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0027 DFLD  POS=(12,41),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0044 DFLD  POS=(13,2),LTH=10,                                      +        
               ATTR=(PROT)                                                      
DGIA0056 DFLD  POS=(13,16),LTH=15,                                     +        
               ATTR=(PROT)                                                      
DGIA0014 DFLD  POS=(13,35),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0028 DFLD  POS=(13,41),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0045 DFLD  POS=(14,2),LTH=10,                                      +        
               ATTR=(PROT)                                                      
DGIA0057 DFLD  POS=(14,16),LTH=15,                                     +        
               ATTR=(PROT)                                                      
DGIA0015 DFLD  POS=(14,35),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0029 DFLD  POS=(14,41),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0046 DFLD  POS=(15,2),LTH=10,                                      +        
               ATTR=(PROT)                                                      
DGIA0058 DFLD  POS=(15,16),LTH=15,                                     +        
               ATTR=(PROT)                                                      
DGIA0016 DFLD  POS=(15,35),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0030 DFLD  POS=(15,41),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0047 DFLD  POS=(16,2),LTH=10,                                      +        
               ATTR=(PROT)                                                      
DGIA0059 DFLD  POS=(16,16),LTH=15,                                     +        
               ATTR=(PROT)                                                      
DGIA0017 DFLD  POS=(16,35),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0031 DFLD  POS=(16,41),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0048 DFLD  POS=(17,2),LTH=10,                                      +        
               ATTR=(PROT)                                                      
DGIA0060 DFLD  POS=(17,16),LTH=15,                                     +        
               ATTR=(PROT)                                                      
DGIA0018 DFLD  POS=(17,35),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0032 DFLD  POS=(17,41),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0040 DFLD  POS=(18,2),LTH=10,                                      +        
               ATTR=(PROT)                                                      
DGIA0052 DFLD  POS=(18,16),LTH=15,                                     +        
               ATTR=(PROT)                                                      
DGIA0010 DFLD  POS=(18,35),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0024 DFLD  POS=(18,41),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0036 DFLD  POS=(19,5),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0049 DFLD  POS=(19,16),LTH=15,                                     +        
               ATTR=(NOPROT)                                                    
DGIA0007 DFLD  POS=(19,35),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0021 DFLD  POS=(19,41),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Remove ?(Y)',                                          +        
               POS=(19,47),LTH=11,                                     +        
               ATTR=(PROT)                                                      
DGIA0033 DFLD  POS=(19,59),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  '13 Q/U Transp  14 Query TRP/DST 15 Query DISTR 16',    +        
               POS=(21,2),LTH=49,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,17),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,49),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W4I581N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N581),                                           +        
               OPT=2,                                                  +        
               NXT=W4O581N1                                                     
MID      LPAGE SOR=(FORMAT),                                           +        
               NXT=W4O581N1                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F8'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '45812',                                                +        
               LTH=5                                                            
         MFLD  (IDTRPIN,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDTRPUT,                                                +        
               LTH=5                                                            
         MFLD  (DGIA0004,                                              +        
               '+++++++++++++++'),                                     +        
               LTH=15,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  DGIA0005,                                               +        
               LTH=15                                                           
         MFLD  (DGIA0061,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  DGIA0062,                                               +        
               LTH=2                                                            
         MFLD  DGIA0037,                                               +        
               LTH=7                                                            
         MFLD  DGIA0035,                                               +        
               LTH=7                                                            
         MFLD  (DGIA0019,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0002,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0000,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0006,                                              +        
               '+++++++++++++++'),                                     +        
               LTH=15,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0034,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (DGIA0036,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0049,                                              +        
               '+++++++++++++++'),                                     +        
               LTH=15,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0007,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (DGIA0021,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0033,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4O581N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N581,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I581N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT,                                             +        
               NXT=W4I581N1                                                     
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDTRPIN,                                                +        
               LTH=5                                                            
         MFLD  IDTRPUT,                                                +        
               LTH=5                                                            
         MFLD  DGIA0004,                                               +        
               LTH=15                                                           
         MFLD  DGIA0005,                                               +        
               LTH=15                                                           
         MFLD  DGIA0061,                                               +        
               LTH=2                                                            
         MFLD  DGIA0062,                                               +        
               LTH=2                                                            
         MFLD  DGIA0037,                                               +        
               LTH=7                                                            
         MFLD  DGIA0035,                                               +        
               LTH=7                                                            
         MFLD  DGIA0019,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0020,                                               +        
               LTH=5                                                            
         MFLD  DGIA0002,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0003,                                               +        
               LTH=5                                                            
         MFLD  DGIA0000,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0001,                                               +        
               LTH=5                                                            
         MFLD  DGIA0006,                                               +        
               LTH=17,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0034,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0038,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0050,                                               +        
               LTH=17,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0008,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0022,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0039,                                               +        
               LTH=10                                                           
         MFLD  DGIA0051,                                               +        
               LTH=15                                                           
         MFLD  DGIA0009,                                               +        
               LTH=1                                                            
         MFLD  DGIA0023,                                               +        
               LTH=3                                                            
         MFLD  DGIA0041,                                               +        
               LTH=10                                                           
         MFLD  DGIA0053,                                               +        
               LTH=15                                                           
         MFLD  DGIA0011,                                               +        
               LTH=1                                                            
         MFLD  DGIA0025,                                               +        
               LTH=3                                                            
         MFLD  DGIA0042,                                               +        
               LTH=10                                                           
         MFLD  DGIA0054,                                               +        
               LTH=15                                                           
         MFLD  DGIA0012,                                               +        
               LTH=1                                                            
         MFLD  DGIA0026,                                               +        
               LTH=3                                                            
         MFLD  DGIA0043,                                               +        
               LTH=10                                                           
         MFLD  DGIA0055,                                               +        
               LTH=15                                                           
         MFLD  DGIA0013,                                               +        
               LTH=1                                                            
         MFLD  DGIA0027,                                               +        
               LTH=3                                                            
         MFLD  DGIA0044,                                               +        
               LTH=10                                                           
         MFLD  DGIA0056,                                               +        
               LTH=15                                                           
         MFLD  DGIA0014,                                               +        
               LTH=1                                                            
         MFLD  DGIA0028,                                               +        
               LTH=3                                                            
         MFLD  DGIA0045,                                               +        
               LTH=10                                                           
         MFLD  DGIA0057,                                               +        
               LTH=15                                                           
         MFLD  DGIA0015,                                               +        
               LTH=1                                                            
         MFLD  DGIA0029,                                               +        
               LTH=3                                                            
         MFLD  DGIA0046,                                               +        
               LTH=10                                                           
         MFLD  DGIA0058,                                               +        
               LTH=15                                                           
         MFLD  DGIA0016,                                               +        
               LTH=1                                                            
         MFLD  DGIA0030,                                               +        
               LTH=3                                                            
         MFLD  DGIA0047,                                               +        
               LTH=10                                                           
         MFLD  DGIA0059,                                               +        
               LTH=15                                                           
         MFLD  DGIA0017,                                               +        
               LTH=1                                                            
         MFLD  DGIA0031,                                               +        
               LTH=3                                                            
         MFLD  DGIA0048,                                               +        
               LTH=10                                                           
         MFLD  DGIA0060,                                               +        
               LTH=15                                                           
         MFLD  DGIA0018,                                               +        
               LTH=1                                                            
         MFLD  DGIA0032,                                               +        
               LTH=3                                                            
         MFLD  DGIA0040,                                               +        
               LTH=10                                                           
         MFLD  DGIA0052,                                               +        
               LTH=15                                                           
         MFLD  DGIA0010,                                               +        
               LTH=1                                                            
         MFLD  DGIA0024,                                               +        
               LTH=3                                                            
         MFLD  DGIA0036,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0049,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0007,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0021,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0033,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
