***********************************************************************         
* CREATED BY PC30174   ON 93/05/14  AT 15:44                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'VAL FÖR TULLTRANSAR             '                               
W4N538   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W4T538 7',                                           +        
               8='W4T538 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T538U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T531  ',                                          +        
               14='W4T532  ',                                          +        
               15='W4T533  ',                                          +        
               16='W4T534  ',                                          +        
               17='W4T535  ',                                          +        
               18='W4T536  ',                                          +        
               19='W4T537  ',                                          +        
               20='W4T538  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W4N538   DPAGE CURSOR=((2,8)),                                         +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'CUSTOMS ID SELECTION',                                 +        
               POS=(1,11),LTH=20,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Distr',                                                +        
               POS=(2,2),LTH=5,                                        +        
               ATTR=(ALPHA,PROT)                                                
IDDISTRI DFLD  POS=(2,8),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Invoice',                                              +        
               POS=(2,29),LTH=7,                                       +        
               ATTR=(PROT)                                                      
IDFAKTI  DFLD  POS=(2,38),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
IDDISTRU DFLD  POS=(3,8),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
IDFAKTU  DFLD  POS=(3,38),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0012 DFLD  POS=(4,2),LTH=6,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0006 DFLD  POS=(4,9),LTH=2,                                        +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0020 DFLD  POS=(4,12),LTH=7,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0002 DFLD  POS=(4,20),LTH=7,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0016 DFLD  POS=(4,28),LTH=5,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0010 DFLD  POS=(4,34),LTH=5,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0014 DFLD  POS=(4,40),LTH=6,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0008 DFLD  POS=(4,47),LTH=2,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0022 DFLD  POS=(4,50),LTH=7,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0004 DFLD  POS=(4,58),LTH=7,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0017 DFLD  POS=(4,66),LTH=5,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0011 DFLD  POS=(4,72),LTH=5,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
         DFLD  'Trp type:',                                            +        
               POS=(5,2),LTH=9,                                        +        
               ATTR=(PROT)                                                      
KDTRPT   DFLD  POS=(5,12),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
KDTRPTU  DFLD  POS=(5,14),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  '(1=Ship,2=Train,3=Truck,4=Air)',                       +        
               POS=(5,16),LTH=30,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'FCL:',                                                 +        
               POS=(5,48),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FLCONT   DFLD  POS=(5,53),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
FLCONTU  DFLD  POS=(5,55),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  '(Y/N)',                                                +        
               POS=(5,57),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Carrier:',                                             +        
               POS=(6,2),LTH=8,                                        +        
               ATTR=(PROT)                                                      
IDLBBETU DFLD  POS=(6,12),LTH=12,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Book. no:',                                            +        
               POS=(6,29),LTH=9,                                       +        
               ATTR=(PROT)                                                      
IDBOKNU  DFLD  POS=(6,39),LTH=15,                                      +        
               ATTR=(PROT)                                                      
DGIA0018 DFLD  POS=(6,66),LTH=7,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0019 DFLD  POS=(6,74),LTH=7,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
IDLBBETI DFLD  POS=(7,12),LTH=12,                                      +        
               ATTR=(NOPROT)                                                    
IDBOKNI  DFLD  POS=(7,39),LTH=15,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Release:',                                             +        
               POS=(7,61),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FLSLUT   DFLD  POS=(7,70),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  '(Y/N)',                                                +        
               POS=(7,72),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Vehicle No:',                                          +        
               POS=(8,2),LTH=11,                                       +        
               ATTR=(PROT)                                                      
IDFORD   DFLD  POS=(8,14),LTH=30,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Invoice   Inv.dat Dist',                               +        
               POS=(9,2),LTH=22,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Cust Order Case  Cl Spec Prodno',                      +        
               POS=(9,27),LTH=31,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Reldat Reltime Status',                                +        
               POS=(9,59),LTH=21,                                      +        
               ATTR=(PROT)                                                      
         DO    9,SUF=10                                                         
FAKT1    DFLD  POS=(10,2),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
FAKTD1   DFLD  POS=(10,13),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DISTR1   DFLD  POS=(10,20),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KUND1    DFLD  POS=(10,25),LTH=6,                                      +        
               ATTR=(PROT)                                                      
ORDER1   DFLD  POS=(10,32),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
KOLLI1   DFLD  POS=(10,38),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
KLASS1   DFLD  POS=(10,45),LTH=1,                                      +        
               ATTR=(PROT)                                                      
SPECO1   DFLD  POS=(10,48),LTH=1,                                      +        
               ATTR=(PROT)                                                      
PRODNR1  DFLD  POS=(10,51),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
TIREGD1  DFLD  POS=(10,59),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TIREGT1  DFLD  POS=(10,67),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FLKLAR1 DFLD  POS=(10,75),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         ENDDO                                                                  
         DFLD  'Delete:',                                              +        
               POS=(19,61),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FLBORT   DFLD  POS=(19,69),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  '(B/D)',                                                +        
               POS=(19,71),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  '1 Query cases   2 Cross cases   3 Loading rel.  4 Backo+        
               ut load. 5 Inv. rel.',                                  +        
               POS=(21,2),LTH=75,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '6 Backout inv.  7',                                    +        
               POS=(22,2),LTH=17,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '8',                                                    +        
               POS=(22,34),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '9',                                                    +        
               POS=(22,50),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  ' VCAS',POS=(23,58)                                              
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W4I538N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N538),                                           +        
               OPT=2,                                                  +        
               NXT=W4O538N1                                                     
MID      LPAGE SOR=(W4N538),                                           +        
               NXT=W4O538N1                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F8'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '45382',                                                +        
               LTH=5                                                            
         MFLD  (IDDISTRI,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDDISTRU,                                               +        
               LTH=4,                                                  +        
               FILL=X'40'                                                       
         MFLD  (IDFAKTI,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDFAKTU,                                                +        
               LTH=7,                                                  +        
               FILL=X'40'                                                       
         MFLD  DGIA0012,                                               +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  DGIA0006,                                               +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  DGIA0020,                                               +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  DGIA0002,                                               +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  DGIA0016,                                               +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  DGIA0010,                                               +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  DGIA0018,                                               +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  DGIA0014,                                               +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  DGIA0008,                                               +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  DGIA0022,                                               +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  DGIA0004,                                               +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  DGIA0017,                                               +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  DGIA0011,                                               +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  DGIA0019,                                               +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (KDTRPTU,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLCONTU,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDLBBETU,                                              +        
               '++++++++++++'),                                        +        
               LTH=12,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDBOKNU,                                               +        
               '+++++++++++++++'),                                     +        
               LTH=15,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLSLUT,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (FLBORT,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (KDTRPT,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (FLCONT,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  IDLBBETI,                                               +        
               LTH=12,                                                 +        
               FILL=X'40'                                                       
         MFLD  IDBOKNI,                                                +        
               LTH=15,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDFORD,                                                +        
               '++++++++++++++++++++++++++++++'),                      +        
               LTH=30,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         DO    9,SUF=10                                                +        
         MFLD  FAKT1,                                                  +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  ORDER1,                                                 +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  KOLLI1,                                                 +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  PRODNR1,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         ENDDO                                                                  
         MSGEND                                                                 
W4O538N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N538,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I538N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W4N538,                                             +        
               NXT=W4I538N1                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  IDDISTRI,                                               +        
               LTH=4                                                            
         MFLD  IDFAKTI,                                                +        
               LTH=7                                                            
         MFLD  IDDISTRU,                                               +        
               LTH=4                                                            
         MFLD  IDFAKTU,                                                +        
               LTH=7                                                            
         MFLD  DGIA0012,                                               +        
               LTH=6                                                            
         MFLD  DGIA0006,                                               +        
               LTH=2                                                            
         MFLD  DGIA0020,                                               +        
               LTH=7                                                            
         MFLD  DGIA0002,                                               +        
               LTH=7                                                            
         MFLD  DGIA0016,                                               +        
               LTH=5                                                            
         MFLD  DGIA0010,                                               +        
               LTH=5                                                            
         MFLD  DGIA0018,                                               +        
               LTH=7                                                            
         MFLD  DGIA0014,                                               +        
               LTH=6                                                            
         MFLD  DGIA0008,                                               +        
               LTH=2                                                            
         MFLD  DGIA0022,                                               +        
               LTH=7                                                            
         MFLD  DGIA0004,                                               +        
               LTH=7                                                            
         MFLD  DGIA0017,                                               +        
               LTH=5                                                            
         MFLD  DGIA0011,                                               +        
               LTH=5                                                            
         MFLD  DGIA0019,                                               +        
               LTH=7                                                            
         MFLD  FLSLUT,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLBORT,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDTRPT,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLCONT,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDLBBETI,                                               +        
               LTH=14,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDBOKNI,                                                +        
               LTH=17,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDFORD,                                                 +        
               LTH=32,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDTRPTU,                                                +        
               LTH=1                                                            
         MFLD  FLCONTU,                                                +        
               LTH=1                                                            
         MFLD  IDLBBETU,                                               +        
               LTH=12                                                           
         MFLD  IDBOKNU,                                                +        
               LTH=15                                                           
         DO    9,SUF=10                                                         
         MFLD  FAKT1,                                                  +        
               LTH=9                                                            
         MFLD  FAKTD1,                                                 +        
               LTH=6                                                            
         MFLD  DISTR1,                                                 +        
               LTH=4                                                            
         MFLD  KUND1,                                                  +        
               LTH=6                                                            
         MFLD  ORDER1,                                                 +        
               LTH=5                                                            
         MFLD  KOLLI1,                                                 +        
               LTH=5                                                            
         MFLD  KLASS1,                                                 +        
               LTH=1                                                            
         MFLD  SPECO1,                                                 +        
               LTH=1                                                            
         MFLD  PRODNR1,                                                +        
               LTH=7                                                            
         MFLD  TIREGD1,                                                +        
               LTH=6                                                            
         MFLD  TIREGT1,                                                +        
               LTH=5                                                            
         MFLD  FLKLAR1,                                                +        
               LTH=1                                                            
         ENDDO                                                                  
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
