***********************************************************************         
* CREATED BY PC38450   ON 94/11/28  AT 16:51                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'FRÅGA PÅ ORDER VÄRDE            '                               
W4N503   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T501  ',                                          +        
               14='W4T502  ',                                          +        
               15='W4T503  ',                                          +        
               16='W4T504  ',                                          +        
               17='W4T505  ',                                          +        
               18='W4T506  ',                                          +        
               19='W4T507  ',                                          +        
               20='W4T508  ',                                          +        
               21='W4T509  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((2,7)),                                         +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'QUERY ORDER VALUE   ',                                 +        
               POS=(1,12),LTH=20,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Dist',                                                 +        
               POS=(2,2),LTH=4,                                        +        
               ATTR=(ALPHA,PROT)                                                
IDDISTRI DFLD  POS=(2,7),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Cust',                                                 +        
               POS=(2,12),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
IDKUNDNI DFLD  POS=(2,17),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Order',                                                +        
               POS=(2,24),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
IDORDNRI DFLD  POS=(2,30),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Part',                                                 +        
               POS=(2,38),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
IDARTIN  DFLD  POS=(2,43),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Cse',                                                  +        
               POS=(2,53),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0000 DFLD  POS=(2,57),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Prod',                                                 +        
               POS=(2,63),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0005 DFLD  POS=(2,68),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DC',                                                   +        
               POS=(2,76),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
IDDCI    DFLD  POS=(2,79),LTH=2,                                       +        
               ATTR=(ALPHA,NOPROT)                                              
         DFLD  ' ',                                                    +        
               POS=(3,2),LTH=1,                                        +        
               ATTR=(ALPHA)                                                     
IDDISTRU DFLD  POS=(3,7),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
IDKUNDNU DFLD  POS=(3,17),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
IDORDNRU DFLD  POS=(3,30),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
IDARTUT  DFLD  POS=(3,43),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0001 DFLD  POS=(3,57),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0002 DFLD  POS=(3,68),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
IDDCU    DFLD  POS=(3,79),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
TEDDI    DFLD  POS=(4,70),LTH=11,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Cust ref',                                             +        
               POS=(6,2),LTH=8,                                        +        
               ATTR=(PROT)                                                      
BEKUNDRF DFLD  POS=(6,11),LTH=15,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Campaign ref',                                         +        
               POS=(6,28),LTH=12,                                      +        
               ATTR=(PROT)                                                      
IDKAMPRF DFLD  POS=(6,41),LTH=7,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Reg date',                                             +        
               POS=(7,2),LTH=8,                                        +        
               ATTR=(PROT)                                                      
TIREGDAT DFLD  POS=(7,11),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'time',                                                 +        
               POS=(7,18),LTH=4,                                       +        
               ATTR=(ALPHA,PROT)                                                
TIREGTID DFLD  POS=(7,23),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Start',                                                +        
               POS=(7,29),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'RFS',                                                  +        
               POS=(6,49),LTH=3,                                       +        
               ATTR=(PROT)                                                      
TIRFS    DFLD  POS=(6,58),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'TrpId',                                                +        
               POS=(6,65),LTH=5,                                       +        
               ATTR=(PROT)                                                      
IDTRP    DFLD  POS=(6,71),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Dep date',                                             +        
               POS=(7,49),LTH=8,                                       +        
               ATTR=(PROT)                                                      
TIAAMMDD DFLD  POS=(7,58),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'time',                                                 +        
               POS=(7,65),LTH=4,                                       +        
               ATTR=(ALPHA,PROT)                                                
TIHHMM   DFLD  POS=(7,71),LTH=5,                                       +        
               ATTR=(PROT)                                                      
TIREGDAS DFLD  POS=(8,11),LTH=6,                                       +        
               ATTR=(PROT)                                                      
TIREGTIS DFLD  POS=(8,23),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'End',                                                  +        
               POS=(8,29),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'R.date',                                               +        
               POS=(8,49),LTH=6,                                       +        
               ATTR=(PROT)                                                      
TIREPDAT DFLD  POS=(8,58),LTH=6,                                       +        
               ATTR=(PROT)                                                      
IDLEVNR  DFLD  POS=(8,65),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Total registered',                                     +        
               POS=(9,2),LTH=16,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Type',                                                 +        
               POS=(9,49),LTH=4,                                       +        
               ATTR=(PROT)                                                      
KDORDTYP DFLD  POS=(9,58),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Value',                                                +        
               POS=(10,2),LTH=5,                                       +        
               ATTR=(PROT)                                                      
KDVALISO DFLD  POS=(10,08),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0004 DFLD  POS=(10,18),LTH=12,                                     +        
               ATTR=(PROT)                                                      
ASTERIX1 DFLD  POS=(10,31),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'No. of order lines',                                   +        
               POS=(10,35),LTH=18,                                     +        
               ATTR=(PROT)                                                      
DGIA0003 DFLD  POS=(10,56),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Value status U',                                       +        
               POS=(11,2),LTH=14,                                      +        
               ATTR=(PROT)                                                      
SUORDVU  DFLD  POS=(11,18),LTH=12,                                     +        
               ATTR=(PROT)                                                      
ASTERIX2 DFLD  POS=(11,31),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'P',                                                    +        
               POS=(12,15),LTH=1,                                      +        
               ATTR=(PROT)                                                      
SUORDVP  DFLD  POS=(12,18),LTH=12,                                     +        
               ATTR=(PROT)                                                      
ASTERIX3 DFLD  POS=(12,31),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Case lines status P',                                  +        
               POS=(12,35),LTH=19,                                     +        
               ATTR=(PROT)                                                      
KVRADERP DFLD  POS=(12,56),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'S/F',                                                  +        
               POS=(13,13),LTH=3,                                      +        
               ATTR=(PROT)                                                      
SUORDVF  DFLD  POS=(13,18),LTH=12,                                     +        
               ATTR=(PROT)                                                      
ASTERIX4 DFLD  POS=(13,31),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'S/F',                                                  +        
               POS=(13,51),LTH=3,                                      +        
               ATTR=(PROT)                                                      
KVRADERF DFLD  POS=(13,56),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'L',                                                    +        
               POS=(14,15),LTH=1,                                      +        
               ATTR=(PROT)                                                      
SUORDVL  DFLD  POS=(14,18),LTH=12,                                     +        
               ATTR=(PROT)                                                      
ASTERIX5 DFLD  POS=(14,31),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'L',                                                    +        
               POS=(14,53),LTH=1,                                      +        
               ATTR=(PROT)                                                      
KVRADERL DFLD  POS=(14,56),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Invoice Date',                                         +        
               POS=(16,2),LTH=12,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Invoice Date',                                         +        
               POS=(16,20),LTH=12,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Invoice Date',                                         +        
               POS=(16,38),LTH=12,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Invoice Date',                                         +        
               POS=(16,56),LTH=12,                                     +        
               ATTR=(PROT)                                                      
IDFAKT1  DFLD  POS=(17,2),LTH=7,                                       +        
               ATTR=(PROT)                                                      
TIFAKT1  DFLD  POS=(17,10),LTH=6,                                      +        
               ATTR=(PROT)                                                      
IDFAKT4  DFLD  POS=(17,20),LTH=7,                                      +        
               ATTR=(PROT)                                                      
TIFAKT4  DFLD  POS=(17,28),LTH=6,                                      +        
               ATTR=(PROT)                                                      
IDFAKT7  DFLD  POS=(17,38),LTH=7,                                      +        
               ATTR=(PROT)                                                      
TIFAKT7  DFLD  POS=(17,46),LTH=6,                                      +        
               ATTR=(PROT)                                                      
IDFAKT10 DFLD  POS=(17,56),LTH=7,                                      +        
               ATTR=(PROT)                                                      
TIFAKT10 DFLD  POS=(17,64),LTH=6,                                      +        
               ATTR=(PROT)                                                      
IDFAKT2  DFLD  POS=(18,2),LTH=7,                                       +        
               ATTR=(PROT)                                                      
TIFAKT2  DFLD  POS=(18,10),LTH=6,                                      +        
               ATTR=(PROT)                                                      
IDFAKT5  DFLD  POS=(18,20),LTH=7,                                      +        
               ATTR=(PROT)                                                      
TIFAKT5  DFLD  POS=(18,28),LTH=6,                                      +        
               ATTR=(PROT)                                                      
IDFAKT8  DFLD  POS=(18,38),LTH=7,                                      +        
               ATTR=(PROT)                                                      
TIFAKT8  DFLD  POS=(18,46),LTH=6,                                      +        
               ATTR=(PROT)                                                      
IDFAKT11 DFLD  POS=(18,56),LTH=7,                                      +        
               ATTR=(PROT)                                                      
TIFAKT11 DFLD  POS=(18,64),LTH=6,                                      +        
               ATTR=(PROT)                                                      
IDFAKT3  DFLD  POS=(19,2),LTH=7,                                       +        
               ATTR=(PROT)                                                      
TIFAKT3  DFLD  POS=(19,10),LTH=6,                                      +        
               ATTR=(PROT)                                                      
IDFAKT6  DFLD  POS=(19,20),LTH=7,                                      +        
               ATTR=(PROT)                                                      
TIFAKT6  DFLD  POS=(19,28),LTH=6,                                      +        
               ATTR=(PROT)                                                      
IDFAKT9  DFLD  POS=(19,38),LTH=7,                                      +        
               ATTR=(PROT)                                                      
TIFAKT9  DFLD  POS=(19,46),LTH=6,                                      +        
               ATTR=(PROT)                                                      
IDFAKT12 DFLD  POS=(19,56),LTH=7,                                      +        
               ATTR=(PROT)                                                      
TIFAKT12 DFLD  POS=(19,64),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '13 Gen order   14 Order part   15 Order value 16 Order +        
               cust info 17 Pack/load',                                +        
               POS=(21,2),LTH=77,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18 Cases load  19 Archive PU   20 Cases',              +        
               POS=(22,2),LTH=39,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21 Part info',                                         +        
               POS=(22,48),LTH=12,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,67),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4I503N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N503),                                           +        
               OPT=2,                                                  +        
               NXT=W4O503N1                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '45032',                                                +        
               LTH=5                                                            
         MFLD  (IDDISTRI,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDDISTRU,                                              +        
               '   '),                                                 +        
               LTH=4                                                            
         MFLD  (IDKUNDNI,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDKUNDNU,                                              +        
               '   '),                                                 +        
               LTH=6                                                            
         MFLD  (IDORDNRI,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDORDNRU,                                              +        
               '   '),                                                 +        
               LTH=7                                                            
         MFLD  (IDARTIN,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDARTUT,                                                +        
               LTH=9                                                            
         MFLD  (DGIA0000,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0001,                                               +        
               LTH=5                                                            
         MFLD  (DGIA0005,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0002,                                               +        
               LTH=7                                                            
         MFLD  (IDDCI,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDDCU,                                                 +        
               '  '),                                                  +        
               LTH=2                                                            
         MSGEND                                                                 
W4O503N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N503,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I503N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDDISTRI,                                               +        
               LTH=2                                                            
         MFLD  IDDISTRU,                                               +        
               LTH=4                                                            
         MFLD  IDKUNDNI,                                               +        
               LTH=2                                                            
         MFLD  IDKUNDNU,                                               +        
               LTH=6                                                            
         MFLD  IDORDNRI,                                               +        
               LTH=2                                                            
         MFLD  IDORDNRU,                                               +        
               LTH=7                                                            
         MFLD  IDARTIN,                                                +        
               LTH=2                                                            
         MFLD  IDARTUT,                                                +        
               LTH=9                                                            
         MFLD  DGIA0000,                                               +        
               LTH=2                                                            
         MFLD  DGIA0001,                                               +        
               LTH=5                                                            
         MFLD  DGIA0005,                                               +        
               LTH=2                                                            
         MFLD  DGIA0002,                                               +        
               LTH=7                                                            
         MFLD  IDDCI,                                                  +        
               LTH=2                                                            
         MFLD  IDDCU,                                                  +        
               LTH=2                                                            
         MFLD  TEDDI,                                                  +        
               LTH=11                                                           
         MFLD  BEKUNDRF,                                               +        
               LTH=15                                                           
         MFLD  IDKAMPRF,                                               +        
               LTH=7                                                            
         MFLD  TIREGDAT,                                               +        
               LTH=6                                                            
         MFLD  TIREGTID,                                               +        
               LTH=5                                                            
         MFLD  TIRFS,                                                  +        
               LTH=6                                                            
         MFLD  IDTRP,                                                  +        
               LTH=5                                                            
         MFLD  TIAAMMDD,                                               +        
               LTH=6                                                            
         MFLD  TIHHMM,                                                 +        
               LTH=5                                                            
         MFLD  TIREGDAS,                                               +        
               LTH=6                                                            
         MFLD  TIREGTIS,                                               +        
               LTH=5                                                            
         MFLD  TIREPDAT,                                               +        
               LTH=6                                                            
         MFLD  IDLEVNR,                                                +        
               LTH=5                                                            
         MFLD  KDORDTYP,                                               +        
               LTH=2                                                            
         MFLD  KDVALISO,                                               +        
               LTH=3                                                            
         MFLD  DGIA0004,                                               +        
               LTH=12                                                           
         MFLD  ASTERIX1,                                               +        
               LTH=1                                                            
         MFLD  DGIA0003,                                               +        
               LTH=5                                                            
         MFLD  SUORDVU,                                                +        
               LTH=12                                                           
         MFLD  ASTERIX2,                                               +        
               LTH=1                                                            
         MFLD  SUORDVP,                                                +        
               LTH=12                                                           
         MFLD  ASTERIX3,                                               +        
               LTH=1                                                            
         MFLD  KVRADERP,                                               +        
               LTH=5                                                            
         MFLD  SUORDVF,                                                +        
               LTH=12                                                           
         MFLD  ASTERIX4,                                               +        
               LTH=1                                                            
         MFLD  KVRADERF,                                               +        
               LTH=5                                                            
         MFLD  SUORDVL,                                                +        
               LTH=12                                                           
         MFLD  ASTERIX5,                                               +        
               LTH=1                                                            
         MFLD  KVRADERL,                                               +        
               LTH=5                                                            
         MFLD  IDFAKT1,                                                +        
               LTH=7                                                            
         MFLD  TIFAKT1,                                                +        
               LTH=6                                                            
         MFLD  IDFAKT4,                                                +        
               LTH=7                                                            
         MFLD  TIFAKT4,                                                +        
               LTH=6                                                            
         MFLD  IDFAKT7,                                                +        
               LTH=7                                                            
         MFLD  TIFAKT7,                                                +        
               LTH=6                                                            
         MFLD  IDFAKT10,                                               +        
               LTH=7                                                            
         MFLD  TIFAKT10,                                               +        
               LTH=6                                                            
         MFLD  IDFAKT2,                                                +        
               LTH=7                                                            
         MFLD  TIFAKT2,                                                +        
               LTH=6                                                            
         MFLD  IDFAKT5,                                                +        
               LTH=7                                                            
         MFLD  TIFAKT5,                                                +        
               LTH=6                                                            
         MFLD  IDFAKT8,                                                +        
               LTH=7                                                            
         MFLD  TIFAKT8,                                                +        
               LTH=6                                                            
         MFLD  IDFAKT11,                                               +        
               LTH=7                                                            
         MFLD  TIFAKT11,                                               +        
               LTH=6                                                            
         MFLD  IDFAKT3,                                                +        
               LTH=7                                                            
         MFLD  TIFAKT3,                                                +        
               LTH=6                                                            
         MFLD  IDFAKT6,                                                +        
               LTH=7                                                            
         MFLD  TIFAKT6,                                                +        
               LTH=6                                                            
         MFLD  IDFAKT9,                                                +        
               LTH=7                                                            
         MFLD  TIFAKT9,                                                +        
               LTH=6                                                            
         MFLD  IDFAKT12,                                               +        
               LTH=7                                                            
         MFLD  TIFAKT12,                                               +        
               LTH=6                                                            
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
