***********************************************************************         
* CREATED BY V077376   ON 02/03/22  AT 12:46                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE '                                '                               
W4N572   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W4T572 7',                                           +        
               8='W4T572 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T572U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T571  ',                                          +        
               14='W4T572  ',                                          +        
               15='W4T573  ',                                          +        
               16='W4T571  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W4T572  ',                                          +        
               24='  RCL.  ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,8)),                                         +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'UPDATE BO/TPO',                                        +        
               POS=(1,12),LTH=13,                                      +        
               ATTR=(PROT)                                                      
FLD0136  DFLD  POS=(1,36),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Distr',                                                +        
               POS=(2,2),LTH=5,                                        +        
               ATTR=(PROT)                                                      
FLD0208  DFLD  POS=(2,8),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Cust',                                                 +        
               POS=(2,13),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0218  DFLD  POS=(2,18),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Partno',                                               +        
               POS=(2,25),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0233  DFLD  POS=(2,33),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Cl',                                                   +        
               POS=(2,43),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0246  DFLD  POS=(2,46),LTH=1,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Pr',                                                   +        
               POS=(2,48),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0251  DFLD  POS=(2,51),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Order',                                                +        
               POS=(2,54),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0260  DFLD  POS=(2,60),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'TPO',                                                  +        
               POS=(2,66),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0270  DFLD  POS=(2,70),LTH=1,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DC',                                                   +        
               POS=(2,72),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0275  DFLD  POS=(2,75),LTH=2,                                       +        
               ATTR=(ALPHA,NOPROT)                                              
FLD0308  DFLD  POS=(3,8),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
FLD0318  DFLD  POS=(3,18),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0333  DFLD  POS=(3,33),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0346  DFLD  POS=(3,46),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0351  DFLD  POS=(3,51),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0360  DFLD  POS=(3,60),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0370  DFLD  POS=(3,70),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0375  DFLD  POS=(3,75),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0402  DFLD  POS=(4,2),LTH=4,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0407  DFLD  POS=(4,7),LTH=6,                                        +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
FLD0415  DFLD  POS=(4,15),LTH=9,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0425  DFLD  POS=(4,25),LTH=1,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
FLD0427  DFLD  POS=(4,27),LTH=2,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
FLD0430  DFLD  POS=(4,30),LTH=5,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
FLD0436  DFLD  POS=(4,36),LTH=1,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
FLD0438  DFLD  POS=(4,38),LTH=6,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
FLD0445  DFLD  POS=(4,45),LTH=2,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
FLD0448  DFLD  POS=(4,48),LTH=2,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
FLD0451  DFLD  POS=(4,51),LTH=26,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
TEDDI    DFLD  POS=(4,78),LTH=3,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  'A   Cust    Partno',                                   +        
               POS=(5,2),LTH=18,                                       +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Qty Order Cl  Fk TPOdate    Fob.net',                  +        
               POS=(5,25),LTH=35,                                      +        
               ATTR=(PROT)                                                      
KDVALISO DFLD  POS=(5,61),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Qpack Pri DC',                                         +        
               POS=(5,65),LTH=12,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD0621  DFLD  POS=(6,21),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FLD0636  DFLD  POS=(6,36),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0639  DFLD  POS=(6,39),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FLD0650  DFLD  POS=(6,50),LTH=10,                                      +        
               ATTR=(PROT)                                                      
COL0207  DFLD  POS=(7,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
COL0407  DFLD  POS=(7,4),LTH=6,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
COL1107  DFLD  POS=(7,11),LTH=9,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL2107  DFLD  POS=(7,21),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL2907  DFLD  POS=(7,29),LTH=5,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL3607  DFLD  POS=(7,36),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
COL3807  DFLD  POS=(7,38),LTH=3,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL4307  DFLD  POS=(7,43),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
COL5007  DFLD  POS=(7,50),LTH=10,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL6107  DFLD  POS=(7,61),LTH=1,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL6507  DFLD  POS=(7,65),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
COL7107  DFLD  POS=(7,71),LTH=3,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL7507  DFLD  POS=(7,75),LTH=2,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL0208  DFLD  POS=(8,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
COL0408  DFLD  POS=(8,4),LTH=6,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
COL1108  DFLD  POS=(8,11),LTH=9,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL2108  DFLD  POS=(8,21),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL2908  DFLD  POS=(8,29),LTH=5,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL3608  DFLD  POS=(8,36),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
COL3808  DFLD  POS=(8,38),LTH=3,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL4308  DFLD  POS=(8,43),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
COL5008  DFLD  POS=(8,50),LTH=10,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL6108  DFLD  POS=(8,61),LTH=1,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL6508  DFLD  POS=(8,65),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
COL7108  DFLD  POS=(8,71),LTH=3,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL7508  DFLD  POS=(8,75),LTH=2,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL0209  DFLD  POS=(9,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
COL0409  DFLD  POS=(9,4),LTH=6,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
COL1109  DFLD  POS=(9,11),LTH=9,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL2109  DFLD  POS=(9,21),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL2909  DFLD  POS=(9,29),LTH=5,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL3609  DFLD  POS=(9,36),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
COL3809  DFLD  POS=(9,38),LTH=3,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL4309  DFLD  POS=(9,43),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
COL5009  DFLD  POS=(9,50),LTH=10,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL6109  DFLD  POS=(9,61),LTH=1,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL6509  DFLD  POS=(9,65),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
COL7109  DFLD  POS=(9,71),LTH=3,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL7509  DFLD  POS=(9,75),LTH=2,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL0210  DFLD  POS=(10,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL0410  DFLD  POS=(10,4),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL1110  DFLD  POS=(10,11),LTH=9,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2110  DFLD  POS=(10,21),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2910  DFLD  POS=(10,29),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL3610  DFLD  POS=(10,36),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
COL3810  DFLD  POS=(10,38),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL4310  DFLD  POS=(10,43),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL5010  DFLD  POS=(10,50),LTH=10,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
COL6110  DFLD  POS=(10,61),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL6510  DFLD  POS=(10,65),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
COL7110  DFLD  POS=(10,71),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL7510  DFLD  POS=(10,75),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL0211  DFLD  POS=(11,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL0411  DFLD  POS=(11,4),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL1111  DFLD  POS=(11,11),LTH=9,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2111  DFLD  POS=(11,21),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2911  DFLD  POS=(11,29),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL3611  DFLD  POS=(11,36),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
COL3811  DFLD  POS=(11,38),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL4311  DFLD  POS=(11,43),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL5011  DFLD  POS=(11,50),LTH=10,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
COL6111  DFLD  POS=(11,61),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL6511  DFLD  POS=(11,65),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
COL7111  DFLD  POS=(11,71),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL7511  DFLD  POS=(11,75),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL0212  DFLD  POS=(12,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL0412  DFLD  POS=(12,4),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL1112  DFLD  POS=(12,11),LTH=9,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2112  DFLD  POS=(12,21),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2912  DFLD  POS=(12,29),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL3612  DFLD  POS=(12,36),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
COL3812  DFLD  POS=(12,38),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL4312  DFLD  POS=(12,43),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL5012  DFLD  POS=(12,50),LTH=10,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
COL6112  DFLD  POS=(12,61),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL6512  DFLD  POS=(12,65),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
COL7112  DFLD  POS=(12,71),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL7512  DFLD  POS=(12,75),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL0213  DFLD  POS=(13,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL0413  DFLD  POS=(13,4),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL1113  DFLD  POS=(13,11),LTH=9,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2113  DFLD  POS=(13,21),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2913  DFLD  POS=(13,29),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL3613  DFLD  POS=(13,36),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
COL3813  DFLD  POS=(13,38),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL4313  DFLD  POS=(13,43),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL5013  DFLD  POS=(13,50),LTH=10,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
COL6113  DFLD  POS=(13,61),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL6513  DFLD  POS=(13,65),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
COL7113  DFLD  POS=(13,71),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL7513  DFLD  POS=(13,75),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL0214  DFLD  POS=(14,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL0414  DFLD  POS=(14,4),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL1114  DFLD  POS=(14,11),LTH=9,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2114  DFLD  POS=(14,21),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2914  DFLD  POS=(14,29),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL3614  DFLD  POS=(14,36),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
COL3814  DFLD  POS=(14,38),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL4314  DFLD  POS=(14,43),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL5014  DFLD  POS=(14,50),LTH=10,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
COL6114  DFLD  POS=(14,61),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL6514  DFLD  POS=(14,65),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
COL7114  DFLD  POS=(14,71),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL7514  DFLD  POS=(14,75),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL0215  DFLD  POS=(15,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL0415  DFLD  POS=(15,4),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL1115  DFLD  POS=(15,11),LTH=9,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2115  DFLD  POS=(15,21),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2915  DFLD  POS=(15,29),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL3615  DFLD  POS=(15,36),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
COL3815  DFLD  POS=(15,38),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL4315  DFLD  POS=(15,43),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL5015  DFLD  POS=(15,50),LTH=10,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
COL6115  DFLD  POS=(15,61),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL6515  DFLD  POS=(15,65),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
COL7115  DFLD  POS=(15,71),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL7515  DFLD  POS=(15,75),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL0216  DFLD  POS=(16,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL0416  DFLD  POS=(16,4),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL1116  DFLD  POS=(16,11),LTH=9,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2116  DFLD  POS=(16,21),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2916  DFLD  POS=(16,29),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL3616  DFLD  POS=(16,36),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
COL3816  DFLD  POS=(16,38),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL4316  DFLD  POS=(16,43),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL5016  DFLD  POS=(16,50),LTH=10,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
COL6116  DFLD  POS=(16,61),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL6516  DFLD  POS=(16,65),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
COL7116  DFLD  POS=(16,71),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL7516  DFLD  POS=(16,75),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL0217  DFLD  POS=(17,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL0417  DFLD  POS=(17,4),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL1117  DFLD  POS=(17,11),LTH=9,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2117  DFLD  POS=(17,21),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2917  DFLD  POS=(17,29),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL3617  DFLD  POS=(17,36),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
COL3817  DFLD  POS=(17,38),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL4317  DFLD  POS=(17,43),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL5017  DFLD  POS=(17,50),LTH=10,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
COL6117  DFLD  POS=(17,61),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL6517  DFLD  POS=(17,65),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
COL7117  DFLD  POS=(17,71),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL7517  DFLD  POS=(17,75),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL0218  DFLD  POS=(18,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL0418  DFLD  POS=(18,4),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL1118  DFLD  POS=(18,11),LTH=9,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2118  DFLD  POS=(18,21),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2918  DFLD  POS=(18,29),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL3618  DFLD  POS=(18,36),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
COL3818  DFLD  POS=(18,38),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL4318  DFLD  POS=(18,43),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL5018  DFLD  POS=(18,50),LTH=10,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
COL6118  DFLD  POS=(18,61),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL6518  DFLD  POS=(18,65),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
COL7118  DFLD  POS=(18,71),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL7518  DFLD  POS=(18,75),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL0219  DFLD  POS=(19,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL0419  DFLD  POS=(19,4),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL1119  DFLD  POS=(19,11),LTH=9,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2119  DFLD  POS=(19,21),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2919  DFLD  POS=(19,29),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL3619  DFLD  POS=(19,36),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
COL3819  DFLD  POS=(19,38),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL4319  DFLD  POS=(19,43),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL5019  DFLD  POS=(19,50),LTH=10,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
COL6119  DFLD  POS=(19,61),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL6519  DFLD  POS=(19,65),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
COL7119  DFLD  POS=(19,71),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL7519  DFLD  POS=(19,75),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FLD2002  DFLD  POS=(20,2),LTH=4,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD2007  DFLD  POS=(20,7),LTH=6,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
FLD2015  DFLD  POS=(20,15),LTH=9,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD2025  DFLD  POS=(20,25),LTH=1,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
FLD2027  DFLD  POS=(20,27),LTH=3,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
FLD2031  DFLD  POS=(20,31),LTH=5,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
FLD2037  DFLD  POS=(20,37),LTH=1,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
FLD2039  DFLD  POS=(20,39),LTH=2,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  '13 Quest BO    14 Update BO',                          +        
               POS=(21,2),LTH=27,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '15 Reserv. lines 16',                                  +        
               POS=(21,34),LTH=19,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,17),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,51),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4O572N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N572,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I572N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0136,                                                +        
               LTH=40                                                           
         MFLD  FLD0208,                                                +        
               LTH=4                                                            
         MFLD  FLD0308,                                                +        
               LTH=4                                                            
         MFLD  FLD0218,                                                +        
               LTH=6                                                            
         MFLD  FLD0318,                                                +        
               LTH=6                                                            
         MFLD  FLD0233,                                                +        
               LTH=9                                                            
         MFLD  FLD0333,                                                +        
               LTH=9                                                            
         MFLD  FLD0246,                                                +        
               LTH=1                                                            
         MFLD  FLD0346,                                                +        
               LTH=1                                                            
         MFLD  FLD0251,                                                +        
               LTH=2                                                            
         MFLD  FLD0351,                                                +        
               LTH=2                                                            
         MFLD  FLD0260,                                                +        
               LTH=5                                                            
         MFLD  FLD0360,                                                +        
               LTH=5                                                            
         MFLD  FLD0270,                                                +        
               LTH=1                                                            
         MFLD  FLD0370,                                                +        
               LTH=1                                                            
         MFLD  FLD0275,                                                +        
               LTH=2                                                            
         MFLD  FLD0375,                                                +        
               LTH=2                                                            
         MFLD  FLD0402,                                                +        
               LTH=4                                                            
         MFLD  FLD0407,                                                +        
               LTH=6                                                            
         MFLD  FLD0415,                                                +        
               LTH=9                                                            
         MFLD  FLD0425,                                                +        
               LTH=1                                                            
         MFLD  FLD0427,                                                +        
               LTH=2                                                            
         MFLD  FLD0430,                                                +        
               LTH=5                                                            
         MFLD  FLD0436,                                                +        
               LTH=1                                                            
         MFLD  FLD0438,                                                +        
               LTH=6                                                            
         MFLD  FLD0445,                                                +        
               LTH=2                                                            
         MFLD  FLD0448,                                                +        
               LTH=2                                                            
         MFLD  FLD0451,                                                +        
               LTH=26                                                           
         MFLD  TEDDI,                                                  +        
               LTH=3                                                            
         MFLD  KDVALISO,                                               +        
               LTH=3                                                            
         MFLD  FLD0621,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0636,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0639,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0650,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL0207,                                                +        
               LTH=1                                                            
         MFLD  COL0407,                                                +        
               LTH=6                                                            
         MFLD  COL1107,                                                +        
               LTH=9                                                            
         MFLD  COL2107,                                                +        
               LTH=7                                                            
         MFLD  COL2907,                                                +        
               LTH=5                                                            
         MFLD  COL3607,                                                +        
               LTH=1                                                            
         MFLD  COL3807,                                                +        
               LTH=3                                                            
         MFLD  COL4307,                                                +        
               LTH=6                                                            
         MFLD  COL5007,                                                +        
               LTH=10                                                           
         MFLD  COL6107,                                                +        
               LTH=1                                                            
         MFLD  COL6507,                                                +        
               LTH=5                                                            
         MFLD  COL7107,                                                +        
               LTH=3                                                            
         MFLD  COL7507,                                                +        
               LTH=2                                                            
         MFLD  COL0208,                                                +        
               LTH=1                                                            
         MFLD  COL0408,                                                +        
               LTH=6                                                            
         MFLD  COL1108,                                                +        
               LTH=9                                                            
         MFLD  COL2108,                                                +        
               LTH=7                                                            
         MFLD  COL2908,                                                +        
               LTH=5                                                            
         MFLD  COL3608,                                                +        
               LTH=1                                                            
         MFLD  COL3808,                                                +        
               LTH=3                                                            
         MFLD  COL4308,                                                +        
               LTH=6                                                            
         MFLD  COL5008,                                                +        
               LTH=10                                                           
         MFLD  COL6108,                                                +        
               LTH=1                                                            
         MFLD  COL6508,                                                +        
               LTH=5                                                            
         MFLD  COL7108,                                                +        
               LTH=3                                                            
         MFLD  COL7508,                                                +        
               LTH=2                                                            
         MFLD  COL0209,                                                +        
               LTH=1                                                            
         MFLD  COL0409,                                                +        
               LTH=6                                                            
         MFLD  COL1109,                                                +        
               LTH=9                                                            
         MFLD  COL2109,                                                +        
               LTH=7                                                            
         MFLD  COL2909,                                                +        
               LTH=5                                                            
         MFLD  COL3609,                                                +        
               LTH=1                                                            
         MFLD  COL3809,                                                +        
               LTH=3                                                            
         MFLD  COL4309,                                                +        
               LTH=6                                                            
         MFLD  COL5009,                                                +        
               LTH=10                                                           
         MFLD  COL6109,                                                +        
               LTH=1                                                            
         MFLD  COL6509,                                                +        
               LTH=5                                                            
         MFLD  COL7109,                                                +        
               LTH=3                                                            
         MFLD  COL7509,                                                +        
               LTH=2                                                            
         MFLD  COL0210,                                                +        
               LTH=1                                                            
         MFLD  COL0410,                                                +        
               LTH=6                                                            
         MFLD  COL1110,                                                +        
               LTH=9                                                            
         MFLD  COL2110,                                                +        
               LTH=7                                                            
         MFLD  COL2910,                                                +        
               LTH=5                                                            
         MFLD  COL3610,                                                +        
               LTH=1                                                            
         MFLD  COL3810,                                                +        
               LTH=3                                                            
         MFLD  COL4310,                                                +        
               LTH=6                                                            
         MFLD  COL5010,                                                +        
               LTH=10                                                           
         MFLD  COL6110,                                                +        
               LTH=1                                                            
         MFLD  COL6510,                                                +        
               LTH=5                                                            
         MFLD  COL7110,                                                +        
               LTH=3                                                            
         MFLD  COL7510,                                                +        
               LTH=2                                                            
         MFLD  COL0211,                                                +        
               LTH=1                                                            
         MFLD  COL0411,                                                +        
               LTH=6                                                            
         MFLD  COL1111,                                                +        
               LTH=9                                                            
         MFLD  COL2111,                                                +        
               LTH=7                                                            
         MFLD  COL2911,                                                +        
               LTH=5                                                            
         MFLD  COL3611,                                                +        
               LTH=1                                                            
         MFLD  COL3811,                                                +        
               LTH=3                                                            
         MFLD  COL4311,                                                +        
               LTH=6                                                            
         MFLD  COL5011,                                                +        
               LTH=10                                                           
         MFLD  COL6111,                                                +        
               LTH=1                                                            
         MFLD  COL6511,                                                +        
               LTH=5                                                            
         MFLD  COL7111,                                                +        
               LTH=3                                                            
         MFLD  COL7511,                                                +        
               LTH=2                                                            
         MFLD  COL0212,                                                +        
               LTH=1                                                            
         MFLD  COL0412,                                                +        
               LTH=6                                                            
         MFLD  COL1112,                                                +        
               LTH=9                                                            
         MFLD  COL2112,                                                +        
               LTH=7                                                            
         MFLD  COL2912,                                                +        
               LTH=5                                                            
         MFLD  COL3612,                                                +        
               LTH=1                                                            
         MFLD  COL3812,                                                +        
               LTH=3                                                            
         MFLD  COL4312,                                                +        
               LTH=6                                                            
         MFLD  COL5012,                                                +        
               LTH=10                                                           
         MFLD  COL6112,                                                +        
               LTH=1                                                            
         MFLD  COL6512,                                                +        
               LTH=5                                                            
         MFLD  COL7112,                                                +        
               LTH=3                                                            
         MFLD  COL7512,                                                +        
               LTH=2                                                            
         MFLD  COL0213,                                                +        
               LTH=1                                                            
         MFLD  COL0413,                                                +        
               LTH=6                                                            
         MFLD  COL1113,                                                +        
               LTH=9                                                            
         MFLD  COL2113,                                                +        
               LTH=7                                                            
         MFLD  COL2913,                                                +        
               LTH=5                                                            
         MFLD  COL3613,                                                +        
               LTH=1                                                            
         MFLD  COL3813,                                                +        
               LTH=3                                                            
         MFLD  COL4313,                                                +        
               LTH=6                                                            
         MFLD  COL5013,                                                +        
               LTH=10                                                           
         MFLD  COL6113,                                                +        
               LTH=1                                                            
         MFLD  COL6513,                                                +        
               LTH=5                                                            
         MFLD  COL7113,                                                +        
               LTH=3                                                            
         MFLD  COL7513,                                                +        
               LTH=2                                                            
         MFLD  COL0214,                                                +        
               LTH=1                                                            
         MFLD  COL0414,                                                +        
               LTH=6                                                            
         MFLD  COL1114,                                                +        
               LTH=9                                                            
         MFLD  COL2114,                                                +        
               LTH=7                                                            
         MFLD  COL2914,                                                +        
               LTH=5                                                            
         MFLD  COL3614,                                                +        
               LTH=1                                                            
         MFLD  COL3814,                                                +        
               LTH=3                                                            
         MFLD  COL4314,                                                +        
               LTH=6                                                            
         MFLD  COL5014,                                                +        
               LTH=10                                                           
         MFLD  COL6114,                                                +        
               LTH=1                                                            
         MFLD  COL6514,                                                +        
               LTH=5                                                            
         MFLD  COL7114,                                                +        
               LTH=3                                                            
         MFLD  COL7514,                                                +        
               LTH=2                                                            
         MFLD  COL0215,                                                +        
               LTH=1                                                            
         MFLD  COL0415,                                                +        
               LTH=6                                                            
         MFLD  COL1115,                                                +        
               LTH=9                                                            
         MFLD  COL2115,                                                +        
               LTH=7                                                            
         MFLD  COL2915,                                                +        
               LTH=5                                                            
         MFLD  COL3615,                                                +        
               LTH=1                                                            
         MFLD  COL3815,                                                +        
               LTH=3                                                            
         MFLD  COL4315,                                                +        
               LTH=6                                                            
         MFLD  COL5015,                                                +        
               LTH=10                                                           
         MFLD  COL6115,                                                +        
               LTH=1                                                            
         MFLD  COL6515,                                                +        
               LTH=5                                                            
         MFLD  COL7115,                                                +        
               LTH=3                                                            
         MFLD  COL7515,                                                +        
               LTH=2                                                            
         MFLD  COL0216,                                                +        
               LTH=1                                                            
         MFLD  COL0416,                                                +        
               LTH=6                                                            
         MFLD  COL1116,                                                +        
               LTH=9                                                            
         MFLD  COL2116,                                                +        
               LTH=7                                                            
         MFLD  COL2916,                                                +        
               LTH=5                                                            
         MFLD  COL3616,                                                +        
               LTH=1                                                            
         MFLD  COL3816,                                                +        
               LTH=3                                                            
         MFLD  COL4316,                                                +        
               LTH=6                                                            
         MFLD  COL5016,                                                +        
               LTH=10                                                           
         MFLD  COL6116,                                                +        
               LTH=1                                                            
         MFLD  COL6516,                                                +        
               LTH=5                                                            
         MFLD  COL7116,                                                +        
               LTH=3                                                            
         MFLD  COL7516,                                                +        
               LTH=2                                                            
         MFLD  COL0217,                                                +        
               LTH=1                                                            
         MFLD  COL0417,                                                +        
               LTH=6                                                            
         MFLD  COL1117,                                                +        
               LTH=9                                                            
         MFLD  COL2117,                                                +        
               LTH=7                                                            
         MFLD  COL2917,                                                +        
               LTH=5                                                            
         MFLD  COL3617,                                                +        
               LTH=1                                                            
         MFLD  COL3817,                                                +        
               LTH=3                                                            
         MFLD  COL4317,                                                +        
               LTH=6                                                            
         MFLD  COL5017,                                                +        
               LTH=10                                                           
         MFLD  COL6117,                                                +        
               LTH=1                                                            
         MFLD  COL6517,                                                +        
               LTH=5                                                            
         MFLD  COL7117,                                                +        
               LTH=3                                                            
         MFLD  COL7517,                                                +        
               LTH=2                                                            
         MFLD  COL0218,                                                +        
               LTH=1                                                            
         MFLD  COL0418,                                                +        
               LTH=6                                                            
         MFLD  COL1118,                                                +        
               LTH=9                                                            
         MFLD  COL2118,                                                +        
               LTH=7                                                            
         MFLD  COL2918,                                                +        
               LTH=5                                                            
         MFLD  COL3618,                                                +        
               LTH=1                                                            
         MFLD  COL3818,                                                +        
               LTH=3                                                            
         MFLD  COL4318,                                                +        
               LTH=6                                                            
         MFLD  COL5018,                                                +        
               LTH=10                                                           
         MFLD  COL6118,                                                +        
               LTH=1                                                            
         MFLD  COL6518,                                                +        
               LTH=5                                                            
         MFLD  COL7118,                                                +        
               LTH=3                                                            
         MFLD  COL7518,                                                +        
               LTH=2                                                            
         MFLD  COL0219,                                                +        
               LTH=1                                                            
         MFLD  COL0419,                                                +        
               LTH=6                                                            
         MFLD  COL1119,                                                +        
               LTH=9                                                            
         MFLD  COL2119,                                                +        
               LTH=7                                                            
         MFLD  COL2919,                                                +        
               LTH=5                                                            
         MFLD  COL3619,                                                +        
               LTH=1                                                            
         MFLD  COL3819,                                                +        
               LTH=3                                                            
         MFLD  COL4319,                                                +        
               LTH=6                                                            
         MFLD  COL5019,                                                +        
               LTH=10                                                           
         MFLD  COL6119,                                                +        
               LTH=1                                                            
         MFLD  COL6519,                                                +        
               LTH=5                                                            
         MFLD  COL7119,                                                +        
               LTH=3                                                            
         MFLD  COL7519,                                                +        
               LTH=2                                                            
         MFLD  FLD2002,                                                +        
               LTH=4                                                            
         MFLD  FLD2007,                                                +        
               LTH=6                                                            
         MFLD  FLD2015,                                                +        
               LTH=9                                                            
         MFLD  FLD2025,                                                +        
               LTH=1                                                            
         MFLD  FLD2027,                                                +        
               LTH=3                                                            
         MFLD  FLD2031,                                                +        
               LTH=5                                                            
         MFLD  FLD2037,                                                +        
               LTH=1                                                            
         MFLD  FLD2039,                                                +        
               LTH=2                                                            
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I572N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N572),                                           +        
               OPT=2,                                                  +        
               NXT=W4O572N1                                                     
MID      LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F7'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '45722',                                                +        
               LTH=5                                                            
         MFLD  (FLD0208,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0308,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0218,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0318,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0233,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0333,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0246,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0346,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0251,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0351,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0260,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0360,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0270,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0370,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0275,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0375,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0402,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0407,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0415,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0425,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0427,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0430,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0436,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0438,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0445,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0448,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0451,                                                +        
               LTH=26,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0621,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0636,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0639,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0650,                                               +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL0207,                                                +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL0407,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1107,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2107,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2907,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL3607,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL3807,                                                +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL4307,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5007,                                                +        
               LTH=10,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL6107,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL6507,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7107,                                                +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7507,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL0208,                                                +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL0408,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1108,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2108,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2908,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL3608,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL3808,                                                +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL4308,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5008,                                                +        
               LTH=10,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL6108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL6508,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7108,                                                +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7508,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL0209,                                                +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL0409,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1109,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2109,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2909,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL3609,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL3809,                                                +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL4309,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5009,                                                +        
               LTH=10,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL6109,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL6509,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7109,                                                +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7509,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL0210,                                                +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL0410,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1110,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2110,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2910,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL3610,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL3810,                                                +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL4310,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5010,                                                +        
               LTH=10,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL6110,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL6510,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7110,                                                +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7510,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL0211,                                                +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL0411,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1111,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2111,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2911,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL3611,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL3811,                                                +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL4311,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5011,                                                +        
               LTH=10,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL6111,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL6511,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7111,                                                +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7511,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL0212,                                                +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL0412,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1112,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2112,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2912,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL3612,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL3812,                                                +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL4312,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5012,                                                +        
               LTH=10,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL6112,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL6512,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7112,                                                +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7512,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL0213,                                                +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL0413,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1113,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2113,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2913,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL3613,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL3813,                                                +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL4313,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5013,                                                +        
               LTH=10,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL6113,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL6513,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7113,                                                +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7513,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL0214,                                                +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL0414,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1114,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2114,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2914,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL3614,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL3814,                                                +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL4314,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5014,                                                +        
               LTH=10,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL6114,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL6514,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7114,                                                +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7514,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL0215,                                                +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL0415,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1115,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2115,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2915,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL3615,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL3815,                                                +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL4315,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5015,                                                +        
               LTH=10,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL6115,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL6515,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7115,                                                +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7515,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL0216,                                                +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL0416,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1116,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2116,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2916,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL3616,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL3816,                                                +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL4316,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5016,                                                +        
               LTH=10,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL6116,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL6516,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7116,                                                +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7516,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL0217,                                                +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL0417,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1117,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2117,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2917,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL3617,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL3817,                                                +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL4317,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5017,                                                +        
               LTH=10,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL6117,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL6517,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7117,                                                +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7517,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL0218,                                                +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL0418,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1118,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2118,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2918,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL3618,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL3818,                                                +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL4318,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5018,                                                +        
               LTH=10,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL6118,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL6518,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7118,                                                +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7518,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL0219,                                                +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL0419,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL1119,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2119,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL2919,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL3619,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL3819,                                                +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL4319,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL5019,                                                +        
               LTH=10,                                                 +        
               FILL=X'F0'                                                       
         MFLD  COL6119,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL6519,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7119,                                                +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  COL7519,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD2002,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD2007,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD2015,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD2025,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD2027,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD2031,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD2037,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD2039,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
