***********************************************************************         
* CREATED BY PCC6483   ON 97/03/04  AT 16:00                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'FRÅGA PÅ ORDER KUNDINFO         '                               
W4N504   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W4T504 4',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T501  ',                                          +        
               14='W4T502  ',                                          +        
               15='W4T503  ',                                          +        
               16='W4T504  ',                                          +        
               17='W4T505  ',                                          +        
               18='W4T506  ',                                          +        
               19='W4T507  ',                                          +        
               20='W4T508  ',                                          +        
               21='W4T509  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W4N504   DPAGE CURSOR=((2,7)),                                         +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'QUERY ORDER NAME/ADDRESS   ',                          +        
               POS=(1,12),LTH=27,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Dist',                                                 +        
               POS=(2,2),LTH=4,                                        +        
               ATTR=(ALPHA,PROT)                                                
IDDISTRI DFLD  POS=(2,7),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Cust',                                                 +        
               POS=(2,12),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
IDKUNDNI DFLD  POS=(2,17),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Order',                                                +        
               POS=(2,24),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
IDORDNRI DFLD  POS=(2,30),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Part',                                                 +        
               POS=(2,38),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
IDARTNRI DFLD  POS=(2,43),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Cse',                                                  +        
               POS=(2,53),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
IDKOLLI  DFLD  POS=(2,57),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Prod',                                                 +        
               POS=(2,63),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0000 DFLD  POS=(2,68),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DC',                                                   +        
               POS=(2,76),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
IDDCI    DFLD  POS=(2,79),LTH=2,                                       +        
               ATTR=(ALPHA,NOPROT)                                              
         DFLD  ' ',                                                    +        
               POS=(3,2),LTH=1,                                        +        
               ATTR=(ALPHA)                                                     
IDDISTRU DFLD  POS=(3,7),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
IDKUNDNU DFLD  POS=(3,17),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
IDORDNRU DFLD  POS=(3,30),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
IDARTNRU DFLD  POS=(3,43),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
IDKOLLU  DFLD  POS=(3,57),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0001 DFLD  POS=(3,68),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
IDDCU    DFLD  POS=(3,79),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Printer/Proforma docum.',                              +        
               POS=(5,53),LTH=23,                                      +        
               ATTR=(PROT)                                                      
DGIA0002 DFLD  POS=(5,78),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Custref',                                              +        
               POS=(6,2),LTH=7,                                        +        
               ATTR=(NUM,PROT)                                                  
BEKUNDRF DFLD  POS=(6,10),LTH=15,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Campaign ref',                                         +        
               POS=(6,27),LTH=12,                                      +        
               ATTR=(PROT)                                                      
KAMPREF  DFLD  POS=(6,40),LTH=7,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Regdate',                                              +        
               POS=(7,2),LTH=7,                                        +        
               ATTR=(PROT)                                                      
TIREGDAT DFLD  POS=(7,10),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'RFS',                                                  +        
               POS=(7,18),LTH=3,                                       +        
               ATTR=(PROT)                                                      
TIRFS    DFLD  POS=(7,22),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'TrpId',                                                +        
               POS=(7,30),LTH=5,                                       +        
               ATTR=(PROT)                                                      
IDTRP    DFLD  POS=(7,36),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Dep date',                                             +        
               POS=(7,43),LTH=8,                                       +        
               ATTR=(PROT)                                                      
TIAAMMDD DFLD  POS=(7,52),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'time',                                                 +        
               POS=(7,60),LTH=4,                                       +        
               ATTR=(PROT)                                                      
TIHHMM   DFLD  POS=(7,65),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Buyer name',                                           +        
               POS=(9,2),LTH=10,                                       +        
               ATTR=(PROT)                                                      
BEKOP1   DFLD  POS=(9,19),LTH=35,                                      +        
               ATTR=(PROT)                                                      
BEKOP2   DFLD  POS=(10,19),LTH=35,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Buyer address',                                        +        
               POS=(11,2),LTH=13,                                      +        
               ATTR=(PROT)                                                      
ADKOP1   DFLD  POS=(11,19),LTH=35,                                     +        
               ATTR=(PROT)                                                      
ADKOP2   DFLD  POS=(12,19),LTH=35,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Consignee',                                            +        
               POS=(14,10),LTH=9,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Pay responsible',                                      +        
               POS=(14,46),LTH=15,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Name',                                                 +        
               POS=(15,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
BEGMT1   DFLD  POS=(15,10),LTH=35,                                     +        
               ATTR=(PROT)                                                      
BEBET1   DFLD  POS=(15,46),LTH=35,                                     +        
               ATTR=(NUM,PROT)                                                  
BEGMT2   DFLD  POS=(16,10),LTH=35,                                     +        
               ATTR=(PROT)                                                      
BEBET2   DFLD  POS=(16,46),LTH=35,                                     +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Address',                                              +        
               POS=(17,2),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
ADGMT1   DFLD  POS=(17,10),LTH=35,                                     +        
               ATTR=(PROT)                                                      
ADBET1   DFLD  POS=(17,46),LTH=35,                                     +        
               ATTR=(NUM,PROT)                                                  
ADGMT2   DFLD  POS=(18,10),LTH=35,                                     +        
               ATTR=(PROT)                                                      
ADBET2   DFLD  POS=(18,46),LTH=35,                                     +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Goods marking',                                        +        
               POS=(19,2),LTH=13,                                      +        
               ATTR=(NUM,PROT)                                                  
BEGDMRK1 DFLD  POS=(19,16),LTH=30,                                     +        
               ATTR=(PROT)                                                      
BEGDMRK2 DFLD  POS=(19,47),LTH=30,                                     +        
               ATTR=(NUM,PROT)                                                  
         DFLD  '13 Gen order   14 Order part   15 Order value 16 Order +        
               cust info 17 Pack/load',                                +        
               POS=(21,2),LTH=77,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18 Cases load  19 Archive PU   20 Cases',              +        
               POS=(22,2),LTH=39,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21 Part info',                                         +        
               POS=(22,48),LTH=12,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,67),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4I504N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N504),                                           +        
               OPT=2,                                                  +        
               NXT=W4O504N1                                                     
MID      LPAGE SOR=(W4N504)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '45042',                                                +        
               LTH=5                                                            
         MFLD  (IDDISTRI,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDDISTRU,                                               +        
               LTH=4                                                            
         MFLD  (IDKUNDNI,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDKUNDNU,                                               +        
               LTH=6                                                            
         MFLD  (IDORDNRI,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDORDNRU,                                               +        
               LTH=7                                                            
         MFLD  (IDARTNRI,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDARTNRU,                                               +        
               LTH=9                                                            
         MFLD  (IDKOLLI,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDKOLLU,                                                +        
               LTH=5                                                            
         MFLD  (DGIA0000,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0001,                                               +        
               LTH=7                                                            
         MFLD  (IDDCI,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  IDDCU,                                                  +        
               LTH=2                                                            
         MFLD  DGIA0002,                                               +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MSGEND                                                                 
W4O504N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N504,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I504N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W4N504                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDDISTRI,                                               +        
               LTH=2                                                            
         MFLD  IDDISTRU,                                               +        
               LTH=4                                                            
         MFLD  IDKUNDNI,                                               +        
               LTH=2                                                            
         MFLD  IDKUNDNU,                                               +        
               LTH=6                                                            
         MFLD  IDORDNRI,                                               +        
               LTH=2                                                            
         MFLD  IDORDNRU,                                               +        
               LTH=7                                                            
         MFLD  IDARTNRI,                                               +        
               LTH=2                                                            
         MFLD  IDARTNRU,                                               +        
               LTH=9                                                            
         MFLD  IDKOLLI,                                                +        
               LTH=2                                                            
         MFLD  IDKOLLU,                                                +        
               LTH=5                                                            
         MFLD  DGIA0000,                                               +        
               LTH=2                                                            
         MFLD  DGIA0001,                                               +        
               LTH=7                                                            
         MFLD  IDDCI,                                                  +        
               LTH=2                                                            
         MFLD  IDDCU,                                                  +        
               LTH=2                                                            
         MFLD  DGIA0002,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BEKUNDRF,                                               +        
               LTH=15                                                           
         MFLD  KAMPREF,                                                +        
               LTH=7                                                            
         MFLD  TIREGDAT,                                               +        
               LTH=6                                                            
         MFLD  TIRFS,                                                  +        
               LTH=6                                                            
         MFLD  IDTRP,                                                  +        
               LTH=5                                                            
         MFLD  TIAAMMDD,                                               +        
               LTH=6                                                            
         MFLD  TIHHMM,                                                 +        
               LTH=5                                                            
         MFLD  BEKOP1,                                                 +        
               LTH=35                                                           
         MFLD  BEKOP2,                                                 +        
               LTH=35                                                           
         MFLD  ADKOP1,                                                 +        
               LTH=35                                                           
         MFLD  ADKOP2,                                                 +        
               LTH=35                                                           
         MFLD  BEGMT1,                                                 +        
               LTH=35                                                           
         MFLD  BEBET1,                                                 +        
               LTH=35                                                           
         MFLD  BEGMT2,                                                 +        
               LTH=35                                                           
         MFLD  BEBET2,                                                 +        
               LTH=35                                                           
         MFLD  ADGMT1,                                                 +        
               LTH=35                                                           
         MFLD  ADBET1,                                                 +        
               LTH=35                                                           
         MFLD  ADGMT2,                                                 +        
               LTH=35                                                           
         MFLD  ADBET2,                                                 +        
               LTH=35                                                           
         MFLD  BEGDMRK1,                                               +        
               LTH=30                                                           
         MFLD  BEGDMRK2,                                               +        
               LTH=30                                                           
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
