***********************************************************************         
* CREATED BY PC38450   ON 94/12/16  AT 12:32                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE '                                '                               
W4N574   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W4T574 7',                                           +        
               8='W4T574 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T574  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T571  ',                                          +        
               14='W4T572  ',                                          +        
               15='W4T573  ',                                          +        
               16='W4T574  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W4T574  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,8)),                                         +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'RELEASED BACKORDER/TPO',                               +        
               POS=(1,12),LTH=22,                                      +        
               ATTR=(PROT)                                                      
FLD0139  DFLD  POS=(1,39),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Distr',                                                +        
               POS=(2,2),LTH=5,                                        +        
               ATTR=(PROT)                                                      
FLD0208  DFLD  POS=(2,8),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Custom',                                               +        
               POS=(2,14),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0221  DFLD  POS=(2,21),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Partno',                                               +        
               POS=(2,29),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0236  DFLD  POS=(2,36),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Order',                                                +        
               POS=(2,47),LTH=5,                                       +        
               ATTR=(PROT)                                                      
FLD0253  DFLD  POS=(2,53),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
FLD0308  DFLD  POS=(3,8),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
FLD0321  DFLD  POS=(3,21),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0336  DFLD  POS=(3,36),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0353  DFLD  POS=(3,53),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0402  DFLD  POS=(4,2),LTH=4,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0407  DFLD  POS=(4,7),LTH=6,                                        +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
FLD0415  DFLD  POS=(4,15),LTH=9,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0425  DFLD  POS=(4,25),LTH=5,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
         DFLD  'Custom      Partno',                                   +        
               POS=(5,2),LTH=18,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Order',                                                +        
               POS=(5,25),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Dc',                                                   +        
               POS=(5,31),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Qty  Attached-to',                                     +        
               POS=(5,41),LTH=16,                                      +        
               ATTR=(PROT)                                                      
         DO 14,SUF=06                                                           
COL02    DFLD  POS=(06,02),LTH=0006,                                   +        
               ATTR=(PROT)                                                      
COL12    DFLD  POS=(06,12),LTH=0008,                                   +        
               ATTR=(PROT)                                                      
COL25    DFLD  POS=(06,25),LTH=0005,                                   +        
               ATTR=(PROT)                                                      
COL31    DFLD  POS=(06,31),LTH=0002,                                   +        
               ATTR=(PROT)                                                      
COL37    DFLD  POS=(06,37),LTH=0007,                                   +        
               ATTR=(PROT)                                                      
COL46    DFLD  POS=(06,46),LTH=0010,                                   +        
               ATTR=(PROT)                                                      
         ENDDO                                                                  
FLD2002  DFLD  POS=(20,2),LTH=4,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD2007  DFLD  POS=(20,7),LTH=6,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
FLD2015  DFLD  POS=(20,15),LTH=9,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD2025  DFLD  POS=(20,25),LTH=5,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
         DFLD  '13',                                                   +        
               POS=(21,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '14',                                                   +        
               POS=(21,17),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '15',                                                   +        
               POS=(21,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16 Released BO 17',                                    +        
               POS=(21,51),LTH=17,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,17),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,51),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4O574N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N574,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I574N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0139,                                                +        
               LTH=40                                                           
         MFLD  FLD0208,                                                +        
               LTH=4                                                            
         MFLD  FLD0308,                                                +        
               LTH=4                                                            
         MFLD  FLD0221,                                                +        
               LTH=6                                                            
         MFLD  FLD0321,                                                +        
               LTH=6                                                            
         MFLD  FLD0236,                                                +        
               LTH=9                                                            
         MFLD  FLD0336,                                                +        
               LTH=9                                                            
         MFLD  FLD0253,                                                +        
               LTH=5                                                            
         MFLD  FLD0353,                                                +        
               LTH=5                                                            
         MFLD  FLD0402,                                                +        
               LTH=4                                                            
         MFLD  FLD0407,                                                +        
               LTH=6                                                            
         MFLD  FLD0415,                                                +        
               LTH=9                                                            
         MFLD  FLD0425,                                                +        
               LTH=5                                                            
         DO    14,SUF=06                                                        
         MFLD  COL02,LTH=0006                                                   
         MFLD  COL12,LTH=0008                                                   
         MFLD  COL25,LTH=0005                                                   
         MFLD  COL31,LTH=0002                                                   
         MFLD  COL37,LTH=0007                                                   
         MFLD  COL46,LTH=0010                                                   
         ENDDO                                                                  
         MFLD  FLD2002,                                                +        
               LTH=4                                                            
         MFLD  FLD2007,                                                +        
               LTH=6                                                            
         MFLD  FLD2015,                                                +        
               LTH=9                                                            
         MFLD  FLD2025,                                                +        
               LTH=5                                                            
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I574N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N574),                                           +        
               OPT=2,                                                  +        
               NXT=W4O574N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F7'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '45742',                                                +        
               LTH=5                                                            
         MFLD  (FLD0208,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0308,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0221,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0321,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0236,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0336,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0253,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0353,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0402,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0407,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0415,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0425,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD2002,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD2007,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD2015,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD2025,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
