***********************************************************************         
* CREATED BY PC36147   ON 96/11/12  AT 10:54                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE '                                '                               
W4N531   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W4T531  ',                                           +        
               2='W4T532  ',                                           +        
               3='W4T533  ',                                           +        
               4='W4T534  ',                                           +        
               5='W4T535  ',                                           +        
               6='W4T536  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T531  ',                                          +        
               14='W4T532  ',                                          +        
               15='W4T533  ',                                          +        
               16='W4T534  ',                                          +        
               17='W4T535  ',                                          +        
               18='W4T536  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,9)),                                         +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'QUESTION PACKED CASES',                                +        
               POS=(1,10),LTH=21,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Distr',                                                +        
               POS=(2,3),LTH=5,                                        +        
               ATTR=(PROT)                                                      
FLD0209  DFLD  POS=(2,9),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Cust',                                                 +        
               POS=(2,15),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FLD0221  DFLD  POS=(2,21),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'FC',                                                   +        
               POS=(2,29),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FLD0231  DFLD  POS=(2,33),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Shipm',                                                +        
               POS=(2,37),LTH=5,                                       +        
               ATTR=(PROT)                                                      
FLD0243  DFLD  POS=(2,44),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DC',                                                   +        
               POS=(2,53),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DCI      DFLD  POS=(2,57),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FLD0309  DFLD  POS=(3,9),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
FLD0321  DFLD  POS=(3,21),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0331  DFLD  POS=(3,33),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0343  DFLD  POS=(3,44),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
DCO      DFLD  POS=(3,57),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0402  DFLD  POS=(4,2),LTH=44,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'Prodno-Case   L   W   H Typ  Gr.-w  Net.-w  Gr.vol     +        
               Value Line Shipm Pdat S',                               +        
               POS=(5,3),LTH=78,                                       +        
               ATTR=(PROT)                                                      
FLD0602  DFLD  POS=(6,2),LTH=79,                                       +        
               ATTR=(PROT)                                                      
FLD0702  DFLD  POS=(7,2),LTH=79,                                       +        
               ATTR=(ALPHA,PROT)                                                
FLD0802  DFLD  POS=(8,2),LTH=79,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0902  DFLD  POS=(9,2),LTH=79,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD1002  DFLD  POS=(10,2),LTH=79,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1102  DFLD  POS=(11,2),LTH=79,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1202  DFLD  POS=(12,2),LTH=79,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1302  DFLD  POS=(13,2),LTH=79,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1402  DFLD  POS=(14,2),LTH=79,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1502  DFLD  POS=(15,2),LTH=79,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1602  DFLD  POS=(16,2),LTH=79,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1702  DFLD  POS=(17,2),LTH=79,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1802  DFLD  POS=(18,2),LTH=79,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1902  DFLD  POS=(19,2),LTH=79,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  '1 Query cases   2 Cross cases   3 Loading rel   4 Backo+        
               ut load  5 Inv. rel',                                   +        
               POS=(21,2),LTH=74,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '6 Backout inv   7',                                    +        
               POS=(22,2),LTH=17,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '8',                                                    +        
               POS=(22,34),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '9',                                                    +        
               POS=(22,50),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4O531N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N531,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I531N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  FLD0209,                                                +        
               LTH=4                                                            
         MFLD  FLD0221,                                                +        
               LTH=6                                                            
         MFLD  FLD0231,                                                +        
               LTH=2                                                            
         MFLD  FLD0243,                                                +        
               LTH=7                                                            
         MFLD  DCI,                                                    +        
               LTH=2                                                            
         MFLD  FLD0309,                                                +        
               LTH=4                                                            
         MFLD  FLD0321,                                                +        
               LTH=6                                                            
         MFLD  FLD0331,                                                +        
               LTH=2                                                            
         MFLD  FLD0343,                                                +        
               LTH=7                                                            
         MFLD  DCO,                                                    +        
               LTH=2                                                            
         MFLD  FLD0402,                                                +        
               LTH=44                                                           
         MFLD  FLD0602,                                                +        
               LTH=79                                                           
         MFLD  FLD0702,                                                +        
               LTH=79                                                           
         MFLD  FLD0802,                                                +        
               LTH=79                                                           
         MFLD  FLD0902,                                                +        
               LTH=79                                                           
         MFLD  FLD1002,                                                +        
               LTH=79                                                           
         MFLD  FLD1102,                                                +        
               LTH=79                                                           
         MFLD  FLD1202,                                                +        
               LTH=79                                                           
         MFLD  FLD1302,                                                +        
               LTH=79                                                           
         MFLD  FLD1402,                                                +        
               LTH=79                                                           
         MFLD  FLD1502,                                                +        
               LTH=79                                                           
         MFLD  FLD1602,                                                +        
               LTH=79                                                           
         MFLD  FLD1702,                                                +        
               LTH=79                                                           
         MFLD  FLD1802,                                                +        
               LTH=79                                                           
         MFLD  FLD1902,                                                +        
               LTH=79                                                           
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I531N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N531),                                           +        
               OPT=2,                                                  +        
               NXT=W4O531N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '45312',                                                +        
               LTH=5                                                            
         MFLD  (FLD0209,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0309,                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0221,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0321,                                                +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0231,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0331,                                                +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0243,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0343,                                                +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DCI,                                                   +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  DCO,                                                    +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  FLD0402,                                                +        
               LTH=44,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
