***********************************************************************         
* CREATED BY PCC4448   ON 95/03/08  AT 09:26                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE '                                '                               
W4N534   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W4T531  ',                                           +        
               2='W4T532  ',                                           +        
               3='W4T533  ',                                           +        
               4='W4T534  ',                                           +        
               5='W4T535  ',                                           +        
               6='W4T536  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T531  ',                                          +        
               14='W4T532  ',                                          +        
               15='W4T533  ',                                          +        
               16='W4T534  ',                                          +        
               17='W4T535  ',                                          +        
               18='W4T536  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,11)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'INVOICE RELEASE BACKOUT',                              +        
               POS=(1,11),LTH=23,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'District',                                             +        
               POS=(2,2),LTH=8,                                        +        
               ATTR=(NUM,PROT)                                                  
FLD0211  DFLD  POS=(2,11),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Customer',                                             +        
               POS=(2,17),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FLD0224  DFLD  POS=(2,26),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Fc',                                                   +        
               POS=(2,34),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FLD0235  DFLD  POS=(2,37),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Shipment',                                             +        
               POS=(2,42),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FLD0247  DFLD  POS=(2,51),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DC',                                                   +        
               POS=(2,60),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDDCIN   DFLD  POS=(2,63),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
FLD0311  DFLD  POS=(3,11),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0324  DFLD  POS=(3,26),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0335  DFLD  POS=(3,37),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0347  DFLD  POS=(3,51),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
IDDCUT   DFLD  POS=(3,63),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'In loading No.',                                       +        
               POS=(5,9),LTH=14,                                       +        
               ATTR=(PROT)                                                      
FLD0524  DFLD  POS=(5,24),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'the following has been chosen:',                       +        
               POS=(5,33),LTH=30,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'No. of cases',                                         +        
               POS=(7,7),LTH=12,                                       +        
               ATTR=(PROT)                                                      
FLD0728  DFLD  POS=(7,28),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Gross weight kg',                                      +        
               POS=(8,7),LTH=15,                                       +        
               ATTR=(PROT)                                                      
FLD0826  DFLD  POS=(8,24),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Gross volume m3',                                      +        
               POS=(9,7),LTH=15,                                       +        
               ATTR=(PROT)                                                      
FLD0928  DFLD  POS=(9,24),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'District included in the loading:',                    +        
               POS=(11,11),LTH=33,                                     +        
               ATTR=(PROT)                                                      
FLD1145  DFLD  POS=(11,45),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD1150  DFLD  POS=(11,50),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1155  DFLD  POS=(11,55),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1160  DFLD  POS=(11,60),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1165  DFLD  POS=(11,65),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1170  DFLD  POS=(11,70),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1175  DFLD  POS=(11,75),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1245  DFLD  POS=(12,45),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD1250  DFLD  POS=(12,50),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1255  DFLD  POS=(12,55),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1260  DFLD  POS=(12,60),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1265  DFLD  POS=(12,65),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1270  DFLD  POS=(12,70),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1275  DFLD  POS=(12,75),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1345  DFLD  POS=(13,45),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD1350  DFLD  POS=(13,50),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1355  DFLD  POS=(13,55),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1360  DFLD  POS=(13,60),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1365  DFLD  POS=(13,65),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1370  DFLD  POS=(13,70),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1375  DFLD  POS=(13,75),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1445  DFLD  POS=(14,45),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD1450  DFLD  POS=(14,50),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1455  DFLD  POS=(14,55),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1460  DFLD  POS=(14,60),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1465  DFLD  POS=(14,65),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1470  DFLD  POS=(14,70),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1475  DFLD  POS=(14,75),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Yes = Start from the beginning  ===>',                 +        
               POS=(17,11),LTH=36,                                     +        
               ATTR=(PROT)                                                      
FLD1745  DFLD  POS=(17,48),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  '1 Query cases   2 Cross cases   3 Loading rel.  4 Backo+        
               ut load. 5 Inv. rel.',                                  +        
               POS=(21,2),LTH=75,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '6 Backout inv.  7',                                    +        
               POS=(22,2),LTH=17,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '8',                                                    +        
               POS=(22,34),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '9',                                                    +        
               POS=(22,50),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W4O534N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N534,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I534N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  FLD0211,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0311,                                                +        
               LTH=4                                                            
         MFLD  FLD0224,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0324,                                                +        
               LTH=6                                                            
         MFLD  FLD0235,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0335,                                                +        
               LTH=2                                                            
         MFLD  FLD0247,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0347,                                                +        
               LTH=7                                                            
         MFLD  IDDCIN,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  FLD0524,                                                +        
               LTH=7                                                            
         MFLD  FLD0728,                                                +        
               LTH=4                                                            
         MFLD  FLD0826,                                                +        
               LTH=8                                                            
         MFLD  FLD0928,                                                +        
               LTH=8                                                            
         MFLD  FLD1145,                                                +        
               LTH=4                                                            
         MFLD  FLD1150,                                                +        
               LTH=4                                                            
         MFLD  FLD1155,                                                +        
               LTH=4                                                            
         MFLD  FLD1160,                                                +        
               LTH=4                                                            
         MFLD  FLD1165,                                                +        
               LTH=4                                                            
         MFLD  FLD1170,                                                +        
               LTH=4                                                            
         MFLD  FLD1175,                                                +        
               LTH=4                                                            
         MFLD  FLD1245,                                                +        
               LTH=4                                                            
         MFLD  FLD1250,                                                +        
               LTH=4                                                            
         MFLD  FLD1255,                                                +        
               LTH=4                                                            
         MFLD  FLD1260,                                                +        
               LTH=4                                                            
         MFLD  FLD1265,                                                +        
               LTH=4                                                            
         MFLD  FLD1270,                                                +        
               LTH=4                                                            
         MFLD  FLD1275,                                                +        
               LTH=4                                                            
         MFLD  FLD1345,                                                +        
               LTH=4                                                            
         MFLD  FLD1350,                                                +        
               LTH=4                                                            
         MFLD  FLD1355,                                                +        
               LTH=4                                                            
         MFLD  FLD1360,                                                +        
               LTH=4                                                            
         MFLD  FLD1365,                                                +        
               LTH=4                                                            
         MFLD  FLD1370,                                                +        
               LTH=4                                                            
         MFLD  FLD1375,                                                +        
               LTH=4                                                            
         MFLD  FLD1445,                                                +        
               LTH=4                                                            
         MFLD  FLD1450,                                                +        
               LTH=4                                                            
         MFLD  FLD1455,                                                +        
               LTH=4                                                            
         MFLD  FLD1460,                                                +        
               LTH=4                                                            
         MFLD  FLD1465,                                                +        
               LTH=4                                                            
         MFLD  FLD1470,                                                +        
               LTH=4                                                            
         MFLD  FLD1475,                                                +        
               LTH=4                                                            
         MFLD  FLD1745,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I534N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N534),                                           +        
               OPT=2,                                                  +        
               NXT=W4O534N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '45342',                                                +        
               LTH=5                                                            
         MFLD  (FLD0211,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0311,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0224,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0324,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0235,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0335,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0247,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0347,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (IDDCIN,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDDCUT,                                                 +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  '4534',                                                 +        
               LTH=4                                                            
         MFLD  FLD0524,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD1745,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
