***********************************************************************         
* CREATED BY PCC4448   ON 95/01/25  AT 09:17                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'FILED PACKING-LISTS             '                               
W4N507   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T505  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T501  ',                                          +        
               14='W4T502  ',                                          +        
               15='W4T503  ',                                          +        
               16='W4T504  ',                                          +        
               17='W4T505  ',                                          +        
               18='W4T506  ',                                          +        
               19='W4T507  ',                                          +        
               20='W4T508  ',                                          +        
               21='W4T509  ',                                          +        
               22='WHELP   ',                                          +        
               23='W4T507  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W4N507   DPAGE CURSOR=((2,7)),                                         +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'FILED PACKING LISTS',                                  +        
               POS=(1,13),LTH=19,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Dist',                                                 +        
               POS=(2,2),LTH=4,                                        +        
               ATTR=(ALPHA,PROT)                                                
FLD0207  DFLD  POS=(2,7),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Cust',                                                 +        
               POS=(2,12),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0217  DFLD  POS=(2,17),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Order',                                                +        
               POS=(2,24),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0230  DFLD  POS=(2,30),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DC',                                                   +        
               POS=(2,38),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
IDDCIN   DFLD  POS=(2,41),LTH=2,                                       +        
               ATTR=(ALPHA,NOPROT)                                              
         DFLD  '*Part',                                                +        
               POS=(2,44),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0244  DFLD  POS=(2,50),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Cse',                                                  +        
               POS=(2,60),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0258  DFLD  POS=(2,64),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Pnr',                                                  +        
               POS=(2,70),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0268  DFLD  POS=(2,74),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
FLD0307  DFLD  POS=(3,7),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
FLD0317  DFLD  POS=(3,17),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0330  DFLD  POS=(3,30),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
IDDCUT   DFLD  POS=(3,41),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  '*',                                                    +        
               POS=(3,44),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0344  DFLD  POS=(3,50),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0358  DFLD  POS=(3,64),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0368  DFLD  POS=(3,74),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0402  DFLD  POS=(4,2),LTH=12,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
         DFLD  'F I L E D',                                            +        
               POS=(5,32),LTH=9,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'YYMMDD  YYMMDD  YYMMDD  YYMMDD  YYMMDD  YYMMDD  YYMMDD'+        
               ,POS=(6,10),LTH=54,                                     +        
               ATTR=(PROT)                                                      
COL1008  DFLD  POS=(8,10),LTH=56,                                      +        
               ATTR=(PROT)                                                      
COL1009  DFLD  POS=(10,10),LTH=56,                                     +        
               ATTR=(PROT)                                                      
COL1010  DFLD  POS=(12,10),LTH=56,                                     +        
               ATTR=(PROT)                                                      
COL1011  DFLD  POS=(14,10),LTH=56,                                     +        
               ATTR=(PROT)                                                      
COL1012  DFLD  POS=(16,10),LTH=56,                                     +        
               ATTR=(PROT)                                                      
COL1013  DFLD  POS=(18,10),LTH=56,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '13 Gen order   14 Order part    15 Order value 16 Order+        
                cust inf 17 Pack load',                                +        
               POS=(21,2),LTH=77,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18 Cases load  19 Archive PU    20 Cases',             +        
               POS=(22,2),LTH=40,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21 Part info',                                         +        
               POS=(22,49),LTH=12,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,67),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W4O507N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N507,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I507N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W4N507                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  FLD0207,                                                +        
               LTH=4                                                            
         MFLD  FLD0217,                                                +        
               LTH=6                                                            
         MFLD  FLD0230,                                                +        
               LTH=7                                                            
         MFLD  IDDCIN,                                                 +        
               LTH=2                                                            
         MFLD  FLD0244,                                                +        
               LTH=9                                                            
         MFLD  FLD0258,                                                +        
               LTH=5                                                            
         MFLD  FLD0268,                                                +        
               LTH=7                                                            
         MFLD  FLD0307,                                                +        
               LTH=4                                                            
         MFLD  FLD0317,                                                +        
               LTH=6                                                            
         MFLD  FLD0330,                                                +        
               LTH=7                                                            
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  FLD0344,                                                +        
               LTH=9                                                            
         MFLD  FLD0358,                                                +        
               LTH=5                                                            
         MFLD  FLD0368,                                                +        
               LTH=7                                                            
         MFLD  FLD0402,                                                +        
               LTH=12                                                           
         MFLD  COL1008,                                                +        
               LTH=56                                                           
         MFLD  COL1009,                                                +        
               LTH=56                                                           
         MFLD  COL1010,                                                +        
               LTH=56                                                           
         MFLD  COL1011,                                                +        
               LTH=56                                                           
         MFLD  COL1012,                                                +        
               LTH=56                                                           
         MFLD  COL1013,                                                +        
               LTH=56                                                           
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I507N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N507),                                           +        
               OPT=2,                                                  +        
               NXT=W4O507N1                                                     
MID      LPAGE SOR=(W4N507)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F7'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '45072',                                                +        
               LTH=5                                                            
         MFLD  (FLD0207,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0307,                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0217,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0317,                                                +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0230,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0330,                                                +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0244,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0344,                                                +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0258,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0358,                                                +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0268,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0368,                                                +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDDCIN,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDDCUT,                                                 +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0402,                                                +        
               LTH=12,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
