***********************************************************************         
* CREATED BY PCC4448   ON 94/11/11  AT 13:29                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE '                                '                               
W4N541   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T541  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T541  ',                                          +        
               14='W4T542  ',                                          +        
               15='W4T543  ',                                          +        
               16='W4T544  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W4T541  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W4N541   DPAGE CURSOR=((2,8)),                                         +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'QUERY SHIPMENT 1   ',                                  +        
               POS=(1,13),LTH=19,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Distr',                                                +        
               POS=(2,2),LTH=5,                                        +        
               ATTR=(ALPHA,PROT)                                                
FLD0208  DFLD  POS=(2,8),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Cust',                                                 +        
               POS=(2,14),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FLD0220  DFLD  POS=(2,20),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Shipment',                                             +        
               POS=(2,29),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FLD0238  DFLD  POS=(2,38),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DC',                                                   +        
               POS=(2,49),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDDCIN   DFLD  POS=(2,52),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '*Prod',                                                +        
               POS=(2,55),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0257  DFLD  POS=(2,62),LTH=7,                                       +        
               ATTR=(ALPHA,NOPROT)                                              
FLD0308  DFLD  POS=(3,8),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
FLD0320  DFLD  POS=(3,20),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0338  DFLD  POS=(3,38),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
IDDCUT   DFLD  POS=(3,52),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  '*',                                                    +        
               POS=(3,55),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0357  DFLD  POS=(3,62),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0402  DFLD  POS=(4,2),LTH=14,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'Goods receiver',                                       +        
               POS=(5,2),LTH=14,                                       +        
               ATTR=(PROT)                                                      
FLD0518  DFLD  POS=(5,18),LTH=27,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Gross weight',                                         +        
               POS=(5,48),LTH=12,                                      +        
               ATTR=(PROT)                                                      
FLD0564  DFLD  POS=(5,64),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Name',                                                 +        
               POS=(6,6),LTH=4,                                        +        
               ATTR=(PROT)                                                      
FLD0618  DFLD  POS=(6,18),LTH=27,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Gross volume',                                         +        
               POS=(6,48),LTH=12,                                      +        
               ATTR=(PROT)                                                      
FLD0666  DFLD  POS=(6,66),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Goods receiver',                                       +        
               POS=(7,2),LTH=14,                                       +        
               ATTR=(PROT)                                                      
FLD0718  DFLD  POS=(7,18),LTH=27,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Booking No.',                                          +        
               POS=(7,48),LTH=11,                                      +        
               ATTR=(PROT)                                                      
FLD0764  DFLD  POS=(7,64),LTH=15,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Address',                                              +        
               POS=(8,6),LTH=7,                                        +        
               ATTR=(PROT)                                                      
FLD0818  DFLD  POS=(8,18),LTH=27,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Shipment date',                                        +        
               POS=(8,48),LTH=13,                                      +        
               ATTR=(PROT)                                                      
FLD0864  DFLD  POS=(8,64),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Invoice No.',                                          +        
               POS=(12,34),LTH=11,                                     +        
               ATTR=(PROT)                                                      
FLD1248  DFLD  POS=(12,48),LTH=9,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'L/C No.',                                              +        
               POS=(13,2),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FLD1318  DFLD  POS=(13,18),LTH=15,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Pack. & handl',                                        +        
               POS=(13,34),LTH=13,                                     +        
               ATTR=(ALPHA,PROT)                                                
FLD1348  DFLD  POS=(13,48),LTH=9,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Inv order v',                                          +        
               POS=(13,58),LTH=11,                                     +        
               ATTR=(NUM,PROT)                                                  
FLD1370  DFLD  POS=(13,70),LTH=11,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Licence No.',                                          +        
               POS=(14,2),LTH=11,                                      +        
               ATTR=(ALPHA,PROT)                                                
FLD1418  DFLD  POS=(14,18),LTH=15,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Insur. cost',                                          +        
               POS=(14,34),LTH=11,                                     +        
               ATTR=(ALPHA,PROT)                                                
FLD1448  DFLD  POS=(14,48),LTH=9,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Tot inv v',                                            +        
               POS=(14,58),LTH=9,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1470  DFLD  POS=(14,70),LTH=11,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Contract No.',                                         +        
               POS=(15,2),LTH=12,                                      +        
               ATTR=(ALPHA,PROT)                                                
FLD1518  DFLD  POS=(15,18),LTH=15,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Freight cost',                                         +        
               POS=(15,34),LTH=12,                                     +        
               ATTR=(ALPHA,PROT)                                                
FLD1548  DFLD  POS=(15,48),LTH=9,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Legal cost',                                           +        
               POS=(16,34),LTH=10,                                     +        
               ATTR=(PROT)                                                      
FLD1648  DFLD  POS=(16,48),LTH=9,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Total shipment value',                                 +        
               POS=(16,59),LTH=20,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Reduction',                                            +        
               POS=(17,34),LTH=9,                                      +        
               ATTR=(PROT)                                                      
FLD1748  DFLD  POS=(17,47),LTH=10,                                     +        
               ATTR=(PROT)                                                      
FLD1770  DFLD  POS=(17,70),LTH=11,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Goods marking',                                        +        
               POS=(18,2),LTH=13,                                      +        
               ATTR=(ALPHA,PROT)                                                
FLD1818  DFLD  POS=(18,18),LTH=47,                                     +        
               ATTR=(PROT)                                                      
FLD1918  DFLD  POS=(19,18),LTH=47,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '13 Query ship 1  14 Query ship 2  15 Q dist/ship   16 Q+        
                dist/trp   17',                                        +        
               POS=(21,2),LTH=69,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,19),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,36),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,53),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,69),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W4O541N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N541,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I541N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W4N541                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  FLD0208,                                                +        
               LTH=4                                                            
         MFLD  FLD0308,                                                +        
               LTH=4                                                            
         MFLD  FLD0220,                                                +        
               LTH=6                                                            
         MFLD  FLD0320,                                                +        
               LTH=6                                                            
         MFLD  FLD0238,                                                +        
               LTH=9                                                            
         MFLD  FLD0338,                                                +        
               LTH=9                                                            
         MFLD  IDDCIN,                                                 +        
               LTH=2                                                            
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  FLD0257,                                                +        
               LTH=7                                                            
         MFLD  FLD0357,                                                +        
               LTH=7                                                            
         MFLD  FLD0402,                                                +        
               LTH=14                                                           
         MFLD  FLD0518,                                                +        
               LTH=27                                                           
         MFLD  FLD0618,                                                +        
               LTH=27                                                           
         MFLD  FLD0718,                                                +        
               LTH=27                                                           
         MFLD  FLD0818,                                                +        
               LTH=27                                                           
         MFLD  FLD0564,                                                +        
               LTH=8                                                            
         MFLD  FLD0666,                                                +        
               LTH=8                                                            
         MFLD  FLD0764,                                                +        
               LTH=15                                                           
         MFLD  FLD0864,                                                +        
               LTH=6                                                            
         MFLD  FLD1318,                                                +        
               LTH=15                                                           
         MFLD  FLD1418,                                                +        
               LTH=15                                                           
         MFLD  FLD1518,                                                +        
               LTH=15                                                           
         MFLD  FLD1248,                                                +        
               LTH=9                                                            
         MFLD  FLD1348,                                                +        
               LTH=9                                                            
         MFLD  FLD1448,                                                +        
               LTH=9                                                            
         MFLD  FLD1548,                                                +        
               LTH=9                                                            
         MFLD  FLD1648,                                                +        
               LTH=9                                                            
         MFLD  FLD1748,                                                +        
               LTH=10                                                           
         MFLD  FLD1370,                                                +        
               LTH=11                                                           
         MFLD  FLD1470,                                                +        
               LTH=11                                                           
         MFLD  FLD1770,                                                +        
               LTH=11                                                           
         MFLD  FLD1818,                                                +        
               LTH=47                                                           
         MFLD  FLD1918,                                                +        
               LTH=47                                                           
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I541N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N541),                                           +        
               OPT=2,                                                  +        
               NXT=W4O541N1                                                     
MID      LPAGE SOR=(W4N541)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '45412',                                                +        
               LTH=5                                                            
         MFLD  (FLD0208,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0308,                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0220,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0320,                                                +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0238,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0338,                                                +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDDCIN,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDDCUT,                                                 +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0257,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0357,                                                +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0402,                                                +        
               LTH=14,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
