***********************************************************************         
* CREATED BY PCC4448   ON 94/11/10  AT 15:27                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE '                                '                               
W4N537   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W4T531  ',                                           +        
               2='W4T532  ',                                           +        
               3='W4T533  ',                                           +        
               4='W4T534  ',                                           +        
               5='W4T535  ',                                           +        
               6='W4T536  ',                                           +        
               7='W4T537  ',                                           +        
               8='W4T538  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T531  ',                                          +        
               14='W4T532  ',                                          +        
               15='W4T533  ',                                          +        
               16='W4T534  ',                                          +        
               17='W4T535  ',                                          +        
               18='W4T536  ',                                          +        
               19='W4T537  ',                                          +        
               20='W4T538  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,11)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'FREIGHT COST COMPL. SWEDEN',                           +        
               POS=(1,10),LTH=26,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'District',                                             +        
               POS=(2,2),LTH=8,                                        +        
               ATTR=(NUM,PROT)                                                  
FLD0211  DFLD  POS=(2,11),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Prod.No',                                              +        
               POS=(2,17),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0225  DFLD  POS=(2,25),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
FLD0311  DFLD  POS=(3,11),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0325  DFLD  POS=(3,25),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Custno  Orderno',                                      +        
               POS=(5,3),LTH=15,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Fc  Pack.dat  Freight cost',                           +        
               POS=(5,23),LTH=26,                                      +        
               ATTR=(PROT)                                                      
FLD0602  DFLD  POS=(6,2),LTH=32,                                       +        
               ATTR=(PROT)                                                      
FLD0637  DFLD  POS=(6,37),LTH=10,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '1 Query cases   2 Cross cases   3 Loading rel.  4 Backo+        
               ut load. 5 Inv. rel.',                                  +        
               POS=(21,2),LTH=75,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '6 Backout inv.  7',                                    +        
               POS=(22,2),LTH=17,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '8',                                                    +        
               POS=(22,34),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '9',                                                    +        
               POS=(22,50),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4O537N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N537,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I537N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  FLD0211,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0225,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0311,                                                +        
               LTH=5                                                            
         MFLD  FLD0325,                                                +        
               LTH=7                                                            
         MFLD  FLD0602,                                                +        
               LTH=32                                                           
         MFLD  FLD0637,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I537N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N537),                                           +        
               OPT=2,                                                  +        
               NXT=W4O537N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F7'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '45372',                                                +        
               LTH=5                                                            
         MFLD  (FLD0211,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0225,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0311,                                                +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0325,                                                +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0637,                                               +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
