***********************************************************************         
* CREATED BY PC65797   ON 98/04/27  AT 08:38                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'BACKORDER                       '                               
W4N576   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W4T576 7',                                           +        
               8='W4T576 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W4N576   DPAGE CURSOR=((2,11)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Backorder Queue (Part No.)',                           +        
               POS=(1,11),LTH=26,                                      +        
               ATTR=(PROT)                                                      
FELMEDD  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Part No.',                                             +        
               POS=(2,2),LTH=8,                                        +        
               ATTR=(NUM,PROT)                                                  
ARTNRIN  DFLD  POS=(2,11),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DC',                                                   +        
               POS=(2,21),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
IDDCIN   DFLD  POS=(2,24),LTH=2,                                       +        
               ATTR=(ALPHA,NOPROT)                                              
         DFLD  'Status',                                               +        
               POS=(2,27),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
STATIN   DFLD  POS=(2,34),LTH=1,                                       +        
               ATTR=(NUM,NOPROT)                                                
ARTNRUT  DFLD  POS=(3,10),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
IDDCUT   DFLD  POS=(3,24),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
STATUT   DFLD  POS=(3,34),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Distr Cust No. BOdate Quantity Status Order No. Class P+        
               rio Rel.Date Del.Ord',                                  +        
               POS=(5,2),LTH=75,                                       +        
               ATTR=(PROT)                                                      
DISTR1   DFLD  POS=(6,2),LTH=4,                                        +        
               ATTR=(PROT)                                                      
RET1     DFLD  POS=(6,9),LTH=7,                                        +        
               ATTR=(PROT)                                                      
BODATE1  DFLD  POS=(6,17),LTH=6,                                       +        
               ATTR=(PROT)                                                      
ANTAL1   DFLD  POS=(6,25),LTH=7,                                       +        
               ATTR=(PROT)                                                      
STATUS1  DFLD  POS=(6,35),LTH=1,                                       +        
               ATTR=(PROT)                                                      
ORDNO1   DFLD  POS=(6,44),LTH=5,                                       +        
               ATTR=(PROT)                                                      
KLASS1   DFLD  POS=(6,52),LTH=1,                                       +        
               ATTR=(PROT)                                                      
PRIO1    DFLD  POS=(6,56),LTH=3,                                       +        
               ATTR=(PROT)                                                      
RDATE1   DFLD  POS=(6,61),LTH=6,                                       +        
               ATTR=(PROT)                                                      
DELORD1  DFLD  POS=(6,70),LTH=10,                                      +        
               ATTR=(PROT)                                                      
DISTR2   DFLD  POS=(7,2),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
RET2     DFLD  POS=(7,9),LTH=7,                                        +        
               ATTR=(PROT,MOD)                                                  
BODATE2  DFLD  POS=(7,17),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
ANTAL2   DFLD  POS=(7,25),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
STATUS2  DFLD  POS=(7,35),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
ORDNO2   DFLD  POS=(7,44),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
KLASS2   DFLD  POS=(7,52),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
PRIO2    DFLD  POS=(7,56),LTH=3,                                       +        
               ATTR=(PROT)                                                      
RDATE2   DFLD  POS=(7,61),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
DELORD2  DFLD  POS=(7,70),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
DISTR3   DFLD  POS=(8,2),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
RET3     DFLD  POS=(8,9),LTH=7,                                        +        
               ATTR=(PROT,MOD)                                                  
BODATE3  DFLD  POS=(8,17),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
ANTAL3   DFLD  POS=(8,25),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
STATUS3  DFLD  POS=(8,35),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
ORDNO3   DFLD  POS=(8,44),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
KLASS3   DFLD  POS=(8,52),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
PRIO3    DFLD  POS=(8,56),LTH=3,                                       +        
               ATTR=(PROT)                                                      
RDATE3   DFLD  POS=(8,61),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
DELORD3  DFLD  POS=(8,70),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
DISTR4   DFLD  POS=(9,2),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
RET4     DFLD  POS=(9,9),LTH=7,                                        +        
               ATTR=(PROT,MOD)                                                  
BODATE4  DFLD  POS=(9,17),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
ANTAL4   DFLD  POS=(9,25),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
STATUS4  DFLD  POS=(9,35),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
ORDNO4   DFLD  POS=(9,44),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
KLASS4   DFLD  POS=(9,52),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
PRIO4    DFLD  POS=(9,56),LTH=3,                                       +        
               ATTR=(PROT)                                                      
RDATE4   DFLD  POS=(9,61),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
DELORD4  DFLD  POS=(9,70),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
DISTR5   DFLD  POS=(10,2),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
RET5     DFLD  POS=(10,9),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
BODATE5  DFLD  POS=(10,17),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ANTAL5   DFLD  POS=(10,25),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
STATUS5  DFLD  POS=(10,35),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
ORDNO5   DFLD  POS=(10,44),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
KLASS5   DFLD  POS=(10,52),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
PRIO5    DFLD  POS=(10,56),LTH=3,                                      +        
               ATTR=(PROT)                                                      
RDATE5   DFLD  POS=(10,61),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DELORD5  DFLD  POS=(10,70),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
DISTR6   DFLD  POS=(11,2),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
RET6     DFLD  POS=(11,9),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
BODATE6  DFLD  POS=(11,17),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ANTAL6   DFLD  POS=(11,25),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
STATUS6  DFLD  POS=(11,35),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
ORDNO6   DFLD  POS=(11,44),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
KLASS6   DFLD  POS=(11,52),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
PRIO6    DFLD  POS=(11,56),LTH=3,                                      +        
               ATTR=(PROT)                                                      
RDATE6   DFLD  POS=(11,61),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DELORD6  DFLD  POS=(11,70),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
DISTR7   DFLD  POS=(12,2),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
RET7     DFLD  POS=(12,9),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
BODATE7  DFLD  POS=(12,17),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ANTAL7   DFLD  POS=(12,25),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
STATUS7  DFLD  POS=(12,35),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
ORDNO7   DFLD  POS=(12,44),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
KLASS7   DFLD  POS=(12,52),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
PRIO7    DFLD  POS=(12,56),LTH=3,                                      +        
               ATTR=(PROT)                                                      
RDATE7   DFLD  POS=(12,61),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DELORD7  DFLD  POS=(12,70),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
DISTR8   DFLD  POS=(13,2),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
RET8     DFLD  POS=(13,9),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
BODATE8  DFLD  POS=(13,17),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ANTAL8   DFLD  POS=(13,25),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
STATUS8  DFLD  POS=(13,35),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
ORDNO8   DFLD  POS=(13,44),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
KLASS8   DFLD  POS=(13,52),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
PRIO8    DFLD  POS=(13,56),LTH=3,                                      +        
               ATTR=(PROT)                                                      
RDATE8   DFLD  POS=(13,61),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DELORD8  DFLD  POS=(13,70),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
DISTR9   DFLD  POS=(14,2),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
RET9     DFLD  POS=(14,9),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
BODATE9  DFLD  POS=(14,17),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ANTAL9   DFLD  POS=(14,25),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
STATUS9  DFLD  POS=(14,35),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
ORDNO9   DFLD  POS=(14,44),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
KLASS9   DFLD  POS=(14,52),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
PRIO9    DFLD  POS=(14,56),LTH=3,                                      +        
               ATTR=(PROT)                                                      
RDATE9   DFLD  POS=(14,61),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DELORD9  DFLD  POS=(14,70),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
DISTR10  DFLD  POS=(15,2),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
RET10    DFLD  POS=(15,9),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
BODATE10 DFLD  POS=(15,17),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ANTAL10  DFLD  POS=(15,25),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
STATUS10 DFLD  POS=(15,35),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
ORDNO10  DFLD  POS=(15,44),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
KLASS10  DFLD  POS=(15,52),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
PRIO10   DFLD  POS=(15,56),LTH=3,                                      +        
               ATTR=(PROT)                                                      
RDATE10  DFLD  POS=(15,61),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DELORD10 DFLD  POS=(15,70),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
DISTR11  DFLD  POS=(16,2),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
RET11    DFLD  POS=(16,9),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
BODATE11 DFLD  POS=(16,17),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ANTAL11  DFLD  POS=(16,25),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
STATUS11 DFLD  POS=(16,35),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
ORDNO11  DFLD  POS=(16,44),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
KLASS11  DFLD  POS=(16,52),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
PRIO11   DFLD  POS=(16,56),LTH=3,                                      +        
               ATTR=(PROT)                                                      
RDATE11  DFLD  POS=(16,61),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DELORD11 DFLD  POS=(16,70),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
DISTR12  DFLD  POS=(17,2),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
RET12    DFLD  POS=(17,9),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
BODATE12 DFLD  POS=(17,17),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ANTAL12  DFLD  POS=(17,25),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
STATUS12 DFLD  POS=(17,35),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
ORDNO12  DFLD  POS=(17,44),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
KLASS12  DFLD  POS=(17,52),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
PRIO12   DFLD  POS=(17,56),LTH=3,                                      +        
               ATTR=(PROT)                                                      
RDATE12  DFLD  POS=(17,61),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DELORD12 DFLD  POS=(17,70),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
DISTR13  DFLD  POS=(18,2),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
RET13    DFLD  POS=(18,9),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
BODATE13 DFLD  POS=(18,17),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ANTAL13  DFLD  POS=(18,25),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
STATUS13 DFLD  POS=(18,35),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
ORDNO13  DFLD  POS=(18,44),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
KLASS13  DFLD  POS=(18,52),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
PRIO13   DFLD  POS=(18,56),LTH=3,                                      +        
               ATTR=(PROT)                                                      
RDATE13  DFLD  POS=(18,61),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DELORD13 DFLD  POS=(18,70),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
DISTR14  DFLD  POS=(19,2),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
RET14    DFLD  POS=(19,9),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
BODATE14 DFLD  POS=(19,17),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ANTAL14  DFLD  POS=(19,25),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
STATUS14 DFLD  POS=(19,35),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
ORDNO14  DFLD  POS=(19,44),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
KLASS14  DFLD  POS=(19,52),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
PRIO14   DFLD  POS=(19,56),LTH=3,                                      +        
               ATTR=(PROT)                                                      
RDATE14  DFLD  POS=(19,61),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DELORD14 DFLD  POS=(19,70),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
DISTR15  DFLD  POS=(20,2),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
RET15    DFLD  POS=(20,9),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
BODATE15 DFLD  POS=(20,17),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ANTAL15  DFLD  POS=(20,25),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
STATUS15 DFLD  POS=(20,35),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
ORDNO15  DFLD  POS=(20,44),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
KLASS15  DFLD  POS=(20,52),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
PRIO15   DFLD  POS=(20,56),LTH=3,                                      +        
               ATTR=(PROT)                                                      
RDATE15  DFLD  POS=(20,61),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DELORD15 DFLD  POS=(20,70),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'F7=First        F8=Forward     F10=WHELP',             +        
               POS=(22,2),LTH=40,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'F12=Logoff',                                           +        
               POS=(22,47),LTH=10,                                     +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATUM    DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TID      DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W4O576N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N576,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I576N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W4N576                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FELMEDD,                                                +        
               LTH=40                                                           
         MFLD  ARTNRIN,                                                +        
               LTH=9                                                            
         MFLD  ARTNRUT,                                                +        
               LTH=9                                                            
         MFLD  IDDCIN,                                                 +        
               LTH=2                                                            
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  STATIN,                                                 +        
               LTH=1                                                            
         MFLD  STATUT,                                                 +        
               LTH=1                                                            
         MFLD  DISTR1,                                                 +        
               LTH=4                                                            
         MFLD  RET1,                                                   +        
               LTH=7                                                            
         MFLD  BODATE1,                                                +        
               LTH=6                                                            
         MFLD  ANTAL1,                                                 +        
               LTH=7                                                            
         MFLD  STATUS1,                                                +        
               LTH=1                                                            
         MFLD  ORDNO1,                                                 +        
               LTH=5                                                            
         MFLD  KLASS1,                                                 +        
               LTH=1                                                            
         MFLD  PRIO1,                                                  +        
               LTH=3                                                            
         MFLD  RDATE1,                                                 +        
               LTH=6                                                            
         MFLD  DELORD1,                                                +        
               LTH=10                                                           
         MFLD  DISTR2,                                                 +        
               LTH=4                                                            
         MFLD  RET2,                                                   +        
               LTH=7                                                            
         MFLD  BODATE2,                                                +        
               LTH=6                                                            
         MFLD  ANTAL2,                                                 +        
               LTH=7                                                            
         MFLD  STATUS2,                                                +        
               LTH=1                                                            
         MFLD  ORDNO2,                                                 +        
               LTH=5                                                            
         MFLD  KLASS2,                                                 +        
               LTH=1                                                            
         MFLD  PRIO2,                                                  +        
               LTH=3                                                            
         MFLD  RDATE2,                                                 +        
               LTH=6                                                            
         MFLD  DELORD2,                                                +        
               LTH=10                                                           
         MFLD  DISTR3,                                                 +        
               LTH=4                                                            
         MFLD  RET3,                                                   +        
               LTH=7                                                            
         MFLD  BODATE3,                                                +        
               LTH=6                                                            
         MFLD  ANTAL3,                                                 +        
               LTH=7                                                            
         MFLD  STATUS3,                                                +        
               LTH=1                                                            
         MFLD  ORDNO3,                                                 +        
               LTH=5                                                            
         MFLD  KLASS3,                                                 +        
               LTH=1                                                            
         MFLD  PRIO3,                                                  +        
               LTH=3                                                            
         MFLD  RDATE3,                                                 +        
               LTH=6                                                            
         MFLD  DELORD3,                                                +        
               LTH=10                                                           
         MFLD  DISTR4,                                                 +        
               LTH=4                                                            
         MFLD  RET4,                                                   +        
               LTH=7                                                            
         MFLD  BODATE4,                                                +        
               LTH=6                                                            
         MFLD  ANTAL4,                                                 +        
               LTH=7                                                            
         MFLD  STATUS4,                                                +        
               LTH=1                                                            
         MFLD  ORDNO4,                                                 +        
               LTH=5                                                            
         MFLD  KLASS4,                                                 +        
               LTH=1                                                            
         MFLD  PRIO4,                                                  +        
               LTH=3                                                            
         MFLD  RDATE4,                                                 +        
               LTH=6                                                            
         MFLD  DELORD4,                                                +        
               LTH=10                                                           
         MFLD  DISTR5,                                                 +        
               LTH=4                                                            
         MFLD  RET5,                                                   +        
               LTH=7                                                            
         MFLD  BODATE5,                                                +        
               LTH=6                                                            
         MFLD  ANTAL5,                                                 +        
               LTH=7                                                            
         MFLD  STATUS5,                                                +        
               LTH=1                                                            
         MFLD  ORDNO5,                                                 +        
               LTH=5                                                            
         MFLD  KLASS5,                                                 +        
               LTH=1                                                            
         MFLD  PRIO5,                                                  +        
               LTH=3                                                            
         MFLD  RDATE5,                                                 +        
               LTH=6                                                            
         MFLD  DELORD5,                                                +        
               LTH=10                                                           
         MFLD  DISTR6,                                                 +        
               LTH=4                                                            
         MFLD  RET6,                                                   +        
               LTH=7                                                            
         MFLD  BODATE6,                                                +        
               LTH=6                                                            
         MFLD  ANTAL6,                                                 +        
               LTH=7                                                            
         MFLD  STATUS6,                                                +        
               LTH=1                                                            
         MFLD  ORDNO6,                                                 +        
               LTH=5                                                            
         MFLD  KLASS6,                                                 +        
               LTH=1                                                            
         MFLD  PRIO6,                                                  +        
               LTH=3                                                            
         MFLD  RDATE6,                                                 +        
               LTH=6                                                            
         MFLD  DELORD6,                                                +        
               LTH=10                                                           
         MFLD  DISTR7,                                                 +        
               LTH=4                                                            
         MFLD  RET7,                                                   +        
               LTH=7                                                            
         MFLD  BODATE7,                                                +        
               LTH=6                                                            
         MFLD  ANTAL7,                                                 +        
               LTH=7                                                            
         MFLD  STATUS7,                                                +        
               LTH=1                                                            
         MFLD  ORDNO7,                                                 +        
               LTH=5                                                            
         MFLD  KLASS7,                                                 +        
               LTH=1                                                            
         MFLD  PRIO7,                                                  +        
               LTH=3                                                            
         MFLD  RDATE7,                                                 +        
               LTH=6                                                            
         MFLD  DELORD7,                                                +        
               LTH=10                                                           
         MFLD  DISTR8,                                                 +        
               LTH=4                                                            
         MFLD  RET8,                                                   +        
               LTH=7                                                            
         MFLD  BODATE8,                                                +        
               LTH=6                                                            
         MFLD  ANTAL8,                                                 +        
               LTH=7                                                            
         MFLD  STATUS8,                                                +        
               LTH=1                                                            
         MFLD  ORDNO8,                                                 +        
               LTH=5                                                            
         MFLD  KLASS8,                                                 +        
               LTH=1                                                            
         MFLD  PRIO8,                                                  +        
               LTH=3                                                            
         MFLD  RDATE8,                                                 +        
               LTH=6                                                            
         MFLD  DELORD8,                                                +        
               LTH=10                                                           
         MFLD  DISTR9,                                                 +        
               LTH=4                                                            
         MFLD  RET9,                                                   +        
               LTH=7                                                            
         MFLD  BODATE9,                                                +        
               LTH=6                                                            
         MFLD  ANTAL9,                                                 +        
               LTH=7                                                            
         MFLD  STATUS9,                                                +        
               LTH=1                                                            
         MFLD  ORDNO9,                                                 +        
               LTH=5                                                            
         MFLD  KLASS9,                                                 +        
               LTH=1                                                            
         MFLD  PRIO9,                                                  +        
               LTH=3                                                            
         MFLD  RDATE9,                                                 +        
               LTH=6                                                            
         MFLD  DELORD9,                                                +        
               LTH=10                                                           
         MFLD  DISTR10,                                                +        
               LTH=4                                                            
         MFLD  RET10,                                                  +        
               LTH=7                                                            
         MFLD  BODATE10,                                               +        
               LTH=6                                                            
         MFLD  ANTAL10,                                                +        
               LTH=7                                                            
         MFLD  STATUS10,                                               +        
               LTH=1                                                            
         MFLD  ORDNO10,                                                +        
               LTH=5                                                            
         MFLD  KLASS10,                                                +        
               LTH=1                                                            
         MFLD  PRIO10,                                                 +        
               LTH=3                                                            
         MFLD  RDATE10,                                                +        
               LTH=6                                                            
         MFLD  DELORD10,                                               +        
               LTH=10                                                           
         MFLD  DISTR11,                                                +        
               LTH=4                                                            
         MFLD  RET11,                                                  +        
               LTH=7                                                            
         MFLD  BODATE11,                                               +        
               LTH=6                                                            
         MFLD  ANTAL11,                                                +        
               LTH=7                                                            
         MFLD  STATUS11,                                               +        
               LTH=1                                                            
         MFLD  ORDNO11,                                                +        
               LTH=5                                                            
         MFLD  KLASS11,                                                +        
               LTH=1                                                            
         MFLD  PRIO11,                                                 +        
               LTH=3                                                            
         MFLD  RDATE11,                                                +        
               LTH=6                                                            
         MFLD  DELORD11,                                               +        
               LTH=10                                                           
         MFLD  DISTR12,                                                +        
               LTH=4                                                            
         MFLD  RET12,                                                  +        
               LTH=7                                                            
         MFLD  BODATE12,                                               +        
               LTH=6                                                            
         MFLD  ANTAL12,                                                +        
               LTH=7                                                            
         MFLD  STATUS12,                                               +        
               LTH=1                                                            
         MFLD  ORDNO12,                                                +        
               LTH=5                                                            
         MFLD  KLASS12,                                                +        
               LTH=1                                                            
         MFLD  PRIO12,                                                 +        
               LTH=3                                                            
         MFLD  RDATE12,                                                +        
               LTH=6                                                            
         MFLD  DELORD12,                                               +        
               LTH=10                                                           
         MFLD  DISTR13,                                                +        
               LTH=4                                                            
         MFLD  RET13,                                                  +        
               LTH=7                                                            
         MFLD  BODATE13,                                               +        
               LTH=6                                                            
         MFLD  ANTAL13,                                                +        
               LTH=7                                                            
         MFLD  STATUS13,                                               +        
               LTH=1                                                            
         MFLD  ORDNO13,                                                +        
               LTH=5                                                            
         MFLD  KLASS13,                                                +        
               LTH=1                                                            
         MFLD  PRIO13,                                                 +        
               LTH=3                                                            
         MFLD  RDATE13,                                                +        
               LTH=6                                                            
         MFLD  DELORD13,                                               +        
               LTH=10                                                           
         MFLD  DISTR14,                                                +        
               LTH=4                                                            
         MFLD  RET14,                                                  +        
               LTH=7                                                            
         MFLD  BODATE14,                                               +        
               LTH=6                                                            
         MFLD  ANTAL14,                                                +        
               LTH=7                                                            
         MFLD  STATUS14,                                               +        
               LTH=1                                                            
         MFLD  ORDNO14,                                                +        
               LTH=5                                                            
         MFLD  KLASS14,                                                +        
               LTH=1                                                            
         MFLD  PRIO14,                                                 +        
               LTH=3                                                            
         MFLD  RDATE14,                                                +        
               LTH=6                                                            
         MFLD  DELORD14,                                               +        
               LTH=10                                                           
         MFLD  DISTR15,                                                +        
               LTH=4                                                            
         MFLD  RET15,                                                  +        
               LTH=7                                                            
         MFLD  BODATE15,                                               +        
               LTH=6                                                            
         MFLD  ANTAL15,                                                +        
               LTH=7                                                            
         MFLD  STATUS15,                                               +        
               LTH=1                                                            
         MFLD  ORDNO15,                                                +        
               LTH=5                                                            
         MFLD  KLASS15,                                                +        
               LTH=1                                                            
         MFLD  PRIO15,                                                 +        
               LTH=3                                                            
         MFLD  RDATE15,                                                +        
               LTH=6                                                            
         MFLD  DELORD15,                                               +        
               LTH=10                                                           
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATUM,                                                 +        
               DATE4)                                                           
         MFLD  (TID,                                                   +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I576N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N576),                                           +        
               OPT=2,                                                  +        
               NXT=W4O576N1                                                     
MID      LPAGE SOR=(W4N576)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F7'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '45762',                                                +        
               LTH=5                                                            
         MFLD  (ARTNRIN,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  ARTNRUT,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (IDDCIN,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDDCUT,                                                 +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (STATIN,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  STATUT,                                                 +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
