***********************************************************************         
* CREATED BY PCC4448   ON 95/01/25  AT 09:17                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'ORDEWINFO LOADED CASES          '                               
W4N506   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W4T506 7',                                           +        
               8='W4T506 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T501  ',                                          +        
               14='W4T502  ',                                          +        
               15='W4T503  ',                                          +        
               16='W4T504  ',                                          +        
               17='W4T505  ',                                          +        
               18='W4T506  ',                                          +        
               19='W4T507  ',                                          +        
               20='W4T508  ',                                          +        
               21='W4T509  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W4N506   DPAGE CURSOR=((2,7))                                                   
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'QUERY ORDER LOADED CASES   ',                          +        
               POS=(1,11),LTH=27,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Dist',                                                 +        
               POS=(2,2),LTH=4,                                        +        
               ATTR=(ALPHA,PROT)                                                
DGIA0002 DFLD  POS=(2,7),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Cust',                                                 +        
               POS=(2,13),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0008 DFLD  POS=(2,18),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Shipno',                                               +        
               POS=(2,26),LTH=6,                                       +        
               ATTR=(PROT)                                                      
DGIA0016 DFLD  POS=(2,33),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DC',                                                   +        
               POS=(2,42),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDDCIN   DFLD  POS=(2,45),LTH=2,                                       +        
               ATTR=(ALPHA,NOPROT)                                              
DGIA0003 DFLD  POS=(3,7),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
DGIA0009 DFLD  POS=(3,18),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0017 DFLD  POS=(3,33),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
IDDCUT   DFLD  POS=(3,45),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'New carrier (Y)',                                      +        
               POS=(3,52),LTH=15,                                      +        
               ATTR=(PROT)                                                      
DGIA0013 DFLD  POS=(3,69),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0010 DFLD  POS=(4,2),LTH=12,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0011 DFLD  POS=(4,15),LTH=12,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0014 DFLD  POS=(4,28),LTH=7,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0015 DFLD  POS=(4,36),LTH=7,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0006 DFLD  POS=(4,44),LTH=5,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0007 DFLD  POS=(4,50),LTH=5,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
         DFLD  'Carrier desc',                                         +        
               POS=(5,2),LTH=12,                                       +        
               ATTR=(PROT)                                                      
DGIA0000 DFLD  POS=(5,15),LTH=15,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Carr-type',                                            +        
               POS=(5,32),LTH=9,                                       +        
               ATTR=(PROT)                                                      
DGIA0001 DFLD  POS=(5,42),LTH=12,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Carr-seal',                                            +        
               POS=(5,55),LTH=9,                                       +        
               ATTR=(ALPHA,PROT)                                                
SIGILL   DFLD  POS=(5,65),LTH=9,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Fr letter no',                                         +        
               POS=(6,2),LTH=12,                                       +        
               ATTR=(PROT)                                                      
DGIA0004 DFLD  POS=(6,15),LTH=15,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Load-date',                                            +        
               POS=(6,32),LTH=9,                                       +        
               ATTR=(PROT)                                                      
DGIA0012 DFLD  POS=(6,42),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'W gross',                                              +        
               POS=(7,2),LTH=7,                                        +        
               ATTR=(PROT)                                                      
BTOVIKT  DFLD  POS=(7,10),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Order vol',                                            +        
               POS=(7,19),LTH=9,                                       +        
               ATTR=(ALPHA,PROT)                                                
BTOVOL   DFLD  POS=(7,29),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Order value',                                          +        
               POS=(7,38),LTH=11,                                      +        
               ATTR=(ALPHA,PROT)                                                
DGIA0005 DFLD  POS=(7,50),LTH=12,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Tare',                                                 +        
               POS=(7,63),LTH=4,                                       +        
               ATTR=(ALPHA,PROT)                                                
TARA     DFLD  POS=(7,68),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Prodno   Cse  Inv-no',                                 +        
               POS=(9,3),LTH=20,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Prodno   Cse  Inv-no',                                 +        
               POS=(9,29),LTH=20,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Prodno   Cse  Inv-no',                                 +        
               POS=(9,55),LTH=20,                                      +        
               ATTR=(PROT)                                                      
PRODNR1  DFLD  POS=(10,2),LTH=7,                                       +        
               ATTR=(PROT)                                                      
KOLLI1   DFLD  POS=(10,10),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FAKT1    DFLD  POS=(10,16),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
PRODNR11 DFLD  POS=(10,28),LTH=7,                                      +        
               ATTR=(PROT)                                                      
KOLLI11  DFLD  POS=(10,36),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FAKT11   DFLD  POS=(10,42),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
PRODNR21 DFLD  POS=(10,54),LTH=7,                                      +        
               ATTR=(PROT)                                                      
KOLLI21  DFLD  POS=(10,62),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FAKT21   DFLD  POS=(10,68),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
PRODNR2  DFLD  POS=(11,2),LTH=7,                                       +        
               ATTR=(PROT)                                                      
KOLLI2   DFLD  POS=(11,10),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FAKT2    DFLD  POS=(11,16),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
PRODNR12 DFLD  POS=(11,28),LTH=7,                                      +        
               ATTR=(PROT)                                                      
KOLLI12  DFLD  POS=(11,36),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FAKTNR12 DFLD  POS=(11,42),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
PRODNR22 DFLD  POS=(11,54),LTH=7,                                      +        
               ATTR=(PROT)                                                      
KOLLI22  DFLD  POS=(11,62),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FAKT22   DFLD  POS=(11,68),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
PRODNR3  DFLD  POS=(12,2),LTH=7,                                       +        
               ATTR=(PROT)                                                      
KOLLI3   DFLD  POS=(12,10),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FAKT3    DFLD  POS=(12,16),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
PRODNR13 DFLD  POS=(12,28),LTH=7,                                      +        
               ATTR=(PROT)                                                      
KOLLI13  DFLD  POS=(12,36),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FAKT13   DFLD  POS=(12,42),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
PRODNR23 DFLD  POS=(12,54),LTH=7,                                      +        
               ATTR=(PROT)                                                      
KOLLI23  DFLD  POS=(12,62),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FAKT23   DFLD  POS=(12,68),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
PRODNR4  DFLD  POS=(13,2),LTH=7,                                       +        
               ATTR=(PROT)                                                      
KOLLI4   DFLD  POS=(13,10),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FAKT4    DFLD  POS=(13,16),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
PRODNR14 DFLD  POS=(13,28),LTH=7,                                      +        
               ATTR=(PROT)                                                      
KOLLI14  DFLD  POS=(13,36),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FAKT14   DFLD  POS=(13,42),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
PRODNR24 DFLD  POS=(13,54),LTH=7,                                      +        
               ATTR=(PROT)                                                      
KOLLI24  DFLD  POS=(13,62),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FAKT24   DFLD  POS=(13,68),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
PRODNR5  DFLD  POS=(14,2),LTH=7,                                       +        
               ATTR=(PROT)                                                      
KOLLI5   DFLD  POS=(14,10),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FAKT5    DFLD  POS=(14,16),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
PRODNR15 DFLD  POS=(14,28),LTH=7,                                      +        
               ATTR=(PROT)                                                      
KOLLI15  DFLD  POS=(14,36),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FAKT15   DFLD  POS=(14,42),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
PRODNR25 DFLD  POS=(14,54),LTH=7,                                      +        
               ATTR=(PROT)                                                      
KOLLI25  DFLD  POS=(14,62),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FAKT25   DFLD  POS=(14,68),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
PRODNR6  DFLD  POS=(15,2),LTH=7,                                       +        
               ATTR=(PROT)                                                      
KOLLI6   DFLD  POS=(15,10),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FAKT6    DFLD  POS=(15,16),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
PRODNR16 DFLD  POS=(15,28),LTH=7,                                      +        
               ATTR=(PROT)                                                      
KOLLI16  DFLD  POS=(15,36),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FAKT16   DFLD  POS=(15,42),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
PRODNR26 DFLD  POS=(15,54),LTH=7,                                      +        
               ATTR=(PROT)                                                      
KOLLI26  DFLD  POS=(15,62),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FAKT26   DFLD  POS=(15,68),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
PRODNR7  DFLD  POS=(16,2),LTH=7,                                       +        
               ATTR=(PROT)                                                      
KOLLI7   DFLD  POS=(16,10),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FAKT7    DFLD  POS=(16,16),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
PRODNR17 DFLD  POS=(16,28),LTH=7,                                      +        
               ATTR=(PROT)                                                      
KOLLI17  DFLD  POS=(16,36),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FAKT17   DFLD  POS=(16,42),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
PRODNR27 DFLD  POS=(16,54),LTH=7,                                      +        
               ATTR=(PROT)                                                      
KOLLI27  DFLD  POS=(16,62),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FAKT27   DFLD  POS=(16,68),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
PRODNR8  DFLD  POS=(17,2),LTH=7,                                       +        
               ATTR=(PROT)                                                      
KOLLI8   DFLD  POS=(17,10),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FAKT8    DFLD  POS=(17,16),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
PRODNR18 DFLD  POS=(17,28),LTH=7,                                      +        
               ATTR=(PROT)                                                      
KOLLI18  DFLD  POS=(17,36),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FAKT18   DFLD  POS=(17,42),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
PRODNR28 DFLD  POS=(17,54),LTH=7,                                      +        
               ATTR=(PROT)                                                      
KOLLI28  DFLD  POS=(17,62),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FAKT28   DFLD  POS=(17,68),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
PRODNR9  DFLD  POS=(18,2),LTH=7,                                       +        
               ATTR=(PROT)                                                      
KOLLI9   DFLD  POS=(18,10),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FAKT9    DFLD  POS=(18,16),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
PRODNR19 DFLD  POS=(18,28),LTH=7,                                      +        
               ATTR=(PROT)                                                      
KOLLI19  DFLD  POS=(18,36),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FAKT19   DFLD  POS=(18,42),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
PRODNR29 DFLD  POS=(18,54),LTH=7,                                      +        
               ATTR=(PROT)                                                      
KOLLI29  DFLD  POS=(18,62),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FAKT29   DFLD  POS=(18,68),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
PRODNR10 DFLD  POS=(19,2),LTH=7,                                       +        
               ATTR=(PROT)                                                      
KOLLI10  DFLD  POS=(19,10),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FAKT10   DFLD  POS=(19,16),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
PRODNR20 DFLD  POS=(19,28),LTH=7,                                      +        
               ATTR=(PROT)                                                      
KOLLI20  DFLD  POS=(19,36),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FAKT20   DFLD  POS=(19,42),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
PRODNR30 DFLD  POS=(19,54),LTH=7,                                      +        
               ATTR=(PROT)                                                      
KOLLI30  DFLD  POS=(19,62),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FAKT30   DFLD  POS=(19,68),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  '13 Gen order   14 Order part   15 Order value 16 Order +        
               cust info 17 Pack/load',                                +        
               POS=(21,2),LTH=77,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18 Cases load  19 Archive PU   20 Cases',              +        
               POS=(22,2),LTH=39,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21 Part info',                                         +        
               POS=(22,48),LTH=12,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,67),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2374  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4I506N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N506),                                           +        
               OPT=2,                                                  +        
               NXT=N4O51501                                                     
MID      LPAGE SOR=(W4N506)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  ' ',                                                    +        
               LTH=2                                                            
         MFLD  '45062',                                                +        
               LTH=5                                                            
         MFLD  (DGIA0002,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0003,                                               +        
               LTH=4                                                            
         MFLD  (DGIA0008,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0009,                                               +        
               LTH=6                                                            
         MFLD  (DGIA0016,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0017,                                               +        
               LTH=7                                                            
         MFLD  (IDDCIN,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  (DGIA0013,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  DGIA0010,                                               +        
               LTH=12                                                           
         MFLD  DGIA0011,                                               +        
               LTH=12                                                           
         MFLD  DGIA0014,                                               +        
               LTH=7                                                            
         MFLD  DGIA0015,                                               +        
               LTH=7                                                            
         MFLD  DGIA0006,                                               +        
               LTH=5                                                            
         MFLD  DGIA0007,                                               +        
               LTH=5                                                            
         MSGEND                                                                 
W4O506N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N506,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I506N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W4N506                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  DGIA0002,                                               +        
               LTH=2                                                            
         MFLD  DGIA0003,                                               +        
               LTH=4                                                            
         MFLD  DGIA0008,                                               +        
               LTH=2                                                            
         MFLD  DGIA0009,                                               +        
               LTH=6                                                            
         MFLD  DGIA0016,                                               +        
               LTH=2                                                            
         MFLD  DGIA0017,                                               +        
               LTH=7                                                            
         MFLD  IDDCIN,                                                 +        
               LTH=2                                                            
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  DGIA0013,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0010,                                               +        
               LTH=12                                                           
         MFLD  DGIA0011,                                               +        
               LTH=12                                                           
         MFLD  DGIA0014,                                               +        
               LTH=7                                                            
         MFLD  DGIA0015,                                               +        
               LTH=7                                                            
         MFLD  DGIA0006,                                               +        
               LTH=5                                                            
         MFLD  DGIA0007,                                               +        
               LTH=5                                                            
         MFLD  DGIA0000,                                               +        
               LTH=15                                                           
         MFLD  DGIA0001,                                               +        
               LTH=12                                                           
         MFLD  SIGILL,                                                 +        
               LTH=9                                                            
         MFLD  DGIA0004,                                               +        
               LTH=15                                                           
         MFLD  DGIA0012,                                               +        
               LTH=6                                                            
         MFLD  BTOVIKT,                                                +        
               LTH=8                                                            
         MFLD  BTOVOL,                                                 +        
               LTH=8                                                            
         MFLD  DGIA0005,                                               +        
               LTH=12                                                           
         MFLD  TARA,                                                   +        
               LTH=8                                                            
         MFLD  PRODNR1,                                                +        
               LTH=7                                                            
         MFLD  KOLLI1,                                                 +        
               LTH=5                                                            
         MFLD  FAKT1,                                                  +        
               LTH=7                                                            
         MFLD  PRODNR2,                                                +        
               LTH=7                                                            
         MFLD  KOLLI2,                                                 +        
               LTH=5                                                            
         MFLD  FAKT2,                                                  +        
               LTH=7                                                            
         MFLD  PRODNR3,                                                +        
               LTH=7                                                            
         MFLD  KOLLI3,                                                 +        
               LTH=5                                                            
         MFLD  FAKT3,                                                  +        
               LTH=7                                                            
         MFLD  PRODNR4,                                                +        
               LTH=7                                                            
         MFLD  KOLLI4,                                                 +        
               LTH=5                                                            
         MFLD  FAKT4,                                                  +        
               LTH=7                                                            
         MFLD  PRODNR5,                                                +        
               LTH=7                                                            
         MFLD  KOLLI5,                                                 +        
               LTH=5                                                            
         MFLD  FAKT5,                                                  +        
               LTH=7                                                            
         MFLD  PRODNR6,                                                +        
               LTH=7                                                            
         MFLD  KOLLI6,                                                 +        
               LTH=5                                                            
         MFLD  FAKT6,                                                  +        
               LTH=7                                                            
         MFLD  PRODNR7,                                                +        
               LTH=7                                                            
         MFLD  KOLLI7,                                                 +        
               LTH=5                                                            
         MFLD  FAKT7,                                                  +        
               LTH=7                                                            
         MFLD  PRODNR8,                                                +        
               LTH=7                                                            
         MFLD  KOLLI8,                                                 +        
               LTH=5                                                            
         MFLD  FAKT8,                                                  +        
               LTH=7                                                            
         MFLD  PRODNR9,                                                +        
               LTH=7                                                            
         MFLD  KOLLI9,                                                 +        
               LTH=5                                                            
         MFLD  FAKT9,                                                  +        
               LTH=7                                                            
         MFLD  PRODNR10,                                               +        
               LTH=7                                                            
         MFLD  KOLLI10,                                                +        
               LTH=5                                                            
         MFLD  FAKT10,                                                 +        
               LTH=7                                                            
         MFLD  PRODNR11,                                               +        
               LTH=7                                                            
         MFLD  KOLLI11,                                                +        
               LTH=5                                                            
         MFLD  FAKT11,                                                 +        
               LTH=7                                                            
         MFLD  PRODNR12,                                               +        
               LTH=7                                                            
         MFLD  KOLLI12,                                                +        
               LTH=5                                                            
         MFLD  FAKTNR12,                                               +        
               LTH=7                                                            
         MFLD  PRODNR13,                                               +        
               LTH=7                                                            
         MFLD  KOLLI13,                                                +        
               LTH=5                                                            
         MFLD  FAKT13,                                                 +        
               LTH=7                                                            
         MFLD  PRODNR14,                                               +        
               LTH=7                                                            
         MFLD  KOLLI14,                                                +        
               LTH=5                                                            
         MFLD  FAKT14,                                                 +        
               LTH=7                                                            
         MFLD  PRODNR15,                                               +        
               LTH=7                                                            
         MFLD  KOLLI15,                                                +        
               LTH=5                                                            
         MFLD  FAKT15,                                                 +        
               LTH=7                                                            
         MFLD  PRODNR16,                                               +        
               LTH=7                                                            
         MFLD  KOLLI16,                                                +        
               LTH=5                                                            
         MFLD  FAKT16,                                                 +        
               LTH=7                                                            
         MFLD  PRODNR17,                                               +        
               LTH=7                                                            
         MFLD  KOLLI17,                                                +        
               LTH=5                                                            
         MFLD  FAKT17,                                                 +        
               LTH=7                                                            
         MFLD  PRODNR18,                                               +        
               LTH=7                                                            
         MFLD  KOLLI18,                                                +        
               LTH=5                                                            
         MFLD  FAKT18,                                                 +        
               LTH=7                                                            
         MFLD  PRODNR19,                                               +        
               LTH=7                                                            
         MFLD  KOLLI19,                                                +        
               LTH=5                                                            
         MFLD  FAKT19,                                                 +        
               LTH=7                                                            
         MFLD  PRODNR20,                                               +        
               LTH=7                                                            
         MFLD  KOLLI20,                                                +        
               LTH=5                                                            
         MFLD  FAKT20,                                                 +        
               LTH=7                                                            
         MFLD  PRODNR21,                                               +        
               LTH=7                                                            
         MFLD  KOLLI21,                                                +        
               LTH=5                                                            
         MFLD  FAKT21,                                                 +        
               LTH=7                                                            
         MFLD  PRODNR22,                                               +        
               LTH=7                                                            
         MFLD  KOLLI22,                                                +        
               LTH=5                                                            
         MFLD  FAKT22,                                                 +        
               LTH=7                                                            
         MFLD  PRODNR23,                                               +        
               LTH=7                                                            
         MFLD  KOLLI23,                                                +        
               LTH=5                                                            
         MFLD  FAKT23,                                                 +        
               LTH=7                                                            
         MFLD  PRODNR24,                                               +        
               LTH=7                                                            
         MFLD  KOLLI24,                                                +        
               LTH=5                                                            
         MFLD  FAKT24,                                                 +        
               LTH=7                                                            
         MFLD  PRODNR25,                                               +        
               LTH=7                                                            
         MFLD  KOLLI25,                                                +        
               LTH=5                                                            
         MFLD  FAKT25,                                                 +        
               LTH=7                                                            
         MFLD  PRODNR26,                                               +        
               LTH=7                                                            
         MFLD  KOLLI26,                                                +        
               LTH=5                                                            
         MFLD  FAKT26,                                                 +        
               LTH=7                                                            
         MFLD  PRODNR27,                                               +        
               LTH=7                                                            
         MFLD  KOLLI27,                                                +        
               LTH=5                                                            
         MFLD  FAKT27,                                                 +        
               LTH=7                                                            
         MFLD  PRODNR28,                                               +        
               LTH=7                                                            
         MFLD  KOLLI28,                                                +        
               LTH=5                                                            
         MFLD  FAKT28,                                                 +        
               LTH=7                                                            
         MFLD  PRODNR29,                                               +        
               LTH=7                                                            
         MFLD  KOLLI29,                                                +        
               LTH=5                                                            
         MFLD  FAKT29,                                                 +        
               LTH=7                                                            
         MFLD  PRODNR30,                                               +        
               LTH=7                                                            
         MFLD  KOLLI30,                                                +        
               LTH=5                                                            
         MFLD  FAKT30,                                                 +        
               LTH=7                                                            
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2374,                                               +        
               TIME)                                                            
         MFLD  FSYSMSG,                                                +        
               LTH=79                                                           
         MSGEND                                                                 
         END                                                                    
