***********************************************************************         
* CREATED BY PCC4448   ON 95/02/17  AT 13:04                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE '                                '                               
W4N562   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T561  ',                                          +        
               14='W0T562  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,14)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'QUERY LOADING 2    ',                                  +        
               POS=(1,12),LTH=19,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Loading No.',                                          +        
               POS=(2,2),LTH=11,                                       +        
               ATTR=(ALPHA,PROT)                                                
FLD0214  DFLD  POS=(2,14),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '*Status',                                              +        
               POS=(2,24),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FLD0246  DFLD  POS=(2,32),LTH=1,                                       +        
               ATTR=(NUM,NOPROT)                                                
FLD0314  DFLD  POS=(3,14),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  '*',                                                    +        
               POS=(3,24),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0346  DFLD  POS=(3,32),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0402  DFLD  POS=(4,2),LTH=1,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0406  DFLD  POS=(4,6),LTH=7,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0415  DFLD  POS=(4,15),LTH=5,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'District',                                             +        
               POS=(5,2),LTH=8,                                        +        
               ATTR=(PROT)                                                      
FLD0511  DFLD  POS=(5,11),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Customer',                                             +        
               POS=(5,16),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0524  DFLD  POS=(5,25),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'DC',                                                   +        
               POS=(5,32),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
IDDC     DFLD  POS=(5,35),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Shipment',                                             +        
               POS=(5,38),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0555  DFLD  POS=(5,47),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Release date',                                         +        
               POS=(5,55),LTH=12,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD0562  DFLD  POS=(5,68),LTH=6,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Carrier  : Type',                                      +        
               POS=(7,2),LTH=15,                                       +        
               ATTR=(PROT)                                                      
FLD0718  DFLD  POS=(7,18),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Name',                                                 +        
               POS=(7,22),LTH=4,                                       +        
               ATTR=(ALPHA,PROT)                                                
FLD0733  DFLD  POS=(7,28),LTH=12,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Seal',                                                 +        
               POS=(7,42),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FLD0754  DFLD  POS=(7,47),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Tare',                                                 +        
               POS=(7,58),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FLD0764  DFLD  POS=(7,64),LTH=9,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Prod No Case Rep.date Deviations',                     +        
               POS=(9,2),LTH=32,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Prod No Case Rep.date Deviations',                     +        
               POS=(9,42),LTH=32,                                      +        
               ATTR=(PROT)                                                      
FLD1003  DFLD  POS=(10,3),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FLD1010  DFLD  POS=(10,11),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FLD1017  DFLD  POS=(10,17),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1024  DFLD  POS=(10,24),LTH=17,                                     +        
               ATTR=(PROT)                                                      
FLD1043  DFLD  POS=(10,43),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FLD1050  DFLD  POS=(10,51),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FLD1057  DFLD  POS=(10,57),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1064  DFLD  POS=(10,64),LTH=17,                                     +        
               ATTR=(PROT)                                                      
FLD1103  DFLD  POS=(11,3),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FLD1110  DFLD  POS=(11,11),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FLD1117  DFLD  POS=(11,17),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1124  DFLD  POS=(11,24),LTH=17,                                     +        
               ATTR=(PROT)                                                      
FLD1143  DFLD  POS=(11,43),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FLD1150  DFLD  POS=(11,51),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FLD1157  DFLD  POS=(11,57),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1164  DFLD  POS=(11,64),LTH=17,                                     +        
               ATTR=(PROT)                                                      
FLD1203  DFLD  POS=(12,3),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FLD1210  DFLD  POS=(12,11),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FLD1217  DFLD  POS=(12,17),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1224  DFLD  POS=(12,24),LTH=17,                                     +        
               ATTR=(PROT)                                                      
FLD1243  DFLD  POS=(12,43),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FLD1250  DFLD  POS=(12,51),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FLD1257  DFLD  POS=(12,57),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1264  DFLD  POS=(12,64),LTH=17,                                     +        
               ATTR=(PROT)                                                      
FLD1303  DFLD  POS=(13,3),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FLD1310  DFLD  POS=(13,11),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FLD1317  DFLD  POS=(13,17),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1324  DFLD  POS=(13,24),LTH=17,                                     +        
               ATTR=(PROT)                                                      
FLD1343  DFLD  POS=(13,43),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FLD1350  DFLD  POS=(13,51),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FLD1357  DFLD  POS=(13,57),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1364  DFLD  POS=(13,64),LTH=17,                                     +        
               ATTR=(PROT)                                                      
FLD1403  DFLD  POS=(14,3),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FLD1410  DFLD  POS=(14,11),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FLD1417  DFLD  POS=(14,17),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1424  DFLD  POS=(14,24),LTH=17,                                     +        
               ATTR=(PROT)                                                      
FLD1443  DFLD  POS=(14,43),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FLD1450  DFLD  POS=(14,51),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FLD1457  DFLD  POS=(14,57),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1464  DFLD  POS=(14,64),LTH=17,                                     +        
               ATTR=(PROT)                                                      
FLD1503  DFLD  POS=(15,3),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FLD1510  DFLD  POS=(15,11),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FLD1517  DFLD  POS=(15,17),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1524  DFLD  POS=(15,24),LTH=17,                                     +        
               ATTR=(PROT)                                                      
FLD1543  DFLD  POS=(15,43),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FLD1550  DFLD  POS=(15,51),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FLD1557  DFLD  POS=(15,57),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1564  DFLD  POS=(15,64),LTH=17,                                     +        
               ATTR=(PROT)                                                      
FLD1603  DFLD  POS=(16,3),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FLD1610  DFLD  POS=(16,11),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FLD1617  DFLD  POS=(16,17),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1624  DFLD  POS=(16,24),LTH=17,                                     +        
               ATTR=(PROT)                                                      
FLD1643  DFLD  POS=(16,43),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FLD1650  DFLD  POS=(16,51),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FLD1657  DFLD  POS=(16,57),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1664  DFLD  POS=(16,64),LTH=17,                                     +        
               ATTR=(PROT)                                                      
FLD1703  DFLD  POS=(17,3),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FLD1710  DFLD  POS=(17,11),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FLD1717  DFLD  POS=(17,17),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1724  DFLD  POS=(17,24),LTH=17,                                     +        
               ATTR=(PROT)                                                      
FLD1743  DFLD  POS=(17,43),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FLD1750  DFLD  POS=(17,51),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FLD1757  DFLD  POS=(17,57),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1764  DFLD  POS=(17,64),LTH=17,                                     +        
               ATTR=(PROT)                                                      
FLD1803  DFLD  POS=(18,3),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FLD1810  DFLD  POS=(18,11),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FLD1817  DFLD  POS=(18,17),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1824  DFLD  POS=(18,24),LTH=17,                                     +        
               ATTR=(PROT)                                                      
FLD1843  DFLD  POS=(18,43),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FLD1850  DFLD  POS=(18,51),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FLD1857  DFLD  POS=(18,57),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1864  DFLD  POS=(18,64),LTH=17,                                     +        
               ATTR=(PROT)                                                      
FLD1903  DFLD  POS=(19,3),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FLD1910  DFLD  POS=(19,11),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FLD1917  DFLD  POS=(19,17),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1924  DFLD  POS=(19,24),LTH=17,                                     +        
               ATTR=(PROT)                                                      
FLD1943  DFLD  POS=(19,43),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FLD1950  DFLD  POS=(19,51),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FLD1957  DFLD  POS=(19,57),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1964  DFLD  POS=(19,64),LTH=17,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '13 Query load 1 14 Query load 2 15',                   +        
               POS=(21,2),LTH=34,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16',                                                   +        
               POS=(21,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W4O562N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N562,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I562N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  FLD0214,                                                +        
               LTH=7                                                            
         MFLD  FLD0246,                                                +        
               LTH=1                                                            
         MFLD  FLD0314,                                                +        
               LTH=7                                                            
         MFLD  FLD0346,                                                +        
               LTH=1                                                            
         MFLD  FLD0402,                                                +        
               LTH=1                                                            
         MFLD  FLD0406,                                                +        
               LTH=7                                                            
         MFLD  FLD0415,                                                +        
               LTH=5                                                            
         MFLD  FLD0511,                                                +        
               LTH=4                                                            
         MFLD  FLD0524,                                                +        
               LTH=6                                                            
         MFLD  IDDC,                                                   +        
               LTH=2                                                            
         MFLD  FLD0555,                                                +        
               LTH=7                                                            
         MFLD  FLD0562,                                                +        
               LTH=6                                                            
         MFLD  FLD0718,                                                +        
               LTH=3                                                            
         MFLD  FLD0733,                                                +        
               LTH=12                                                           
         MFLD  FLD0754,                                                +        
               LTH=9                                                            
         MFLD  FLD0764,                                                +        
               LTH=9                                                            
         MFLD  FLD1003,                                                +        
               LTH=7                                                            
         MFLD  FLD1010,                                                +        
               LTH=5                                                            
         MFLD  FLD1017,                                                +        
               LTH=6                                                            
         MFLD  FLD1024,                                                +        
               LTH=17                                                           
         MFLD  FLD1043,                                                +        
               LTH=7                                                            
         MFLD  FLD1050,                                                +        
               LTH=5                                                            
         MFLD  FLD1057,                                                +        
               LTH=6                                                            
         MFLD  FLD1064,                                                +        
               LTH=17                                                           
         MFLD  FLD1103,                                                +        
               LTH=7                                                            
         MFLD  FLD1110,                                                +        
               LTH=5                                                            
         MFLD  FLD1117,                                                +        
               LTH=6                                                            
         MFLD  FLD1124,                                                +        
               LTH=17                                                           
         MFLD  FLD1143,                                                +        
               LTH=7                                                            
         MFLD  FLD1150,                                                +        
               LTH=5                                                            
         MFLD  FLD1157,                                                +        
               LTH=6                                                            
         MFLD  FLD1164,                                                +        
               LTH=17                                                           
         MFLD  FLD1203,                                                +        
               LTH=7                                                            
         MFLD  FLD1210,                                                +        
               LTH=5                                                            
         MFLD  FLD1217,                                                +        
               LTH=6                                                            
         MFLD  FLD1224,                                                +        
               LTH=17                                                           
         MFLD  FLD1243,                                                +        
               LTH=7                                                            
         MFLD  FLD1250,                                                +        
               LTH=5                                                            
         MFLD  FLD1257,                                                +        
               LTH=6                                                            
         MFLD  FLD1264,                                                +        
               LTH=17                                                           
         MFLD  FLD1303,                                                +        
               LTH=7                                                            
         MFLD  FLD1310,                                                +        
               LTH=5                                                            
         MFLD  FLD1317,                                                +        
               LTH=6                                                            
         MFLD  FLD1324,                                                +        
               LTH=17                                                           
         MFLD  FLD1343,                                                +        
               LTH=7                                                            
         MFLD  FLD1350,                                                +        
               LTH=5                                                            
         MFLD  FLD1357,                                                +        
               LTH=6                                                            
         MFLD  FLD1364,                                                +        
               LTH=17                                                           
         MFLD  FLD1403,                                                +        
               LTH=7                                                            
         MFLD  FLD1410,                                                +        
               LTH=5                                                            
         MFLD  FLD1417,                                                +        
               LTH=6                                                            
         MFLD  FLD1424,                                                +        
               LTH=17                                                           
         MFLD  FLD1443,                                                +        
               LTH=7                                                            
         MFLD  FLD1450,                                                +        
               LTH=5                                                            
         MFLD  FLD1457,                                                +        
               LTH=6                                                            
         MFLD  FLD1464,                                                +        
               LTH=17                                                           
         MFLD  FLD1503,                                                +        
               LTH=7                                                            
         MFLD  FLD1510,                                                +        
               LTH=5                                                            
         MFLD  FLD1517,                                                +        
               LTH=6                                                            
         MFLD  FLD1524,                                                +        
               LTH=17                                                           
         MFLD  FLD1543,                                                +        
               LTH=7                                                            
         MFLD  FLD1550,                                                +        
               LTH=5                                                            
         MFLD  FLD1557,                                                +        
               LTH=6                                                            
         MFLD  FLD1564,                                                +        
               LTH=17                                                           
         MFLD  FLD1603,                                                +        
               LTH=7                                                            
         MFLD  FLD1610,                                                +        
               LTH=5                                                            
         MFLD  FLD1617,                                                +        
               LTH=6                                                            
         MFLD  FLD1624,                                                +        
               LTH=17                                                           
         MFLD  FLD1643,                                                +        
               LTH=7                                                            
         MFLD  FLD1650,                                                +        
               LTH=5                                                            
         MFLD  FLD1657,                                                +        
               LTH=6                                                            
         MFLD  FLD1664,                                                +        
               LTH=17                                                           
         MFLD  FLD1703,                                                +        
               LTH=7                                                            
         MFLD  FLD1710,                                                +        
               LTH=5                                                            
         MFLD  FLD1717,                                                +        
               LTH=6                                                            
         MFLD  FLD1724,                                                +        
               LTH=17                                                           
         MFLD  FLD1743,                                                +        
               LTH=7                                                            
         MFLD  FLD1750,                                                +        
               LTH=5                                                            
         MFLD  FLD1757,                                                +        
               LTH=6                                                            
         MFLD  FLD1764,                                                +        
               LTH=17                                                           
         MFLD  FLD1803,                                                +        
               LTH=7                                                            
         MFLD  FLD1810,                                                +        
               LTH=5                                                            
         MFLD  FLD1817,                                                +        
               LTH=6                                                            
         MFLD  FLD1824,                                                +        
               LTH=17                                                           
         MFLD  FLD1843,                                                +        
               LTH=7                                                            
         MFLD  FLD1850,                                                +        
               LTH=5                                                            
         MFLD  FLD1857,                                                +        
               LTH=6                                                            
         MFLD  FLD1864,                                                +        
               LTH=17                                                           
         MFLD  FLD1903,                                                +        
               LTH=7                                                            
         MFLD  FLD1910,                                                +        
               LTH=5                                                            
         MFLD  FLD1917,                                                +        
               LTH=6                                                            
         MFLD  FLD1924,                                                +        
               LTH=17                                                           
         MFLD  FLD1943,                                                +        
               LTH=7                                                            
         MFLD  FLD1950,                                                +        
               LTH=5                                                            
         MFLD  FLD1957,                                                +        
               LTH=6                                                            
         MFLD  FLD1964,                                                +        
               LTH=17                                                           
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I562N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N562),                                           +        
               OPT=2,                                                  +        
               NXT=W4O562N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '45622',                                                +        
               LTH=5                                                            
         MFLD  (FLD0214,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0314,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0246,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0346,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0402,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0406,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0415,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0511,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0524,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  IDDC,                                                   +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0555,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0562,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0718,                                                +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0733,                                                +        
               LTH=12,                                                 +        
               FILL=X'40'                                                       
         MFLD  FLD0754,                                                +        
               LTH=9,                                                  +        
               FILL=X'40'                                                       
         MFLD  FLD0764,                                                +        
               LTH=9,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
